[
    {
        "paper_title": "Real-Time Intelligent Anomaly Detection and Prevention System",
        "paper_author": "Gürfidan R.",
        "publication": "Sakarya University Journal of Computer and Information Sciences",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Real-time anomaly detection in network traffic is a method that detects unexpected and anomalous behavior by identifying normal behavior and statistical patterns in network traffic data. This method is used to detect potential attacks or other anomalous conditions in network traffic. Real-time anomaly detection uses different algorithms to detect abnormal activities in network traffic. These include statistical methods, machine learning, and deep learning techniques. By learning the normal behavior of network traffic, these methods can detect unexpected and anomalous situations. Attackers use various techniques to mimic normal patterns in network traffic, making it difficult to detect. Real-time anomaly detection allows network administrators to detect attacks faster and respond more effectively. Real-time anomaly detection can improve network performance by detecting abnormal conditions in network traffic. Abnormal traffic can overuse the network's resources and cause the network to slow down. Real-time anomaly detection detects abnormal traffic conditions, allowing network resources to be used more effectively. In this study, blockchain technology and machine learning algorithms are combined to propose a real-time prevention model that can detect anomalies in network traffic.",
        "affiliation_name": "Isparta University of Applied Sciences",
        "affiliation_city": "Isparta",
        "affiliation_country": "Turkey"
    },
    {
        "paper_title": "Prediction of Cardiovascular Disease Based on Voting Ensemble Model and SHAP Analysis",
        "paper_author": "Akkur E.",
        "publication": "Sakarya University Journal of Computer and Information Sciences",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Globally, cardiovascular diseases (CVD) account for a large number of deaths. Early detection plays a critical role in reducing the mortality rate. Early detection can be achieved by utilizing machine learning algorithms on existing data of patients. Ensemble learning methods are one of the techniques applied to improve the classification performance of ML algorithms. This study suggests a prediction model based on voting ensemble learning for the prediction of CVD. The hyperparameters of classification algorithms are optimized by using grid search. The results of each model are validated by using a 10-fold cross-validation schema. The IEEE Data port dataset is used for all experiments Furthermore, the SHAP technique is employed to interpret the proposed prediction model, including the risk factors that play a role in detecting this disease The proposed model for CVD prediction achieved an accuracy of 0.937 and an AUC-ROC score of 0.936. The model presented in this study has a high classification rate compared to previous similar studies.",
        "affiliation_name": "Turkish Medicines and Medical Devices Agency",
        "affiliation_city": "Cankaya",
        "affiliation_country": "Turkey"
    },
    {
        "paper_title": "Social Media User Opinion Analysis Using Deep Learning and Machine Learning Methods: A Case Study on Airlines",
        "paper_author": "Şencan Ö.A.",
        "publication": "Turkish Journal of Mathematics and Computer Science",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "The rapid surge in social media usage has augmented the significance and value of data available on these platforms. As a result, analyzing community sentiment and opinions related to various topics and events using social media data has become increasingly crucial. However, the sheer volume of data produced on social media platforms surpasses human processing capabilities. Consequently, artificial intelligence-based models be-came frequently employed in social media analysis. In this study, deep learning (DL) and machine learning (ML) methods are applied to assess user opinions regarding airlines, and the effectiveness of these methods in social media analysis is comparatively discussed based on the performance results obtained. Due to the imbalanced na-ture of the dataset, synthetic data is produced using the Synthetic Minority Over-Sampling Technique (SMOTE) to enhance model performance. Before the SMOTE process, the dataset containing 14640 data points expanded to 27534 data points after the SMOTE process. The experimental results demonstrate that Support Vector Machines (SVM) achieved the highest performance among all methods with accuracy, precision, recall, and F-score values of 0.79 in the pre-SMOTE (imbalanced dataset). In contrast, Random Forest (RF) obtained the best performance among all methods, with accuracy, precision, recall, and F-score values of 0.88 in the post-SMOTE (balanced data set). Moreover, experimental findings demonstrate that SMOTE led to performance improvements in ML and DL models, ranging from a minimum of 3% to a maximum of 24% increase in F-Score metric.",
        "affiliation_name": "Gazi Üniversitesi",
        "affiliation_city": "Ankara",
        "affiliation_country": "Turkey"
    },
    {
        "paper_title": "Skin Lesion Classification Using Convolutional Neural Network and ABCRule",
        "paper_author": "Kestek E.",
        "publication": "Turkish Journal of Mathematics and Computer Science",
        "citied_by": "1",
        "cover_date": "2023-12-31",
        "Abstract": "Skin cancer, which can occur in any part of the human skin, is one of the common and serious types of cancer. Accurate diagnosis and segmentation of lesions are crucial to the early diagnosis. Computer-aided diagnosis make important contributions to help doctors in the diagnosis of cancer from skin images. The most important factor for such systems to reveal the accurate results is the correct feature extraction. In this study, a model for the classification of seven types of skin lesions is developed by combining the features of CNN-based feature extraction and the ABCD rule, which is widely used in the clinic. The model is evaluated on HAM10000 well-known dataset. The classification results obtained with different combinations of features and machine learning algorithms are compared. According to the results, the best classification accuracy is obtained with the Cosine Similarity Classifier with 96.4% when the features determined by CNN and the features in the ABCD rule are used together.",
        "affiliation_name": "Bartin Üniversitesi",
        "affiliation_city": "Bartin",
        "affiliation_country": "Turkey"
    },
    {
        "paper_title": "Artificial intelligence (AI) or augmented intelligence? How big data and AI are transforming healthcare: Challenges and opportunities",
        "paper_author": "Moodley K.",
        "publication": "South African medical journal = Suid-Afrikaanse tydskrif vir geneeskunde",
        "citied_by": "2",
        "cover_date": "2023-12-31",
        "Abstract": "The sanctity of the doctor-patient relationship is deeply embedded in tradition - the Hippocratic oath, medical ethics, professional codes of conduct, and legislation - all of which are being disrupted by big data and 'artificial' intelligence (AI). The transition from paper-based records to electronic health records, wearables, mobile health applications and mobile phone data has created new opportunities to scale up data collection. Databases of unimaginable magnitude can be harnessed to develop algorithms for AI and to refine machine learning. Complex neural networks now lie at the core of ubiquitous AI systems in healthcare. A transformed healthcare environment enhanced by innovation, robotics, digital technology, and improved diagnostics and therapeutics is plagued by ethical, legal and social challenges. Global guidelines are emerging to ensure governance in AI, but many low- and middle-income countries have yet to develop context- specific frameworks. Legislation must be developed to frame liability and account for negligence due to robotics in the same way human healthcare providers are held accountable. The digital divide between high- and low-income settings is significant and has the potential to exacerbate health inequities globally.",
        "affiliation_name": "Stellenbosch University, Faculty of Medicine and Health Sciences",
        "affiliation_city": "Cape Town",
        "affiliation_country": "South Africa"
    },
    {
        "paper_title": "PREDICTION OF TEMPERATURE FIELD DISTRIBUTION IN A GAS TURBINE USING A HIGHER ORDER NEURAL NETWORK",
        "paper_author": "Pařez J.",
        "publication": "Acta Polytechnica",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "This paper presents the prediction of temperature field distribution in a single annular section using an artificial neural network (ANN). This temperature distribution is non-uniform on the outer tube due to continuous natural convection and radiation caused by the homogeneous steady-state heating of the inner tube, which represents the hot gas flow path through the turbine. The outer tube represents the case of a gas turbine. This temperature is important for the electronic components attached to the engine or the overall engine deformation. The presented approach allows for a quick estimation of the temperature distribution without the need to perform time consuming computational fluid dynamics (CFD) simulations. This can greatly accelerate the design and development of gas turbines. A machine learning approach is applied to an extensive set of CFD simulations under different operating conditions and geometry setups.",
        "affiliation_name": "Czech Technical University in Prague",
        "affiliation_city": "Prague",
        "affiliation_country": "Czech Republic"
    },
    {
        "paper_title": "Hyperspectral prediction of pigment content in tomato leaves based on logistic-optimized sparrow search algorithm and back propagation neural network",
        "paper_author": "Zhao J.",
        "publication": "Journal of Agricultural Engineering",
        "citied_by": "3",
        "cover_date": "2023-12-31",
        "Abstract": "Leaf pigment content can reflect the nutrient content of the cultivation medium indirectly. To rapidly and accurately predict the pigment content of tomato leaves, chlorophyll a, chlorophyll b, chlorophyll and carotenoid were extracted from the leaves of tomato seedlings cultured at different nitrogen concentrations. The visible/near-infrared hyperspectral imaging non-destructive measurement technology, 430-900 nm and 950-1650 nm, with total variables of 794, was used to obtain the reflection spectra of leaves. An improved strategy of the sparrow search algorithm (SSA) based on logistic chaotic mapping was proposed, and it optimized the back propagation neural network to predict the pigment content of leaves. Different pretreatment methods were used to effectively improve the prediction accuracy of the model. The results showed that when the nitrogen concentration in the nutrient solution was 302.84 mg·L-1, the pigment content of the leaves reached its maximum. Meanwhile, the inhibition effect of high concentrations was much stronger than that of low concentrations. To address the problem that the SSA is prone to premature convergence due to the reduction of population diversity at the end of the iteration, the initialization of the SSA population by logistic chaotic mapping improves the initial solution quality, convergence speed, and search capacity. The root mean squared error (RMSE), coefficient of determination (R2) and relative percent deviation (RPD) of chlorophyll a were 0.77, 0.77, and 2.08, respectively. The RMSE, R2 and RPD of chlorophyll b were 0.30, 0.66, and 1.71, respectively. The RMSE, R2 and RPD of chlorophyll were 0.88, 0.81, and 2.28, respectively. The RMSE, R2 and RPD of carotenoid were 0.14, 0.75, and 2.00, respectively. Hyperspectral imaging technology combined with machine learning algorithms can achieve rapid and accurate prediction of crop physiological information, providing data support for the precise management of fertilization in facility agriculture, which is conducive to improving the quality and output of tomatoes.",
        "affiliation_name": "Shanxi Agricultural University",
        "affiliation_city": "Taiyuan",
        "affiliation_country": "China"
    },
    {
        "paper_title": "Departure Flight Delay Prediction and Visual Analysis Based on Machine Learning",
        "paper_author": "Qi X.",
        "publication": "SAE Technical Papers",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Nowadays, the rapid growth of civil aviation transportation demand has led to more frequent flight delays. The major problem of flight delays is restricting the development of municipal airports. To further improve passenger satisfaction, and reduce economic losses caused by flight delays, environmental pollution and many other adverse consequences, three machine learning algorithms are constructed in current study: random forest (RF), gradient boosting decision tree (GBDT) and BP neural network (BPNN). The departure flight delay prediction model uses the actual data set of domestic flights in the United States to simulate and verify the performance and accuracy of the three models. This model combines the visual analysis system to show the density of departure flight delays between different airports. Firstly, the data set is reprocessed, and the main factors leading to flight delays are selected as sample attributes by principal component analysis. Secondly, the mean absolute error (MAE), mean absolute percentage error (MAPE) and root mean square error (RMSE) were selected as evaluation indexes to compare the prediction results of three different models. The final results show that the departure flight delay prediction model based on BPNN algorithm has faster solution speed and overcomes the over-fitting problem, and has higher prediction accuracy and robustness. Based on the algorithm developed in this paper, the airport system can be planned in a targeted manner, thereby alleviating the pressure of air transportation and reducing flight delays.",
        "affiliation_name": "Southeast University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China"
    },
    {
        "paper_title": "Machine Learning Based Flight State Prediction for Improving UAV Resistance to Uncertainty",
        "paper_author": "Mu J.",
        "publication": "SAE Technical Papers",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Unmanned Aerial Vehicles (UAVs) encounter various uncertainties, including unfamiliar environments, signal delays, limited control precision, and other disturbances during task execution. Such factors can significantly compromise flight safety in complex scenarios. In this paper, to enhance the safety of UAVs amidst these uncertainties, a control accuracy prediction model based on ensemble learning abnormal state detection is designed. By analyzing the historical state data, the trained model can be used to judge the current state and obtain the command tracking control accuracy of the UAV at that instant. Ensemble learning offers superior classification capabilities compared to weak learners, particularly for anomaly detection in flight data. The learning efficacy of support vector machine, random forest classifier is compared and achieving a peak accuracy of 95% for the prediction results using random forest combined with adaboost model. Subsequently, a trajectory planning method leveraging the DWA(Dynamic Window approach) algorithm was designed to mitigate the safety risks associated with uncertain control command tracking. By employing the obtained model of nominal command execution results of UAVs subjected to uncertainty, and by adjusting the original assessment criteria to a probability-weighted comprehensive optimal metric, optimal control commands that factor in uncertainty are derived. The simulation results affirm the effectiveness of the designed method.",
        "affiliation_name": "Hangzhou City University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China"
    },
    {
        "paper_title": "Aeroengine Gas Path Parameter Trend Prediction Based on LSTM",
        "paper_author": "Liu Y.",
        "publication": "SAE Technical Papers",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Accurately predicting the trend of aero-engine gas path parameters is crucial for ensuring safe flight and enabling condition-based maintenance. However, the demanding and uncertain service environment introduces challenges in dealing with the noisy and non-stationary data collected by engine gas path sensors. Traditional time series models struggle to accurately predicts parameter trends, resulting in insufficient fitting and prediction accuracy. In this paper, we address these challenges by leveraging the characteristics of engine post-flight data and introducing Long Short-Term Memory (LSTM), a type of artificial neural network in deep learning. We construct both single-feature input and multi-feature input LSTM prediction models for six key indicators of engine gas path performance. We analyze the models' capabilities for single-step and multistep predictions. To evaluate the effectiveness of our approach, we compare the LSTM model with the traditional Autoregressive Moving Average (ARMA) model and support vector regression (SVR) method. The results demonstrate that the LSTM model outperforms the traditional ARMA and SVR models in terms of prediction accuracy and stability. This indicates that utilizing LSTM is an effective approach for improving the accuracy of engine gas path parameter prediction. By accurately predicting these parameters, we can enhance flight safety and enable more efficient condition based maintenance.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China"
    },
    {
        "paper_title": "Yield Prediction and Recommendation of Crops in India’s Northeastern Region Using Machine Learning Regression Models",
        "paper_author": "Sharma N.",
        "publication": "Yuzuncu Yil University Journal of Agricultural Sciences",
        "citied_by": "3",
        "cover_date": "2023-12-31",
        "Abstract": "Agriculture has a big impact on society because it is essential for a large percentage of our food. The issue of hunger is getting worse because of a growing population in many nations, resulting in food shortages or insufficiencies. To meet the world's food needs, it is ever more crucial to provide crop protection, conduct detailed land surveys, and predict crop yields. To calculate the estimated number of crops that are produced in a year, this research focuses on the use of machine learning techniques to predict crop yield and recommend crops with the highest yield and profitability in the Northeast region of India. The crop market's fluctuations in prices may be controlled with the aid of this information. To estimate agricultural crop yields, this study accurately evaluates a range of machine learning regression models, such as Linear Regression, Decision Tree, Random Forest, Gradient Boosting, XGBoost (eXtreme Gradient Boosting), and AdaBoost. With a 0.98 R2 score for the XGBoost and 0.96 for the Random Forest, they performed better than the other models. By evaluating crop yields along with their corresponding market prices and costs, we have determined their profitability. As a result, we have provided recommendations for the top five profitable crops in India’s Northeastern region.",
        "affiliation_name": "Assam down town University",
        "affiliation_city": "Guwahati",
        "affiliation_country": "India"
    },
    {
        "paper_title": "A review of computer-aided classification prediction of Parkinson’s disease based on machine learning",
        "paper_author": "Wen J.Y.",
        "publication": "Journal of Graphics",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Parkinson’s disease (PD) is among the top ten most challenging diseases according to the World Health Organization, placing a substantial burden on patients and their families. Currently, treatment can only offer partial relief from clinical symptoms and cannot achieve a complete cure. Therefore, early auxiliary diagnosis holds significant practical significance for PD patients. This research conducted a comprehensive analysis of computer-aided diagnosis techniques for PD classification prediction both domestically and internationally. It also summarized research endeavors utilizing machine learning models to assist in the early detection of PD, aiming to guide early intervention and prevent disease progression. Common prediction methods involved data preprocessing, feature selection, and classification. Traditional machine learning methods might not be as effective when dealing with large datasets or high data complexity, making deep learning or improved machine learning methods more promising for improving prediction accuracy. Furthermore, there has been a growing focus on diagnosing brain structural images of PD patients with cognitive impairment. Research on cognitive dysfunction followed a progressive trajectory, emphasizing the need for early screening and timely intervention. Future research should further explore computer-assisted diagnostic techniques based on machine learning methods and apply them to the early classification prediction of PD, aiming to enhance the accuracy of medical diagnosis and elevate the quality of diagnosis and treatment.",
        "affiliation_name": "Guangzhou University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China"
    },
    {
        "paper_title": "A STEP TOWARDS IMO GREENHOUSE GAS REDUCTION GOAL: EFFECTIVENESS OF MACHINE LEARNING BASED CO<inf>2</inf> EMISSION PREDICTION MODEL",
        "paper_author": "Monisha I.I.",
        "publication": "Journal of Naval Architecture and Marine Engineering",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Ships are the world’s most economical means of freight transportation, and day by day, it is expanding quickly. The increase in ship transportation activities has resulted in a significant concern about CO2 emissions. International Maritime Organization has agreed to set a goal of reducing the maritime sector’s total gas emissions by at least 50% by 2050. In this regard, a CO2 emission prediction model followed by an emission inventory can play a vital role in decision-making to optimize the ship’s speed, draft, trim, and other influencing parameters under Ship Energy Efficiency Management Plan to decrease carbon emissions during operation. Machine learning, a branch of the data science approach, can be utilized to create effective emission-prediction models. In this research, two machine-learning models have been developed using actual voyage data collected from the noon reports of ships in Bangladesh. The models have been trained with the ship’s speed, engine rpm, wind force, and sea condition during voyages. The models’ performances have been assessed employing the Coefficient of Determination (R2) and Root Mean Square Error (RMSE). The prediction accuracies for the K Nearest Neighbor Regression model and the Light Gradient Boosted Machine Regression model are 84% and 81%, with RMSE of 5.12 and 5.53, respectively.",
        "affiliation_name": "Bangladesh University of Engineering and Technology",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh"
    },
    {
        "paper_title": "WSN-IoT Forecast: Wireless Sensor Network Throughput Prediction Framework in Multimedia Internet of Things",
        "paper_author": "Eliviani R.",
        "publication": "Journal of ICT Research and Applications",
        "citied_by": "1",
        "cover_date": "2023-12-31",
        "Abstract": "Accurate throughput predictions can significantly improve the quality of experience (QoE), where QoE denotes a network’s capacity to provide satisfactory service. By increasing the results of good throughput predictions, the best strategy can be planned for managing data transmission networks with the aim of better and faster data transmission, thereby increasing QoE. Consequently, this paper investigates how to predict the throughput of wireless sensor networks utilizing multimedia data. First, we conducted a comparative analysis of relevant prior research on the topic of throughput prediction in Multimedia Internet of Things (Multimedia IoT). We developed a throughput prediction framework for wireless sensor networks based on what we learned from these studies using machine learning. The Throughput Prediction Framework identifies historical throughput data and employs these traits to predict throughput. In the final phase, multiple camera nodes and local servers are utilized to test a framework for throughput prediction. Our analysis demonstrates that WSN-IoT predictions are quite precise. For a 1-second time breakdown, the average absolute percentage error for all investigated scenarios ranges from 1 to 8 percent.",
        "affiliation_name": "Institut Teknologi Bandung",
        "affiliation_city": "Bandung",
        "affiliation_country": "Indonesia"
    },
    {
        "paper_title": "An Efficient Intrusion Detection System to Combat Cyber Threats using a Deep Neural Network Model",
        "paper_author": "Ramaiah M.",
        "publication": "Journal of ICT Research and Applications",
        "citied_by": "2",
        "cover_date": "2023-12-31",
        "Abstract": "The proliferation of Internet of Things (IoT) solutions has led to a significant increase in cyber-attacks targeting IoT networks. Securing networks and especially wireless IoT networks against these attacks has become a crucial but challenging task for organizations. Therefore, ensuring the security of wireless IoT networks is of the utmost importance in today’s world. Among various solutions for detecting intruders, there is a growing demand for more effective techniques. This paper introduces a network intrusion detection system (NIDS) based on a deep neural network that utilizes network data features selected through the bagging and boosting methods. The presented NIDS implements both binary and multiclass attack detection models and was evaluated using the KDDCUP 99 and CICDDoS datasets. The experimental results demonstrated that the presented NIDS achieved an impressive accuracy rate of 99.4% while using a minimal number of features. This high level of accuracy makes the presented IDS a valuable tool.",
        "affiliation_name": "Vellore Institute of Technology",
        "affiliation_city": "Vellore",
        "affiliation_country": "India"
    },
    {
        "paper_title": "Prediction of hold-up in pulsed disc-doughnut column based on least absolute shrinkage and selection operator regression",
        "paper_author": "Jin L.",
        "publication": "Harbin Gongcheng Daxue Xuebao/Journal of Harbin Engineering University",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "To obtain a predictive equation that provides high applicability and analytical convenience, based on the least absolute shrinkage and selection operator (LASSO). Investigate the effects of pulse intensity, disperse phase velocity, and continuous phase velocity on the hold-up in a pulsed disc-doughnut column with a kerosene-water system using the volume replacement method. Subsequently, several sets of empirical equations from related literature were compared and analyzed with new multivariate quadratic prediction equations fitted using the LASSO method. The results revealed that the prediction equations fitted using the LASSO method fit the experimental data extremely well, and the effect of the parameter on the hold-up in the specific operating range could be quantitatively analyzed by calculating the partial derivatives of the equation for each of the three operating parameters. The results also adapted very well to other literature data, and the average relative deviation of the fitted results from the experimental data was within 20%. This demonstrates that LASSO is a simple and intuitive way to analyze the effect of each parameter on the hold-up.",
        "affiliation_name": "China Institute of Atomic Energy",
        "affiliation_city": "Beijing",
        "affiliation_country": "China"
    },
    {
        "paper_title": "Transformer Fault Diagnosis Method Based on Variation Sparrow Search Algorithm and Improved SMOTE Under Unbalanced Samples",
        "paper_author": "Zhu L.",
        "publication": "Gaodianya Jishu/High Voltage Engineering",
        "citied_by": "8",
        "cover_date": "2023-12-31",
        "Abstract": "To solve the problem of poor classification results caused by the serious homogeneity of the sparrow search algorithm and the unbalance of the transformer fault sample, a method of transformer fault diagnosis is proposed. It is based on a variation sparrow search algorithm-support vector machine(VSSA-SVM) and improved synthetic minority over-sampling technique (ISMOTE). Firstly, the dataset is denoised by the Tomek Link, and the center offset weight (COW) is introduced to improve the SMOTE for minority class sample synthesis of the unbalanced dataset, which can obtain the balancing processed transformer fault dataset. Then, a transformer fault diagnosis model based on the variation of the VSSA-SVM is proposed using the idea of mutation. Finally, the dissoived gas anaiysis (DGA) data of 413 cases of the collecting oil-immersed transformers are diagnosed using SSA-SVM, PSO-SVM and VSSA-SVM models, and the diagnosis accuracy results are 81.45%, 88.71% and 96.77% respectively. Additionally, compared to the SMOTE-NND, SVM SMOTE, Borderline-SMOTE, SMOTE and original dataset methods, the diagnosis accuracy of the ISMOTE model is improved by 3.22%, 4.03%, 6.45%, 7.52% and 11.29% respectively. The results show that the proposed method in this paper can be adopted to accurately judge the transformer fault state, and to effectively solve the problem of unbalanced fault data caused by low classification accuracy, which has a certain engineering practical value.",
        "affiliation_name": "Hubei University of Technology",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China"
    },
    {
        "paper_title": "Resolving the Human-subjects Status of Machine learning’s Crowdworkers",
        "paper_author": "Kaushik D.",
        "publication": "Queue",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "As toward datasets, crowdsourcing (naturalthe focus settingslanguage researchers of MLplatforms.characterized (machineprocessing) have 13,25learning) become Just taskby massivefor of reliant hasthe passage-shiftedNLP on based QA (question answering), more than 15 new datasets containing at least 50k annotations have been introduced since 2016. Prior to 2016, available QA datasets contained orders of magnitude fewer examples.",
        "affiliation_name": "Carnegie Mellon University",
        "affiliation_city": "Pittsburgh",
        "affiliation_country": "United States"
    },
    {
        "paper_title": "ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING-DRIVEN DECISION-MAKING IN SPINAL DISEASE TREATMENT",
        "paper_author": "Sundaramoorthy K.",
        "publication": "Journal of Theoretical and Applied Information Technology",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Aside from people with significant neurological abnormalities, it's unclear whether conservative or surgical therapy of spinal disorders is better for each patient. This research looks into the use of Artificial Intelligence (AI) and Machine Learning (ML) in the therapy of spinal diseases decision-making. A supervised ML was trained and tested using the datasets of 70 patients with goal of accurately predicting the Oswestry Disability Index (ODI) 5 months following operation or the beginning of conservative therapy. In addition, using tenfold cross-validation, created an approach that forecasts the ODI of 5 arbitrarily chosen testing patients. The use of AI in this study also enabled for a comparison of the genuine patient data after 5 months with different treatment forecast, revealing variances of up to 19.6%. In the supervised version used here, ML can detect patients who'd receive from conservative treatment earlier on and, on the other hand, avoid unnecessary delays and painful for patients who'd gain from surgical treatment. Furthermore, despite tiny diagnostic categories, this strategy can be applied in various other fields of medical as an excellent instrument for decision-making when deciding between competing treatments alternatives.",
        "affiliation_name": "Panipat Institute of Engineering &amp; Technology",
        "affiliation_city": "Panipat",
        "affiliation_country": "India"
    },
    {
        "paper_title": "PREDICTION OF LUNG DISEASE SEVERITY BY APPLYING MACHINE AND DEEP LEARNING TECHNIQUES",
        "paper_author": "Guttula S.P.",
        "publication": "Journal of Theoretical and Applied Information Technology",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Virus infected diseases are increasing rapidly. SARS covid -19 is one emerged into human body to extinct the human life. Prediction of the rapid changes and meticulous interpretation of the type of decease is challenging. Various stages of the risk severity prediction and interpretation is challenging. This paper discussed various machine learning algorithms applied on X-radiation chest images to predict the severity of the decease. Significant features are extracted using Principal component analysis (PCA). Bagging, Ada boost, XG boost, KNN machine learning methodologies applied to achieve the reliable performance. Bagging methodology shows dominant performance over other machine learning methodologies with 98.82% precision value and 98.67% accuracy. The F1 score and recall value is significantly good with 98.755 and 98.69 respectively. Bagging methodology is much reliable to interpret X-radiation images for Sars Covid-19 infections.",
        "affiliation_name": "Rabindranath Tagore University",
        "affiliation_city": "Mendua",
        "affiliation_country": "India"
    },
    {
        "paper_title": "Machine-learning methods based on the texture and non-texture features of MRI for the preoperative prediction of sentinel lymph node metastasis in breast cancer",
        "paper_author": "Wang J.",
        "publication": "Translational Cancer Research",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Background: The establishment of an accurate, stable, and non-invasive prediction model of sentinel lymph node (SLN) metastasis in breast cancer is difficult nowadays. The aim of this work is to identify the optimal machine learning model based on the three-dimensional (3D) image features of magnetic resonance imaging (MRI) for the preoperative prediction of SLN metastasis in breast cancer patients. Methods: A total of 172 patients with histologically proven breast cancer were enrolled retrospectively, including 74 SLN metastasis patients and 98 non-SLN metastasis patients. All of them underwent diffusion-weighted imaging (DWI) magnetic resonance imaging (MRI) scan. Firstly, a total of 10,320 texture and four non-texture features were extracted from the region of interests (ROIs) of image. Twenty-four feature selection methods and 11 classification methods were then evaluated by using 10-fold cross-validation to identify the optimal machine learning model in terms of the mean area under the curve (AUC), accuracy (ACC), and stability. Results: The result showed that the model based on the combination of minimum redundancy maximum relevance (MRMR) + random forest (RF) exhibited the optimal predictive performance (AUC: 0.97±0.03; ACC: 0.89±0.05; stability: 2.94). Moreover, we independently investigated the performance of feature selection methods and classification methods, and observed that L1-support vector machine (L1-SVM) (AUC: 0.80±0.08; ACC: 0.76±0.07) and sequential forward floating selection (SFFS) (stability: 3.04) presented the best average predictive performance and stability among all feature selection methods, respectively. RF (AUC: 0.85±0.11; ACC: 0.80±0.09) and SVM (stability: 8.43) showed the best average predictive performance and stability among all classification methods, respectively. Conclusions: The identified model based on the 3D image features of MRI provides a non-invasive way for the preoperative prediction of SLN metastasis in breast cancer patients.",
        "affiliation_name": "Jinan University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China"
    },
    {
        "paper_title": "AN ENSEMBLE APPROACH FOR HARVEST VINTAGE FORECAST WITH MACHINE LEARNING TECHNIQUES: AN EXPERIMENTAL STUDY",
        "paper_author": "Pittala S.K.",
        "publication": "Journal of Theoretical and Applied Information Technology",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "Since crop yield forecasting directly affects the production and security of food, it is an essential part of agricultural research and development. The traditional methods of calculating harvest vintages centered on agriculturalists' explanations and expertise have become increasingly challenging as a result of the rapid ups and downs in soil and climatic state of affairs. Machine-learning techniques have been applied in recent years to find a solution to this issue. This study centers around the utilization of a few AI models, for example, nearest neighbor relapse, closest polynomial relapse, irregular woodland relapse, slope helped tree relapse, and backing vector relapse, for the expectation of farming efficiency. The raw data was transformed into a format that is conducive to machine learning using efficient feature selection techniques. The study's findings showed that, in comparison to other tactics, when choosing features, using an ensemble technique can lead to more accurate predictions. By combining several data sources and machine learning algorithms, the ensemble approach generates a detailed and precise forecast. This work highlights both the benefits of using machine learning techniques to forecast agricultural amount produced and the recompenses of using a collaborative line of attack to feature selection.",
        "affiliation_name": "Shri Vishnu Engineering College For Women",
        "affiliation_city": "Bhimavaram",
        "affiliation_country": "India"
    },
    {
        "paper_title": "EXPLORING THE CAPABILITIES OF DEEP LEARNING FOR ADVANCING CREDIT CARD FRAUD DETECTION: A REVOLUTIONARY APPROACH",
        "paper_author": "Daif A.",
        "publication": "Journal of Theoretical and Applied Information Technology",
        "citied_by": "0",
        "cover_date": "2023-12-31",
        "Abstract": "The use of credit cards for both online and in-person purchases has become increasingly prevalent in our daily lives. However, this convenience also exposes users to the risks associated with credit card fraud. Credit card fraud presents a significant challenge for banks, merchants, and consumers, emphasizing the crucial need for the swift and accurate detection of such fraudulent activities. In response to this challenge, recent research has delved into the application of deep learning techniques for credit card fraud detection. This article presents a study that combines a Bi-LSTM (Bidirectional Long Short-Term Memory) with an attention layer to identify fraudulent transaction patterns and achieve a balanced classification of data. The results of this study demonstrate the method's high accuracy, surpassing the performance of other fraud detection approaches. Notably, this innovative approach efficiently identifies critical transactions within input sequences, significantly improving the prediction accuracy for fraudulent transactions. This research provides a unique perspective on the use of deep learning to enhance security in credit card transactions.",
        "affiliation_name": "Laboratoire de Technologie de l'Information et Modélisation",
        "affiliation_city": "Casablanca",
        "affiliation_country": "Morocco"
    },
    {
        "paper_title": "Use of survival support vector machine combined with random survival forest to predict the survival of nasopharyngeal carcinoma patients",
        "paper_author": "Xiao Z.",
        "publication": "Translational Cancer Research",
        "citied_by": "3",
        "cover_date": "2023-12-31",
        "Abstract": "Background: The Cox regression model is not sufficiently accurate to predict the survival prognosis of nasopharyngeal carcinoma (NPC) patients. It is impossible to calculate and rank the importance of impact factors due to the low predictive accuracy of the Cox regression model. So, we developed a system. Using the SEER (The Surveillance, Epidemiology, and End Results) database data on NPC patients, we proposed the use of random survival forest (RSF) and survival-support vector machine (SVM) from the machine learning methods to develop a survival prediction system specifically for NPC patients. This approach aimed to make up for the insufficiency of the Cox regression model. We also used the Cox regression model to validate the development of the nomogram and compared it with machine learning methods. Methods: A total of 1,683 NPC patients were extracted from the SEER database from January 2010 to December 2015. We used R language for modeling work, established the nomogram of survival prognosis of NPC patients by Cox regression model, ranked the correlation of influencing factors by RSF model VIMP (variable important) method, developed a survival prognosis system for NPC patients based on survival-SVM, and used C-index for model evaluation and performance comparison. Results: Although the Cox regression models can be developed to predict the prognosis of NPC patients, their accuracy was lower than that of machine learning methods. When we substituted the data for the Cox model, the C-index for the training set was only 0.740, and the C-index for the test set was 0.721. In contrast, the C index of the survival-SVM model was 0.785. The C-index of the RSF model was 0.729. The importance ranking of each variable could be obtained according to the VIMP method. Conclusions: The prediction results from the Cox model are not as good as those of the RSF method and survival-SVM based on the machine learning method. For the survival prognosis of NPC patients, the machine learning method can be considered for clinical application.",
        "affiliation_name": "Guangxi Medical University",
        "affiliation_city": "Nanning",
        "affiliation_country": "China"
    },
    {
        "paper_title": "Integrating Phylogenetic Analysis and Machine Learning for Enhanced Phenotype Prediction in Oryza Sativa",
        "paper_author": "Kiranmai B.",
        "publication": "International Journal of Agriculture and Biosciences",
        "citied_by": "3",
        "cover_date": "2023-12-31",
        "Abstract": "Genomic selection has revolutionized plant breeding by enabling the efficient and accurate selection of elite genotypes. Traditional approaches require resource-intensive phenotyping at all stages of artificial selection. However, genomic selection reduces this burden by leveraging genotyping data and machine learning techniques to predict agronomically relevant phenotypic traits. In this paper, we present a two-level prediction system that incorporates both phylogenetic analysis and machine learning models to predict the height of Oryza Sativa L. (Rice) plants based on their gene sequences. The only input for our model is a genomic sequence, whose length does not have to be equal to 24 (number of SNPs considered for our model). At the first level, we employ phylogenetic analysis to classify the plants into subpopulations, capturing the inherent genetic diversity within the dataset. This approach addresses the limitations of existing research, as it incorporates population structure information from gene sequences that is often overlooked in machine learning-based approaches. Subsequently, at the second level, we leverage the population structure information and genomic data to train a machine learning model for accurately predicting plant height. We compare and evaluate various methods employed at both levels to identify the most effective approach. Hence our approach of predicting Phenotype with reference to genotype is accurate compared with other existing systems. Two level classification has done well in identifying phenotype and performed well in predicting subpopulation.",
        "affiliation_name": "Keshav Memorial Institute of Technology",
        "affiliation_city": "Hyderabad",
        "affiliation_country": "India"
    }
]