[
    {
        "paper_title": "Impossibility Results in AI: A Survey",
        "publication": "ACM Computing Surveys",
        "citied_by": "7",
        "cover_date": "2023-12-31",
        "Abstract": "An impossibility theorem demonstrates that a particular problem or set of problems cannot be solved as described in the claim. Such theorems put limits on what is possible to do concerning artificial intelligence, especially the super-intelligent one. As such, these results serve as guidelines, reminders, and warnings to AI safety, AI policy, and governance researchers. These might enable solutions to some long-standing questions in the form of formalizing theories in the framework of constraint satisfaction without committing to one option. We strongly believe this to be the most prudent approach to long-term AI safety initiatives. In this article, we have categorized impossibility theorems applicable to AI into five mechanism-based categories: Deduction, indistinguishability, induction, tradeoffs, and intractability. We found that certain theorems are too specific or have implicit assumptions that limit application. Also, we added new results (theorems) such as the unfairness of explainability, the first explainability-related result in the induction category. The remaining results deal with misalignment between the clones and put a limit to the self-awareness of agents. We concluded that deductive impossibilities deny 100%-guarantees for security. In the end, we give some ideas that hold potential in explainability, controllability, value alignment, ethics, and group decision-making.",
        "DOI": "10.1145/3603371",
        "paper_author": "Brcic M.",
        "affiliation_name": "University of Zagreb, Faculty of Electrical Engineering and Computing",
        "affiliation_city": "Zagreb",
        "affiliation_country": "Croatia",
        "affiliation_id": "60159855",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital Innovation and AI Artificial Intelligence Perspectives on Wuhan Flower Gallery Accommodation Resources Fuzzy integrated evaluation benefit analysis",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-30",
        "Abstract": "There are many types of accommodation products in Wuhan Flower Gallery (Huabohui), and this paper carries out a fuzzy comprehensive evaluation of the benefits of Wuhan Flower Gallery accommodation industry. This paper comprehensively considers the quality grade, brand effect, government policy, market supply and demand relationship, business subjects, consumer habits and other factors, using fuzzy comprehensive evaluation method to evaluate the comprehensive benefits of Wuhan Flower Gallery accommodation products. The evaluation results show that the output benefit of Wuhan Flower Gallery accommodation products is high, but there are still service quality problems, combined with digital innovation and AI artificial intelligence, it puts forward countermeasures and suggestions to improve the service quality of Wuhan Flower Gallery accommodation products.",
        "DOI": "10.1145/3644479.3644508",
        "paper_author": "Longxing L.",
        "affiliation_name": "China",
        "affiliation_city": "Hubei",
        "affiliation_country": "China",
        "affiliation_id": "131160273",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Narrative Roads to Rebuild China's Global Image-Sentiment Analysis of Twitter Activities after China's Covid-19 Aid Activities in Italy",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-30",
        "Abstract": "As the digital era unfolds, social media supported by mobile devices and AI technologies are rapidly changing the way people communicate. The impact of public opinion formed on the social network platforms often has an enormous and somehow long-lasting influence on a country's foreign policy and international relations, and international interactions in the form of Twiplomacy are gradually attracting the attention of researchers. However, the attempts to analyze the impact that online public opinion has on actual policy or the inverse are still lacking or failed to explain the problem on the socioeconomic ground. There are very few theoretical explanations of how different pandemic narratives emerges and co-exists, and yet no article that analyzed how the positive and negative narratives about China spread and wrestled in their respective public opinion arenas during such a global event. Under certain analogous sense, Virus like the rumor \"China virus \"and vaccines like the encouraging reports we get from the \"China Aid Activities in Italy\"are fighting each other in the social media battleground and thus in every individual's mind which finally aggregated as the ideology. Hence, to explain the underlying motives for the public to accept and spread different pandemic narratives, we combined the modified SIR model and Glaeser(2005) ' political economic dynamic to cast light on its deep route in the background of the U.S.-China trade conflict and the U.S. presidential election-all three Black swans landed in the same Lake. Our research combined the sentiment semantic analysis methods from the AI-NLP field with the causal mechanism analysis to evaluate the differences in the attitudes of the Italian & international public towards China before and after the Chinese medical aid to Italy to fight the Covid-19 epidemic. Using the public data set from the GitHub project and other open-source scientific data, we applied the Bidirectional Encoder Representations from Transformers model (BERT) on individual tweets to include both emotional and non-emotional terms from a sentence sematic scale rather than word meaning scale which allows us to dig-in rich in topical information and estimate the international image trend of China during the 2020 February-March period. Here inspired by hybrid enrichment framework proposed by Gencoglu & Gruber (2020) but limited with the data, we choose the ARMA model instead to infer the sentimental level and the causality of medical aid event, empirical result shows that the positive change in Italy' public sentiment level is significantly affected by China's aid activities event here. The results of this article also provide insight into how China can improve its international image to promote the progress of many international regional economic and trade cooperation from the narrative perspective. Facts always speak louder than words, with which the adequate speed-up dissemination of fact is also important.",
        "DOI": "10.1145/3644479.3644482",
        "paper_author": "Liu W.",
        "affiliation_name": "Wuhan Business University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60225899",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "GPT-4 and medical image analysis: strengths, weaknesses and future directions",
        "publication": "Journal of Medical Artificial Intelligence",
        "citied_by": "12",
        "cover_date": "2023-12-30",
        "Abstract": "ChatGPT (Generative Pre-trained Transformer) is an artificial intelligence (AI) language model developed by OpenAI. GPT-4 is the newest version of ChatGPT released on March 14, 2023 and has been reported to have a broader knowledge base as well as improved problem-solving ability. GPT-4 has also been reported to be less easy to fool, and is capable of processing 8 times more words. The usages for ChatGPT continue to grow, and new applications of the langue learning model continue to be found. Due to the black box nature of AI models, interpretation of GPT-4 outputs must be made with caution to ensure that no errors have been made. Particularly in healthcare delivery and medicine, where policies and procedures are frequently revised, GPT-4 algorithms comments may be out-of-date or incorrect. Out of the new features introduced in GPT-4, the most important feature may be its new ability to analyze images. This could potentially help doctors to diagnose and treat patients quickly and accurately, especially in areas where access to medical professionals may be limited. To examine GPT-4’s image diagnostic ability, we provided it with a variety of common medical imaging modalities: from chest X-rays, magnetic resonance images (MRI), to optical coherence tomography (OCT) images. All in all, although significant advancements and further research is still required, the future of automated medical image analysis is highly promising.",
        "DOI": "10.21037/jmai-23-94",
        "paper_author": "Waisberg E.",
        "affiliation_name": "University of Cambridge",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60031101",
        "affiliation_state": "Cambridgeshire"
    },
    {
        "paper_title": "Artificial intelligence and the future of Chinese language pedagogy: An in-depth analysis",
        "publication": "Fostering Foreign Language Teaching and Learning Environments With Contemporary Technologies",
        "citied_by": "5",
        "cover_date": "2023-12-29",
        "Abstract": "This chapter explores the function of cutting-edge technologies including artificial intelligence, augmented reality, and the metaverse in teaching Chinese as a foreign language. It's an example of how AI is being put to use in tailor-made programs for mastering Chinese and all its subtleties. The chapter covers how to use augmented reality and how it can help you have more meaningful conversations with others. The potential of ChatGPT and the metaverse as interactive learning environments is also discussed in this chapter. The effects on educational policy and teacher preparation, as well as an examination of students' independence in technologically advanced classrooms, are discussed in the last section.",
        "DOI": "10.4018/9798369303535.ch001",
        "paper_author": "Zreik M.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Synergizing AI and HRM: Leveraging business analytics for a future-ready workforce",
        "publication": "Exploring the Intersection of AI and Human Resources Management",
        "citied_by": "0",
        "cover_date": "2023-12-29",
        "Abstract": "This chapter explores the integration of artificial intelligence (AI) and human resource management (HRM) practices within the Asian business landscape. It offers a comprehensive examination of the evolution of AI in HRM, emphasizing the benefits and potential challenges associated with implementing AI-driven HRM strategies. The discussion highlights the importance of synergizing AI and HRM through business analytics, offering insights into how AI can enhance recruitment, retention, and employee engagement. The author delves into potential ethical, cultural, and legal issues associated with AI-driven HRM, highlighting the necessity for thoughtful and strategic implementation. Finally, the chapter proposes strategies for successfully incorporating AI in HRM, emphasizing the development of AI competencies, fostering a data-driven culture, and ensuring ethical AI deployment. The discussion provides a foundation for future research, policy development, and practical applications in AI-driven HRM, promoting a future-ready workforce in Asia.",
        "DOI": "10.4018/9798369300398.ch010",
        "paper_author": "Allil K.",
        "affiliation_name": "University of Hertfordshire",
        "affiliation_city": "Hatfield",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60032760",
        "affiliation_state": "Hertfordshire"
    },
    {
        "paper_title": "Integrating generative AI into K-12 curriculums and pedagogies in India: Opportunities and challenges",
        "publication": "Facilitating Global Collaboration and Knowledge Sharing in Higher Education With Generative AI",
        "citied_by": "52",
        "cover_date": "2023-12-29",
        "Abstract": "Generative artificial intelligence (AI) can revolutionize K-12 education in India by enhancing curriculums and pedagogies. This chapter explores the principles of generative AI, including generative adversarial networks (GANs), variational autoencoders (VAEs), and natural language generation (NLG), and its potential to create content indistinguishable from human-generated materials. Generative AI addresses challenges like resource scarcity, linguistic diversity, and personalized learning experiences, while emphasizing ethical considerations, data privacy, and bridging the digital divide. The future of K-12 education in India will see personalized learning journeys, inclusivity, and empowered educators. A comprehensive policy framework, infrastructure support, and teacher training are needed to realize the full potential of generative AI in shaping the educational landscape.",
        "DOI": "10.4018/9798369304877.ch006",
        "paper_author": "Sharma D.M.",
        "affiliation_name": "Shri Ramdeobaba College of Engineering and Management, Nagpur",
        "affiliation_city": "Nagpur",
        "affiliation_country": "India",
        "affiliation_id": "60056514",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "Fortifying the digital forge: Unleashing cybersecurity in the interconnected world of digital manufacturing",
        "publication": "Emerging Technologies in Digital Manufacturing and Smart Factories",
        "citied_by": "3",
        "cover_date": "2023-12-29",
        "Abstract": "In our interconnected world, cybersecurity is paramount due to IoT, cloud computing, and automation's impact on manufacturing. This chapter underscores digital manufacturing's dependence on interconnected systems and cloud infrastructure, acknowledging risks like data breaches, IP theft, and operational disruptions. It advocates a comprehensive cybersecurity approach encompassing technical measures, organizational policies, staff training, and incident response. The chapter delves into threats like malware, phishing, ransomware, and supply chain attacks, emphasizing continuous monitoring, threat intelligence, and vulnerability management. Additionally, it explores emerging trends like AI and machine learning in cybersecurity, legacy system security, and collaborative efforts among industry players, government agencies, and cybersecurity experts to safeguard digital manufacturing. This chapter aids manufacturers, security experts, and researchers in building secure systems in our connected digital landscape.",
        "DOI": "10.4018/979-8-3693-0920-9.ch014",
        "paper_author": "Dodiya K.R.",
        "affiliation_name": "Gujarat University",
        "affiliation_city": "Gujarat",
        "affiliation_country": "India",
        "affiliation_id": "126149593",
        "affiliation_state": "GJ"
    },
    {
        "paper_title": "Facilitators and Barriers Influencing the Integration of ChatGPT-Based Models in Enhancing the Delivery of Public Services within Government Institutions in Nigeria",
        "publication": "Ianna Journal of Interdisciplinary Studies",
        "citied_by": "3",
        "cover_date": "2023-12-28",
        "Abstract": "Background: Integrating advanced technology and Chat Generative Pre-trained Transformer (ChatGPT-type) artificial intelligence(AI) models in public service delivery has global significance. However, limited research exists on ChatGPT's adoption and implementation in Nigerian government institutions, which is crucial given Nigeria's unique challenges and opportunities in its pursuit of digital transformation and governance improvement. Objectives: This study investigated the facilitators of ChatGPT-based model integration in Nigerian public institutions, investigated the obstacles impeding their deployment, and proposed policy recommendations for their effective use in the public sector. Methodology: This study employed a cross-sectional survey design to investigate the adoption of ChatGPT-based models in Nigerian government institutions. The study was conducted in Abuja, targeting IT personnel in public organisations. Purposive sampling was used to select 108 respondents with expertise in the field. Data was collected using a structured questionnaire based on the principles of the Technology Acceptance Model (TAM). Results: The study found strong support for ChatGPT integration in Nigerian government institutions, with favourable opinions on its potential to enhance public service delivery. However, concerns included security, employee resistance, resource needs, and usability were found. Policy recommendations included training, data privacy regulations, clear guidelines, awareness campaigns, gradual integration, incentives, combining ChatGPT with human support, and oversight mechanisms. Significant positive correlations were observed between facilitators and intentions and between perceived barriers and intentions. Users' intentions were also positively associated with their perceptions of ChatGPT adoption in public institutions, highlighting the link between intention and perceived adoption. Conclusion: The significance of enhancing user-friendliness, public service delivery, and resolving security issues and employee resistance are highlighted by crucial findings. These findings provide useful information for developing evidence-based strategies to improve ChatGPT integration and advance the provision of public services in Nigeria's government sector. Unique Contribution: This research offers valuable insights for developing evidence-based strategies to enhance the use of ChatGPT and improve public service provision in the Nigerian government sector. Recommendation: Among other recommendations, it is advised that a comprehensive training program should be designed and implemented for public workers in order to ensure a smooth technological transition and effective public service delivery in Nigeria.",
        "DOI": "NA",
        "paper_author": "Onwuka I.A.",
        "affiliation_name": "University of Nigeria",
        "affiliation_city": "Naukka",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60025390",
        "affiliation_state": "Enugu"
    },
    {
        "paper_title": "Reforming higher education through AI",
        "publication": "Governance in Higher Education: Global Reform and Trends in the MENA Region",
        "citied_by": "6",
        "cover_date": "2023-12-27",
        "Abstract": "The modernization of higher education is both an intricate and urgent issue, particularly in regions experiencing added complexities of volatility, such as the Middle East and North Africa (MENA). This chapter delves into the multidimensional challenges faced by higher education globally, and specifically within the MENA region, including the Two Sigma Problem, the standardization of teaching and learning, and the increasing burdens on educators. It examines the transformative potential of Artificial Intelligence (AI) as a tool to address these challenges, focusing on Generative AI's capacity to democratize and personalize learning. We dissect the evolution of AI from speculation to reality, highlighting the emergence of large language models and exploring potential educational use cases. The discussion emphasizes personalized learning as a core use case, providing a pragmatic outline for building an AI Personalized Tutor. The envisioned solution promises to resolve long-standing educational issues such as the Two Sigma Problem and decrease overall educational costs, while granting teachers more time to support their students effectively. Despite the exciting prospects, we highlight the essentiality of ethical considerations and governance in AI deployment. Concerns over the responsible use of AI necessitate comprehensive governing frameworks and institutional policies. The chapter concludes with a call to action for universities to establish the necessary foundations for the successful integration of AI: upskilling educators, reimagining teaching models, instilling students with requisite skills, and creating ethical guidelines for AI use in professional and research contexts. This proactive approach will ensure the potential of AI is harnessed effectively and responsibly, driving transformation in the realm of higher education.",
        "DOI": "10.1007/978-3-031-40586-0_12",
        "paper_author": "Karam J.",
        "affiliation_name": "Tabarja Beach Resort",
        "affiliation_city": "Tabarja",
        "affiliation_country": "Lebanon",
        "affiliation_id": "131346895",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "NAVIGATING THE GEOPOLITICAL LANDSCAPE OF ARTIFICIAL INTELLIGENCE: REFLECTIONS AND CHALLENGES",
        "publication": "Journal of Liberty and International Affairs",
        "citied_by": "0",
        "cover_date": "2023-12-26",
        "Abstract": "Artificial Intelligence (AI) has enormously impacted everyday life’s economic, social, and political spheres. This impact is even more significant in today’s globalized world. Artificial Intelligence and new technologies influenced the geopolitical domain, shifting and influencing the balance of power. The power that excelled in governing, educating, and reproducing novelties in AI claimed the title. However, instead of aspiring to be the best, the great powers balanced out their antagonism and joined forces. They cooperated in the domain of new technologies and AI, aiming for the benefit of humanity. AI had to be adequately harvested to produce peace, prosperity, and stability, acting as a bridge in an interconnected, globalized world. The purpose of the research was to discuss and analyze, through qualitative research analysis, the present and future influences, effects, and policies of Artificial Intelligence and new technologies in the geopolitical domain and their impact on humanity.",
        "DOI": "10.47305/JLIA2393599tk",
        "paper_author": "Tilovska-Kechedji E.",
        "affiliation_name": "St. Kliment Ohridski University",
        "affiliation_city": "Bitola",
        "affiliation_country": "North Macedonia",
        "affiliation_id": "60072632",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The application of \"5G+AI\" information technology in college English teaching",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-22",
        "Abstract": "With the rapid development of information technology, the widespread implementation of 5G and artificial intelligence (AI) technology has become evident across various fields. This study aims to explore the utilization of \"5G+AI\"information technology in college English teaching, analyze its advantages and obstacles, and provide appropriate recommendations. It emphasizes three key benefits of this integration: providing access to a vast array of learning resources, delivering personalized learning experiences, and facilitating efficient teaching evaluation. Through extensive literature review and comprehensive case studies analysis, it has been observed that the integration of \"5G+AI\"technology presents augmented learning resources, customized educational experiences, and streamlined teaching evaluations, all of which significantly contribute to improving college English instruction. However, the application of this technology also faces challenges such as privacy protection, network security, and technological costs. Therefore, educational departments and institutions should strengthen teacher training and support by formulating relevant policies and standards to foster the extensive integration of \"5G+AI\"information technology in college English instruction.",
        "DOI": "10.1145/3660043.3660200",
        "paper_author": "Wang H.",
        "affiliation_name": "Dalian Neusoft University of Information",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60108768",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "AI is transforming how science is done. Science education must reflect this change.",
        "publication": "Science",
        "citied_by": "13",
        "cover_date": "2023-12-22",
        "Abstract": "NA",
        "DOI": "10.1126/SCIENCE.ADM9788",
        "paper_author": "Erduran S.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Summary Report APE 2023, 10-12 January, Berlin, Germany Berlin Re-Visited: Building Technological Support for Scholarship and Scientific Publishing",
        "publication": "Information Services and Use",
        "citied_by": "0",
        "cover_date": "2023-12-22",
        "Abstract": "This paper summarizes the 18th Academic Publishing in Europe (APE) Conference: Berlin Re-Visited: Building Technological Support for Scholarship and Scientific Publishing, held as a hybrid event 10 and 11 January 2023, and organized by the Berlin Institute of Scholarly Publishing (BISP), a not-for-profit organization dedicated to bringing publishers, researchers, funders, and policymakers together. This year's conference theme “Out with the old, in with the new!” was discussed and presented in keynote speeches, the APE lecture, and several panel discussions. Current challenges within scholarly publishing, e.g., with research integrity, trust, and research assessment, have much to do with the old ways of doing things. To move science forward, new technologies and innovations, like the decentralized web, FAIR digital objects, and blockchain technology are needed to shape new paradigms. In many sessions it was stressed that not just new technologies are needed to move science forward, but human collaboration and partnerships as well. The changing role of the journal and the importance to recognize more diverse research outputs, beyond the journal article, was a topic of importance. Not only research assessment reforms and improved collaboration amongst different stakeholder groups are needed to address this, new publishing systems, better metadata, and open infrastructures as well. A session presenting different start-ups showcased how Artificial Intelligence, Natural Language Processing and software technology can be used to tackle problems in e.g., finding relevant funders and peer reviewers, and detecting image plagiarism. It was also discussed what publishers can do to help achieve the Sustainable Development Goals. Collaboration, data transparency and sharing best practices amongst researchers, funders, and policy makers are key. Another important topic during this year's APE was how publishers can support Early Career Researchers: establishing new workflows and infrastructures that enable publication of a wider range of research outputs, and broader recognition of these outputs, will incentivize ECRs. This year's APE was concluded with the APE Award Ceremony. The winner - Vsevolod Solovyov from Prophy - has used AI to enhance the current peer review system and made a very important contribution to improving the scholarly communication system.",
        "DOI": "10.3233/ISU-230189",
        "paper_author": "Duine M.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The Robots are Here: Navigating the Generative AI Revolution in Computing Education",
        "publication": "ITiCSE-WGR 2023 - Proceedings of the 2023 Working Group Reports on Innovation and Technology in Computer Science Education",
        "citied_by": "104",
        "cover_date": "2023-12-22",
        "Abstract": "Recent advancements in artificial intelligence (AI) and specifically generative AI (GenAI) are threatening to fundamentally reshape computing and society. Largely driven by large language models (LLMs), many tools are now able to interpret and generate both natural language instructions and source code. These capabilities have sparked urgent questions in the computing education community around how educators should adapt their pedagogy to address the challenges and to leverage the opportunities presented by this new technology. In this working group report, we undertake a comprehensive exploration of generative AI in the context of computing education and make five significant contributions. First, we provide a detailed review of the literature on LLMs in computing education and synthesise findings from 71 primary articles, nearly 80% of which have been published in the first 8 months of 2023. Second, we report the findings of a survey of computing students and instructors from across 20 countries, capturing prevailing attitudes towards GenAI/LLMs and their use in computing education contexts. Third, to understand how pedagogy is already changing, we offer insights collected from in-depth interviews with 22 computing educators from five continents. Fourth, we use the ACM Code of Ethics to frame a discussion of ethical issues raised by the use of large language models in computing education, and we provide concrete advice for policy makers, educators, and students. Finally, we benchmark the performance of several current GenAI models/tools on various computing education datasets, and highlight the extent to which the capabilities of current models are rapidly improving. There is little doubt that LLMs and other forms of GenAI will have a profound impact on computing education over the coming years. However, just as the technology will continue to improve, so will our collective knowledge about how to leverage these new models and tools in educational settings. We expect many important conversations around this topic will emerge as the community explores how to provide more effective, inclusive, and personalised learning experiences. Our aim is that this report will serve as a focal point for both researchers and practitioners who are exploring, adapting, using, and evaluating GenAI and LLM-based tools in computing classrooms.",
        "DOI": "10.1145/3623762.3633499",
        "paper_author": "Prather J.",
        "affiliation_name": "Abilene Christian University",
        "affiliation_city": "Abilene",
        "affiliation_country": "United States",
        "affiliation_id": "60026136",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Criticality-based data segmentation and resource allocation in machine inference pipelines",
        "publication": "Artificial Intelligence for Edge Computing",
        "citied_by": "1",
        "cover_date": "2023-12-21",
        "Abstract": "This chapter introduces a criticality-aware data segmentation and resource allocation framework for real-time machine perception pipelines at the edge, for running DNN-based perception models in real time on resource-constraint edge platforms to process the sensing data stream (i.e., sequence of image frames). Mainstream machine inference frameworks commonly adopt a simple First-in-First-out (FIFO) policy to process the perceived images in a holistic manner without differentiating the data criticality, which results in a significant form of algorithmic priority inversion issue. Priority inversion happens when data of lower priority are processed ahead of or together with data of higher priority. The proposed framework first segments the input data into fine-grained subframe regions with different criticality, and processes them in a priority-based manner with differentiated deadlines and computation resource allocation. We design the general architecture in a modularized way and implement multiple alternative algorithms for data segmentation, prioritization, and resource allocation respectively for different edge scenarios. Experimental results on autonomous driving applications show that the framework is able to provide more timely responses to critical regions with only negligible degradation in overall perception quality. We also extend the idea into two generalized edge AI scenarios: collaborative multi-camera surveillance and edge-assisted live video analytics.",
        "DOI": "10.1007/978-3-031-40787-1_11",
        "paper_author": "Liu S.",
        "affiliation_name": "Shanghai Jiao Tong University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025084",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Neighborhood Determinants of Sleep and the Moderating Role of Cultural Factors Among Native Adolescents",
        "publication": "Health Psychology",
        "citied_by": "2",
        "cover_date": "2023-12-21",
        "Abstract": "Objective: This study examined the association between neighborhood social environment and sleep among urban American Indian and Alaska Native (AI/AN) adolescents as well as the moderating role of cultural factors in this association. Method: The analytic sample included 133 urban AI/AN adolescents (age 12–16, 57.1% female, Mage = 14.03, SDage = 1.35). Perceived neighborhood social environment included safety and cohesion. Cultural factors included AI/AN cultural identification and historical loss. Sleep duration, efficiency, and wake after sleep onset (WASO) were measured via actigraphy. Sleep disturbance was measured via a questionnaire. Results: Greater neighborhood safety was significantly associated with lower sleep disturbance (b = −2.17, SE = 0.8, p =.008), higher sleep efficiency (b = 1.75, SE = 0.64, p =.006), and lower WASO (b = −8.60, SE = 3.34, p =.01). Neighborhood cohesion was not associated with any sleep outcomes. Cultural factors moderated the association between neighborhood social environment and sleep outcomes (p,.05). Specifically, both neighborhood safety and cohesion were associated with lower sleep disturbance, only among individuals reporting higher levels of AI/AN cultural identification. Further, neighborhood safety was associated with greater sleep efficiency and lower WASO (i.e., better sleep) only among adolescents with higher contemplation of historical loss. Conclusions: Findings high-light the importance of considering cultural factors in addressing sleep and health disparities. AI/AN cultural identification and a sense of historical loss may be important targets for identifying adolescents who might benefit the most from policies and interventions focused on improving the social environment in order to improve sleep and other health outcomes.",
        "DOI": "10.1037/hea0001342",
        "paper_author": "Mousavi Z.",
        "affiliation_name": "University of California",
        "affiliation_city": "San Diego",
        "affiliation_country": "United States",
        "affiliation_id": "123291141",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Digital labor, platforms, and AI",
        "publication": "Introduction to Digital Humanism: A Textbook",
        "citied_by": "1",
        "cover_date": "2023-12-20",
        "Abstract": "This chapter examines the role that platform labor plays in the development of contemporary AI systems. While such systems are often touted as magical innovations, they are typically propped up by vast amounts of human laborers, who clean the data, manually label key features, and moderate toxic content, among other tasks. Proponents claim these tasks offer flexibility and pay; critics counter that this work is exploitative and precarious, taking advantage of the already marginalized. This chapter surfaces this often-invisible labor, highlighting several key issues around its poor or nonexistent remuneration, exploitative mechanisms, negative impact on well-being, and extractive colonial logics. The chapter suggests several interventions, from concrete policy to corporate responsibility, that might lead to improvements. As AI technologies proliferate into many domains, the hidden labor required to develop them-and the negative impacts this has on lives and livelihoods-becomes an increasingly urgent issue.",
        "DOI": "10.1007/978-3-031-45304-5_35",
        "paper_author": "Munn L.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Introduction to digital humanism: A textbook",
        "publication": "Introduction to Digital Humanism: A Textbook",
        "citied_by": "6",
        "cover_date": "2023-12-20",
        "Abstract": "This open access textbook introduces and defines digital humanism from a diverse range of disciplines. Following the 2019 Vienna Manifesto, the book calls for a digital humanism that describes, analyzes, and, most importantly, influences the complex interplay of technology and humankind, for a better society and life, fully respecting universal human rights. The book is organized in three parts: Part I \"Background\" provides the multidisciplinary background needed to understand digital humanism in its philosophical, cultural, technological, historical, social, and economic dimensions. The goal is to present the necessary knowledge upon which an effective interdisciplinary discourse on digital humanism can be founded. Part II \"Digital Humanism - a System's View\" focuses on an in-depth presentation and discussion of the main digital humanism concerns arising in current digital systems. The goal of this part is to make readers aware and sensitive to these issues, including e.g. thecontrol and autonomy of AI systems, privacy and security, and the role of governance. Part III \"Critical and Societal Issues of Digital Systems\" delves into critical societal issues raised by advances of digital technologies. While the public debate in the past has often focused on them separately, especially when they became visible through sensational events the aim here is to shed light on the entire landscape and show their interconnected relationships. This includes issues such as AI and ethics, fairness and bias, privacy and surveillance, platform power and democracy. This textbook is intended for students, teachers, and policy makers interested in digital humanism. It is designed for stand-alone and for complementary courses in computer science, or curricula in science, engineering, humanities and social sciences. Each chapter includes questions for students and an annotated reading list to dive deeper into the associated chapter material. The book aims to provide readers with as wide an exposure as possible to digital advances and their consequences for humanity. It includes constructive ideas and approaches that seek to ensure that our collective digital future is determined through human agency.",
        "DOI": "10.1007/9783031453045",
        "paper_author": "Werthner H.",
        "affiliation_name": "Technische Universität Wien",
        "affiliation_city": "Vienna",
        "affiliation_country": "Austria",
        "affiliation_id": "60018163",
        "affiliation_state": "Vienna"
    },
    {
        "paper_title": "Human rights alignment: The challenge ahead for AI lawmakers",
        "publication": "Introduction to Digital Humanism: A Textbook",
        "citied_by": "2",
        "cover_date": "2023-12-20",
        "Abstract": "The frameworks for the governance of AI have evolved rapidly. From the 2018 Universal Guidelines for AI on through the 2019 OECD/G20 AI Principles 2019, and the 2021 UNESCO Recommendation on AI Ethics, governments have agreed to the basic norms to regulate AI services. Two important legal frameworks are also now underway-the EU AI Act and the Council of Europe AI Convention. As these frameworks have evolved, we see the scope of AI governance models expand. From an initial focus on \"human-centric and trustworthy AI\" through the recognition of \"fairness, accuracy, and transparency\" as building blocks for AI governance, we see now consideration of sustainability, gender equality, and employment as key categories for AI policy. AI laws also overlap with familiar legal topics such as consumer protection, copyright, national security, and privacy. Throughout this evolution, we should consider whether the evolving models for the governance of AI are aligned with the legal norms that undergird democratic societies-fundamental rights, democratic institutions, and the rule of law. For democracies to flourish in the age of artificial intelligence, this is the ultimate alignment challenge for AI.",
        "DOI": "10.1007/978-3-031-45304-5_38",
        "paper_author": "Rotenberg M.",
        "affiliation_name": "Center for AI and Digital Policy",
        "affiliation_city": "Washington",
        "affiliation_country": "United States",
        "affiliation_id": "130648949",
        "affiliation_state": "DC"
    },
    {
        "paper_title": "Charting the course: exploring the changing terrain of online shopping and future directions for research",
        "publication": "International Journal of Electronic Business",
        "citied_by": "6",
        "cover_date": "2023-12-20",
        "Abstract": "The COVID-19 pandemic’s pernicious consequences are characterised as quintessential disruptors that have inflicted widespread havoc upon human, social, and economic spheres globally, leading to a surge in online shopping and underscoring the significance of its examination. This study comprehensively investigates online shopping research by scrutinising 410 publications between 2002 and 2022 sourced from the dimensions AI database, revealing China’s preeminent position in the field, followed closely by the USA and India, with US publications demonstrating high citation rates and formidable collaborative networks. Utilising the TCCM framework, this study performs a systematic review of selected articles and identifies the most popular constructs, theories, contexts, and methodologies employed in extant studies, yielding profound insights that have the potential to inform policymakers’ and businesses’ policies and strategies aimed at fostering sustainable and profitable online commerce that meets the dynamic and evolving needs of consumers, while also suggesting future research avenues.",
        "DOI": "10.1504/IJEB.2024.135653",
        "paper_author": "Jaiswal R.",
        "affiliation_name": "H.N.B.Garhwal University",
        "affiliation_city": "Srinagar",
        "affiliation_country": "India",
        "affiliation_id": "60069550",
        "affiliation_state": "UK"
    },
    {
        "paper_title": "Enhancing Legally-Based E-Government Services in Education Through Artificial Intelligence",
        "publication": "International Journal of Cognitive Research in Science, Engineering and Education",
        "citied_by": "2",
        "cover_date": "2023-12-20",
        "Abstract": "Through the utilization of artificial intelligence (AI), governments can automate the analysis of publicly available government datasets. This process aids in the recognition of patterns and the development of a more profound comprehension of various socio-economic factors and empowers governments to base their policy decisions on data, effectively tackling societal issues, and optimizing the allocation of resources. In this paper we present AI’s application in the realm of e-government, with particular emphasis on its potential influence on the advancement of this field through e-government services and their significance for a range of stakeholders. Moreover, we have conducted comprehensive review of existing literature on the subject and the identification of avenues for enhancement along with consideration of legislation as a potent instrument to guide the progression of AI within the sphere of e-government, thereby amplifying its transformative effect. We emphasize the importance of education in area of AI in order to ensure it’s high quality implementation in this and other areas.",
        "DOI": "10.23947/2334-8496-2023-11-3-511-518",
        "paper_author": "Spalević Ž.",
        "affiliation_name": "Singidunum University",
        "affiliation_city": "Belgrade",
        "affiliation_country": "Serbia",
        "affiliation_id": "60175855",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "HOW ARTIFICIAL INTELLIGENCE AFFECTS EDUCATION?",
        "publication": "Human Technology",
        "citied_by": "4",
        "cover_date": "2023-12-19",
        "Abstract": "Acquiring specific knowledge that can be tested by means of a test is a very common scenario present in the education system, which determines the passing of successive levels of education. The simultaneous development of technology, in particular artificial intelligence models available through publicized large language models, makes this scheme vulnerable to abuse and pitfalls. Updating knowledge and awareness of the advantages and risks of the use of artificial intelligence in education (AIED) is the responsibility of the research community and global policy. This text is a voice that attempts to redress the balance between the enthusiasm for the use of AI in education and the dangers that come with it. Public awareness develops more slowly in this case than the technology itself, and the regulations created are no substitute for ethics and decency, at the initial stage of their introduction, before certain patterns and rules have become established.",
        "DOI": "10.14254/1795-6889.2023.19-3.0",
        "paper_author": "Wojciechowski A.",
        "affiliation_name": "Lodz University of Technology",
        "affiliation_city": "Lodz",
        "affiliation_country": "Poland",
        "affiliation_id": "60016104",
        "affiliation_state": "LD"
    },
    {
        "paper_title": "Exploring the Landscape of AI Tools in Student Learning: An analysis of commonly utilized AI Tools at a university in the Philippines",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-16",
        "Abstract": "Artificial intelligence (AI) has become a prominent tool within the education sector, which is set to begin an innovative revolution. Researchers aim to analyze what AI tools are commonly utilized by students in consideration of the program they are enrolled to. Thus, providing the university with an opportunity to integrate it into its existing curriculum. It aims to promote a deeper understanding and utilization of AI technologies while also acknowledging and resolving the challenges associated with its use in the academe. The researchers used an electronic survey to gather information on what AI tools are commonly used per school department at a university in the Philippines. The results show that students mostly use AI writing assistant tools, and students believe that their performance was enhanced by using these. Researchers concluded that artificial intelligence should be discussed more in terms of its capabilities in the education sector. Moreover, with the results obtained in this study, the university may consider adjusting its pedagogy, assessment styles, and other policies to ensure that students are compelled to submit their own works and not AI generated, and students are able to use AI confidently and responsibly in their professional future.",
        "DOI": "10.1145/3639592.3639629",
        "paper_author": "Diloy M.A.",
        "affiliation_name": "National University, Philippines",
        "affiliation_city": "Manila",
        "affiliation_country": "Philippines",
        "affiliation_id": "60105238",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of Artificial Intelligence on the Socioeconomic factors in the UAE",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-16",
        "Abstract": "Artificial Intelligence (AI) is rapidly transforming industries worldwide, including the United Arab Emirates (UAE). As the UAE aims to become a leader in AI adoption and deployment, it is crucial to understand its impact on the country's socioeconomic factors. This research proposal aims to investigate the impact of AI on employment, wage inequality, productivity, innovation, and ethical implications in the UAE. The research will adopt a mixed-methods approach combining a systematic literature review and a quantitative survey to gather and assess data. The literature review will identify relevant literature to establish the research framework, while the survey will target leaders, employees, and end-users of organizations operating in the UAE across various sectors. A sample size of no less than 250 respondents who are predominantly leadership executives will be used, and the survey will consist of 30 questions, including demographic questions, and a 5-point Likert scale to measure respondents' level of agreement or disagreement with the statements presented. Ethical considerations, including informed consent and anonymity, will be addressed. The findings from this research will contribute to a better understanding of the impact of AI on the socioeconomic factors in the UAE and help inform the development of appropriate policies and strategies for the responsible adoption and deployment of AI technologies in the country. The research proposal presents an exciting opportunity to explore a relevant and timely topic that will shed light on the potential impact of AI on the UAE's socioeconomic development.",
        "DOI": "10.1145/3639592.3639609",
        "paper_author": "Hassanien A.R.M.",
        "affiliation_name": "S.P. Jain School of Global Management",
        "affiliation_city": null,
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "129046322",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "AIGPU: An Arithmetic-Intensity-Guided Single-GPU Scheduling Model",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "With the advent of large AI models, GPU has become a primary co-processor for accelerating the training processes. Research on efficiently utilizing multi-GPU systems has been a lot; nevertheless, studies about efficiently exploiting a single GPU are scarce. The common throughput-oriented way to control a single GPU is to launch kernels as many as possible under memory safety. However, in this case, the set of launched kernels might not utilize the GPU efficiently, resulting in idle compute or bandwidth resources. In this paper, we propose AIGPU — an arithmetic-intensity-guided single-GPU scheduling model — to evaluate the degree of overlapped execution for multiple kernels. We formulate the model as an integer linear programming(ILP) problem and use its scheduling decisions to select a set of kernels to launch concurrently. In our implementation, two policies with different granularities are proposed to evaluate AIGPU. We demonstrate our method on NVIDIA RTX 3080Ti using eight benchmarks from CUDA SDK. The experiments show the technique improves the GPU throughput by up to 78.6%(on average 21%) and 267%(on average 133%) compared to the state-of-the-art single-GPU scheduling and the state-of-the-art multi-GPU scheduling algorithm, respectively. This is mainly because it explores the overlapped execution of multiple kernels such that the GPU is utilized more efficiently. AIGPU achieves peak GPU utilization of 94%(on average 25.05%).",
        "DOI": "10.1145/3638264.3638278",
        "paper_author": "Zheng J.",
        "affiliation_name": "Dongguan University of Technology",
        "affiliation_city": "Dongguan",
        "affiliation_country": "China",
        "affiliation_id": "60073518",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Educational Missions and Tactics in the EU Artificial Intelligence Strategy in the Era of Digital Transformation: A Policy Analysis Based on EU Documents Published During 2018-2022",
        "publication": "Advances in Transdisciplinary Engineering",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "In the era of digital transformation, AI, cloud computing, big data, blockchain, and other intelligent technologies have increasingly profound impacts on work, study, life, and especially education. The Publishing of The Age of Artificial Intelligence: Towards a European Strategy for Human-Centric Machines marked the official launch of the EU Artificial Intelligence Strategy. By analyzing policy documents published during 2018 and 2022 for the EU Artificial Intelligence Strategy, it is found that the strategy has set three strategic goals, namely achieving an 'Ecosystem of Excellence', building an 'Ecosystem of Trust', and establishing an 'Ecosystem of Digital Education'. To ensure its implementation, the European Commission has published a series of policy documents successively. As the main driver of the AI strategy, education plays an important role in the development of AI, and the EU has adopted various education tactics in the series of documents. Given the particularity of the EU as a regional cooperation organization, this strategy values philosophy, norms, and cooperation. It also provides a good reference for AI development and digital transformation of society in other countries and brings new opportunities for international cooperation in the field of AI.",
        "DOI": "10.3233/ATDE230999",
        "paper_author": "Xiong Y.",
        "affiliation_name": "Wenzhou University",
        "affiliation_city": "Wenzhou",
        "affiliation_country": "China",
        "affiliation_id": "60020224",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "PPO-Based Autonomous Transmission Period Control System in IoT Edge Computing",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "11",
        "cover_date": "2023-12-15",
        "Abstract": "With the recent explosive growth of the Internet of Things (IoT), edge computing is emerging as a modern computing paradigm that coexists with the cloud to process massive amounts of data particularly distributed at the edge network. Meanwhile, edge computing directly permits the use of artificial intelligent (AI) models at the edge. Currently in numerous IoT applications, a tremendous amount of data is being measured and transmitted from IoT sensors to monitor surrounding information in real-time. Considering that continuous transmission of sensed data substantially requires high-energy consumption of IoT sensors, this article proposes a proximal policy optimization (PPO)-based autonomous transmission period control (PPO-ATPC) system in IoT edge computing that can automatically and adaptively control the transmission period of each IoT sensor. Here, the design of state, action, and reward is shaped in an unprecedented way and furthermore, a PPO, which is one of the most effective model-free deep reinforcement learning (DRL) algorithms, is fully leveraged to achieve an optimal or nearly optimal policy that can significantly shorten the data volume while maintaining high-data quality. The merits of the proposed PPO-ATPC are extensively validated through quantitative comparison with other alternative approaches using three different sensor data collected from real-time environmental monitoring, and in-depth insights into the effectiveness of PPO-ATPC are further provided from diverse perspectives. The performance results show that total data volume for each data set could be reduced by 73.849%, 89.931%, and 81.310%, with the average root mean square error of 0.322, 13.896, and 0.048.",
        "DOI": "10.1109/JIOT.2023.3293511",
        "paper_author": "Lee G.H.",
        "affiliation_name": "Korea Advanced Institute of Science and Technology",
        "affiliation_city": "Daejeon",
        "affiliation_country": "South Korea",
        "affiliation_id": "60032144",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digitization, AI and algorithms in African journalism and media contexts: Practice, policy and critical literacies",
        "publication": "Digitization, AI and Algorithms in African Journalism and Media Contexts: Practice, Policy and Critical Literacies",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "AI, robots, algorithms, and data/metrics are pervasive throughout the media industry, increasingly dictating and rapidly changing journalistic and newsroom practices, cultures, and norms - from editorial agenda setting to news production processes, to audience and advertiser targeting. Social media platforms in particular have been at the core of the AI and algorithmic turn, offering real-time consumer analytics and newsfeeds for insatiable and borderless digital citizens. The algorithms within these platforms make them powerful news aggregators, redirecting consumer habits and advertisers, making them vital in the journalism practice and media viability across the globe. Despite this, there is a shortage of scholarship on AI, algorithms and data-driven journalism from the global South, and especially in Sub-Saharan African contexts. Digitisation, AI and Algorithms in African Journalism and Media Contexts moves the focus from the West, addressing the significant knowledge gaps relating to the current state of AI, algorithms and data-driven journalism, as well as the implications for political, social, cultural, markets, media viability and journalism education. This timely collection offers new knowledge on key issues surrounding automation and data-driven media and journalism practice in post-truth, post-human and post-Covid African contexts. It is a vital resource for researchers, educators, media students, academics, advocacy groups, media practitioners, developers and policy makers, both in African countries and internationally. © 2024 Carol Azungi Dralega. Individual chapters",
        "DOI": "NA",
        "paper_author": "Dralega C.A.",
        "affiliation_name": "NLA University College",
        "affiliation_city": "Bergen",
        "affiliation_country": "Norway",
        "affiliation_id": "60007272",
        "affiliation_state": "Vestland"
    },
    {
        "paper_title": "A comparative study of AI policy frameworks on journalism practice in sub-Saharan Africa",
        "publication": "Digitization, AI and Algorithms in African Journalism and Media Contexts: Practice, Policy and Critical Literacies",
        "citied_by": "1",
        "cover_date": "2023-12-14",
        "Abstract": "This study explores how the national artificial intelligence (AI) strategies and policies in four sub-Saharan African countries - Mauritius, South Africa, Ghana and Gabon - influence the adoption of AI in journalism. In the journalistic world, AI have been mainly used for news gathering, production and distribution. Irrespective of the prospects, the pervasive nature of AI brings with it a host of challenges concerning privacy, gender, and ethnic bias. Despite its relevance to journalism, the challenges associated with using AI necessitate the need for policy frameworks that guide the development and usage of these technologies. At a global level, UNESCO has established a normative framework which lays out principles and standards regarding how member states formulate policies that ensures ethical and healthy development of AI. Using document analysis and the technological determinism theory, the study investigated how the national AI policies and strategies of these countries is impacting journalism and highlights the challenges to the adoption of the technology in the field. In lieu of the AI-specific laws, the countries seem to loosely rely on their data protection acts to govern aspects of AI use involving automated decision making. Mauritius was found to be the only country in the study with a set national AI strategy.",
        "DOI": "10.1108/978-1-80455-135-620231006",
        "paper_author": "Dralega C.A.",
        "affiliation_name": "NLA University College",
        "affiliation_city": "Bergen",
        "affiliation_country": "Norway",
        "affiliation_id": "60007272",
        "affiliation_state": "Vestland"
    },
    {
        "paper_title": "AI and the algorithmic-turn in journalism practice in Eastern Africa: Perceptions, practice and challenges",
        "publication": "Digitization, AI and Algorithms in African Journalism and Media Contexts: Practice, Policy and Critical Literacies",
        "citied_by": "3",
        "cover_date": "2023-12-14",
        "Abstract": "In the current post-human society, artificial intelligence (AI) and algorithms are rapidly being deployed in newsrooms around the world to enhance processes of news idea conception, newsgathering, writing, packaging and dissemination. Although AI adaptation has been ongoing especially in Western Newsrooms over the last decade, this process is only budding in sub-Saharan newsroom contexts. This study explores perceptions, use, prospects and challenges in the adaptation of AI and algorithms in newsrooms. This qualitative survey draws insights from 33 respondents from newspapers, radio stations, online media and community media in Uganda, Tanzania, Rwanda and Ethiopia. The study found varied levels of AI adoption in several newsrooms with some newsrooms not yet using AI while others were fully experimenting with a variety of tools, functionalities - even producing their own AI tools and also in change employment patterns to accommodate the skills needed within this new field. In some of the 'inactive AI newsrooms' individual journalists took the onus on themselves to learn and use the disruptive technologies and while the general attitudes towards AI were positive among journalists, the attitudes among management was generally considered poor. The study concludes for the benefits to be maximally leveraged, several of the bottlenecks in application must be addressed. These include the integration of 'humans-in the loop', journalistic principles, decolonial and local contextual perspectives in AI development and use. Such perspectives and synergies would need to be drawn from media ecosystems - including journalism education, research, policy, industry and developers.",
        "DOI": "10.1108/978-1-80455-135-620231003",
        "paper_author": "Dralega C.A.",
        "affiliation_name": "NLA University College",
        "affiliation_city": "Bergen",
        "affiliation_country": "Norway",
        "affiliation_id": "60007272",
        "affiliation_state": "Vestland"
    },
    {
        "paper_title": "Can AI deliver advice that is judgement-free for science policy?",
        "publication": "Nature",
        "citied_by": "1",
        "cover_date": "2023-12-14",
        "Abstract": "NA",
        "DOI": "10.1038/d41586-023-03949-9",
        "paper_author": "Canali S.",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Confrontation strategy for evolution of future employment",
        "publication": "Fostering Sustainable Development in the Age of Technologies",
        "citied_by": "0",
        "cover_date": "2023-12-13",
        "Abstract": "Industry 4.0 refers to an era in which human work, creative activities and professional knowledge are largely replaced by artificial intelligence (AI) and robots. Due to the current exponential rate of technological development and the infinite expansion and generalisation of technologies, it is not difficult to predict that these technologies will spread at exponential rates and will spur massive changes in the adopted production, management and governance mechanisms and in the future employment market. Especially, employment changes are inevitable with the rise in automation and the job scope and prospects are bound to vary widely. In this chapter, confrontation strategies for employment in Industry 4.0 are proposed. It is hoped that this study will be able to provide an accurate direction for future employment and will be able to contribute to the study of employment policies and Industry 4.0.",
        "DOI": "10.1108/978-1-83753-060-120231006",
        "paper_author": "Yoon D.",
        "affiliation_name": "Kyonggi University",
        "affiliation_city": "Suwon",
        "affiliation_country": "South Korea",
        "affiliation_id": "60017818",
        "affiliation_state": "Gyeonggi-do"
    },
    {
        "paper_title": "Application of industry 4.0 technologies in climate-smart agricultural practices",
        "publication": "Fostering Sustainable Development in the Age of Technologies",
        "citied_by": "0",
        "cover_date": "2023-12-13",
        "Abstract": "The United Nations (UN) adopted Sustainable Development Goals (SDGs); agenda 2030 focuses on Climate Action (goal 13), targeting climate adaptability, as well as resilience, awareness and improving policy mechanisms on climate change. In order to enhance climate adaptability, climate-smart agricultural practices (CSAP) is a necessary step. CSAP is a sustainable agriculture approach with a strong focus on climate dimensions. The three pillars of climate-smart agriculture (CSA) are 'Adaptation': adapting to climate change; 'Resilience': building resilience against it and 'Remove': reducing carbon emissions. The new world economy uses Industry 4.0 technologies for sustainable advancement, including blockchain technology, big data analytics, artificial intelligence (AI), augmented and virtual reality, industrial Internet of Things (IoT) and services. Hence, technology plays a significant role in climate sustainable agriculture practices. This chapter shall consider three technologies consisting of IoT, AI and blockchain technology which contribute to CSAP in pre-harvesting (monitoring climate as well as fertility status, soil testing, etc.), harvesting (tilling, fertilisation, seed operations, etc.) and post-harvesting (predicting weather factors, seed varieties, etc.) periods of agriculture. All these three technologies work like the human nervous system; IoT helps in converting various information regarding demography, climate change, local agricultural needs, etc. into world data; AI works like a brain in combination with IoT, helps predict the use of climate-smart technology and blockchain, the memory part of the nervous system which deals with supply-side and ensures traceability as well as transparency for consumers as well as farmers. Hence, this chapter shall contribute to the importance of these three technologies in adopting CSAP in three stages of agriculture.",
        "DOI": "10.1108/978-1-83753-060-120231020",
        "paper_author": "Panda S.S.",
        "affiliation_name": "Birla Institute of Technology and Science, Pilani",
        "affiliation_city": "Pilani",
        "affiliation_country": "India",
        "affiliation_id": "60000414",
        "affiliation_state": "RJ"
    },
    {
        "paper_title": "Innovations and development of artificial intelligence in Europe: some empirical evidences",
        "publication": "European Journal of Management and Business Economics",
        "citied_by": "13",
        "cover_date": "2023-12-12",
        "Abstract": "Purpose: The objective of this paper is to analyze the relationship between innovation and the development of artificial intelligence (AI) and digital technologies in Europe. The use of digital technologies among European companies is studied through a composite index, while the relationship between innovation and AI is studied through a log-linear regression model. The results of the model have made possible to develop interesting indications for economic and industrial policy. Design/methodology/approach: The use of digital technologies among European companies is studied through a composite index of AI and information technology (ICT) (using the Fair and Sustainable Welfare methodology) with the aim of measuring territorial gaps and to know which European countries are more or less inclined to its use, while the relationship between innovation and AI is studied through a log-linear regression model. Findings: In the paper, two different methodologies were used to analyze the relationship between innovation and the development of digital technologies in Europe. The synthetic indicator made possible to develop a taxonomy between the different countries, the log-linear model made possible to identify and explain the determinants of innovation. Originality/value: The description of the biunivocal relationship between innovation and AI is a topical and relevant issue that is treated in the paper in an original way using a synthetic indicator and a log-linear model.",
        "DOI": "10.1108/EJMBE-03-2023-0085",
        "paper_author": "Marino D.",
        "affiliation_name": "Università degli Studi di Reggio Calabria",
        "affiliation_city": "Reggio Calabria",
        "affiliation_country": "Italy",
        "affiliation_id": "60020167",
        "affiliation_state": "RC"
    },
    {
        "paper_title": "The role of artificial intelligence in effective business operations during COVID-19",
        "publication": "International Journal of Emerging Markets",
        "citied_by": "20",
        "cover_date": "2023-12-12",
        "Abstract": "Purpose: The pressure to survive in a highly competitive market by using artificial intelligence (AI) has further demonstrated the need for automation in business operations during a crisis, such as COVID-19. Prior research finds managers' mixed perceptions about the use of technology in business, which underscores the need to better understand their perceptions of adopting AI for automation in business operations during COVID-19. Based on social exchange theory, the authors investigated managers' perceptions of using AI in business for effective operations during the COVID-19 pandemic. Design/methodology/approach: This study collected data through a survey conducted in China (N = 429) and ran structural equation modeling to examine the proposed research model and structural relationships using Smart PLS software. Findings: The results show that using AI in supply chain management, inventory management, business models, and budgeting are positively associated with managers' satisfaction. Further, the relationship between managers' satisfaction and effective business operations was found to be positively significant. In addition, the findings suggest that top management support and the working environment have moderating effects on the relationship between managers' satisfaction and effective business operations. Practical implications: The results of this study can guide firms to adopt an AI usage policy and execution strategy, according to managers' perceptions and psychological responses to AI. Social implications: The study can be used to manage the behavior of managers within organizations. This will ultimately improve society's perception of the employment of AI in business operations. Originality/value: The study's outcomes provide valuable insights into business management and information systems with AI application as a business response to any crisis in the future.",
        "DOI": "10.1108/IJOEM-11-2021-1666",
        "paper_author": "Chen Y.",
        "affiliation_name": "Xiamen University",
        "affiliation_city": "Xiamen",
        "affiliation_country": "China",
        "affiliation_id": "60018205",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "Employability challenges and opportunities under STEM learning with a special focus on apprenticeship and internship",
        "publication": "STEM: A Multi-Disciplinary Approach to Integrate Pedagogies, Inculcate Innovations and Connections",
        "citied_by": "0",
        "cover_date": "2023-12-11",
        "Abstract": "Employability is a big issue with most HR Professionals and Managers agreeing that most fresh graduates, especially from traditional courses like B. Com, B. Sc., BBM, BCA, BSW, and BA, are not competent to begin work even after the induction program. The skills and knowledge they possess are mostly not industry-relevant and very few candidates have the attitude necessary to pick up necessary skills and knowledge efficiently. STEM Learning is almost unavoidable for future work. In India the new National Education Policy provides an opportunity for the University, while planning the pedagogy of all their courses, to take inputs from HR Managers, Industry Representatives, Chamber of Commerce, and MSME Department Personnel. Similarly, the UN, ILO, EU, and various Government bodies are also banking on STEM learning to address both economic growth and employability issues, which if left unresolved may lead to social problems shortly. Globally STEM is seen as the most reliable and sustainable solution to overcome the challenges brought forth by emerging technologies like AI, IoT, 3D Printing, Machine Learning, Robotics, and other beneficial but disruptive technologies (International Labour Organization, 2021; Ministry of Education, 2021). Most employed persons use only part of their STEM learning in their day-to-day work. It is also a fact that different professions and different tasks need different knowledge, skills, and experience in STEM applications. Different technology in the same industry at the same levels of work also creates different needs for STEM application for employees. This is where Internships and Apprenticeships can help individuals and specific industries design and deliver their unique STEM requirements among potential employees. While formal education syllabi are designed generically keeping in mind the overall job market requirements, the specifics KSE (Knowledge, Skill & Experience) can be delivered through Internships.",
        "DOI": "NA",
        "paper_author": "Nayak P.",
        "affiliation_name": "Vivekanand Institute of Management",
        "affiliation_city": "Kalaburagi, Karnataka",
        "affiliation_country": "India",
        "affiliation_id": "130788551",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Intelligent human resources for the adoption of artificial intelligence: a systematic literature review",
        "publication": "Journal of Organizational Change Management",
        "citied_by": "25",
        "cover_date": "2023-12-11",
        "Abstract": "Purpose: This study is dedicated to critically analysing research addressing human resource management (HRM) and the adoption of artificial intelligence (AI) with the purpose of driving development in the field of human resources (HR) at the strategic and managerial level. Design/methodology/approach: A systematic literature review (SLR) was conducted using the Scopus database, which gathered 61 articles between 2002 and 2022. The SLR process has the potential to, in addition to generating knowledge and theories, support and guide policy development and practice in many disciplines. Findings: The results of this study allowed the author to identify three main conclusions: (a) there are four thematic clusters – (i) Strategic HR and AI, (ii) Recruitment and AI, (iii) Training and AI and (iv) Future of work; (b) there is a growing academic interest in studying the implementation of AI to develop the HR sector and (c) the application of AI stands out in the strategic HR and AI cluster as a means of achieving profit maximisation and the overall development of the organisation. Originality/value: This study is the first SLR to present a strategic and managerial view on AI applications associated with specific HRM dimensions. The study is also the first SLR to identify key trends in the literature, drivers and obstacles to the development of AI in HRM and then place them within the landscape of positive and negative approaches in a framework. Also, as a contribution, the study has practical implications for HR managers and practitioners in adopting AI as a decision support in the area's processes.",
        "DOI": "10.1108/JOCM-03-2022-0075",
        "paper_author": "Jatobá M.N.",
        "affiliation_name": "Universidade da Beira Interior",
        "affiliation_city": "Covilha",
        "affiliation_country": "Portugal",
        "affiliation_id": "60001002",
        "affiliation_state": "Castelo Branco"
    },
    {
        "paper_title": "Research on Intelligent Tourism of Ancient Villages under the Perspective of Artificial Intelligence - Take Guilin Yueling Village for example",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "Combined with the relevant development of artificial intelligence big data, the construction of tourism perception analysis model is discussed, based on the existing government information query platform to establish a big data analysis model, which provides an interface for data aggregation and, data prediction Dynamic streaming data processing in the model, real-time collection and aggregation from the government platform, and combined with machine learning algorithms to propose a recommendation strategy aimed at improving tourism perception, which can help government departments formulate relevant support policies for tourist attractions, and finally, the model performance was evaluated through actual data collection, and the results showed that this model can better analyse and predict the tourism perception of residents.",
        "DOI": "10.1145/3659211.3659321",
        "paper_author": "Li N.",
        "affiliation_name": "Guilin University of Electronic Technology",
        "affiliation_city": "Guilin",
        "affiliation_country": "China",
        "affiliation_id": "60008919",
        "affiliation_state": "Guangxi"
    },
    {
        "paper_title": "Human-AI collaboration in environmental decision making: Ethical considerations",
        "publication": "Exploring Ethical Dimensions of Environmental Sustainability and Use of AI",
        "citied_by": "0",
        "cover_date": "2023-12-07",
        "Abstract": "In a crowded, interconnected world, it is becoming increasingly important to consider the ethical implications of decisions made by humans and AI. When AI and humans work together on decision-making in environmental policy, novel ethical considerations arise that require both parties to work in cooperation with one another. One party may be more knowledgeable about the situation at hand while the other may have access to resources not as readily available for a single party. There are many potential benefits for human-AI collaboration including efficiency, improving accuracy of predictions, expanding knowledge base and breadth of expertise without bias from a single perspective, etc. However, there are also potential drawbacks such as differing stances on ethics among different parties involved in collaboration. It is also possible that a party working in collaboration with a machine may not realize the extent of its involvement.",
        "DOI": "10.4018/9798369308929.ch016",
        "paper_author": "Goalla A.",
        "affiliation_name": "Woxsen University",
        "affiliation_city": "Hyderabad",
        "affiliation_country": "India",
        "affiliation_id": "60274762",
        "affiliation_state": "TS"
    },
    {
        "paper_title": "Guiding the next technological revolution: Principles for responsible AI and nanotech progress",
        "publication": "Artificial Intelligence in the Age of Nanotechnology",
        "citied_by": "1",
        "cover_date": "2023-12-07",
        "Abstract": "This chapter explores the evolution and transformative potential of artificial intelligence (AI) and nanotechnology while evaluating their broader ethical impacts on society. Key opportunities are outlined in media, manufacturing, and medicine, along with risks like algorithmic bias and privacy erosion that raise complex challenges. Realizing the benefits of AI and nanotech requires thoughtful, responsible development and governance guided by core ethical principles like transparency, accountability, and human dignity over efficiency alone. Cooperation among diverse government, industry, academia, and civil society stakeholders is vital to uphold these values. Adaptive policies and voluntary ethics codes should complement each other as regulatory tools. With inclusive dialogue and foresight anchoring innovation in wisdom, emerging technologies like AI and nanotechnology can empower humanity to build a more just and prosperous world.",
        "DOI": "10.4018/9798369303689.ch011",
        "paper_author": "Gutierrez R.",
        "affiliation_name": "University of Southern California",
        "affiliation_city": "Los Angeles",
        "affiliation_country": "United States",
        "affiliation_id": "60029311",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Unifying linguistic landscapes: The potential of AI and nanotechnology in facilitating real-time translation",
        "publication": "Artificial Intelligence in the Age of Nanotechnology",
        "citied_by": "1",
        "cover_date": "2023-12-07",
        "Abstract": "This chapter examines how recent artificial intelligence and nanotechnology innovations could help overcome persistent global language barriers that hamper communication. It explores the progression of machine translation capabilities leveraging neural networks to achieve near-human-level accuracy. The chapter also considers how nanotechnology may enable real-time translation through augmented reality and wearable devices. However, these technologies also pose challenges regarding potential misuse, biases, and unintended cultural impacts. Therefore, responsible advancement of these technologies is imperative, ensuring they are deployed equitably to benefit all of society. This chapter aims to provide a comprehensive overview of the associated technologies and their integrated applications while also discussing prudent research directions and policies needed to steer these fields toward the greater good. Overall, it strikes a balance between enthusiasm for the future capabilities of AI and nanotech in translation and a cautious approach to their development.",
        "DOI": "10.4018/9798369303689.ch005",
        "paper_author": "Gutierrez R.",
        "affiliation_name": "University of Southern California",
        "affiliation_city": "Los Angeles",
        "affiliation_country": "United States",
        "affiliation_id": "60029311",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Revisiting the debate: documenting biodiversity in the age of digital and artificially generated images",
        "publication": "Web Ecology",
        "citied_by": "2",
        "cover_date": "2023-12-07",
        "Abstract": "This study examines the risks associated with relying solely on images for documenting new species records, rediscoveries, taxonomic descriptions, and distribution expansions. We highlight concerns regarding image authenticity, especially in cases where images may be altered, adulterated, or AI (artificial intelligence)generated, potentially leading to inaccuracies in biodiversity documentation. To illustrate the evolving challenges, we conducted an experiment with 621 participants who assessed nine AI-generated images. Surprisingly, six were deemed authentic, while three raised doubts, highlighting the difficulty in discerning AI-generated content. Our main message emphasizes the critical role of trust in biodiversity documentation, particularly for taxonomy and conservation, and how eroded trust can hinder conservation efforts. Improved communication and collaboration between taxonomists and conservationists are needed, emphasizing scientific integrity. We urge a reevaluation of journal policies concerning data validation, especially in articles relying on images as primary evidence, to preserve the credibility of scientific research amidst technological advancements.",
        "DOI": "10.5194/we-23-135-2023",
        "paper_author": "Campos D.S.",
        "affiliation_name": "Universidade Federal do Maranhão",
        "affiliation_city": "Sao Luis",
        "affiliation_country": "Brazil",
        "affiliation_id": "60015786",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "ARCHERY: a prospective observational study of artificial intelligence-based radiotherapy treatment planning for cervical, head and neck and prostate cancer - study protocol",
        "publication": "BMJ Open",
        "citied_by": "8",
        "cover_date": "2023-12-07",
        "Abstract": "Introduction Fifty per cent of patients with cancer require radiotherapy during their disease course, however, only 10%-40% of patients in low-income and middle-income countries (LMICs) have access to it. A shortfall in specialised workforce has been identified as the most significant barrier to expanding radiotherapy capacity. Artificial intelligence (AI)-based software has been developed to automate both the delineation of anatomical target structures and the definition of the position, size and shape of the radiation beams. Proposed advantages include improved treatment accuracy, as well as a reduction in the time (from weeks to minutes) and human resources needed to deliver radiotherapy. Methods ARCHERY is a non-randomised prospective study to evaluate the quality and economic impact of AI-based automated radiotherapy treatment planning for cervical, head and neck, and prostate cancers, which are endemic in LMICs, and for which radiotherapy is the primary curative treatment modality. The sample size of 990 patients (330 for each cancer type) has been calculated based on an estimated 95% treatment plan acceptability rate. Time and cost savings will be analysed as secondary outcome measures using the time-driven activity-based costing model. The 48-month study will take place in six public sector cancer hospitals in India (n=2), Jordan (n=1), Malaysia (n=1) and South Africa (n=2) to support implementation of the software in LMICs. Ethics and dissemination The study has received ethical approval from University College London (UCL) and each of the six study sites. If the study objectives are met, the AI-based software will be offered as a not-for-profit web service to public sector state hospitals in LMICs to support expansion of high quality radiotherapy capacity, improving access to and affordability of this key modality of cancer cure and control. Public and policy engagement plans will involve patients as key partners.",
        "DOI": "10.1136/bmjopen-2023-077253",
        "paper_author": "Aggarwal A.",
        "affiliation_name": "University College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60022148",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The challenges of industry self-regulation of AI in emerging economies: Implications of the case of Russia for public policy and institutional development",
        "publication": "Elgar Companion to Regulating AI and Big Data in Emerging Economies",
        "citied_by": "0",
        "cover_date": "2023-12-05",
        "Abstract": "NA",
        "DOI": "10.4337/9781785362408.00011",
        "paper_author": "Papyshev G.",
        "affiliation_name": "Hong Kong University of Science and Technology",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008592",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Navigating the Terrain: Current challenges and solutions in integrating generative AI into education",
        "publication": "Generative AI in Teaching and Learning",
        "citied_by": "0",
        "cover_date": "2023-12-05",
        "Abstract": "The chapter provides an extensive exploration of Generative AI in education. It investigates the evolution and significance of AI in educational settings while delving into contemporary issues such as ethics, privacy, fairness, and pedagogy. Furthermore, it examines the impact on traditional teaching methods, personalization, and accessibility, addressing educational disparities. The chapter also outlines the best practices and lessons learned from case studies and successful institutions, pointing toward future directions, including emerging technologies like GPT-4 and augmented reality. It emphasizes advancing ethical guidelines, enhancing teacher-student collaboration with AI, proposing policy recommendations, and establishing legal frameworks for student data protection, along with government initiatives and funding in the realm of AI in education.",
        "DOI": "10.4018/979-8-3693-0074-9.ch011",
        "paper_author": "Suresh Babu C.V.",
        "affiliation_name": "Hindustan Institute of Technology and Science",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60107090",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Generative AI in teaching and learning",
        "publication": "Generative AI in Teaching and Learning",
        "citied_by": "3",
        "cover_date": "2023-12-05",
        "Abstract": "Generative AI in Teaching and Learning delves into the revolutionary field of generative artificial intelligence and its impact on education. This comprehensive guide explores the multifaceted applications of generative AI in both formal and informal learning environments, shedding light on the ethical considerations and immense opportunities that arise from its implementation. From the early approaches of utilizing generative AI in teaching to its integration into various facets of learning, this book offers a profound analysis of its potential. Teachers, researchers, instructional designers, developers, data analysts, programmers, and learners alike will find valuable insights into harnessing the power of generative AI for educational purposes. The book covers a wide range of topics, including generative AI applications in artwork, coding, writing, research, collaboration, and more. It examines the implications of public generative AI interfaces and explores how generative AI can be effectively utilized in formal education settings, such as accredited institutions. The roles of teachers, content creation, instructional design, research, community service, sports, policies, assignments, grading, student work, and programming are all examined in relation to generative AI. Furthermore, the book explores the use of generative AI in nonformal and informal teaching and learning, emphasizing the opportunities for self-learning, group learning, and social change that arise from its implementation. It also delves into the professional ethics surrounding the application of generative AI in education. While examining the potential benefits of generative AI, the book also addresses the risks associated with demotivation for skill acquisition, deskilling, and downskilling. It highlights the opportunities for upskilling and encourages educators and learners to engage in learning practices that leverage the power of generative AI.",
        "DOI": "10.4018/979-8-3693-0074-9",
        "paper_author": "Hai-Jew S.",
        "affiliation_name": "Hutchinson Community College",
        "affiliation_city": "Hutchinson",
        "affiliation_country": "United States",
        "affiliation_id": "100793308",
        "affiliation_state": "KS"
    },
    {
        "paper_title": "Underwater Wireless Sensor Network Risk Analysis, Security, and Mitigation Policies",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2023-12-05",
        "Abstract": "Underwater-Wireless-Sensor-Networks have received increasing consideration from scientists and industry entities as a result of technological advancements. The wireless routing of the information under the ocean or generally underwater has made the best technical ways of oceanic observations possible. Underwater sensor networks that were strategically positioned have been the main enabler of oceanographic observations. By establishing connectivity between sensors that are monitored without extensive wiring, underwater sensor networks can also be created wirelessly. Due to the vulnerability of the UWSNs ecosystem to various security assaults, security is a crucial component. The hostile underwater environment, its own characteristics, and the open auditory channel make it susceptible to threats and malevolent attacks. These features make it simple for attackers to intercept data between the source and the destination. Reliable connectivity is crucial for defending the UWSN against malicious attacks. The security analysis, difficulties, suggestions, and AI-based solutions for carrying out various tasks in maritime environments are covered in this article.",
        "DOI": "10.1063/5.0177492",
        "paper_author": "Jocil D.",
        "affiliation_name": "Bharathiar University",
        "affiliation_city": "Coimbatore",
        "affiliation_country": "India",
        "affiliation_id": "60013041",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Responsible ACI: Expanding the Influence of Animal-Computer Interaction",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-04",
        "Abstract": "With emerging technologies powered by AI and IoT affecting animals in unprecedented ways, a question for the ACI community is how to expand the field's influence so that the computing interactions to which animals are exposed do not harm but benefit them. This position paper proposes that more ACI work could: focus on the risks that technology poses for animals and the impacts of technology that does not necessarily target them, as well as on the benefits of technologies that target them; re-frame human-centric ethical frameworks produced by governance bodies from a multispecies perspective against which to foreground impacts of technologies on animals; explicitly relate ACI work to global societal priorities set by governance bodies against which to highlight how an animal-centred perspective can support those. The paper encourages researchers to take responsibility for the challenge of giving animals representation amongst anthropocentric pressures and, despite necessary compromises, to continue to push for animal-centred technological innovation. CCS CONCEPTS •Social and Professional Topics •Computing / Technology Policy •Government Technology Policy.",
        "DOI": "10.1145/3637882.3637895",
        "paper_author": "Mancini C.",
        "affiliation_name": "The Open University",
        "affiliation_city": "Milton Keynes",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60012113",
        "affiliation_state": "Buckinghamshire"
    },
    {
        "paper_title": "(R)evolutions of Thought: Artificial Intelligence and Education Futures",
        "publication": "Teachers College Record",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "As part of the 125th issue of Teachers College Record, this commentary provides an overview of technological innovation with a focus on the emergence of machine learning and artificial intelligence (AI). The presence and use of AI is a pressing contemporary topic in education, raising questions about the information and perspective(s) AI might privilege, as well as the evolving ethical concerns related to the blurred and increasingly indistinguishable boundaries of human and nonhuman entities and practices.",
        "DOI": "10.1177/01614681241230173",
        "paper_author": "Abrams S.S.",
        "affiliation_name": "University of South Africa",
        "affiliation_city": "Pretoria",
        "affiliation_country": "South Africa",
        "affiliation_id": "60002397",
        "affiliation_state": "Gauteng"
    },
    {
        "paper_title": "ESSE 2023 - Proceedings of the 4th European Symposium on Software Engineering",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "The proceedings contain 14 papers. The topics discussed include: difficulties in object-oriented design and its relationship with abstraction: a systematic review of literature; a practical failure prediction model based on code smells and software development metrics; a question answering software for assessing AI policies of OECD countries; transforming tourism experience: AI-based smart travel platform; towards a globally distributed testing network in the automotive industry; imposing cache: busy-aware cooperative data caching in edge-cloud environments; using quantum Monte Carlo simulation to price complicated derivatives in the big data environment; study on the complexity and multidimensional proximity of knowledge and technology cooperation networks among higher educational institutions within the Yangtze River Delta; and efficient pneumonia detection in chest x-ray images: leveraging lightweight transfer learning for improved accuracy and practicality.",
        "DOI": "NA",
        "paper_author": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Question Answering Software for Assessing AI Policies of OECD Countries",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "It is widely accepted that the current advancements in the fields of Natural Language Processing (NLP) and Artificial Intelligence (AI) in general, have provided the necessary means for the implementation of systems that were not possible in the past. Given the fact that there is now a vast volume of available text data, a tremendous amount of heterogenous language models have already been trained based on those data, in order to complete different tasks. The complexity of those tasks, in both the demands for computational resources and the efficiency of the corresponding approach, increases exponentially, mostly based on the volume and the complexity of the available data. A typical example of such a task is Question Answering (QA), where the data that are selected as a knowledge base for providing answers directly affect the efficiency, accuracy and the computational cost of the whole approach. As a result, when developing a QA tool, it is crucial to take into consideration a number of factors throughout the whole QA pipeline, in order to ensure that the given approach provides the right answers in the most efficient way possible. To this end, this paper proposes an efficient QA pipeline consisting of several steps, which range from the retrieval and preprocessing of the data to the selection of the appropriate language model, for assessing large documents that contain AI policies of OECD countries.",
        "DOI": "10.1145/3651640.3651651",
        "paper_author": "Mavrogiorgos K.",
        "affiliation_name": "University of Piraeus",
        "affiliation_city": "Piraeus",
        "affiliation_country": "Greece",
        "affiliation_id": "60010667",
        "affiliation_state": "Attica"
    },
    {
        "paper_title": "A Study on the Comparison of Global Policies for Trustworthy AI and the Application Method in Korea",
        "publication": "Journal of Korean Institute of Communications and Information Sciences",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "The rapid advancement of AI has accelerated societal innovation. Along with the positive impacts of AI, concerns about its societal dysfunctions are growing. The bias inherent in AI algorithms has the potential to exacerbate social inequalities. Moreover, deep learning technologies using massive data raise concerns about privacy. As AI technologies are applied across society, the ambiguity regarding legal responsibility, diminishes public trust in the technology. To address these issues, nations worldwide are proactively establishing unique governmental policies to ensure the reliability of AI technology. Consequently, comparing and analyzing the features and evolving aspects of AI policies and the EU will provide valuable insights for formulating suitable domestic policies. In this paper, we have analyzed various policies implemented by major countries to ensure the trustworthy AI, drawing out commonalities and differences. Based on this, we propose policy recommendations grounded in trustworthiness. to maximize the positive impact of AI technology and minimize its adverse effects.",
        "DOI": "10.7840/kics.2023.48.12.1652",
        "paper_author": "Kim J.",
        "affiliation_name": "Soongsil University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60014156",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "AI – bedazzled by its allure, blinded to its risks",
        "publication": "Network Security",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "You can't escape generative AI. It is being applied to so many parts of our lives and is the source of much excitement and speculation. But how many organisations fully understand its ramifications? It seems that few have properly delineated policies and standards for its application, and this could lead to serious problems.",
        "DOI": "10.12968/S1353-4858(23)70060-3",
        "paper_author": "Datoo A.",
        "affiliation_name": "D2 Legal Technologies (D2LT)",
        "affiliation_city": null,
        "affiliation_country": "United Kingdom",
        "affiliation_id": "131200563",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The Brazilian (Non)perspective on national strategy for artificial intelligence",
        "publication": "Discover Artificial Intelligence",
        "citied_by": "5",
        "cover_date": "2023-12-01",
        "Abstract": "This article examines the design dynamics and process of the Brazilian National Strategy for Artificial Intelligence (EBIA). We argue that Brazil has a long history of policies for digital development, covering a range of policies that encourage research and development and deploy AI-based digital technologies in industry and governments. Specifically for the AI policy, we analyze how these policies are fragmented into different initiatives without an approach to integrating the instruments and their mixes. We analyze how and why the Brazilian National Strategy for Artificial Intelligence design fails to implement and create an integrated perspective of these policies. This perspective for AI policy in Brazil results in fragmentation and failures to involve actors in the formulation and implementation process. The article concludes that the Brazilian perspective for artificial intelligence, emerging with EBIA, reproduces a situation of path dependence without promoting significant policy changes for the development and application of this technology in society.",
        "DOI": "10.1007/s44163-023-00052-w",
        "paper_author": "Filgueiras F.",
        "affiliation_name": "Universidade Federal de Goiás",
        "affiliation_city": "Goiania",
        "affiliation_country": "Brazil",
        "affiliation_id": "60027136",
        "affiliation_state": "GO"
    },
    {
        "paper_title": "Delving into the Digital Twin Developments and Applications in the Construction Industry: A PRISMA Approach",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "17",
        "cover_date": "2023-12-01",
        "Abstract": "Construction 4.0 is witnessing exponential growth in digital twin (DT) technology developments and applications, revolutionizing the adoption of building information modelling (BIM) and other emerging technologies used throughout the built environment lifecycle. BIM provides technologies, procedures, and data schemas representing building components and systems. At the same time, the DT enhances this with real-time data for integrating cyber-physical systems, enabling live asset monitoring and better decision making. Despite being in the early stages of development, DT applications have rapidly progressed in the AEC sector, resulting in a diverse literature landscape due to the various technologies and parameters involved in fully developing the DT technology. The intricate complexities inherent in digital twin advancements have confused professionals and researchers. This confusion arises from the nuanced distinctions between the two technologies, i.e., BIM and DT, causing a convergence that hinders realizing their potential. To address this confusion and lead to a swift development of DT technology, this study provides a holistic review of the existing research focusing on the critical components responsible for developing the applications of DT technology in the construction industry. It highlights five crucial elements: technologies, maturity levels, data layers, enablers, and functionalities. Additionally, it identifies research gaps and proposes future avenues for streamlined DT developments and applications in the AEC sector. Future researchers and practitioners can target data integrity, integration and transmission, bi-directional interoperability, non-technical factors, and data security to achieve mature digital twin applications for AEC practices. This study highlights the growing significance of DTs in construction and provides a foundation for further advancements in this field to harness its potential to transform built environment practices. It also pinpoints the latest developments in AI, namely the large language model (LLM) and retrieval-augmented generation (RAG)’s implications for DT education, policies, and the construction industry’s practices.",
        "DOI": "10.3390/su152316436",
        "paper_author": "Afzal M.",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Use of ai for climate change : Modelling the barriers in energy sector by ism approach",
        "publication": "Water and Energy International",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "This study is of prominent importance in the present scenario where each country is pacing on its own AI speed and the debate is high on the Artificial Intelligence regulations. EU is looking for an AI Act as the UK stand is different. The UK’s AI Safety Summit has heightened this debate and set the stage rolling. Many think of establishing panels like the International Panel on Climate Change for international consensus on AI model assistance. In India, the 2021 Niti Ayog’s Responsible AI/AI for All report highlight seven principles for AI systems emphasizing accountability, transparency, security, equality, safety, inclusivity, and protection of human values. In Feb 2023 GoI acknowledged establishing three new centers of excellence in AI. Same year in April the Ministry of Electronics and Information Technology announced that GoI is not considering regulating the growth of AI in the country. The pre-training datasets are commonly used in climate change mitigation. The use of AI is popular and promising in climate change mitigation though it has its challenges. The major barriers to the use of climate change are data barriers-availability, accessibility, quality, standardization, and cost; people-related barriers- AI user awareness, climate AI application experts, AI developers and trainers; Institutional barriers- AI dedicated Institutions, AI training institutions; cost-related barriers- Infrastructure and hardware access with maintenance and upkeep, Institutional support and Funds Access the priority barriers are AI standards, regulations and policy. The barriers can be minimised by adaption interventions of social tipping through a human-in-the-loop approach.",
        "DOI": "NA",
        "paper_author": "Mohammed S.",
        "affiliation_name": "Dhofar University",
        "affiliation_city": "Salalah",
        "affiliation_country": "Oman",
        "affiliation_id": "60071776",
        "affiliation_state": "Dhofar"
    },
    {
        "paper_title": "Illegal contract as a general clause - European trends and new Hungarian judicial practice",
        "publication": "Juridical Tribune",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "The invalidity of a contract is a sanction of civil law. In a dispute, the purpose of the law, its effect and its application must be applied together to the contract in conflict with the law. The means of doing so are judicial interpretation and the application of the general clause. An illegal contract may cover several areas: contracts contrary to public policy, a rule of law, morality or fundamental principles. In such a complex legal environment, an important question is which rule is breached and which results in the invalidity of the contract. The relationship between civil law and other rules is of particular importance in the context of the use of AI, where there are a number of technical obligations for the contracting party or administrative rules governing the use of AI. In the digital environment, many sectoral rules impose prohibitions, many norms define specific requirements as well. The study examines the new paradigm of the Hungarian Civil Code of illegal contracts and focuses the judicial practice of the general clause of illegality.",
        "DOI": "10.24818/TBJ/2023/13/4.06",
        "paper_author": "Auer Á.",
        "affiliation_name": "Ludovika University of Public Service",
        "affiliation_city": "Budapest",
        "affiliation_country": "Hungary",
        "affiliation_id": "60120215",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Design-Based Research on the Development and Implementation of AI Courses from the Perspective of University-Enterprise Cooperation",
        "publication": "Frontiers of Education in China",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "In recent years, China has been issuing artificial intelligence (AI) education policies to promote the deep integration between AI and education. Setting AI courses at the basic education phase can cultivate students’ AI literacy and enhance the country’s science and technology competitiveness in the future. However, due to shortages of AI teachers and inadequate conditions for practice, the current AI courses in primary and secondary schools are not enough in effectiveness. In light of current problems, this study, based on the foundation of university-enterprise cooperation, integrates the “competition and education” mechanism into informal AI course design and practice. Using a design-based research paradigm, the study proposes the design framework from four dimensions: goals, themes and content, methods and steps, and evaluation, and then further refines the framework through two rounds of iterations, to provide a reference for the development and practice of AI courses.",
        "DOI": "10.3868/s110-008-023-0031-5",
        "paper_author": "Chiang F.",
        "affiliation_name": "Shanghai Jiao Tong University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025084",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "BIBLIOMETRIC ANALYSIS OF THE LEGAL ISSUES RELATING TO ARTIFICIAL INTELLIGENCE TECHNOLOGY IN TOURISM",
        "publication": "Journal of Engineering Science and Technology",
        "citied_by": "9",
        "cover_date": "2023-12-01",
        "Abstract": "This study aims to map topics and the future research agenda regarding legal issues in artificial intelligence (AI) technology in tourism. The research was conducted using bibliometric analysis of published articles on ScienceDirect between 1999 and 2023. Data collection used the keywords \"legal\", \"artificial intelligence\", and \"tourism\" and found 899 published articles. Network visualization analysis with VosViewer identified seven clusters of topic research. The keywords related to legal issues were policy, governance, security, privacy, and ethics. As a result of the overlay visualization analysis, we found that legal issues in the area of AI technology in tourism differed from the recent topics. The density visualization analysis indicated that more research is needed in the areas of governance, policy, and ethics. As a result of these discussions, future legal issues related to AI in tourism research were raised.",
        "DOI": "NA",
        "paper_author": "Roestamy M.",
        "affiliation_name": "Universitas Djuanda",
        "affiliation_city": "Bogor",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60112899",
        "affiliation_state": "West Java"
    },
    {
        "paper_title": "OPPORTUNITIES AND CHALLENGES OF USING ChatGPT IN THE ELT SCENARIO OF UTAS, NIZWA, OMAN",
        "publication": "Journal of Teaching English for Specific and Academic Purposes",
        "citied_by": "6",
        "cover_date": "2023-12-01",
        "Abstract": "This academic research explores the opportunities and challenges of using Chat Generative Pre-trained Transformer (ChatGPT) in the English Language Teaching (ELT) in a university in Oman. Recent researches have proven that ChatGPT provides various benefits and opportunities in education. Students can gain from different problem-solving scenarios provided by ChatGPT. Moreover, teachers will be freed from heavy marking-load allowing them to spend more time on lesson planning (Hong, 2023). The study aims to find out the possible prospects and challenges of employing ChatGPT in the teaching and learning of English, which naturally influence research and educational policy making as well. The study adopted qualitative methods for data collection and analysis, using literature review and semi-structured interviews. The findings show that the use of ChatGPT in ELT has been much more beneficial and promising, as evidenced by the limited research available. However, there are potential risks associated with over-reliance on ChatGPT and the need for appropriate training and guidance for teachers and students. The study suggests that further research is needed to explore the full potential of ChatGPT in ELT and to address the challenges associated with its.",
        "DOI": "10.22190/JTESAP230529046G",
        "paper_author": "Govindarajan R.",
        "affiliation_name": "University of Technology and Applied Sciences Nizwa",
        "affiliation_city": "Nizwa",
        "affiliation_country": "Oman",
        "affiliation_id": "60281129",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Research progress on the application of artificial intelligence in the screening and treatment of retinopathy of prematurity",
        "publication": "Chinese Journal of Ocular Fundus Diseases",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Retinopathy of prematurity (ROP) is a major cause of vision loss and blindness among premature infants. Timely screening, diagnosis, and intervention can effectively prevent the deterioration of ROP. However, there are several challenges in ROP diagnosis globally, including high subjectivity, low screening efficiency, regional disparities in screening coverage, and severe shortage of pediatric ophthalmologists. The application of artificial intelligence (AI) as an assistive tool for diagnosis or an automated method for ROP diagnosis can improve the efficiency and objectivity of ROP diagnosis, expand screening coverage, and enable automated screening and quantified diagnostic results. In the global environment that emphasizes the development and application of medical imaging AI, developing more accurate diagnostic networks, exploring more effective AI-assisted diagnosis methods, and enhancing the interpretability of AI-assisted diagnosis, can accelerate the improvement of AI policies of ROP and the implementation of AI products, promoting the development of ROP diagnosis and treatment.",
        "DOI": "10.3760/cma.j.cn511434-20230109-00013",
        "paper_author": "Wu D.",
        "affiliation_name": "University of Science and Technology of China",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60019118",
        "affiliation_state": "Anhui"
    },
    {
        "paper_title": "The need for strategic redirection and business model change: The impact of evolving influential forces of change on international entrepreneurship environment",
        "publication": "Journal of International Entrepreneurship",
        "citied_by": "4",
        "cover_date": "2023-12-01",
        "Abstract": "This article examines the rapidly changing environment of international entrepreneurship. The force behind the change is diverse comprising environmental, socio-economic, and technological, including the emergence of intelligent robotics, 3-D printing, the Internet of all things (IOTs), generative artificial intelligence (AI), and the rapid transformation the WWW to WWW.03, amongst other evolving forces, each with profound impact on the iSMEs embedding ecosystems and operating environment. Introduction briefly introduces a selective list of the influential forces and a range of their potential affects, while the “Further development and literature review” section further examines them within their respective contexts of the emerging crises, and their operational, strategic, and theoretical frameworks as the unfolding influential forces evolve with challenging impacts on the internationalized, or internationalizing, SMEs’ (iSMEs’) pool of capabilities and resources with direct effects on their global competitiveness, and growth at home and internationally. The “Discussion” section, in three parts, explores the combined effects of forces of change on the iSMEs’ top management team (TMT) to analyse their strategic posture, the potency of their firm’ resources, and dynamic capabilities, to take potent decisions for leading to potentially non-trivial organizational and strategic change, including fundamental business model innovation (BMI). “Conclusions, implication, and suggestions” further examines the adverse impacts of the recent crises in three parts, ranging from the 2008–2009 global financial crisis (GFC), COVID pandemic, and the unfolding challenges of the climatic change as discussed in the recent COP 28 meetings, and its suggestion for undertaking remedial actions at the corporate, social, and public policy levels. Combined, the necessary change my result in significant architectural and structural change in many common worldwide aspects without sparing anyone, anything, and any location.",
        "DOI": "10.1007/s10843-024-00348-7",
        "paper_author": "Etemad H.",
        "affiliation_name": "Université McGill",
        "affiliation_city": "Montreal",
        "affiliation_country": "Canada",
        "affiliation_id": "60002494",
        "affiliation_state": "QC"
    },
    {
        "paper_title": "Assessing the Potential of AI–ML in Urban Climate Change Adaptation and Sustainable Development",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "21",
        "cover_date": "2023-12-01",
        "Abstract": "This study addresses a notable gap in the climate change literature by examining the potential of artificial intelligence and machine learning (AI–ML) in urban climate change adaptation and sustainable development across major global continents. While much attention has been given to mitigation strategies, this study uniquely delves into the AI–ML’s underexplored role in catalyzing climate change adaptation in contemporary and future urban centers. The research thoroughly explores diverse case studies from Africa, Asia, Australasia, Europe, North America, and South America, utilizing a methodological framework involving six-step and five-step models for systematic literature reviews. The findings underscore AI–ML achievements, illuminate challenges, and emphasize the need for context-specific and collaborative approaches. The findings imply that a one-size-fits-all approach is insufficient. Instead, successful adaptation strategies must be intricately linked to the particular characteristics, vulnerabilities, and intricacies of each region. Furthermore, the research underscores the importance of international collaboration, knowledge sharing, and technology transfer to expedite the integration of AI–ML into climate adaptation strategies globally. The study envisions a promising trajectory for AI–ML in the climate adaptation domain, emphasizing the necessity for ongoing research, innovation, and practical AI–ML applications. As climate change remains a defining challenge, this research predicts an increasingly pivotal role for AI–ML in constructing climate-resilient urban centers and promoting sustainable development. Continuous efforts to advance AI–ML technologies, establish robust policy frameworks, and ensure universal access are crucial for harnessing AI–ML’s transformative capabilities to combat climate change consequences.",
        "DOI": "10.3390/su152316461",
        "paper_author": "Srivastava A.",
        "affiliation_name": "Indian Institute of Technology Kharagpur",
        "affiliation_city": "Kharagpur",
        "affiliation_country": "India",
        "affiliation_id": "60004750",
        "affiliation_state": "WB"
    },
    {
        "paper_title": "Ethical and Privacy Concerns in Artificial Intelligence Dialogue Systems: Do Students in Higher Education Really Care About Them",
        "publication": "31st International Conference on Computers in Education, ICCE 2023 - Proceedings",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "This work-in-progress paper investigates on whether students in higher education really care about the ethical and privacy concerns in the use of artificial intelligence (AI) dialogue systems. Based on semi-structured interviews of 37 undergraduate students, this study uncovered a variety of viewpoints. The study found that despite their awareness of ethical and privacy concerns in the use of AI dialogue systems, the majority of students did not put much effort in addressing these issues. Around 75% of the students prioritized efficient and effective university assignment completion with the help of AI dialogue systems over these ethical and privacy concerns. The study also revealed that cultural differences influenced students’ attitudes towards ethical and privacy concerns. Specifically, students from high-context cultures, where a significant portion of communication relies on shared experiences, implicit cues, and non-verbal elements, showed less concern compared to those from low-context cultures, where their communication relies heavily on explicit messages, direct language, and precise information. This study recommends several strategies to address privacy and ethical concerns, including the development of comprehensive data management policies, the use of data anonymization and minimization techniques, and the enforcement of stringent security measures to prevent data breaches.",
        "DOI": "NA",
        "paper_author": "Zhai C.",
        "affiliation_name": "CQUniversity Australia",
        "affiliation_city": "Rockhampton",
        "affiliation_country": "Australia",
        "affiliation_id": "60031003",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "AIED in K-12 Classrooms: Challenges and Opportunities from an Ethics Lens",
        "publication": "31st International Conference on Computers in Education, ICCE 2023 - Proceedings",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "The recent growth of the AIED field has made available several new tools to facilitate personalized learning and teaching. However, this has also raised concerns over the ethical principles and inclusivity guidelines that should monitor the use of AI tools in the classroom, especially in K-12 settings. This paper looks at some primary use cases of AI in education and reviews the concerns and challenges raised by AIED researchers over applying AI in K-12 educational spaces. We then discuss the ethical guidelines suggested by global agencies, government organizations, and AIED scholars, to direct educational policies that can help integrate AI tools in K-12 classrooms in a more ethical and inclusive manner.",
        "DOI": "NA",
        "paper_author": "Munshi A.",
        "affiliation_name": "Edmentum Inc.",
        "affiliation_city": null,
        "affiliation_country": "United States",
        "affiliation_id": "130681539",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "China’s Economic Growth: The “Two-Dimensional Driving Effect” of Data Factors",
        "publication": "China Finance and Economic Review",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "Data factors have become one of the five essential production factors, but their role in economic growth has always been ambiguous. Starting from AI technologies, this paper establishes an endogenous growth model of data factors affecting economic growth, constructs the generation path and value path of data factors, and estimates the value of new data factors at the provincial level in China from 1999 to 2018 accordingly. Based on theoretical analyses and empirical tests, it clarifies that data factors have a “two-dimensional driving effect” on China’s economic growth, that is, data factors can drive growth both directly through its own economic growth effect and indirectly by promoting technological progress. Furthermore, this paper makes three extended discussions, aiming to make a trial study on the impacts of local government big data transaction platforms on data factors and their growth effects, discuss whether it is possible to reduce the uncertainties of local economic policy based on the nature of data factors, and make a preliminary survey of the output elasticity of data factors between 1999 and 2018.",
        "DOI": "10.1515/cfer-2023-0023",
        "paper_author": "Yang Y.",
        "affiliation_name": "Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60016521",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Does artificial intelligence (AI) reduce ecological footprint? The role of globalization",
        "publication": "Environmental science and pollution research international",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "This article explores the impact of artificial intelligence (AI) on global ecological footprints, which has important implications for global sustainability in the digital age. Using the comprehensive evaluation index of AI constructed by the entropy method and the dataset at the global national level, we find that from 2010 to 2019, the overall level of global AI shows an upward trend, in which the growth rate of AI in developed countries is more pronounced and exhibits a stable growth trend, while the growth rate of AI in developing countries displays a trend of instability. The research results show that AI has a significant inhibitory effect on ecological footprints. This conclusion holds even after endogeneity and robustness tests. In addition, under the effect of globalization, the impact of AI on ecological footprints shows nonlinear characteristics. As globalization deepens, the marginal effect of AI in reducing the ecological footprint shows an increasing trend. These findings emphasize the important role of AI in environmental governance and provide a new and comprehensive perspective for policymakers. Therefore, the government should continue to support the research and application of AI, promote the cross-industry integration of AI, and play a positive role in the process of globalization to promote global sustainable development.",
        "DOI": "10.1007/s11356-023-31076-5",
        "paper_author": "Wang Q.",
        "affiliation_name": "China University of Petroleum (East China)",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60105111",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Digital higher education in Bangladesh: Challenges and prospects",
        "publication": "Accessibility of Digital Higher Education in the Global South",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "In the last two decades, the higher education sector of Bangladesh has expanded considerably through the establishment of hundreds of public and private universities, along with thousands of colleges with higher education provisions. This expansion aims to make higher education accessible, to generate new knowledge and to cultivate skilled human resources for the country's economic development. At the same time, Bangladesh has observed notable progress in digital infrastructure and digitalising its services, including education. This chapter explores the digitalisation of higher education in Bangladesh, portraying its benefits, challenges, and potentials. It also highlights how government policies, regulations, and the 'Digital Bangladesh' agenda have generated opportunities and challenges for higher educational institutions. Furthermore, it explores how the country is progressing towards fulfilling the political promise of providing 'smart education' opportunities for its citizens through the 'Smart Bangladesh' agenda. This chapter also sheds some light on employability in relation to the government's new 'National Skills Development Policy 2023', considering the emerging digital higher education in the era of global digital transformation and the increasing intervention of artificial intelligence (AI) in every sphere of life. Finally, this chapter concludes by explaining the key issues, challenges and recommendations for the digitalisation of higher education in the context of Bangladesh.",
        "DOI": "10.4018/978-1-6684-9179-9.ch007",
        "paper_author": "Shohel M.M.C.",
        "affiliation_name": "University of Roehampton",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026761",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Going green with artificial intelligence: The path of technological change towards the renewable energy transition",
        "publication": "Oeconomia Copernicana",
        "citied_by": "40",
        "cover_date": "2023-12-01",
        "Abstract": "Research background:The twin pressures of economic downturn and climate change faced by countries around the world have become more pronounced over the past decade. A renewable energy transition is believed to play a central role in mitigating the economic-climate paradox. While the architectural and computational power of artificial intelligence is particu larly well suited to address the challenges of massive data processing and demand forecasting during a renewable energy transition, there is very scant empirical assessment that takes a social science perspective and explores the effects of AI development on the energy transition. Purpose of the article: This paper aims to answer two key questions: One is, how does AI software development promote or inhibit the shift of energy consumption towards renewables? The other is, under what policy interventions does AI software development have a more positive effect on promoting renewable energy consumption? Methods: We employ a dataset of 62 economies covering the period 2011–2020 to analyze the impact of AI software development on the energy transition, where possible confounders, including political and economic characteristics and time-invariant elements, are controlled using fixed-effects estimation along with specified covariates. Findings & value added: AI software development can promote the energy transition towards renewables. There is suggestive evidence that the core mechanism linking such a positive relationship tends to lie in improving innovation performance in environmental monitoring rather than in green computing. Government support for R&D in renewable energy technologies is found to be significantly beneficial for harnessing the positive impact of AI software development on the energy transition. Compared to non-market-based environmental policies, market-based environmental policies have a more significant positive moderating effect on the relationship between AI software development and energy transition.",
        "DOI": "10.24136/oc.2023.032",
        "paper_author": "Yin H.T.",
        "affiliation_name": "Xi'an Jiaotong University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60018308",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "AI-Driven Urban Energy Solutions—From Individuals to Society: A Review",
        "publication": "Energies",
        "citied_by": "23",
        "cover_date": "2023-12-01",
        "Abstract": "This paper provides a comprehensive review of solutions based on artificial intelligence (AI) in the urban energy sector, with a focus on their applications and impacts. The study employed a literature review methodology to analyze recent research on AI’s role in energy-related solutions, covering the years 2019 to 2023. The authors classified publications according to their main focus, resulting in two key areas of AI implementation: residential and individual user applications, and urban infrastructure integration for society. The objectives of this review of the literature are the following: O1: to identify trends, emerging technologies, and applications using AI in the energy field; O2: to provide up-to-date insights into the use of AI in energy-related applications; O3: to gain a comprehensive understanding of the current state of AI-driven urban energy solutions; O4: to explore future directions, emerging trends, and challenges in the field of AI-driven energy solutions. This paper contributes to a deeper understanding of the transformative potential of AI in urban energy management, providing valuable insights and directions for researchers and practitioners in the field. Based on the results, it can be claimed that AI connected to energy at homes is used in the following areas: heating and cooling, lighting, windows and blinds, home devices, and energy management systems. AI is integrating into urban infrastructure through the following solutions: enhancement of electric vehicle charging infrastructure, reduction in vehicle emissions, development of smart grids, and efficient energy storage. What is more, the latest challenges associated with the implementation of AI-driven energy solutions include the need to balance resident comfort with energy efficiency in smart homes, ensuring compatibility and cooperation among various devices, preventing unintended energy consumption increases due to constant connectivity, the management of renewable energy sources, and the coordination of energy consumption.",
        "DOI": "10.3390/en16247988",
        "paper_author": "Stecuła K.",
        "affiliation_name": "Silesian University of Technology",
        "affiliation_city": "Gliwice",
        "affiliation_country": "Poland",
        "affiliation_id": "60009081",
        "affiliation_state": "Silesian"
    },
    {
        "paper_title": "Enabling Technologies for Next-Generation Smart Cities: A Comprehensive Review and Research Directions",
        "publication": "Future Internet",
        "citied_by": "15",
        "cover_date": "2023-12-01",
        "Abstract": "The concept of smart cities, which aim to enhance the quality of urban life through innovative technologies and policies, has gained significant momentum in recent years. As we approach the era of next-generation smart cities, it becomes crucial to explore the key enabling technologies that will shape their development. This work reviews the leading technologies driving the future of smart cities. The work begins by introducing the main requirements of different smart city applications; then, the enabling technologies are presented. This work highlights the transformative potential of the Internet of things (IoT) to facilitate data collection and analysis to improve urban infrastructure and services. As a complementary technology, distributed edge computing brings computational power closer to devices, reducing the reliance on centralized data centers. Another key technology is virtualization, which optimizes resource utilization, enabling multiple virtual environments to run efficiently on shared hardware. Software-defined networking (SDN) emerges as a pivotal technology that brings flexibility and scalability to smart city networks, allowing for dynamic network management and resource allocation. Artificial intelligence (AI) is another approach for managing smart cities by enabling predictive analytics, automation, and smart decision making based on vast amounts of data. Lastly, the blockchain is introduced as a promising approach for smart cities to achieve the required security. The review concludes by identifying potential research directions to address the challenges and complexities brought about by integrating these key enabling technologies.",
        "DOI": "10.3390/fi15120398",
        "paper_author": "Ali S.A.",
        "affiliation_name": "Faculty of Engineering",
        "affiliation_city": "Zagazig",
        "affiliation_country": "Egypt",
        "affiliation_id": "60274154",
        "affiliation_state": "Sharqia"
    },
    {
        "paper_title": "Inclusive and Safe Mobility Needs of Senior Citizens: Implications for Age-Friendly Cities and Communities",
        "publication": "Urban Science",
        "citied_by": "8",
        "cover_date": "2023-12-01",
        "Abstract": "Municipalities are concerned with addressing social issues such as mobility inclusion and safety by increasing access to transport facilities and services for all groups in society to create equitable and equal access for all citizens. Moreover, the public transportation systems provided in cities have to be inclusive and safe, driven by emerging technologies such as Artificial Intelligence (AI)-based services that provide personalized recommendation to improve mobility inclusion and safety for all citizens in society, especially vulnerable road users such as senior citizens or older people. But at the moment, there are few studies that have investigated how municipalities can provide inclusive and safe public transportation in general and for senior citizens, particularly those aged 65 and above. Therefore, this study aimed to examine how to provide inclusive and safe mobility for senior citizens to improve out-of-home mobility services for senior citizens towards age-friendly cities and communities. Accordingly, a systematic literature review grounded on secondary data was adopted to investigate inclusive and safe mobility needs for senior citizens. The data were collected from previous research and existing documents, and a descriptive data analysis was carried out to provide insights on urban transportation policies related to senior citizens. Furthermore, case studies were adopted to present polices and strategies employed in Norway, Canada, the United States of America, the United Kingdom, Sweden, and Northern Ireland to identify measures employed to address the public transportation needs of an aging society, focusing on the provision of inclusive and safe mobility to senior citizens. Further findings from this study included the possible use of emerging technologies such as AI-based machine learning for inclusive and safe mobility.",
        "DOI": "10.3390/urbansci7040103",
        "paper_author": "Bokolo A.J.",
        "affiliation_name": "Institutt for energiteknikk",
        "affiliation_city": "Skedsmokorset",
        "affiliation_country": "Norway",
        "affiliation_id": "60010248",
        "affiliation_state": "Akershus"
    },
    {
        "paper_title": "UNDERSTANDING THE CONSUMER DYNAMICS OF AI IN NORTH MACEDONIAN E-BUSINESS",
        "publication": "Economics and Culture",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "Research Purpose: This study investigates the dynamics of Artificial Intelligence (AI) in e-business, particularly from the perspective of consumers in North Macedonia. The research aims to identify and evaluate the benefits and challenges of AI integration in e-business, explore the ethical concerns related to AI decision-making, and understand the impact of AI on consumer behaviour and preferences. Design/Methodology/Approach: The research adopts a mixed-methods approach, integrating qualitative and quantitative analyses. Primary data was collected via a structured questionnaire distributed among various demographic groups to gauge the level of awareness and experiences with AI in e-business. A range of statistical tests, including ANOVA and correlation tests, were employed to assess the significance of the data collected and to test a set of hypotheses concerning consumer perceptions and experiences of AI. Findings: The results reveal that demographic factors such as age, status, education, and occupation do not significantly impact the level of understanding, awareness, or experiences with AI among Macedonian consumers. Participants exhibited a level of high awareness of the importance of AI in e-business and rated their shopping experiences with AI more positively than traditional methods. Trust and reliability in AI did not significantly differ across demographic lines. The findings of this study have significant policy implications, especially in guiding the ethical and responsible integration of AI in e-business. They suggest a need for policies emphasising consumer data protection and privacy, given the heightened awareness and concern among consumers regarding using their personal information. Furthermore, the results advocate for the development of regulatory frameworks that ensure transparency and fairness in AI algorithms, addressing potential biases that could negatively impact consumer trust. Originality/Value/Practical Implications: This research contributes novel insights into the Macedonian consumer market’s perception of AI in e-business, a topic scarcely covered in existing literature. The findings underscore the necessity for businesses to adopt AI responsibly and ethically, highlighting the importance of prioritising fairness, privacy, and transparency to leverage AI’s full potential in e-business. This study stands out in its exploration of AI in e-business from the consumer perspective in North Macedonia, a context not extensively covered in existing literature. The originality of our research lies in its focus on a comprehensive range of consumer-centric factors, including awareness, experiences, ethical concerns, and behaviour related to AI in e-business.",
        "DOI": "10.2478/jec-2023-0016",
        "paper_author": "Josimovski S.",
        "affiliation_name": "Ss. Cyril and Methodius University in Skopje",
        "affiliation_city": "Skopje",
        "affiliation_country": "North Macedonia",
        "affiliation_id": "60072629",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Tech Giants’ Responsible Innovation and Technology Strategy: An International Policy Review",
        "publication": "Smart Cities",
        "citied_by": "9",
        "cover_date": "2023-12-01",
        "Abstract": "As digital technology continues to evolve rapidly and get integrated into various aspects of our cities and societies, the alignment of technological advancements with societal values becomes paramount. The evolving socio-technical landscape has prompted an increased focus on responsible innovation and technology (RIT) among technology companies, driven by mounting public scrutiny, regulatory pressure, and concerns about reputation and long-term sustainability. This study contributes to the ongoing discourse on responsible practices by conducting a policy review that delves into insights from the most influential high-tech companies’—so-called tech giants’—RIT guidance. The findings disclose that (a) leading high-tech companies have started to focus on RIT; (b) the main RIT policy focus of the leading high-tech companies is artificial intelligence; (c) trustworthiness and acceptability of technology are the most common policy areas; (d) affordability related to technology outcomes and adoption is almost absent from the policy; and (e) sustainability considerations are rarely part of the RIT policy, but are included in annual corporate reporting. Additionally, this paper proposes a RIT assessment framework that integrates views from the policy community, academia, and the industry and can be used for evaluating how well high-tech companies adhere to RIT practices. The knowledge assembled in this study is instrumental in advancing RIT practices, ultimately contributing to technology-driven cities and societies that prioritise human and social well-being.",
        "DOI": "10.3390/smartcities6060153",
        "paper_author": "Li W.",
        "affiliation_name": "Queensland University of Technology",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60011019",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Presumptions of Law Concerning Causality in Environmental Cases: Towards Collective Presumptions of Fact?",
        "publication": "Journal of European Tort Law",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Presumptions of law are an appealing concept to remedy situations of causal uncertainty. In many pieces of EU legislation in various areas such as competition law, AI law and environmental law, presumptions are presented as a solution for plaintiffs that encounter problems regarding causal uncertainty in their compensation claims. Oftentimes, however, insufficient attention is paid to the possible risks of over- and under-compensation, the available alternatives and the functionality of these presumptions. In this article, I argue that a presumption of law fulfils two functions. First, this paper aims to address situations of evidentiary deficiency (individual goal). Second, it aims to facilitate the procedural road to compensation in cases of mass harm (collective goal). A comparative analysis of Belgian, Dutch and French law reveals that there are many ways to shape a presumption and its consequences. In conclusion, I argue that presumptions should always be tailored to a certain case and should attempt to reconcile the collective goal with the individual goal. To that end, policy-makers should aim to create collective presumptions of fact, based on the statistical evidence in a certain mass harm case, as opposed to presumptions of law.",
        "DOI": "10.1515/jetl-2023-0015",
        "paper_author": "Van Eekert S.",
        "affiliation_name": "Universiteit Utrecht",
        "affiliation_city": "Utrecht",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60007989",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Off-policy correction algorithm for double Q network based on deep reinforcement learning",
        "publication": "IET Cyber-systems and Robotics",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "A deep reinforcement learning (DRL) method based on the deep deterministic policy gradient (DDPG) algorithm is proposed to address the problems of a mismatch between the needed training samples and the actual training samples during the training of intelligence, the overestimation and underestimation of the existence of Q-values, and the insufficient dynamism of the intelligence policy exploration. This method introduces the Actor-Critic Off-Policy Correction (AC-Off-POC) reinforcement learning framework and an improved double Q-value learning method, which enables the value function network in the target task to provide a more accurate evaluation of the policy network and converge to the optimal policy more quickly and stably to obtain higher value returns. The method is applied to multiple MuJoCo tasks on the Open AI Gym simulation platform. The experimental results show that it is better than the DDPG algorithm based solely on the different policy correction framework (AC-Off-POC) and the conventional DRL algorithm. The value of returns and stability of the double-Q-network off-policy correction algorithm for the deep deterministic policy gradient (DCAOP-DDPG) proposed by the authors are significantly higher than those of other DRL algorithms.",
        "DOI": "10.1049/csy2.12102",
        "paper_author": "Zhang Q.",
        "affiliation_name": "Southwest University of Science and Technology",
        "affiliation_city": "Mianyang",
        "affiliation_country": "China",
        "affiliation_id": "60002980",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "The posthuman abstract: AI, DRONOLOGY &amp; “BECOMING ALIEN”",
        "publication": "AI and Society",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "This paper is addressed to recent theoretical discussions of the Anthropocene, in particular Bernard Stiegler’s Neganthropocene (Open Universities Press, 2018), which argues: “As we drift past tipping points that put future biota at risk, while a post-truth regime institutes the denial of ‘climate change’ (as fake news), and as Silicon Valley assistants snatch decision and memory, and as gene-editing and a financially-engineered bifurcation advances over the rising hum of extinction events and the innumerable toxins and conceptual opiates that Anthropocene Talk fascinated itself with—in short, as ‘the Anthropocene’ discloses itself as a dead-end trap…”. The objective of this paper is therefore twofold: (1) to discuss how the Anthropocene is appropriated to certain ideological discourses (paradoxically) to maintain the hegemony of precisely those systems of production that have most accelerated climate change etc.; (2) to consider how the factography of the Anthropocene is exploited in this process to mask the ideological character of industry-aligned “technocratic” environmental management. The paper is not concerned with specific case studies in terms of government and industry policy, or climate science, but rather with the ways in which the discourse of the Anthropocene has been inflected within the humanities and the broader cultural field—that is to say, ideologically, as a system or logic of meaning. How the Anthropocene “means” is, in this respect, a question of some importance. This paper does not attempt to address all the facets of this question, but focuses upon a central “apocalyptic” strain in the discourse of the Anthropocene drawn particularly from Francis Fukuyama’s millennial posthumanism and centred in the question of “sustainability” as catastrophe management—with the risk that real environmental degradation will become an alibi for a revived neoliberalism. In other words, that the critical Earth system transformations that characterise the Anthropocene are themselves commodities, and that the project of their amelioration is in process of defining a future (opportunistic) “crisis” rhetoric with a global political franchise. The ideological import of the Anthropocene stems precisely from the fact that it is planetary and, while catalysed by human agency, independent in its specific behaviour from it. The Anthropocene objectively presents as the contemporary counterpart of the Cold War doctrine of Mutually Assured Destruction and the most compelling argument for a new kind of technological “arms race.” But it also presents as the condition of an emerging ideological discourse which will determine how this race is run. From the discourse on “energy security” to the widespread “security crackdown” on environmental activists across the so-called developed & developing world, the Anthropocene has come to represent the co-option of a scientific factography for the thinly disguised resurgence of “ideological science” of the Fukuyamaesque variety (post-history, post-human). For Fukuyama, the true meaning of “posthuman” is thus the accomplishment of humanity’s historical mission. As the “End of History” designates an end of ideological struggle, so too the dénouement of the Anthropocene and the “ends of man” represent the accomplished purpose of species warfare: dominion, not simply over the world, but over all possible worlds. According to this narrative, science—like technology—must be uniquely at the service of the maintenance of the global order, organised around a universal appeal to “crisis management.” It is precisely for this reason that what calls itself post-human masks the return of an ever-more-apocalyptic Humanism.",
        "DOI": "10.1007/s00146-018-0869-x",
        "paper_author": "Armand L.",
        "affiliation_name": "Charles University",
        "affiliation_city": "Prague",
        "affiliation_country": "Czech Republic",
        "affiliation_id": "60016605",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "To govern or be governed: an integrated framework for AI governance in the public sector",
        "publication": "Science and Public Policy",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "There has been a significantly increased amount of literature on various aspects of artificial intelligence (AI), but research on AI governance has been a considerably underdeveloped area. This study proposes a comprehensive framework for designing AI governance in the public sector to overcome the limitations of previous studies that primarily dealt with the fragmentary aspect of AI. Also, we applied the developed framework to the case of Korea by combining it with the rank-order survey questions that target experts. This case study presents how to use the framework and provides insight for other countries.",
        "DOI": "10.1093/scipol/scad045",
        "paper_author": "Choi H.",
        "affiliation_name": "Aerospace R&amp;D Center",
        "affiliation_city": "Seongnam",
        "affiliation_country": "South Korea",
        "affiliation_id": "125118254",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Video surveillance and the right to privacy in the AI era: Proposed new rules",
        "publication": "Journal of Data Protection and Privacy",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Artificial intelligence is omnipresent in many areas of our lives. It may provide numerous services, involving the processing of undefined amounts of personal data and the insertion of algorithms. Therefore, its connection with privacy is very strong. A proposal for a Regulation on AI — the EU Artificial Intelligence Act (also known as the AI Act) is about to come into force in 2024. This paper aims to demonstrate the great impact of AI on the right to privacy when video-surveillance technology is being used. The introduction of AI tools lends a particular context to that practice. Thus, through a descriptive methodology, this paper attempts to demonstrate the nature, scope and aim of the draft AI Act. Then, the study puts special emphasis on the governance of video-surveillance systems, especially the governance of facial recognition, as it has been originally regulated under the AI Act. Additionally, following an intense study of national policies, a critical approach is pursued to the new rules on the issue, which have been proposed by MEPs. Achieving a human-centric dimension regarding AI is of primary interest. Consequently, this paper aims, finally, to offer original and fruitful suggestions for the regulation of video-surveillance systems in the new AI era.",
        "DOI": "10.69554/jhqv9916",
        "paper_author": "Kouroupis K.",
        "affiliation_name": "Frederick University",
        "affiliation_city": "Nicosia",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60104670",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Toward a Balanced Approach: Bridging the Military, Policy, and Technical Communities",
        "publication": "Ethics and International Affairs",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "The development of new technologies that enable autonomous weapon systems poses a challenge to policymakers and technologists trying to balance military requirements with international obligations and ethical norms. Some have called for new international agreements to restrict or ban lethal autonomous weapon systems. Given the tactical and strategic value of the technologies and the proliferation of threats, the military continues to explore the development of new autonomous technologies to execute national security missions. The rapid global diffusion and dualuse nature of autonomous systems necessitate a proactive approach and a shared understanding of the technical realities, threats, military relevance, and strategic implications of these technologies from these communities. Ultimately, developing AI-enabled defense systems that adhere to global norms and relevant treaty obligations, leverage emerging technologies, and provide operational advantages is possible. The development of a workable and realistic regulatory framework governing the use of lethal autonomous weapons and the artificial intelligence that underpins autonomy will be best supported through a coordinated effort of the regulatory community, technologists, and military to create requirements that reflect the global proliferation and rapidly evolving threat of autonomous weapon systems. This essay seeks to demonstrate that: (1) the lack of coherent dialogue between the technical and policy communities can create security, ethical, and legal dilemmas; and (2) bridging the military, technical, and policy communities can lead to technology with constraints that balance the needs of military, technical, and policy communities. It uses case studies to show why mechanisms are needed to enable early and continuous engagement across the technical, policymaking, and operational communities. The essay then uses twelve interviews with AI and autonomy experts, which provide insight into what the technical and policymaking communities consider fundamental to the progression of responsible autonomous development. It also recommends practical steps for connecting the relevant stakeholders. The goal is to provide the Department of Defense with concrete steps for building organizational structures or processes that create incentives for engagement across communities.",
        "DOI": "10.1017/S0892679423000321",
        "paper_author": "Seraphin A.",
        "affiliation_name": "Emerging Technologies Institute",
        "affiliation_city": null,
        "affiliation_country": "United States",
        "affiliation_id": "130584936",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "The application of artificial intelligence in health policy: a scoping review",
        "publication": "BMC Health Services Research",
        "citied_by": "11",
        "cover_date": "2023-12-01",
        "Abstract": "Background: Policymakers require precise and in-time information to make informed decisions in complex environments such as health systems. Artificial intelligence (AI) is a novel approach that makes collecting and analyzing data in complex systems more accessible. This study highlights recent research on AI’s application and capabilities in health policymaking. Methods: We searched PubMed, Scopus, and the Web of Science databases to find relevant studies from 2000 to 2023, using the keywords “artificial intelligence” and “policymaking.” We used Walt and Gilson’s policy triangle framework for charting the data. Results: The results revealed that using AI in health policy paved the way for novel analyses and innovative solutions for intelligent decision-making and data collection, potentially enhancing policymaking capacities, particularly in the evaluation phase. It can also be employed to create innovative agendas with fewer political constraints and greater rationality, resulting in evidence-based policies. By creating new platforms and toolkits, AI also offers the chance to make judgments based on solid facts. The majority of the proposed AI solutions for health policy aim to improve decision-making rather than replace experts. Conclusion: Numerous approaches exist for AI to influence the health policymaking process. Health systems can benefit from AI’s potential to foster the meaningful use of evidence-based policymaking.",
        "DOI": "10.1186/s12913-023-10462-2",
        "paper_author": "Ramezani M.",
        "affiliation_name": "School of Public Health",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60171626",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Revolutionizing Biological Science: The Synergy of Genomics in Health, Bioinformatics, Agriculture, and Artificial Intelligence",
        "publication": "OMICS A Journal of Integrative Biology",
        "citied_by": "10",
        "cover_date": "2023-12-01",
        "Abstract": "With climate emergency, COVID-19, and the rise of planetary health scholarship, the binary of human and ecosystem health has been deeply challenged. The interdependence of human and nonhuman animal health is increasingly acknowledged and paving the way for new frontiers in integrative biology. The convergence of genomics in health, bioinformatics, agriculture, and artificial intelligence (AI) has ushered in a new era of possibilities and applications. However, the sheer volume of genomic/multiomics big data generated also presents formidable sociotechnical challenges in extracting meaningful biological, planetary health and ecological insights. Over the past few years, AI-guided bioinformatics has emerged as a powerful tool for managing, analyzing, and interpreting complex biological datasets. The advances in AI, particularly in machine learning and deep learning, have been transforming the fields of genomics, planetary health, and agriculture. This article aims to unpack and explore the formidable range of possibilities and challenges that result from such transdisciplinary integration, and emphasizes its radically transformative potential for human and ecosystem health. The integration of these disciplines is also driving significant advancements in precision medicine and personalized health care. This presents an unprecedented opportunity to deepen our understanding of complex biological systems and advance the well-being of all life in planetary ecosystems. Notwithstanding in mind its sociotechnical, ethical, and critical policy challenges, the integration of genomics, multiomics, planetary health, and agriculture with AI-guided bioinformatics opens up vast opportunities for transnational collaborative efforts, data sharing, analysis, valorization, and interdisciplinary innovations in life sciences and integrative biology.",
        "DOI": "10.1089/omi.2023.0197",
        "paper_author": "Biswas A.",
        "affiliation_name": "Amity University Jharkhand",
        "affiliation_city": "Ranchi",
        "affiliation_country": "India",
        "affiliation_id": "60273561",
        "affiliation_state": "JH"
    },
    {
        "paper_title": "Brain versus bot: Distinguishing letters of recommendation authored by humans compared with artificial intelligence",
        "publication": "AEM Education and Training",
        "citied_by": "7",
        "cover_date": "2023-12-01",
        "Abstract": "Objectives: Letters of recommendation (LORs) are essential within academic medicine, affecting a number of important decisions regarding advancement, yet these letters take significant amounts of time and labor to prepare. The use of generative artificial intelligence (AI) tools, such as ChatGPT, are gaining popularity for a variety of academic writing tasks and offer an innovative solution to relieve the burden of letter writing. It is yet to be determined if ChatGPT could aid in crafting LORs, particularly in high-stakes contexts like faculty promotion. To determine the feasibility of this process and whether there is a significant difference between AI and human-authored letters, we conducted a study aimed at determining whether academic physicians can distinguish between the two. Methods: A quasi-experimental study was conducted using a single-blind design. Academic physicians with experience in reviewing LORs were presented with LORs for promotion to associate professor, written by either humans or AI. Participants reviewed LORs and identified the authorship. Statistical analysis was performed to determine accuracy in distinguishing between human and AI-authored LORs. Additionally, the perceived quality and persuasiveness of the LORs were compared based on suspected and actual authorship. Results: A total of 32 participants completed letter review. The mean accuracy of distinguishing between human- versus AI-authored LORs was 59.4%. The reviewer's certainty and time spent deliberating did not significantly impact accuracy. LORs suspected to be human-authored were rated more favorably in terms of quality and persuasiveness. A difference in gender-biased language was observed in our letters: human-authored letters contained significantly more female-associated words, while the majority of AI-authored letters tended to use more male-associated words. Conclusions: Participants were unable to reliably differentiate between human- and AI-authored LORs for promotion. AI may be able to generate LORs and relieve the burden of letter writing for academicians. New strategies, policies, and guidelines are needed to balance the benefits of AI while preserving integrity and fairness in academic promotion decisions.",
        "DOI": "10.1002/aet2.10924",
        "paper_author": "Preiksaitis C.",
        "affiliation_name": "Stanford University School of Medicine",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60032838",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Towards adequate policy enhancement: An AI-driven decision tree model for efficient recognition and classification of EPA status via multi-emission parameters",
        "publication": "City and Environment Interactions",
        "citied_by": "5",
        "cover_date": "2023-12-01",
        "Abstract": "Accurate and timely evaluation and assessment of emission data and its impact on environmental status has been a key challenge due to the conventional manual approach utilized for independently computing most emission parameters. To resolve this long-standing issue, we proposed an Artificial Intelligence (AI)-driven Decision Tree model to adequately classify Environmental Protection Agency (EPA) status based on multiple Emission Parameters. The model's performance was systematically evaluated using multiple emission parameters obtained from a two-stroke motorcycle dataset collected in Nigeria across various metrics such as K-S Statistics, Confusion Matrix, Correlation Heat Map, Decision Tree, Validation Curve, and Threshold Plot. The K-S Statistics plot's experimental results showed a considerable correlation between HC, CO, and the target variable, with values ranging from 0.75 to 0.80. At the same time, CO2 and O2 do not correlate with the target variable with values between 0.00 and 0.09. The Confusion Matrix revealed that the proposed model has an overall accuracy of 99.9% with 481 true positive predictions and 75 true negative predictions, indicating the effectiveness of the proposed AI-driven model. In conclusion, our proposed AI-driven model can effectively classify EPA status based on multiple emission parameters with high accuracy, which may spur positive advancement in policy enhancement for proper environmental management.",
        "DOI": "10.1016/j.cacint.2023.100127",
        "paper_author": "Awomuti A.",
        "affiliation_name": "Key Laboratory of Yangtze River Water Environment Ministry of Education",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60129287",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Modeling and enforcing access control policies in conversational user interfaces",
        "publication": "Software and Systems Modeling",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "Conversational user interfaces (CUIs), such as chatbots, are becoming a common component of many software systems. Although they are evolving in many directions (such as advanced language processing features, thanks to new AI-based developments), less attention has been paid to access control and other security concerns associated with CUIs, which may pose a clear risk to the systems they interface with. In this paper, we apply model-driven techniques to model and enforce access-control policies in CUIs. In particular, we present a fully fledged framework to integrate the role-based access-control (RBAC) protocol into CUIs by: (1) modeling a set of access-control rules to specify permissions over the bot resources using a domain-specific language that tailors core RBAC concepts to the CUI domain; and (2) describing a mechanism to show the feasibility of automatically generating the infrastructure to evaluate and enforce the modeled access control policies at runtime.",
        "DOI": "10.1007/s10270-023-01131-3",
        "paper_author": "Planas E.",
        "affiliation_name": "Universitat Oberta de Catalunya",
        "affiliation_city": "Barcelona",
        "affiliation_country": "Spain",
        "affiliation_id": "60002581",
        "affiliation_state": "Barcelona"
    },
    {
        "paper_title": "Applications of Artificial Intelligence in Health Care Delivery",
        "publication": "Journal of Medical Systems",
        "citied_by": "4",
        "cover_date": "2023-12-01",
        "Abstract": "Health care costs now comprise nearly one-fifth of the United States’ gross domestic product, with the last 25 years marked by rising administrative costs, a lack of labor productivity growth, and rising patient and physician dissatisfaction. Policy experts have responded with a series of reforms that have – ironically - increased patient and physician administrative burden with little meaningful effect on cost and quality. Artificial intelligence (AI), a topic of great consternation, can serve as the “wheat thresher” for health care delivery, empowering and freeing both patients and physicians by decreasing administrative burden and improving labor productivity. In this Viewpoint, we discuss three principal areas where AI poses an unprecedented opportunity to reduce cost, improve care, and markedly enhance the patient and physician experience: (1) automation of administrative process, (2) augmentation of clinical practice, and (3) automation of elements of clinical practice.",
        "DOI": "10.1007/s10916-023-02018-y",
        "paper_author": "Spear J.",
        "affiliation_name": "University of Oklahoma College of Medicine",
        "affiliation_city": "Oklahoma City",
        "affiliation_country": "United States",
        "affiliation_id": "60012414",
        "affiliation_state": "OK"
    },
    {
        "paper_title": "ChatGPT and its ethical implications for STEM research and higher education: a media discourse analysis",
        "publication": "International Journal of STEM Education",
        "citied_by": "30",
        "cover_date": "2023-12-01",
        "Abstract": "Background: With the increasing demand brought on by the beginning of the fourth industrial revolution in the period of post-digital education and bio-digital technology, artificial intelligence (AI) has played a pivotal role in supporting human intelligence and contributing to intellectuals within science, technology, science, and mathematics (STEM) and in the broader field of higher education. Thus, this study examines how writers for mainstream STEM journals and higher education magazines perceive the impact of ChatGPT, a powerful AI chatbot, on STEM research and higher education. ChatGPT can generate realistic texts based on user prompts. However, this platform also poses ethical challenges for academic integrity, authorship, and publication. Results: Using a comparative media discourse analysis approach, this study analyzes 72 articles from four media outlets: (a) Springer Nature; (b) The Chronicle of Higher Education; (c) Inside Higher Ed; and (d) Times Higher Education. The results show that the writers expressed various concerns and opinions about the potential conflicts and crises caused by ChatGPT in three areas: (a) academic research and publication; (b) teaching and learning; and (c) human resources management. Conclusions: This study concludes with some policy implications and suggestions for future research on ChatGPT and AI ethics in academia by reilluminating the most overarching policy concerns related to ethical writing in STEM research and higher education and limitations to the blindness to authorship and academic integrity among diverse stakeholders.",
        "DOI": "10.1186/s40594-023-00452-5",
        "paper_author": "Nam B.H.",
        "affiliation_name": "Shanghai International Studies University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60016141",
        "affiliation_state": "Shanghai"
    },
    {
        "paper_title": "Spatial-temporal simulation for hospital infection spread and outbreaks of Clostridioides difficile",
        "publication": "Scientific Reports",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Validated and curated datasets are essential for studying the spread and control of infectious diseases in hospital settings, requiring clinical information on patients’ evolution and their location. The literature shows that approaches based on Artificial Intelligence (AI) in the development of clinical-support systems have benefits that are increasingly recognized. However, there is a lack of available high-volume data, necessary for trusting such AI models. One effective method in this situation involves the simulation of realistic data. Existing simulators primarily focus on implementing compartmental epidemiological models and contact networks to validate epidemiological hypotheses. Nevertheless, other practical aspects such as the hospital building distribution, shifts or safety policies on infections has received minimal attention. In this paper, we propose a novel approach for a simulator of nosocomial infection spread, combining agent-based patient description, spatial-temporal constraints of the hospital settings, and microorganism behavior driven by epidemiological models. The predictive validity of the model was analyzed considering micro and macro-face validation, parameter calibration based on literature review, model alignment, and sensitive analysis with an expert. This simulation model is useful in monitoring infections and in the decision-making process in a hospital, by helping to detect spatial-temporal patterns and predict statistical data about the disease.",
        "DOI": "10.1038/s41598-023-47296-1",
        "paper_author": "Kim D.",
        "affiliation_name": "Universidad de Murcia",
        "affiliation_city": "Murcia",
        "affiliation_country": "Spain",
        "affiliation_id": "60000130",
        "affiliation_state": "Murcia"
    },
    {
        "paper_title": "The AI generation gap: Are Gen Z students more interested in adopting generative AI such as ChatGPT in teaching and learning than their Gen X and millennial generation teachers?",
        "publication": "Smart Learning Environments",
        "citied_by": "120",
        "cover_date": "2023-12-01",
        "Abstract": "This study aimed to explore the experiences, perceptions, knowledge, concerns, and intentions of Generation Z (Gen Z) students with Generation X (Gen X) and Generation Y (Gen Y) teachers regarding the use of generative AI (GenAI) in higher education. A sample of students and teachers were recruited to investigate the above using a survey consisting of both open and closed questions. The findings showed that Gen Z participants were generally optimistic about the potential benefits of GenAI, including enhanced productivity, efficiency, and personalized learning, and expressed intentions to use GenAI for various educational purposes. Gen X and Gen Y teachers acknowledged the potential benefits of GenAI but expressed heightened concerns about overreliance, ethical and pedagogical implications, emphasizing the need for proper guidelines and policies to ensure responsible use of the technology. The study highlighted the importance of combining technology with traditional teaching methods to provide a more effective learning experience. Implications of the findings include the need to develop evidence-based guidelines and policies for GenAI integration, foster critical thinking and digital literacy skills among students, and promote responsible use of GenAI technologies in higher education.",
        "DOI": "10.1186/s40561-023-00269-3",
        "paper_author": "Chan C.K.Y.",
        "affiliation_name": "The University of Hong Kong",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60006541",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence techniques for enhancing supply chain resilience: A systematic literature review, holistic framework, and future research",
        "publication": "Computers and Industrial Engineering",
        "citied_by": "20",
        "cover_date": "2023-12-01",
        "Abstract": "Today's supply chains (SC) have become vulnerable to unexpected and ever-intensifying disruptions from myriad sources. Consequently, the concept of supply chain resilience (SCRes) has become crucial to complement the conventional risk management paradigm, which has failed to cope with unexpected SC disruptions resulting in severe consequences affecting SC performances and making business continuity questionable. Advancements in cutting-edge technologies like artificial intelligence (AI) and their potential to enhance SCRes by improving critical antecedents across different phases have attracted the attention of scholars and practitioners. The research from academia and the practical interest of the industry have yielded significant publications at the nexus of AI and SCRes during the last two decades. However, the applications and examinations have been primarily conducted independently, and the extant literature is dispersed into research streams despite the complex nature of SCRes. To bridge this gap, this study undertakes a systematic literature review involving 106 peer-reviewed articles. Through curation, synthesis, and consolidation of up-to-date literature, the study presents a comprehensive overview of developments spanning from 2010 to 2022. Bayesian networks are the most topical ones among the 13 AI techniques evaluated. Concerning the critical antecedents, visibility is the first ranking to be realized by the techniques. The study revealed that AI techniques support only the first 3 phases of SCRes (readiness, response, and recovery), and readiness is the most popular one, while no evidence has been found for the growth phase. The study proposed an AI-SCRes framework to inform research and practice to holistically approach SCRes. It also provided implications for practice, policy, and theory as well as gaps for impactful future research.",
        "DOI": "10.1016/j.cie.2023.109714",
        "paper_author": "Kassa A.",
        "affiliation_name": "Addis Ababa University",
        "affiliation_city": "Addis Ababa",
        "affiliation_country": "Ethiopia",
        "affiliation_id": "60071181",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "AI technologies in the ESL/EFL writing classroom: The villain or the champion?",
        "publication": "Journal of Second Language Writing",
        "citied_by": "4",
        "cover_date": "2023-12-01",
        "Abstract": "The impact of AI technologies, particularly ChatGPT, on the ESL/EFL writing classroom is unprecedented. In response to the focus paper by Warschauer and colleagues regarding this issue, this paper shares some insights from the experiences teaching English writing at the post-secondary level in Thailand. Due to the lack of institutional policies on the use of AI technologies, we need to devise our own strategies for our classes. While students are encouraged to use their voices instead of relying on AI, we attempt to adapt our practice by incorporating AI generators in a productive way to help students enhance their potential as L2 writers. However, there has been a debate among writing teachers in our context whether to accept AI tools as a part of teaching and learning.",
        "DOI": "10.1016/j.jslw.2023.101072",
        "paper_author": "Praphan P.W.",
        "affiliation_name": "Mahasarakham University",
        "affiliation_city": "Maha Sarakham",
        "affiliation_country": "Thailand",
        "affiliation_id": "60002875",
        "affiliation_state": "Maha Sarakham"
    },
    {
        "paper_title": "Corrigendum to “Utilization of E-commerce for fossil fuels allocation and green recovery” [Resour. Pol. 85B (2023) 103980] (Resources Policy (2023) 85(PB), (S0301420723006918), (10.1016/j.resourpol.2023.103980))",
        "publication": "Resources Policy",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "The authors apologize for including the AI language model statement on page 4 of the above-named article, below Table 3, and for failing to include the Declaration of Generative AI and AI-assisted Technologies in Scientific Writing, as required by the journal's policies and recommended by reviewers during revision. During the preparation of this work, the authors used ChatGPT to improve readability and language. After using this tool, the authors reviewed the content and take full responsibility for the content of the publication. The authors employ the Westerlund (2007) methodology, encompassing four statistical measures denoted by Equations (2)–(5). These tests play a pivotal role in scrutinizing potential co-integration relationships among the variables and discerning their enduring associations. The revised equations are presented below: [Formula presented] [Formula presented] [Formula presented] [Formula presented] The authors would like to apologize for any inconvenience caused.",
        "DOI": "10.1016/j.resourpol.2023.104336",
        "paper_author": "Yang J.",
        "affiliation_name": "Liaoning University",
        "affiliation_city": "Shenyang",
        "affiliation_country": "China",
        "affiliation_id": "60022345",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Moderating manipulation: Demystifying extremist tactics for gaming the (regulatory) system",
        "publication": "Policy and Internet",
        "citied_by": "5",
        "cover_date": "2023-12-01",
        "Abstract": "Due to its ease of scalability and broad applicability, the use of artificial intelligence (AI) and machine learning in platform management has gained prominence. This has led to widespread debates about the use of deplatforming as the default tool for repeated or severe violations of terms or service. But technologically deterministic approaches are not infallible and can be predictable based on their actions. This opens the door for manipulation of media content and technological affordances to become tactical options for actors seeking to subvert regulation. Existing discussions often neglect the topic of manipulation of content, algorithms, or platform affordances as a primary aspect of the strategies used by extremists in relation to the difficulties of moderation from a policy perspective. This study argues that it is essential to understand how extremists and conspiracy theorists use manipulation tactics to ‘game’ the current policy, regulatory and legislative systems of content moderation. Developing approaches that attend to manipulation as a strategy and focus on platform and context-specific tactics will generate more effective policies, platform rules, AI developments and moderation procedures. This study analyses and demystifies three primary tactics, which the authors categorize as numerology, borderlands and merchandising, regularly used by extremists online in their strategies to ‘game’ content moderation. We provide case examples from a variety of ideologies including far-right, QAnon and male supremacism to highlight the tactics rather than ideological nature of such manipulation. We conclude with a discussion of how demystification processes could be incorporated into content moderation settings. This study contributes new insights about evasion tactics to the content moderation discussion and expands current understanding of how platforms can develop sociotechnical remedial measures.",
        "DOI": "10.1002/poi3.381",
        "paper_author": "Mattheis A.A.",
        "affiliation_name": "Swansea University",
        "affiliation_city": "Swansea",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60004572",
        "affiliation_state": "West Glamorgan, Wales"
    },
    {
        "paper_title": "The influence of sociodemographic factors on students' attitudes toward AI-generated video content creation",
        "publication": "Smart Learning Environments",
        "citied_by": "30",
        "cover_date": "2023-12-01",
        "Abstract": "Artificial Intelligence (AI) and Machine Learning (ML) technologies offer the potential to support digital content creation and media production, providing opportunities for individuals from diverse sociodemographic backgrounds to engage in creative activities and enhance their multimedia video content. However, less attention has been paid to recent research exploring any possible relationships between AI-generated video creation and the sociodemographic variables of undergraduate students. This study aims to investigate the multifaceted relationship between AI-generated video content and sociodemographics by examining its implications for inclusivity, equity, and representation in the digital media landscape. An empirical study about the use of AI in video content creation was conducted with a diverse cohort of three hundred ninety-eighth undergraduate (n = 398) students. Participants voluntarily took part and were tasked with conceiving and crafting their AI-generated video content. All instruments used were combined into a single web-based self-report questionnaire that was delivered to all participants via email. Key research findings demonstrate that students have a favorable disposition when it comes to incorporating AI-supported learning tasks. The factors fostering this favorable attitude among students include their age, the number of devices they use, the time they dedicate to utilizing technological resources, and their level of experience. Nevertheless, it is the student’s participation in AI training courses that exerts a direct impact on students’ ML attitudes, along with their level of contentment with the reliability of these technologies. This study contributes to a more comprehensive understanding of the transformative power of AI in video content creation and underscores the importance of considering instructional contexts and policies to ensure a fair and equitable digital media platform for students from diverse sociodemographic backgrounds.",
        "DOI": "10.1186/s40561-023-00276-4",
        "paper_author": "Pellas N.",
        "affiliation_name": "University of Western Macedonia",
        "affiliation_city": "Kozani",
        "affiliation_country": "Greece",
        "affiliation_id": "60006517",
        "affiliation_state": "Western Macedonia"
    },
    {
        "paper_title": "The application of artificial intelligence in health financing: a scoping review",
        "publication": "Cost Effectiveness and Resource Allocation",
        "citied_by": "6",
        "cover_date": "2023-12-01",
        "Abstract": "Introduction: Artificial Intelligence (AI) represents a significant advancement in technology, and it is crucial for policymakers to incorporate AI thinking into policies and to fully explore, analyze and utilize massive data and conduct AI-related policies. AI has the potential to optimize healthcare financing systems. This study provides an overview of the AI application domains in healthcare financing. Method: We conducted a scoping review in six steps: formulating research questions, identifying relevant studies by conducting a comprehensive literature search using appropriate keywords, screening titles and abstracts for relevance, reviewing full texts of relevant articles, charting extracted data, and compiling and summarizing findings. Specifically, the research question sought to identify the applications of artificial intelligence in health financing supported by the published literature and explore potential future applications. PubMed, Scopus, and Web of Science databases were searched between 2000 and 2023. Results: We discovered that AI has a significant impact on various aspects of health financing, such as governance, revenue raising, pooling, and strategic purchasing. We provide evidence-based recommendations for establishing and improving the health financing system based on AI. Conclusions: To ensure that vulnerable groups face minimum challenges and benefit from improved health financing, we urge national and international institutions worldwide to use and adopt AI tools and applications.",
        "DOI": "10.1186/s12962-023-00492-2",
        "paper_author": "Ramezani M.",
        "affiliation_name": "School of Public Health",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60171626",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Should we embrace “Big Sister”? Smart speakers as a means to combat intimate partner violence",
        "publication": "Ethics and Information Technology",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "It is estimated that one in three women experience intimate partner violence (IPV) across the course of their life. The popular uptake of “smart speakers” powered by sophisticated AI means that surveillance of the domestic environment is increasingly possible. Correspondingly, there are various proposals to use smart speakers to detect or report IPV. In this paper, we clarify what might be possible when it comes to combatting IPV using existing or near-term technology and also begin the project of evaluating this project both ethically and politically. We argue that the ethical landscape looks different depending on whether one is considering the decision to develop the technology or the decision to use it once it has been developed. If activists and governments wish to avoid the privatisation of responses to IPV, ubiquitous surveillance of domestic spaces, increasing the risk posed to members of minority communities by police responses to IPV, and the danger that more powerful smart speakers will be co-opted by men to control and abuse women, then they should resist the development of this technology rather than wait until these systems are developed. If it is judged that the moral urgency of IPV justifies exploring what might be possible by developing this technology, even in the face of these risks, then it will be imperative that victim-survivors from a range of demographics, as well as government and non-government stakeholders, are engaged in shaping this technology and the legislation and policies needed to regulate it.",
        "DOI": "10.1007/s10676-023-09727-5",
        "paper_author": "Sparrow R.",
        "affiliation_name": "Monash University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60019578",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Research agenda for using artificial intelligence in health governance: interpretive scoping review and framework",
        "publication": "BioData Mining",
        "citied_by": "4",
        "cover_date": "2023-12-01",
        "Abstract": "Background: The governance of health systems is complex in nature due to several intertwined and multi-dimensional factors contributing to it. Recent challenges of health systems reflect the need for innovative approaches that can minimize adverse consequences of policies. Hence, there is compelling evidence of a distinct outlook on the health ecosystem using artificial intelligence (AI). Therefore, this study aimed to investigate the roles of AI and its applications in health system governance through an interpretive scoping review of current evidence. Method: This study intended to offer a research agenda and framework for the applications of AI in health systems governance. To include shreds of evidence with a greater focus on the application of AI in health governance from different perspectives, we searched the published literature from 2000 to 2023 through PubMed, Scopus, and Web of Science Databases. Results: Our findings showed that integrating AI capabilities into health systems governance has the potential to influence three cardinal dimensions of health. These include social determinants of health, elements of governance, and health system tasks and goals. AI paves the way for strengthening the health system's governance through various aspects, i.e., intelligence innovations, flexible boundaries, multidimensional analysis, new insights, and cognition modifications to the health ecosystem area. Conclusion: AI is expected to be seen as a tool with new applications and capabilities, with the potential to change each component of governance in the health ecosystem, which can eventually help achieve health-related goals.",
        "DOI": "10.1186/s13040-023-00346-w",
        "paper_author": "Ramezani M.",
        "affiliation_name": "School of Public Health",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60171626",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "An Artificial Intelligence-Based Framework to Accelerate Data-Driven Policies to Promote Solar Photovoltaics in Lisbon",
        "publication": "Solar RRL",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Due to the unavailability of up-to-date and georeferenced information about Lisbon's existing solar energy systems, tracking the progress of solar energy in relation to the city's Climate Action Plans 2030 is a complex task, thus hindering the potential of data-driven decision-making for a targeted implementation of photovoltaics (PV) in buildings and urban infrastructure. To overcome the challenges posed, an integrated approach to accelerate policy-making based on artificial intelligence (AI) resources and local citizens' and stakeholders' participation is developed and piloted in Lisbon. Recurring to a two-step AI model setup to identify and geolocate PV systems, key policy indicators are calculated to inform policy-makers about the evolution of PV deployment in the city and contribute to tailor future incentives to more depressed or energy poor districts. The AI model based on open data orthophotos from 2016 allowed estimates for the installed peak power at the city level, in that year, to be delivered in a few minutes, whereas manual inspection of aerial images will have taken several months. Although the PV capacity determined is 30% lower than the historical official numbers, the proof of concept for the proposed framework is achieved and validated by local stakeholders.",
        "DOI": "10.1002/solr.202300597",
        "paper_author": "Freitas S.",
        "affiliation_name": "Lisboa E-Nova – Agência de Energia e Ambiente de Lisboa",
        "affiliation_city": "Lisbon",
        "affiliation_country": "Portugal",
        "affiliation_id": "130399647",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The landscape of data and AI documentation approaches in the European policy context",
        "publication": "Ethics and Information Technology",
        "citied_by": "6",
        "cover_date": "2023-12-01",
        "Abstract": "Nowadays, Artificial Intelligence (AI) is present in all sectors of the economy. Consequently, both data-the raw material used to build AI systems- and AI have an unprecedented impact on society and there is a need to ensure that they work for its benefit. For this reason, the European Union has put data and trustworthy AI at the center of recent legislative initiatives. An important element in these regulations is transparency, understood as the provision of information to relevant stakeholders to support their understanding of AI systems and data throughout their lifecycle. In recent years, an increasing number of approaches for documenting AI and datasets have emerged, both within academia and the private sector. In this work, we identify the 36 most relevant ones from more than 2200 papers related to trustworthy AI. We assess their relevance from the angle of European regulatory objectives, their coverage of AI technologies and economic sectors, and their suitability to address the specific needs of multiple stakeholders. Finally, we discuss the main documentation gaps found, including the need to better address data innovation practices (e.g. data sharing, data reuse) and large-scale algorithmic systems (e.g. those used in online platforms), and to widen the focus from algorithms and data to AI systems as a whole.",
        "DOI": "10.1007/s10676-023-09725-7",
        "paper_author": "Micheli M.",
        "affiliation_name": "European Commission Joint Research Centre",
        "affiliation_city": "Brussels",
        "affiliation_country": "Belgium",
        "affiliation_id": "60103695",
        "affiliation_state": "NA"
    }
]