[
    {
        "paper_title": "Research on the Impact of Artificial Intelligence Technology on the Production Efficiency of Advanced Manufacturing Enterprises",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "This paper investigates the influence of artificial intelligence (AI) technology on the production efficiency of advanced manufacturing enterprises and its role in enhancing corporate environmental, social, and governance (ESG) performance. Analyzing financial and annual report data from Chinese A-share listed manufacturing companies from 2010 to 2022, we found a notable positive effect of AI on manufacturing efficiency and corporate ESG outcomes. AI enables automation, intelligent production, market trend forecasting, and product design optimization, thereby boosting efficiency and competitiveness. Additionally, it fosters corporate social responsibility, governance efficiency, and sustainable development. The research also examines the variable impact of AI across enterprises with differing regional, ownership, and production factors, offering insights for targeted policy and strategy development. This contribution is pivotal for both theoretical advancement and practical application, guiding high-quality growth in the advanced manufacturing sector.",
        "DOI": "10.1145/3691422.3691442",
        "paper_author": "Qian Y.",
        "affiliation_name": "Central University of Finance and Economics",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60013131",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Exploring Factors Influencing Artificial Intelligence Adoption in Smart Cities",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "Artificial intelligence (AI) is a prominent technology in the development of smart cities. However, adopting AI in smart cities is very complicated because of its multi-dimensional nature, various application fields, and also the ecosystem-like environment with many stakeholders. This study discusses seven strategic factors, including policy guarantee, stakeholder collaboration, financial capability, and public demands, information security, data availability, and AI infrastructure, and identifies their configurations which lead to a high smart city performance via the adoption of AI. A theoretical model is developed to understand smart city practice in 31 capital cities in the mainland of China. The findings reveal the complexity of AI adoption in smart cities from a configurational perspective and indicate that these factors do not work in isolation, but in combination with others to promote AI adoption in smart cities. Understanding the configurational relationships of these factors can help smart city strategists in their planning and policymaking relating to the development of smart cities.",
        "DOI": "10.1145/3691422.3691435",
        "paper_author": "Gong Y.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Al-Based Paddy Rice Yield Prediction Using Satellite Images, Meteorological Data, and Digital Elevation Model: Case Study of South Korea, 2000-2023",
        "publication": "Korean Journal of Remote Sensing",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "The increasing uncertainty in crop production caused by climate change underscores the necessity of accurate yield predictions for staple crops like rice. This study developed a rice yield prediction model that accounts for climate change by integrating satellite imagery and artificial intelligence. Key variables, including temperature, precipitation, and solar radiation, were derived from Korea Meteorological Administration Automated Synoptic Observing System (ASOS) data and combined with NASAs Shuttle Radar Topography Mission Digital Elevation Model (SRTM DEM) to incorporate topographic factors. A comprehensive database integrating Vegetation indices from Moderate Resolution Imaging Spectroradiometer (MODIS) and Visible Infrared Imaging Radiometer Suite (VIIRS) was established, and Automated Machine Learning (AutoML) was employed to optimize the rice yield prediction model. Validation results demonstrated high predictive accuracy, with the model utilizing ASOS data achieving a MAPE of 4.091% in 2023. This study contributes to data-driven decision-making for climate-resilient agricultural policies and enhanced food security.",
        "DOI": "10.7780/kjrs.2024.40.6.1.25",
        "paper_author": "Sim J.",
        "affiliation_name": "Pukyong National University",
        "affiliation_city": "Busan",
        "affiliation_country": "South Korea",
        "affiliation_id": "60011883",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Medical Crimes in Midwifery Cases: Bibliometrics Analysis",
        "publication": "Babcock University Medical Journal",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "Background: Medical crimes in midwifery cases, a term used to describe medical crimes during pregnancy, childbirth, and the postpartum period, is a controversial feminist term in global health policy and midwifery practice and research. This work aimed to discover the trend of medical crime publications regarding obstetric cases, the number of citations, and the direction of further research topics. Main body: The research method used in this study is Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA), which uses 2,617 scientific articles or publications from the Dimensions database. View articles with VOSviewer. This study conducted a bibliometric analysis of medical crime publications of midwifery case studies from 2013 to 2023 at https://app.dimensions.ai/. The study showed some results. There is an upward trend among the many publications on medical crime in midwifery cases, the number of citations of medical crime in midwifery cases has increased, and the online visualization of medical crime in midwifery cases provides information to find new topics that are not related to each. others, there are 5 clusters in terms of co-occurrence, the overlay imaging of medical crime in obstetric cases provides a trend to future research topics, medical crime in obstetric cases density imaging is still rare. Conclusion: The conclusion of the findings of this study is the development of a medical criminal investigation plan for midwifery cases. Although this study contributed to https://app.dimensions.ai/ to provide the latest insight into medical crime trends in midwifery cases from 2013 to 2023, this study has limitations.",
        "DOI": "10.38029/babcockuniv.med.j..v7i2.504",
        "paper_author": "Damayanti F.N.",
        "affiliation_name": "Universitas Muhammadiyah Semarang",
        "affiliation_city": "Semarang",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60105690",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Enterprise generative artificial intelligence technologies, internet of things and blockchain-based fintech management, and digital twin industrial metaverse in the cognitive algorithmic economy",
        "publication": "Oeconomia Copernicana",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "Research background: Enterprise generative AI system-based worker behavior tracking and monitoring, socially responsible organizational practices, employee performance management satisfaction, and human resource management procedures, relationships, and outcomes develop on hiring and objective performance assessment algorithms in terms of human resource management activities, functions, processes, practices, policies, and productivity. Deep reinforcement and machine learning techniques, operational and analytical generative AI and cloud capabilities, and real-time anomalous behavior recognition systems further fintech development for credit and lending services, payment analytics processes, and risk assessment, monitoring, and mitigation. Generative AI tools can bolster predictive analytics by collaborative and interconnected sensor and machine data for tailored, seamless, and finetuned product, operational process, and organizational workflow development, efficiency, and innovation, driving agile transformative changes in digital twin industrial metaverse. Purpose of the article: We show that enterprise generative AI-driven schedule prediction tools, job search and algorithmic hiring systems, and synthetic training data can improve team selection, job performance and firing decisions, hiring decision processes, and workforce productivity in terms of prediction and decision-making by use of algorithmic management, system performance, and production process tracking tools. Blockchain-based fintech operations can shape cloud-based financial and digital banking services, quote-to-cash process automation, cash-settled crypto futures, digital loan decisioning, asset tokenization simulated transactions, transaction switching and routing operations, tailored peer-to-peer lending, and proactive credit line management. Collaborative unstructured enterprise data processing, infrastructure, and governance can develop on AI decision and behavior automation technology, retrieval augmented generation and development management systems, and real-time data descriptive and predictive analytics, driving productivity surges and competitive advantage in digital twin industrial metaverse. Methods: Reference and review management tools, together with evidence synthesis screening software, harnessed were Abstrackr, AMSTAR, ASReview Lab, CASP, Catchii, Citationchaser, DistillerSR, JBI SUMARI, Litstream, PICO Portal, and Rayyan. Findings & value added: The current state of the art is improved for theory on organizational issues and for policy making as deep learning-based generative AI tools and workplace monitoring systems can augment performance and productivity, gauge employee effectiveness, build resilient, satisfied, and engaged workforce, assess human capital, skill, and career development, drive employee and productivity expectations in relation to flexibility and stability, and shape turnover, retention, and loyalty. Cloud and account servicing technologies can be deployed in generative AI fintechs for embedded cryptocurrency trading, transaction monitoring and processing, digital asset transfers, payment screening, corporate and retail banking operations, and fraud prevention. Generative AI technologies can reshape jobs and reimagine meaningful work, involving creativity and innovation and adaptable and resilient sustained performance, providing valuable constructive feedback, optimizing workplace flexibility and psychological safety, and measuring and supporting autonomy and flexibility-based efficiency, performance, and productivity, while configuring demanding, engaging, and rewarding experiences by cloud and edge computing devices in digital twin industrial metaverse.",
        "DOI": "10.24136/oc.3109",
        "paper_author": "Kliestik T.",
        "affiliation_name": "University of Žilina",
        "affiliation_city": "Zilina",
        "affiliation_country": "Slovakia",
        "affiliation_id": "60005088",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Transformations of national economies under conditions of instability",
        "publication": "Transformations of national economies under conditions of instability",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "The monograph \"Transformation of National Economies in Conditions of Instability\" is dedicated to theoretical-methodological and practical approaches to addressing diverse and pressing challenges faced by key sectors of national economies under risks and threats of various scales and natures. The authors present innovative approaches and unique solutions for transforming the development of structural elements within socio-economic systems, with a particular focus on implementing advanced international experience and standards in the context of modern trends in the global economy. The book consists of nine chapters, each exploring significant aspects of current development challenges and offering forward-looking solutions of strategic importance.",
        "DOI": "10.21303/978-9916-9850-6-9",
        "paper_author": "Cherniavska T.",
        "affiliation_name": "State University of Applied Sciences",
        "affiliation_city": "Konin",
        "affiliation_country": "Poland",
        "affiliation_id": "121596067",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The 2030 Agenda for Sustainable Development: Goals and Implementation",
        "publication": "International Journal of Sustainability Policy and Practice",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "This study examines the implementation of the 2030 Agenda for Sustainable Development and the options for closing the gap in achieving the Sustainable Development Goals (SDGs) in the remaining years of the 2015 to 2030 planning period, focusing on the issues in developing and least-developed countries. The deterring factors and their impact on the 2030 Agenda for Sustainable Development implementation have been analyzed. The possibilities for prioritizing the SDGs and integrating the strategies and policies for their achievement in the context of the water–energy–food nexus (WEF Nexus) and Maslow’s hierarchy of needs have been explored. The research contributes to the understanding of the impact of disincentives on the achievement of the SDGs. Emphasis is placed on poverty, and the main ways and means to overcome problems in this direction are outlined. Research insights into the effective and efficient implementation of the 2030 Agenda for Sustainable Development, related to holistic thinking, system approach, modern tax policy, artificial intelligence (AI), and new technologies are provided. The research leads to an awareness of the need to improve international institutional activities to guarantee overcoming crises in the environmental, social, and health spectrum, peace, security, and achieving the SDGs.",
        "DOI": "10.18848/2325-1166/CGP/v20i02/155-180",
        "paper_author": "Nikolova B.",
        "affiliation_name": "University of Economics - Varna",
        "affiliation_city": "Varna",
        "affiliation_country": "Bulgaria",
        "affiliation_id": "60070361",
        "affiliation_state": "Varna"
    },
    {
        "paper_title": "Resilient forces, AI and the future of work in public sector administration",
        "publication": "The Routledge International Handbook of Public Administration and Digital Governance",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "This chapter proposes a framework for developing organizational resilience in public sector administration based on inherent forces within organizations. A case study of a public sector organization in a developing economy that faced significant disruption during and after the COVID-19 pandemic as well as pervasive governmental and international policy pressures is presented. The study analyzed the intrinsic characteristics of inherent resilient forces to propose a framework that can help public sector organizations prepare for and respond more effectively to disruption. The findings of the research indicate that instead of viewing resilience as a reactive strategy, organizations must see resilience as a state of being. The proposed framework emphasizes the need for a human-AI collaborative approach that prioritizes empathy and a generative culture. Furthermore, the framework can help organizations identify and address the internal forces that impact their resilience, enabling them to adapt and respond to disruption more effectively. By adopting a fresh perspective on organizational resilience, public sector organizations can develop a more proactive and comprehensive approach that can lead to stronger and more resilient organizations that are better equipped to adapt during challenging times.",
        "DOI": "10.4324/9781003458081-15",
        "paper_author": "Afful-Dadzie E.",
        "affiliation_name": "University of Ghana Business School",
        "affiliation_city": "Accra",
        "affiliation_country": "Ghana",
        "affiliation_id": "60196600",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The Routledge international handbook of public administration and digital governance",
        "publication": "The Routledge International Handbook of Public Administration and Digital Governance",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "The Routledge International Handbook of Public Administration and Digital Governance is a comprehensive, cutting-edge guide for students, scholars and practitioners of public policy, public administration and digital governance. The book demonstrates the diverse nature of \"digital government\" through a series of case studies from different regions across the globe, including Africa, the Americas, Asia and Europe. The book uses these cases to highlight various aspects and implications of the intersection of digital technologies and public administration. These include the impact of practices and principles of public administration, the effects of particular technologies/tools and the relationship between state and citizen. The book also addresses barriers and enablers to the adoption of digital technology, with select chapters focusing on artificial intelligence (AI) in governmental contexts by leading practitioners and scholars. Rather than providing region-specific lessons, the cases identify common challenges, offering a more holistic understanding of public administration in the digital era. With contributions from both practitioners and scholars, this handbook will be a compelling resource for those researching, studying or working in public administration, public leadership, information systems, political science and other related fields.",
        "DOI": "10.4324/9781003458081",
        "paper_author": "Giest S.",
        "affiliation_name": "Universiteit Leiden",
        "affiliation_city": "Leiden",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60019816",
        "affiliation_state": "Zuid-Holland"
    },
    {
        "paper_title": "Mastering AI governance in the public sector",
        "publication": "The Routledge International Handbook of Public Administration and Digital Governance",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "Interest in the integration of artificial intelligence-based systems in the public sector follows in the footsteps of earlier movements toward widespread information, communications and technology's adoption in the public sector given the expected improvement in public service delivery, responsiveness and efficiency gains within public administrations. However, AI adoption in the public sector comes with challenges that cut across technological, management and governance dimensions and thus require enhanced competence both at the individual and organizational level. The chapter builds upon research conducted by the lead author as part of the European Commission's AI Watch for the public sector, and the experience of the EU-funded Master in artificial intelligence in public services (AI4GOV). It further leverages the work conducted by the authors for UNESCO to operationalize a framework for capacity building in the area of digital governance and AI at the individual and organizational level. Based on results from these efforts, the chapter outlines the key competences and training requirements needed to adopt AI in government as well as the overall conditions in which these capacity building efforts should be anchored. After discussing the conceptual framework developed for capacity building the analysis presents the key conditions needed to ensure sustainable learning outcomes for both individuals and organizational units. This discussion is complemented by presentation of the outline of an AI and Digital Governance Compass that aims to guide public sector organizations in identifying a mix of hard skills, soft skills and managerial competences that they need to put in place to achieve the organization's objectives. The chapter further emphasizes the importance of interdisciplinary education and methodologies integrating data science and service design. To nurture such an approach is the unique feature of the AI4GOV Master aimed at training \"functional specialists\" in AI for public services, it is crucial to experiment with teamwork and project-based learning. This approach goes beyond the operational use of AI by the public sector for carrying out administrative duties, and addresses the governance challenges that are the core of policymaking in the digital age. The chapter concludes with recommendations for policy and future research directions, to identify and possibly anticipate open-ended future issues that are emerging in the realm of AI governance in the public sector.",
        "DOI": "10.4324/9781003458081-27",
        "paper_author": "Misuraca G.",
        "affiliation_name": "Universidad Politécnica de Madrid",
        "affiliation_city": "Madrid",
        "affiliation_country": "Spain",
        "affiliation_id": "60028442",
        "affiliation_state": "Madrid"
    },
    {
        "paper_title": "Emerging multifaceted application of artificial intelligence in chest radiography: a narrative review",
        "publication": "Journal of Medical Artificial Intelligence",
        "citied_by": "1",
        "cover_date": "2024-12-30",
        "Abstract": "Background and Objective: Chest radiography, otherwise known as chest X-ray (CXR) is the most in demand and widely performed investigation in radiology department; owing to the multiple combining effect of rise in prevalence of respiratory diseases globally and the growing need of heath assessment for pre-employment, pre-operative and migration purposes. However, this task is already proving overwhelming, placing an immeasurable burden of workload on radiographers, radiologist, and the entire health system; this has resulted in long waiting time, fatigue-based technical error, interpretation error, reporting delays and backlogs. To ameliorate this predicament, medical imaging has witnessed the introduction of artificial intelligence (AI). Thus, with the raid evolutionary trend in technology, this article seeks to review current state of evidence on AI use in CXR and level of progress made to minimize these errors and delays. In addition, point out challenges, as well as unfold areas for future research to better detection rates and improve overall clinical outcomes. Methods: A search for relevant literature that focuses on AI in CXR was conducted with the help of certain keywords [machine learning (ML), chest radiography, deep learning (DL), natural language processing (NLP), expert system (ES) and fuzzy logic (FL)]. Thereafter, a narrative logical approach to technically analysing and synthesizing findings across domains of AI (ML, DL, NLP, ES, FL) and robot technologies as it relates to CXR done. Key Content and Findings: A thorough evaluation of the substance of evidence these studies bring to enhance overall workflow and health outcomes show that ML is very useful in performing administrative and imaging tasks such as exam scheduling, worklist management and image acquisition. On the other hand, DL is better suited for classification tasks on a broad spectrum of chest anomalies in CXR. However, a hybrid approach involving ML-DL, FL-DL and NLP-DL/ML technologies seems to further improve reporting accuracy and offer more insights into CXR interpretation. Further studies on training and refining models for clinical use in this perspective is demanded. Conclusions: AI still in its early stages; this review to serve as road map to implementation and policy making, guide routine practice and improve clinical governance.",
        "DOI": "10.21037/jmai-24-67",
        "paper_author": "Nwaiwu V.C.",
        "affiliation_name": "Lincoln University College, Malaysia",
        "affiliation_city": "Petaling Jaya",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60107209",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Mapping the Current Status of CTI Knowledge Graphs through a Bibliometric Analysis",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Bibliometric analysis in the field of cybersecurity and Cyber Threat Intelligence (CTI) is crucial for identifying research trends, key themes, and collaborative networks, which can guide future research directions and policy decisions.This paper presents a comprehensive bibliometric analysis of the current status of research on knowledge graphs in cybersecurity, highlighting significant trends and thematic clusters.The analysis reveals a rapidly growing interest in integrating knowledge graphs with advanced machine learning and AI techniques, such as deep learning and neural networks, to enhance cyber threat intelligence and response strategies.Key findings include the prominence of natural language processing, entity recognition, and relation extraction as critical methodologies in this field.Thematic evolution analysis shows the adoption of large language models (LLMs) and an ongoing focus on structured knowledge representation.The study underscores the potential of knowledge graphs to improve cybersecurity through better data organization, threat detection, and intelligence extraction.",
        "DOI": "10.1145/3688671.3688738",
        "paper_author": "Papoutsoglou M.",
        "affiliation_name": "Aristotle University of Thessaloniki",
        "affiliation_city": "Thessaloniki",
        "affiliation_country": "Greece",
        "affiliation_id": "60015331",
        "affiliation_state": "Central Macedonia"
    },
    {
        "paper_title": "Disaster Psychiatry: An urgent field in psychiatry posing a pertinent question",
        "publication": "Psychiatrike = Psychiatriki",
        "citied_by": "1",
        "cover_date": "2024-12-27",
        "Abstract": "Disasters, both natural and man-made, impose a significant burden on the mental health of individuals, communities, and societies. The frequency and intensity of disasters is increasing; 3-4 fold compared to the last century, with 400-500 significant disasters/year, affecting >1.5 billion people worldwide and costing 250-400 billion dollars/year. Most natural disasters are directly or indirectly linked to climate change, itself a natural disaster of human origin. Armed conflict is another human self-infliction; 59 state-based conflicts are currently active, the highest since WW2 (Uppsala Conflict Data Program-UCDP1). The mental health impact of disasters is multifaceted, influencing both immediate and long-term mental health outcomes. Acute stress, anxiety, depression, and post-traumatic stress disorder (PTSD) represent just the direct impact of disasters on mental health. Forced displacement, economic hardship, and societal matrix disturbance can predispose survivors - especially the most vulnerable - to longer-term and indirect mental health morbidity. In some cases, there may be persistent, even transgenerational morbidity.2,3 Disasters also have important systemic effects, especially in less well-developed systems, where disasters cause acute-on-chronic failures. The ethical handicap is that pressured systems fail exactly where the most vulnerable need them intact. Indeed, in disasters, mental health services are likely to fail early.2-4 Disaster Psychiatry is a branch of psychiatry dedicated to preventing, preparing for, and responding to the mental health consequences of disasters. It relies on a range of evidence-based interventions designed to address the acute response to disasters, but more importantly, to address future disasters by prevention and preparedness. Acute disaster response refers to supporting individuals and the wider system at times of crisis. It is well covered by guidelines by the WHO/IASC, the Sphere, RCPsych, APA, and the World Psychiatric Association, Section on Disaster Psychiatry.5 Beyond practical support and good clinical care, there are several well-supported interventions dealing with the clinical sequelae of disasters. A key intervention is Psychological First Aid (PFA), which focuses on providing immediate and practical support to individuals following a disaster. Among others, effective therapeutic interventions include Eye Movement Desensitization and Reprocessing (EMDR), Cognitive-behavioral therapy (CBT), which has emerged as a gold standard for treating PTSD in meta-research, and Exposure Therapy (ET) which has lately been enhanced by XR and AI integration. To minimize escalation of disaster-related psychopathology, early intervention, social support, and good access to mental health services are critical. Supporting the wider system before, during, and after disasters includes psychoeducation and support for front-line responders, advising decision-makers, facilitating coordination and effective communication between services and up and down the chain of command, as well as assuming leadership when necessary. While acute response is important, the most effective strategies for disaster psychiatry are prevention and preparedness. Disaster prevention has a broad scope involving measures that heavily rely on foresight and often require multifaceted interventions, often political. Disaster preparedness, on the other hand, focuses on enhancing individual and systemic resilience before an impending disaster. For communities, key interventions include precision screening to inform targeted prevention, community-based mental health promotion, community-based preparedness training programs in stress management and coping skills, among others. Government and healthcare organizations also play a pivotal role in disaster preparedness; establishing effective and well-trained mental health response teams, training frontline non-mental healthcare professionals in disaster psychiatry, and ensuring that mental health services are integrated into formal disaster response plans can dramatically help. Disaster preparedness effectively constitutes secondary and tertiary preventive measures against potential psychiatric morbidity. Additionally, fostering global collaboration in research and policy development is essential. The World Health Organization (WHO) has set a global target of 80% of countries to have a system for mental health and psychosocial preparedness for disasters by 20306 and the Inter-Agency Standing Committee (IASC) has called for increased attention to mental health in disaster planning, emphasizing the need for an evidence-based, coordinated, and pro-implementation approach to disaster psychiatry.7 With major impending disasters like climate change, Disaster Psychiatry is posing a pertinent question: What is a psychiatrist's role in disasters? All doctors are trained to care for individual patients; therefore, responding to the clinical aftermath of disasters is familiar territory. However, disaster prevention and preparedness require a collective approach, promoting health across the wider society, as well as using selective and indicated prevention strategies, where appropriate. Furthermore, they require psychiatrists to inform decision-makers and advocate for disaster prevention measures that lie beyond the strict remit of mental health. This broader role of political advocacy constitutes a significant, but perhaps necessary, paradigm shift for the role of psychiatrists and an existential question for psychiatry.",
        "DOI": "10.22365/jpsych.2024.022",
        "paper_author": "Christodoulou N.",
        "affiliation_name": "World Psychiatric Association",
        "affiliation_city": "Thonex",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60275408",
        "affiliation_state": "GE"
    },
    {
        "paper_title": "The role of academia and private sector in smart agriculture applications",
        "publication": "Turkish Journal of Agricultural Economics",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Purpose: In agriculture, it is important to collect data on issues such as climate conditions, soil cultivation, diseases, irrigation and harvest, process them and convert them into information and use them in farmers' production decisions. In this context, in the research, interviews were held with technical staff working on Research and Development (R&D) at universities in Izmir and Aydın and companies producing smart agricultural technology. These interviews aimed to examine the activities, roles and problems of academicians and companies in smart applications that will shape the agricultural sector in the future. Design/Methodology/Approach: The main material of the research consists of data obtained from interviews with a total of 19 people, 12 academicians and 7 technology company officials who carry out R&D activities in the agricultural field in Izmir and Aydın provinces. Simple statistical calculations and content analysis were used in the analysis of the data as required by the qualitative research method. Findings: As a result of the coding made as per the method, smart agriculture application (technology-sustainability), dissemination (organization), policy (planning-problems-solutions) codes came to the fore. These codes also explain the roles of the university and the private sector, which are scientific stakeholders of smart agricultural practices, in the technology collaboration. Originality/Value: Agriculture 4.0, which is called efficient planning, management and digitalization of agricultural activities, includes a number of technologies. These are sensor technologies, artificial intelligence (AI), machine learning, automation and robotic systems, remote access, etc. In addition to the benefits of detecting and solving problems in advance, these technologies also provide benefits in terms of saving manpower, enabling efficient and precise operations, efficient use of farm resources, increasing productivity and ensuring food safety. Smart agricultural practices are also used in Turkish agriculture in parallel with developments in the world. Agriculture and technology cooperation continues to develop in Turkey with technoparks and agroparks that have accelerated their activities in recent years. This research is unique in the sense of collecting current data on the subject and sharing suggestions about possible problems from the perspective of the academy and the private sector.",
        "DOI": "10.24181/tarekoder.1511288",
        "paper_author": "Boz Yilmazer E.",
        "affiliation_name": "Aydin Adnan Menderes University",
        "affiliation_city": "Aydin",
        "affiliation_country": "Turkey",
        "affiliation_id": "60023033",
        "affiliation_state": "Efeler"
    },
    {
        "paper_title": "The role of artificial intelligence in inclusive knowledge management",
        "publication": "Handbook of Inclusive Knowledge Management: Ensuring Inclusivity, Diversity, and Equity in Knowledge Processing Activities",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "This chapter discusses the current level of inclusivity in artificial intelligence (AI) systems and then looks at inclusivity in AI-enabled knowledge management (KM) systems. The major challenges to greater diversity, equity, and inclusivity in both AI and KM result from a series of biases or lack of representativeness in the data collected for AI and the knowledge captured for KM, lack of diversity in AI and KM teams, and the lack of general oversight in the form of AI and KM governance such as legislation, policies, and ethical guidelines. The chapter concludes with a series of recommendations based on proven practices from the KM practitioner perspective.",
        "DOI": "10.1201/9781003407966-8",
        "paper_author": "Lin Y.",
        "affiliation_name": "Pennsylvania State University",
        "affiliation_city": "University Park",
        "affiliation_country": "United States",
        "affiliation_id": "60001439",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "A Trustworthy and Responsible Decision-Making Framework for Resource Management in Food-Energy-Water Nexus: A Control-Theoretical Approach",
        "publication": "ACM Transactions on Intelligent Systems and Technology",
        "citied_by": "0",
        "cover_date": "2024-12-26",
        "Abstract": "This article introduces a hybrid framework for trustworthy and responsible natural resource management, aimed at building bottom-up trust to enhance cooperation among decision-makers in the food, energy, and water sectors. Cooperation is highly critical for the adoption and application of resource management alternatives (solutions), including those generated by AI-based recommender systems, in communities due to significant impact of these sectors on the environment and the economic productivity of affected communities. While algorithms can recommend solutions, effectively communicating and gaining community acceptance of these solutions is crucial. Our research stands out by emphasizing the collaboration between humans and machines, which is essential for addressing broader challenges related to climate change and the need for expert tradeoff handling in the management of natural resources. To support future decision-making, we propose a successful control-theory model based on previous decision-making and actor behavior. We utilize control theory to depict how community decisions can be affected by how much individuals trust and accept proposed solutions on irrigation water rights and crop operations in an iterative and interactive decision support environment. This model interacts with stakeholders to collect their feedback on the acceptability of solutions, while also examining the influence of consensus levels, trust sensitivities, and the number of decision-making rounds on the acceptance of proposed solutions. Furthermore, we investigate a system of multiple decision-making and explore the impact of learning actors who adjust their trust sensitivities based on solution acceptance and the number of decision-making rounds. Additionally, our approach can be employed to evaluate and refine potential policy modifications. Although we assess potential outcomes using hypothetical actions by individuals, it is essential to emphasize our primary objective of developing a tool that accurately captures real human behavior and fosters improved collaboration in community decision-making. Ultimately, our aim is to enhance the harmony between AI-based recommender systems and human values, promoting a deeper understanding and integration between the two.",
        "DOI": "10.1145/3660640",
        "paper_author": "Uslu S.",
        "affiliation_name": "Indiana University-Purdue University Indianapolis",
        "affiliation_city": "Indianapolis",
        "affiliation_country": "United States",
        "affiliation_id": "60024609",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Honest Computing: Achieving demonstrable data lineage and provenance for driving data and process-sensitive policies",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-26",
        "Abstract": "Data is the foundation of any scientific, industrial, or commercial process. Its journey flows from collection to transport, storage, and processing. While best practices and regulations guide its management and protection, recent events have underscored their vulnerabilities. Academic research and commercial data handling have been marred by scandals, revealing the brittleness of data management. Data is susceptible to undue disclosures, leaks, losses, manipulation, or fabrication. These incidents often occur without visibility or accountability, necessitating a systematic structure for safe, honest, and auditable data management. We introduce the concept of Honest Computing as the practice and approach that emphasizes transparency, integrity, and ethical behaviour within the realm of computing and technology. It ensures that computer systems and software operate honestly and reliably without hidden agendas, biases, or unethical practices. It enables privacy and confidentiality of data and code by design and default. We also introduce a reference framework to achieve demonstrable data lineage and provenance, contrasting it with Secure Computing, a related but differently orientated form of computing. At its core, Honest Computing leverages Trustless Computing, Confidential Computing, Distributed Computing, Cryptography, and AAA security concepts. Honest Computing opens new ways of creating technology-based processes and workflows which permit the migration of regulatory frameworks for data protection from principle-based approaches to rule-based ones. Addressing use cases in many fields, from AI model protection and ethical layering to digital currency formation for finance and banking, trading, and healthcare, this foundational layer approach can help define new standards for appropriate data custody and processing.",
        "DOI": "10.1017/dap.2024.68",
        "paper_author": "Guitton F.",
        "affiliation_name": "Imperial College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60015150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Smart Integration of Renewable Energy into Transportation: Challenges, Innovations, and Future Research Directions",
        "publication": "Journal of Renewable Energies",
        "citied_by": "0",
        "cover_date": "2024-12-25",
        "Abstract": "The integration of renewable energy into transportation systems is essential for reducing greenhouse gas emissions and achieving global sustainability goals. This review explores the challenges, innovations, and future directions of incorporating renewable energy sources such as solar, wind, and bioenergy into transportation infrastructures. Key challenges include the intermittency of renewable energy, the need for advancements in energy storage systems, and the regulatory and economic barriers hindering widespread adoption. Innovations such as electric vehicles (EVs), vehicle-to-grid (V2G) technologies, and smart grids are pivotal in enabling this transition. Furthermore, artificial intelligence (AI) and machine learning (ML) offer significant potential to optimize energy management, enhance efficiency, and facilitate the smooth integration of renewable energy with transportation systems. The review also discusses successful case studies from different regions and examines policy frameworks supporting renewable energy in transportation. Future directions point toward increased collaboration between industries, technological advancements, and supportive policies to create a more sustainable, resilient transportation sector. Ultimately, this review aims to provide a comprehensive understanding of how smart integration of renewable energy into transportation can drive a cleaner, more sustainable future.",
        "DOI": "10.54966/jreen.v27i2.1300",
        "paper_author": "Sayeed M.A.",
        "affiliation_name": "University of Technology and Applied Sciences Shinas",
        "affiliation_city": "Shinas",
        "affiliation_country": "Oman",
        "affiliation_id": "60089500",
        "affiliation_state": "Al Batinah"
    },
    {
        "paper_title": "Artificial Intelligence: Legal and Ethical Perspectives in the Health Care Sector",
        "publication": "Science of Law",
        "citied_by": "0",
        "cover_date": "2024-12-24",
        "Abstract": "In this study, the researchers aim to establish how Artificial Intelligence (AI) has revolutionized the health care industry and the ethical and legal issues pertaining to the use of such technology in this organization. The study provides recommendations for implementing value-adding measures to ensure the safe, secure, and ethical use of AI in healthcare, as well as addressing important concerns and providing solutions to effectively implement AI. Using a quantitative research design, the study uses primary and secondary data to critically analyze relevant literature and existing information. It highlights key challenges that come about because of the current boundaries of regulating AI in healthcare, including but not limited to informed consent, transparency, privacy, data protection, and fairness. The study is fundamentally important to the theory and practice of the implementation of AI technologies, as it illustrates the high potential of using them in the sphere of patient care and, at the same time, cites significant ethical and legal issues in their application. To fully achieve the rightly hailed benefits of AI in health care, we must address these issues. To use the AI components responsibly, rules and regulations of ethical and legal standards must change to accommodate key concerns such as consent, ownership, disclosure, and bias. These measures are critically important to centralize patient rights protection and build confidence in health care organizations. Consequently, this study offers practical policy implications that policymakers, healthcare practitioners, and technologists should consider when implementing regulatory policies. Thus, on one hand, such frameworks allow bringing innovation into the field of healthcare by AI while, on the other hand, maintaining compliance to guarantee that such solutions will be both effective and fair.",
        "DOI": "10.55284/sol.v2024i4.152",
        "paper_author": "Farooqui M.O.",
        "affiliation_name": "University of Sharjah",
        "affiliation_city": "Sharjah",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60070813",
        "affiliation_state": "Sharjah"
    },
    {
        "paper_title": "Facilitating Cognitive Load Management and Improved Learning Outcomes and Attitudes in Middle School Technology and Vocational Education Through AI Chatbot",
        "publication": "Journal of Technical Education and Training",
        "citied_by": "0",
        "cover_date": "2024-12-24",
        "Abstract": "Junior Secondary School (JSS) or middle school education is peculiar as it involves the introduction of a wide array of subjects across the sciences, arts, humanities, business and vocational fields to young learners. This situation can be ovewhelming, resulting in high cognitive load (CL), with consequent poor learning outcomes, and other negative issues including high dropout rates, requiring urgent attention. AI tools have been explored for addressing multiple learning issues. AI chatbots are particularly useful based on their ability to support individualized learning, pre-training, and other concepts that can facilitate CL management. This study evaluated the impact of an AI-based chatbot system for reducing students’ CL and improving learning outcomes, attitude and retention among JSS students. A quasi-experimental study with 120 students was conducted over an 8 week period with 24 learning sessions. The experimental group (N=60) learnt using ‘iLearnTech’, an AI Chatbot developed specifically for the study. The control group (N=60) learnt through the traditional approach with no chatbot. Learning content was based on the JSS Basic Technology education, a precursor to TVET. Data was collected using the Cognitive Load Measure, the Basic Technology Achievement Test, Students’ Attitude Survey (SAS), and Students’ Retention Test. The experimental group exhibited huge reductions in CL and corresponding improvements in learning outcomes, attitude and retention. The results also confirmed known relationship between the dependent variables and highlights the potential of AI powered educational tools for addressing diverse educational issues including promoting equitable access, and sustainable education in developing nations and resource-constrained environments. This work contributes to ongoing discussions on AI applications in education. Its novelty lies in its exploration of AI technology in addressing CL issues in the context of junior secondary education. Implications for educational policy and practice, particularly curriculum design and e-learning integration are highlighted.",
        "DOI": "10.30880/jtet.2024.16.03.009",
        "paper_author": "Olugbade D.",
        "affiliation_name": "First Technical University",
        "affiliation_city": "Ibadan",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60115906",
        "affiliation_state": "Oyo"
    },
    {
        "paper_title": "New management pathways for follow-up of CPAP-treated sleep apnoea patients including digital medicine and multimodal telemonitoring",
        "publication": "Thorax",
        "citied_by": "0",
        "cover_date": "2024-12-23",
        "Abstract": "Background The ever-increasing number of patients diagnosed with obstructive sleep apnoea (OSA) and treated by long-term continuous positive airway pressure (CPAP) overstretches conventional follow-up pathways. New approaches to the management of CPAP-treated patient follow-up are needed to strike a balance between remote monitoring through digital technologies and in-person patient-healthcare-professional contacts. Focusing on the reshaping of the management of care pathways of CPAP-treated patients, with a specific focus on telemonitoring platforms, we aimed to review the evidence on how digital medicine and artificial intelligence (AI) tools are facilitating patient phenotyping and triage, risk stratification and the allocation of resources between the various healthcare professionals for an optimal follow-up of CPAP-treated patients. Phenotyping OSA is a heterogeneous condition with diverse phenotypes differing in symptoms, comorbidities, demographics, lifestyle and socioeconomic context. Different phenotypes are associated with different CPAP adherence patterns and differing long-term prognosis. This diversity demands greater plurality in management pathways with different types and levels of support to ensure treatment adherence and risk reduction for patients while easing the burden on health services. In multidimensional phenotyping, we discuss alternatives to the apnoea hypopnoea index (AHI) as a measure of OSA severity. Then we consider risk stratification taking advantage of the wealth of CPAP monitoring data already available in databases that can now be exploited using AI and machine learning to direct (stratify) patients into appropriate follow-up management pathways. Integrated care clinics for high-risk patients We look at the role of integrated OSA care clinics particularly for the management of high-risk patients with low adherence and progression of comorbidities. Here, multidisciplinary teams might propose comorbidity management, and the use of connected wearable devices for long-term monitoring of physical activity, along with remote CPAP monitoring. Remote management pathways The pros and cons of remote management pathways to replace in-person follow-up visits are considered, including the need to re-evaluate CPAP-device reimbursement policies in some countries. While remote CPAP monitoring has become the cornerstone of follow-up providing information on adherence and efficacy, the processing of alerts needs to be improved, particularly regarding mask changes and early detection of CPAP failures. Challenges The implementation of CPAP monitoring alone, as well as its extension to multimodal monitoring, can present challenges that remain to be addressed (eg, access to digital care). The extent and components of remote follow-up must be adapted to each specific OSA phenotype. Finally, we give examples of certain patient phenotypes (eg, comorbid insomnia with OSA) with specific follow-up requirements, for which remote (even multimodal) monitoring alone has limitations and the intervention of both sleep specialists and/or their colleagues from other disciplines is needed. Conclusion Appropriately tailored combined digital and in-person CPAP follow-up pathways would present advantages both for patients with OSA and healthcare services.",
        "DOI": "10.1136/thorax-2024-221422",
        "paper_author": "Pépin J.L.",
        "affiliation_name": "Laboratoire Hypoxie et Physiopathologies Cardiovasculaires et Respiratoires",
        "affiliation_city": "La Tronche",
        "affiliation_country": "France",
        "affiliation_id": "60209335",
        "affiliation_state": "Auvergne-Rhone-Alpes"
    },
    {
        "paper_title": "Machine learning framework for wastewater circular economy — Towards smarter nutrient recoveries",
        "publication": "Desalination",
        "citied_by": "3",
        "cover_date": "2024-12-21",
        "Abstract": "As the world's supply chains become disrupted through geopolitical instability and the race towards a net-zero future, policies have been implemented to improve the security of certain minerals and raw materials critical to a country's survival and sustainability goals. Circular economies (CE) are sought to be an ecosystem that will reduce virgin material consumption rates, lower carbon emissions, and decelerate the rate of landfilling. However, cost-effective and commercially attractive substitutes to conventional products are needed for this to be realised. Machine learning (ML) and the explosion of interest in artificial intelligence (AI) have led to growing interests in predictive and generative applications for sustainability. Phosphorous and, nutrients overall, operate on finite reserves essential for food supply chains; while such nutrients are largely present in municipal wastewater streams. Wastewater treatment plants (WWTPs) must then face a transformational force to become nutrient recovery centres, rather than follow a linear treat-for-disposal model. In this framework paper, ML is positioned as an enabler for scaled, cost-effective and safer recovery of nutrients and other valuable products — tying in economic, societal, technical and commercial factors through open data connectivity. Moreover, the paper issues a policy guide for institutions wishing to advance food, energy and water security through machine learning, circular economy wastewater treatment plants (ML CE WWTP).",
        "DOI": "10.1016/j.desal.2024.118092",
        "paper_author": "Soo A.",
        "affiliation_name": "University of Technology Sydney",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60023932",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Mapping evidence on the regulations affecting accessibility, availability and management of snake antivenom globally: a scoping review protocol",
        "publication": "BMJ Open",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Introduction Snakebite envenomation has been declared a neglected tropical disease by the WHO since 2017. The disease is endemic in affected areas due to the lack of availability and access to antivenom, despite it being the standard treatment for snakebites. This challenge is perpetuated by the shortcomings of the regulatory systems and policies governing the management of antivenoms. This study aims to map the evidence about regulations of snake antivenom globally and identify gaps in the literature. This protocol provides an overview of the methodology and analysis which will be used to conduct the scoping review. Method and analysis The scoping review follows the guidelines from the Arksey and O'Malley framework for scoping reviews and will be reported using Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews. A search strategy was developed with assistance from a health sciences librarian, and the search was done using six relevant databases. The databases used are PubMed, SCOPUS, ProQuest Central, Africa Wide Web, Academic Search Output and Web of Science. Articles in the English language and between 2009 and 2023 were included. The search results were collated, duplicates were removed and results were exported to Rayyan (https://www.rayyan.ai/) for screening. The initial screening for titles and abstracts is currently in progress, and thereafter the second round of screening will be done for full texts. Data extraction will be done using Google Forms. The results of the review will be synthesised using quantitative and qualitative tools. Ethics and dissemination This review will provide guidance for studies investigating regulatory gaps globally and inform future policies governing antivenom management. Ethics approval for the complete postgraduate project was obtained from the University of Pretoria Research Ethics Committee. The review will be published in a scientific journal, and findings will also be disseminated using conference presentations. Trial registration This review has been registered on Open Science Framework (OSF): https://osf.io/54zja.",
        "DOI": "10.1136/bmjopen-2024-086964",
        "paper_author": "Majeed R.",
        "affiliation_name": "University of Pretoria",
        "affiliation_city": "Pretoria",
        "affiliation_country": "South Africa",
        "affiliation_id": "60021902",
        "affiliation_state": "Gauteng"
    },
    {
        "paper_title": "Advances and opportunities in digital diabetic healthcare systems",
        "publication": "Decision Support System for Diabetes Healthcare: Advancements and Applications",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Diabetes has far-reaching implications, not only for those directly affected but also for caregivers, families, and communities. Unhealthy eating and sedentary lifestyles fuel the diabetes surge. Challenges to effectively controlling blood sugar in patients stem from limited access to specialized care, poor medication adherence, and inadequate self-care motivation. Nonetheless, healthcare is rapidly transforming, with state-of-the-art digital technologies like smartphone apps, telemedicine, m-health, device integration, machine learning, and AI poised to reshape diabetes management. These innovations offer great potential to improve care efficacy and encourage patients to play a more active self-care role. These innovations hold immense potential to enhance the efficacy of diabetes management while empowering patients to take a more active role in their self-care. The current healthcare system has given some great instances of overhauling the diabetes ecosystem by utilizing the possibilities of digital transformation. A revolutionary shift in diabetes management via digital transformation offers tremendous potential for optimizing healthcare cost and resource efficiency. This approach promises to elevate the quality and uniformity of diabetes care, transcending geographical constraints and also contributing to enhanced governance and policy formulation across diverse healthcare sectors. Furthermore, it catalyzes encouraging innovation and fostering collaboration among industry stakeholders, ultimately leading to the development of innovative products and solutions that support diabetes management and care. To create a better, more attainable future for individuals with diabetes, this chapter focuses on the most recent digital and technological developments and breakthroughs to identify the appropriate device for diabetes monitoring and management.",
        "DOI": "NA",
        "paper_author": "Vadia N.",
        "affiliation_name": "Marwadi University",
        "affiliation_city": "Rajkot",
        "affiliation_country": "India",
        "affiliation_id": "60138770",
        "affiliation_state": "GJ"
    },
    {
        "paper_title": "Securing a peaceful, sustainable, and humane future through an international data-based systems agency (IDA) at the un",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "The international community, and the UN in particular, is in urgent need of wise policies, and a regulatory institution to put data-based systems, notably AI, to positive use and guard against their abuse. Digital transformation and artificial intelligence (AI)-which can more adequately be called data-based systems (DS)-present ethical opportunities and risks. Helping humans and the planet to flourish sustainably in peace and guaranteeing globally that human dignity is respected not only offline but also online, in the digital sphere, and the domain of DS requires two policy measures: (1) human rights-based data-based systems (HRBDS) and (2) an International Data-Based Systems Agency (IDA): IDA should be established at the UN as a platform for cooperation in the field of digital transformation and DS, fostering human rights, security, and peaceful uses of DS.",
        "DOI": "10.1017/dap.2024.38",
        "paper_author": "Kirchschlaeger P.G.",
        "affiliation_name": "Universität Luzern",
        "affiliation_city": "Luzern",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60017347",
        "affiliation_state": "LU"
    },
    {
        "paper_title": "DESIGNING A GOOD STORY FOR BETTER POLICIES: ENTREPRENEURSHIP AT THE CROSSROADS OF AI-POWERED VISUAL STORYTELLING AND SENSEMAKING",
        "publication": "Human Technology",
        "citied_by": "0",
        "cover_date": "2024-12-19",
        "Abstract": "Sensemaking and AI image generators can contribute as visual storytelling tools to a better comprehension of the life-worlds of entrepreneurs in policymaking. There is doubt about whether policymakers productively understand entrepreneurial realities for the sake of implementing decisions that help startups. Using entrepreneurial journeys of 18 startups in six countries, weak-signal triads and image prompts were derived from shared stories in order to visualize entrepreneurial realities. The advantage of visual storytelling materializes in the cognitive ease that narrative schemas yield. Results indicate that AI generated visuals, e.g. storyboards, depict compelling realities regarding story elements such as character and setting clearly, yet they hardly illustrate the dynamics thereof (e.g. conflict resolution), while triads help understand entrepreneurial priorities. The project showcases the potential of tech-driven visualization, suggesting that visual arts can help the public understand untold stories that drive, among others, entrepreneurial solutions, provided that the dynamics be presented clearly.",
        "DOI": "10.14254/1795-6889.2024.20-3.1",
        "paper_author": "Behar-Villegas E.",
        "affiliation_name": "IU Internationale Hochschule GmbH",
        "affiliation_city": "Erfurt",
        "affiliation_country": "Germany",
        "affiliation_id": "60196597",
        "affiliation_state": "Thuringen"
    },
    {
        "paper_title": "Intellectual Property in the Age of Machine Creativity: Understanding the Legal Landscape and Emerging Issues",
        "publication": "Understanding Generative AI in a Cultural Context: Artificial Myths and Human Realities",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "This chapter explores the intersection of intellectual property (IP) law and generative artificial intelligence (AI), focusing on the complex challenges and emerging issues presented by these technologies. It provides a structured taxonomy of IP concerns related to AI, including authorship and ownership, copyright infringement, fair use. By analyzing the legal and ethical implications of these challenges, the chapter aims to offer insights into current IP frameworks and propose potential solutions and best practices for stakeholders. Through a multidisciplinary approach that includes legal texts, academic literature, and case studies, this chapter contributes to the development of new theoretical frameworks and informs policy, practice, and public understanding in the evolving landscape of machine creativity.",
        "DOI": "10.4018/979-8-3693-7235-7.ch013",
        "paper_author": "Oğul S.",
        "affiliation_name": "Kadir Has Üniversitesi",
        "affiliation_city": "Istanbul",
        "affiliation_country": "Turkey",
        "affiliation_id": "60029111",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Impact of artificial intelligence on employment opportunities in the Indian IT job market",
        "publication": "Public Sector and Workforce Management in the Digital Age",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "The Indian IT sector is going through significant change due to the rapid evolution of artificial intelligence. This study focuses on the impact of AI on job opportunities in the IT industry in India, looking at new job creation, concerns over job loss, and changes in skills required. In a quantitative cross-sectional survey of 363 IT professionals and industry experts, this research shows that AI adoption positively and negatively impacts workforce relationships, resulting in replacements and the emergence of advanced cognitive and digital skills. Key statistical analyses, including chi-square tests, one-way ANOVA, and regression, underscore the critical relationship between AI adoption and job dynamics within India's IT sector. According to the findings, reskilling programs, supported by proactive actions such as facilitating policies, are necessary to cushion against the negatives of AI while capitalising upon its prospects for employment growth and innovation.",
        "DOI": "10.4018/979-8-3373-1137-1.ch011",
        "paper_author": "Haritha K.B.",
        "affiliation_name": "Hindustan Institute of Technology and Science",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60107090",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "The role of digital technology in the sustainability strategies of SMEs",
        "publication": "The Future of Small Business in Industry 5.0",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "The discourse around sustainability and decarbonization has largely overlooked SMEs, despite their crucial role in the global economy and significant collective emissions. SMEs need focused research and policy attention to address sustainability concerns. The accelerated adoption of digital technologies supports sustainability efforts, enhances competitiveness, and enables product customization. However, there is a gap in understanding how effectively these technologies advance SMEs' sustainability objectives. This study, through a systematic literature review, reveals that adopting ICT, social media, big data analytics, IoT/IIoT, AI, business management programs, and cloud computing is crucial for SMEs to enhance sustainability and achieve sustainable development goals (SDGs).",
        "DOI": "10.4018/979-8-3693-7362-0.ch014",
        "paper_author": "Alabi A.T.",
        "affiliation_name": "Kwara State University",
        "affiliation_city": "Malete",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60105044",
        "affiliation_state": "Kwara"
    },
    {
        "paper_title": "Impact of globalization on entrepreneurship growth in India under industry 5.0",
        "publication": "The Future of Small Business in Industry 5.0",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "Globalisation and Industry 5.0 advancements have significantly boosted India's startup ecosystem. This paper explores the impact of globalisation on entrepreneurship in India, emphasizing how the blend of human creativity and advanced technologies drives innovation and market growth. Indian startups now leverage global capital, international markets, and technologies like AI, robotics, and IoT to compete globally. Despite challenges like regulatory issues and the digital divide, globalisation fosters a culture of innovation, offering resources and networks for growth. This study proposes strategic policies to support sustainable entrepreneurial development, positioning India as a key player in the global Industry 5.0 landscape.",
        "DOI": "10.4018/979-8-3693-7362-0.ch008",
        "paper_author": "Chandiok S.",
        "affiliation_name": "Banrasidas Chandiwala Institute of Professional Studies",
        "affiliation_city": null,
        "affiliation_country": "India",
        "affiliation_id": "119639588",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Exploring Data Breach Prevention Strategies in Real-Time Systems Integration and Architecture in the Healthcare Industry",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "Integrating real-time systems in healthcare technology has revolutionized patient care and operational efficiency, yet it poses a significant challenge: safeguarding patient data from data breaches. This paper comprehensively reviews data breach prevention strategies within real-time systems integration in healthcare. Data breaches in healthcare have profound impacts, compromising patient confidentiality, damaging reputations, and incurring financial costs. Effective prevention strategies include robust cybersecurity measures like Intrusion Detection Systems (IDS), advanced identity and access management (IAM) protocols, and Security Information and Event Management (SIEM) platforms. Additionally, innovations such as blockchain, artificial intelligence (AI), and encryption play crucial roles in fortifying data security. However, success depends on technological measures, organizational readiness, and awareness. Cultivating a culture of cybersecurity among healthcare professionals through training and strict policies is essential. While progress has been made, the evolving nature of cyber threats requires continuous adaptation and vigilance. Ongoing refinement of prevention strategies is necessary to combat data breaches in healthcare effectively.",
        "DOI": "10.1145/3688268.3688291",
        "paper_author": "Samonte M.J.C.",
        "affiliation_name": "Mapúa University",
        "affiliation_city": "Manila",
        "affiliation_country": "Philippines",
        "affiliation_id": "60104319",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "FTC Regulation of AI-Generated Medical Disinformation",
        "publication": "JAMA",
        "citied_by": "2",
        "cover_date": "2024-12-17",
        "Abstract": "NA",
        "DOI": "10.1001/jama.2024.19971",
        "paper_author": "Haupt C.E.",
        "affiliation_name": "Northeastern University",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60028628",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Framing Ethical e-Governance: A Plaidoyer for a Human-Rights based Digital Democracy Approach",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "As digital platforms increasingly influence public policy and governance, integrating human rights into digital tools becomes crucial for maintaining transparency, accountability, and inclusivity. The proposed framework focuses on ethical design principles, participatory governance models, accountability mechanisms, capacity building, and continuous evaluation to ensure that digital tools promote public participation and safeguard individual rights. The implementation of the proposed human-rights based approach involves developing ethical artificial intelligence (AI) guidelines, institutionalising public consultation platforms, creating independent oversight bodies, and establishing educational programs to enhance digital literacy. This paper highlights the significant advantages of a human-rights based approach, including enhanced trust and legitimacy in digital governance, improved inclusivity, and strengthened policy responsiveness. However, challenges such as resource allocation, stakeholder resistance, and the rapid pace of technological change require innovative solutions and continuous adaptation. Future research directions are suggested to validate the effectiveness of the proposed framework and explore its adaptability across different cultural and political contexts. Empirical studies are particularly called for to assess the real-world impact of these initiatives and refine the integration of human rights into digital governance practices. By systematically incorporating human rights into ethical e-governance, this framework not only aims to protect against potential abuses but also to leverage digital tools as enablers of a more democratic, just, and participatory governance environment. This approach underscores the transformative potential of ethical e-governance, where technology serves the public good and enhances the democratic fabric of society.",
        "DOI": "10.1145/3680127.3680182",
        "paper_author": "Tauchnitz E.",
        "affiliation_name": "Universität Luzern",
        "affiliation_city": "Luzern",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60017347",
        "affiliation_state": "LU"
    },
    {
        "paper_title": "Assessing digital government at the local level: An analysis of worldwide municipalities' survey",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "The adoption of emerging technologies has a decisive effect on restructuring the local government public service delivery model and the modes governments use to interact and engage with residents. The assessment process is a crucial factor to measure the effectiveness and efficiency of the introduced models and modes. This study aims to constructively summarize and analyse the results of a local e-Government assessment survey. The survey considers data from 51 cities worldwide (Africa, America, Asia, Europe and Oceania). The research method used a questionnaire, named Local Government Questionnaire, answered by the responsible e-Government official of each city. The survey investigates eight areas: Institutional Framework, Legal Framework, Strategy and Implementation, Usage of Online Services, User Satisfaction, Social Media, Crisis/Emergency Situations and Smart City and New Technologies. The findings, systematically analysed, show that 48 cities use at least one website, in many cases a specific website per thematic area, to provide services to the residents. All cities recognise the importance of e-Government projects, therefore they introduce the role of Chief Information Officer in their organisation chart. They strictly align with national e-Government legislation showing in some cases an intention to adopt practices and processes that satisfy local needs. Local e-Government strategies are aligned with sustainability and green economy aspects, affordable, accessible, and sustainable transport municipality systems, affordable housing and services to vulnerable groups and assurance of public safety. There is room for improvement in web portals usage statistics and user satisfaction data online publication. Social networks are identified as valuable interaction tools with the residents. Emerging technologies complement the e-Government prospective municipality agenda but local governments show a hesitation in introducing AI in decision-making.",
        "DOI": "10.1145/3680127.3680163",
        "paper_author": "Sarantis D.",
        "affiliation_name": "United Nations University",
        "affiliation_city": "Guimaraes",
        "affiliation_country": "Portugal",
        "affiliation_id": "128000081",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Approaching Fairness in Digital Governance: A Multi-Dimensional, Multi-Layered Framework",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "This article addresses the pressing issue of algorithmic discrimination, emerging from the increasing use of AI-Assisted decision-making systems. These systems, driven by substantial data and artificial intelligence, profoundly influence individual assessments and categorizations, yet risk perpetuating social inequalities due to their inherent opacity and complexity. This opacity often obscures the logic behind decisions, challenging the replacement of human judgment in key societal roles.The concept of fairness in algorithmic decision-making encompasses a broad spectrum, with interpretations and strategies varying across different cultures, legal systems, and academic disciplines. This paper proposes a multi-dimensional, multi-layered methodology designed to instill fairness in these systems, ensuring they operate equitably and adhere to the principle of equality. This methodology seeks to explore the nuanced definitions and technical applications of fairness within the realms of legality, morality, ethics, and computer science, aiming to assess their implications for individuals and society at large.In the context of global policy-making and regulatory innovations, this approach supports digital governance by offering a framework for developing legal norms for fairness in AI, which is crucial for compliance with new regulations such as the EU Artificial Intelligence Act. The multi-layered, multidimensional framework not only deepens the theoretical understanding of fairness but also enhances its practical application, helping policymakers and technologists manage the ethical and social impacts of AI, thereby fostering more trustworthy and responsible AI implementations. This research underscores the urgent need to integrate fairness into policy-making and AI systems as part of ethical AI self-Assessment and regulatory compliance.",
        "DOI": "10.1145/3680127.3680197",
        "paper_author": "Yousefi Y.",
        "affiliation_name": "Alma Mater Studiorum Università di Bologna",
        "affiliation_city": "Bologna",
        "affiliation_country": "Italy",
        "affiliation_id": "60028218",
        "affiliation_state": "BO"
    },
    {
        "paper_title": "Policy Pathways for Reducing Dependency through Technological Innovation: Lessons from Kenya's Use of Artificial Intelligence (AI) and Blockchain in Healthcare",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Kenya's healthcare system is confronted with significant challenges, including inadequate infrastructure, workforce shortages, and a heavy disease burden, which collectively hinder its ability to deliver effective and sustainable healthcare services. The integration of emerging technologies such as Artificial Intelligence (AI) and blockchain presents potential solutions to these issues, but their successful adoption requires addressing critical gaps in policy, infrastructure, and workforce development.This paper builds on Tlhokomelo Rethabile Monethi's research, which critiques Dependency Theory by exploring how AI and blockchain can reduce Kenya's reliance on the Global North while enhancing healthcare outcomes. Through qualitative desktop research, the paper analyses existing policies and legislative frameworks, identifying obstacles and proposing practical policy recommendations for the effective integration of these technologies into Kenya's healthcare system. The analysis covers multiple sectors, including infrastructure, public funding, education, workforce development, and environmental management, ensuring that recommendations are grounded in a comprehensive understanding of Kenya's regulatory landscape.The findings emphasise the importance of balancing technological advancement with respect for local cultural and ethical values. By implementing the proposed policy reforms, Kenya can foster a self-sufficient and sustainable healthcare system that reduces dependency on external resources, while improving healthcare outcomes for its population.",
        "DOI": "10.1145/3680127.3680128",
        "paper_author": "Monethi T.R.",
        "affiliation_name": "Rhodes University",
        "affiliation_city": "Grahamstown",
        "affiliation_country": "South Africa",
        "affiliation_id": "60026548",
        "affiliation_state": "Eastern Cape"
    },
    {
        "paper_title": "Tracking WHO reporting requests using hybrid AI",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "The United Nations agencies, like many other deliberative institutions, have the urgent need to track the decisions and obligations deliberated in their regulative acts. The AI combined with Formal ontology and LegalXML helps to cope with this task to track and monitor the provisions including mandates and relationships between other documents. This paper presents a hybrid AI methodology for detecting, extracting, annotating, and monitoring over time the provisions of the WHO. This knowledge is used for creating the agenda for the next official meetings of the Executive Board and World Health Assembly. The proposed system demonstrates the feasibility of tracking the so-called mandate provision inside the decisions and resolutions of WHO's governing bodies. The hybrid approach produces promising results that could be improved by using a web interface to capture the expertise of the end-users. The scenario is very relevant for deliberative bodies that need to track mandate provisions over time, to avoid repetition, missing reporting, and double deliberation.",
        "DOI": "10.1145/3680127.3680224",
        "paper_author": "Palmirani M.",
        "affiliation_name": "Alma Mater Studiorum Università di Bologna",
        "affiliation_city": "Bologna",
        "affiliation_country": "Italy",
        "affiliation_id": "60028218",
        "affiliation_state": "BO"
    },
    {
        "paper_title": "Monitoring Sustainable Development Goals in European Legislation using Hybrid AI",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "There is an urgency to detect in legal acts the corresponding provisions where a policy is implemented, to track its evolution over time, to measure the effectiveness of the norms, and to evaluate the impact on society. From this perspective, the Sustainable Development Goals program (SDG) provides a fundamental instrument for monitoring ground basis pillar of the world wide policies. In this work, we propose a method which leverages both the structural nature of legislative documents in AKN-XML and unsupervised machine learning to perform a match between individual articles and definitions and the 2030 Agenda for Sustainable Development Goals, yielding a more fine-grained annotation of individual articles and definitions, instead of the preexisting document-level annotation. Our work provides better traceability of the SDGs policies in the EU legislation permitting the legislator to detect the articles where the association is weakest. During the legal drafting, our tool could be integrated into the editor to suggest better legal definitions for improving the implementation of the SDGs.",
        "DOI": "10.1145/3680127.3680223",
        "paper_author": "Corazza M.",
        "affiliation_name": "Alma Mater Studiorum Università di Bologna",
        "affiliation_city": "Bologna",
        "affiliation_country": "Italy",
        "affiliation_id": "60028218",
        "affiliation_state": "BO"
    },
    {
        "paper_title": "Artificial Intelligence and Entrepreneurship",
        "publication": "Foundations and Trends in Entrepreneurship",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Advances in artificial intelligence (AI) have brought the world to the threshold of significant new technological breakthroughs. These developments bring new opportunities and challenges to existing and potential entrepreneurs, raising pressing and promising research questions. We review emerging but fast-growing literature on impacts of AI on entrepreneurship, providing a resource for researchers in entrepreneurship and neighboring disciplines. We begin with a review of definitions of AI and show that ambiguity and broadness of definitions adopted in empirical studies may result in obscured evidence on impacts of AI on entrepreneurship. Against this background, we present and discuss existing theories and evidence on how AI technologies affect entrepreneurial opportunities and decision-making under uncertainty, the adoption of AI technologies by startups, entry barriers, and the performance of entrepreneurial businesses. We add an original empirical analysis of survey data from the German Socio-economic Panel revealing that entrepreneurs, particularly those with employees, are aware of and use AI technologies significantly more frequently than paid employees. Next, we discuss how AI may affect entrepreneurship indirectly through impacting local and sectoral labor markets. The reviewed evidence suggests that AI technologies that are designed to automate jobs are likely to result in a higher level of necessity entrepreneurship in a region, whereas AI technologies that transform jobs without necessarily displacing human workers increase the level of opportunity entrepreneurship. More generally, AI impacts regional entrepreneurship ecosystems (EE) in multiple ways by altering the importance of existing EE elements and processes, creating new ones, and potentially reducing the role of geography for entrepreneurship. Lastly, we address the question of how the regulation of AI may affect the entrepreneurship landscape by focusing on the case of the European Union and its data protection and AI legislation. We conclude our survey by discussing implications for entrepreneurship research and policy.",
        "DOI": "10.1561/0300000130",
        "paper_author": "Fossen F.M.",
        "affiliation_name": "University of Nevada, Reno",
        "affiliation_city": "Reno",
        "affiliation_country": "United States",
        "affiliation_id": "60001769",
        "affiliation_state": "NV"
    },
    {
        "paper_title": "Healthcare workers' knowledge and attitudes regarding artificial intelligence adoption in healthcare: A cross-sectional study",
        "publication": "Heliyon",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Background: The convergence of healthcare and artificial intelligence (AI) introduces a transformative era in medical practice. However, the knowledge and attitudes of healthcare workers concerning the adoption of artificial intelligence in healthcare are currently unknown. Aims: The primary objective was to investigate the knowledge and attitudes of healthcare professionals in Dhaka city, Bangladesh, regarding the adoption of AI in healthcare. Methods: A cross-sectional research design was employed, incorporating a dual-method approach to select participants using randomness and convenience sampling techniques. Validity was ensured through a literature review, content validity, and reliability assessment (Cronbach's alpha = 0.85), and exploratory factor analysis identified robust underlying factors. Data analysis involved descriptive and inferential statistics, including Fisher's exact tests, multivariate logistic regression, and Pearson correlation analysis, conducted using STATA software, providing a comprehensive understanding of healthcare workers' AI adoption in healthcare. Results: This study revealed that age was a significant factor, with individuals aged 18–25 and 26–35 having higher odds of good knowledge and positive attitudes (AOR 1.56, 95 % CI 1.12–2.43; AOR 1.42, 95 % CI 0.98–2.34). Physicians (AOR 1.08, 95 % CI 0.78–1.89), hospital workers (AOR 1.29, 95 % CI 0.92–2.09), and full-time employees (AOR 1.45, 95 % CI 1.12–2.34) exhibited higher odds. Attending AI conferences (AOR 1.27, 95 % CI 0.92–2.23) and learning through research articles/journals (AOR 1.31, 95 % CI 0.98–2.09) were positively associated with good knowledge and positive attitudes. This research also emphasized the strong correlations between knowledge and positive attitudes (r = 0.89, P < 0.001), as well as negative attitudes with poor knowledge (r = 0.65, P < 0.001). Conclusions: The study highlights the critical need for targeted educational interventions to bridge the knowledge gaps among healthcare professionals regarding AI adoption. The findings reveal that younger healthcare workers, those in full-time employment, and individuals with exposure to AI through conferences or research are more likely to possess good knowledge and hold positive attitudes towards AI integration. These results suggest that policies and training programs must be tailored to address specific demographic differences, ensuring that all groups are equipped to engage with AI technologies. Moreover, the study emphasizes the importance of continuous professional development, which could foster a workforce capable of harnessing AI's potential to improve patient outcomes and healthcare efficiency.",
        "DOI": "10.1016/j.heliyon.2024.e40775",
        "paper_author": "Khan Rony M.K.",
        "affiliation_name": "Bangladesh Open University",
        "affiliation_city": "Gazipur",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60018716",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The relationship between artificial intelligence and low-skilled employment in South Africa",
        "publication": "Heliyon",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "As artificial intelligence (AI) continues to advance, its impact on employment is a topic of concern. In South Africa, where low-skilled labor forms a significant portion of the workforce, the integration of AI technologies raises questions about the future of employment opportunities and economic stability. This manuscript explores the relationship between AI adoption, low-skilled employment dynamics, and its implications using key economic indicators such as inflation, interest rates, and foreign direct investment (FDI). Employing the Vector Error Correction Model (VECM) approach from 2012Q1 to 2021Q4, the study's findings reveal a significant negative correlation between artificial intelligence and low-skilled employment in the long run. Granger causality tests reveal directional relationships, with AI investment unidirectionally causing low-skilled employment. As a policy implication, this study recommends implementing training programs to equip workers with the necessary skills to adapt to the evolving job market influenced by technological advancements. Additionally, it suggests monitoring the implementation of AI technologies and establishing policies to mitigate labor market disruptions.",
        "DOI": "10.1016/j.heliyon.2024.e40640",
        "paper_author": "Giwa F.",
        "affiliation_name": "College of Business and Economics",
        "affiliation_city": "Johannesburg",
        "affiliation_country": "South Africa",
        "affiliation_id": "60197573",
        "affiliation_state": "Gauteng"
    },
    {
        "paper_title": "Elevating e-government: Unleashing the power of AI and IoT for enhanced public services",
        "publication": "Heliyon",
        "citied_by": "1",
        "cover_date": "2024-12-15",
        "Abstract": "This study aims to explore how e-government services can be enhanced through the application of artificial intelligence (AI) and the Internet of Things (IoT). Specifically, it seeks to identify key themes, trends, challenges, and opportunities surrounding the integration of AI and IoT technologies in e-government, with a focus on understanding their implications for service delivery, governance practices, and citizen engagement. A systematic review approach was employed to analyze scholarly articles published between 2014 and 2024, sourced from various academic databases. The review encompassed studies exploring the adoption, implementation, and impact of AI and IoT in e-government contexts. Content analysis, thematic synthesis, and theoretical frameworks were utilized to distill insights and draw conclusions from the literature. The analysis revealed several important findings regarding the role of AI and IoT in enhancing e-government services. Key themes identified include the potential of AI and IoT to improve decision-making processes, optimize service delivery, and foster citizen engagement. However, challenges such as data privacy concerns, ethical considerations, and socioeconomic disparities in access were also identified. The study provides theoretical insights into the evolving landscape of digital governance and offers practical recommendations for policymakers and practitioners. This study contributes to the existing literature by offering a comprehensive analysis of the implications of AI and IoT adoption for e-government practices. It synthesizes findings from a diverse range of scholarly articles, providing insights into the complexities of digital transformation in the public sector. Theoretical frameworks such as ethical AI principles and digital governance models are employed to elucidate the implications of AI and IoT integration for public administration and governance. The findings of this study hold significant value for scholars, policymakers, and practitioners interested in understanding the impact of AI and IoT on e-government services. By highlighting key themes, trends, challenges, and opportunities, this study informs evidence-based decision-making and guides future research and policy development in the field of digital governance. Ultimately, it contributes to the advancement of knowledge and practice in leveraging AI and IoT technologies to enhance e-government services in the digital age.",
        "DOI": "10.1016/j.heliyon.2024.e40591",
        "paper_author": "Al-Ansi A.M.",
        "affiliation_name": "Dhofar University",
        "affiliation_city": "Salalah",
        "affiliation_country": "Oman",
        "affiliation_id": "60071776",
        "affiliation_state": "Dhofar"
    },
    {
        "paper_title": "How often are patients recording their healthcare consultations in Australia and why? An online survey",
        "publication": "PEC Innovation",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Purpose: Recording important healthcare consultations can benefit patients. Technological developments enable recordings by patients and health professionals, as well as real-time ‘listening’ by AI scribes. Not enough is known about whether and why patients record their consultations. Objective: To investigate people's experiences and preferences regarding consultation recording in Australia. Methods: A 21-item online survey available for all Australians aged 18+ was distributed via social media and professional networks in 2022. Items explored recording behaviour (past and planned), and reasons for recording and sharing. Quantitative data were analysed descriptively; qualitative content analysis was used to analyse open-text items. Results: A total of 486 responses were received, of which 236 responses were analysed. Of these, 26 % had openly recorded a healthcare consultation, and 15 % had recorded covertly. The majority (71 %) of participants would consider recording a visit and would like their clinic to allow this (56 %). Participants strongly opposed the idea of sharing a recording on social media (84 %). Open-text responses indicated participants valued the health professional's consent, and protecting their own privacy by not oversharing recordings. Conclusion: Recording of consultations in Australia is common, usually to enhance patients' knowledge, understanding, and participation in their care. Patients value the possibility of recording, especially when they are experiencing vulnerability. Recording can help people navigate the impacts of disability and barriers to information access. Privacy and fairness remain paramount. Innovation: This is the first survey of recording practices in Australia and is highly-relevant given recent technological developments. The findings indicate that changes in policy, law and technologies themselves are needed, to clarify parties' rights and responsibilities and to ensure the benefits of consultation recording are realised.",
        "DOI": "10.1016/j.pecinn.2024.100355",
        "paper_author": "Prictor M.",
        "affiliation_name": "Melbourne Law School",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60112738",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Expediting decarbonization in energy, waste, and water sector through digitalization in sustainable smart cities (SSC): Case-studies in Malaysia and China based on Industry 5.0 paradigm",
        "publication": "Sustainable Cities and Society",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "This work explores the application of Industry 5.0 principles in smart cities development in Malaysia and China, focusing on digital transformation for sustainable urban development. The study presents case-studies from both the countries, highlighting the implementation strategies, challenges, and outcomes associated with integrating advanced technologies to enhance efficiency, climate resilience, and sustainability. This study aims to develop a data-driven methodology to address the absence of region-specific frameworks for sustainable smart cities (SSCs) and to evaluate their impacts. In Malaysia, the implementation of smart energy management systems that utilize IoT and AI has shown promise in reducing carbon footprints and maximizing resource efficiency. China's focus on smart water management using sensor networks and real-time data analytics provides insights into effective water conservation. Smart waste management systems have increased recycling rates by 20–30 %. Progress is crucial for the region's pursuit of SSCs to reach a global investment of USD 2.5 trillion by 2025. This work concludes by discussing the implications of this work in both countries to achieve sustainable urbanization through Industry 5.0 technologies. This work offers recommendations for policymakers, urban planners, and technologists to navigate the complexities of smart city development, while providing a roadmap to leverage digital transformation to achieve decarbonization goals in energy, waste and water sector by 2060.",
        "DOI": "10.1016/j.scs.2024.105969",
        "paper_author": "Goh K.C.",
        "affiliation_name": "Universiti Tun Hussein Onn Malaysia",
        "affiliation_city": "Batu Pahat",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60090656",
        "affiliation_state": "Johor"
    },
    {
        "paper_title": "From theory to practice: Harmonizing taxonomies of trustworthy AI",
        "publication": "Health Policy OPEN",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "The increasing capabilities of AI pose new risks and vulnerabilities for organizations and decision makers. Several trustworthy AI frameworks have been created by U.S. federal agencies and international organizations to outline the principles to which AI systems must adhere for their use to be considered responsible. Different trustworthy AI frameworks reflect the priorities and perspectives of different stakeholders, and there is no consensus on a single framework yet. We evaluate the leading frameworks and provide a holistic perspective on trustworthy AI values, allowing federal agencies to create agency-specific trustworthy AI strategies that account for unique institutional needs and priorities. We apply this approach to the Department of Veterans Affairs, an entity with largest health care system in US. Further, we contextualize our framework from the perspective of the federal government on how to leverage existing trustworthy AI frameworks to develop a set of guiding principles that can provide the foundation for an agency to design, develop, acquire, and use AI systems in a manner that simultaneously fosters trust and confidence and meets the requirements of established laws and regulations.",
        "DOI": "10.1016/j.hpopen.2024.100128",
        "paper_author": "Makridis C.A.",
        "affiliation_name": "U.S. Department of Veterans Affairs",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60023695",
        "affiliation_state": "DC"
    },
    {
        "paper_title": "Prediction of dynamic behaviors of vibrational-powered electromagnetic generators: Synergies between analytical and artificial intelligence modelling",
        "publication": "Applied Energy",
        "citied_by": "3",
        "cover_date": "2024-12-15",
        "Abstract": "The electric efficiency of vibrational electromagnetic generators is highly dependent on their ability to ensure effective adaptability to uncertain and irregular dynamics of mechanical energy sources. Such adaptive ability demands a planning operation considering future information of the highly nonlinear dynamics of these generators and mechanical excitations patterns. High accurate energy predictions are then mandatory for high energy generation efficiencies. However, on the one hand, high prediction accuracy by analytical modelling from first principles requires high modelling complexity; on the other hand, artificial intelligence models ensuring high prediction accuracy have not yet been explored to enhance the performance of these generators, even though their pre-training holds potential to significantly reduce the energy production costs. We here provide a multifaceted study highlighting the synergies between analytical and artificial intelligence modelling for optimizing the efficiency of vibrational-powered electromagnetic generators. Two main innovations are introduced: (1) development and experimental validation of a time-series forecasting artificial intelligence model based on the deep deterministic policy gradient method; (2) validation of a pre-training scenario by analytical modelling ⟶ artificial intelligence modelling synergy. Both the analytical and artificial intelligence models were able to provide high prediction accuracies to periodic and random 3D motions combining translations and rotations. Moreover, the pre-training scenario, using simulation training data sets, ensures prediction accuracies within the ±20% absolute error surfaces, profiling approximately normal distributions centered at approximately null error. These are impacting results in the scope of vibrational electromagnetic generation, holding potential to be extended to innovative self-adaptive electromagnetic generators, including those with ability to absorb complex 6 DOF external mechanical excitations. Besides, it can support the implementation of high-performance AI modelling ⟶ analytical modelling synergies, aiming to re-parameterize the high complex analytical models throughout the EMG operation, such that a superior controllability of the adaptive systems can be achieved.",
        "DOI": "10.1016/j.apenergy.2024.124302",
        "paper_author": "Vidal J.V.",
        "affiliation_name": "CICECO – Instituto de Materiais de Aveiro",
        "affiliation_city": "Aveiro",
        "affiliation_country": "Portugal",
        "affiliation_id": "60013980",
        "affiliation_state": "Aveiro"
    },
    {
        "paper_title": "The Influence of Artificial Intelligence on South Africa’s Tourism Sector: A Review and Path Forward",
        "publication": "International Conference on Multidisciplinary Research",
        "citied_by": "0",
        "cover_date": "2024-12-12",
        "Abstract": "Tourism is a vital economic sector in South Africa, attracting a large number of visitors who come to experience the diverse range of tourist attractions the country has to offer. In its efforts to achieve sustainability and competitiveness, the industry is incorporating Artificial Intelligence (AI) into its operations. This review explores the transformative role of AI in South Africa's tourism sector, highlighting both current applications and future potential. This paper aims to illustrate how AI enhances the tourist experience and operational efficiency. Furthermore, it will map the way forward by identifying challenges and proposing strategic initiatives for stakeholders to harness AI's full potential in promoting sustainable tourism growth. A qualitative approach was employed in reviewing thirty articles published in peer-reviewed journals. The results indicate that AI has a significant potential to enhance the competitiveness of the tourism sector in South Africa. However, the integration of AI into the tourism sector might have a plethora of problems such as data privacy concerns, the fear of retrenchments and worker disenfranchisement. The paper suggests that significant measures are required to maximise the potential benefits of AI. The paper proposes collaboration between tech companies and tourism operators and the development of technology pro-policy initiatives to support AI integration. Further research is necessary to explore strategies for mitigating any adverse effects of AI in tourism, with a focus on boosting job opportunities and improving the socioeconomic welfare of all stakeholders in the sector.",
        "DOI": "10.26803/MyRes.2024.17",
        "paper_author": "Phoofolo T.",
        "affiliation_name": "University of KwaZulu-Natal",
        "affiliation_city": "Durban",
        "affiliation_country": "South Africa",
        "affiliation_id": "60010499",
        "affiliation_state": "KwaZulu-Natal"
    },
    {
        "paper_title": "Better data sets won’t solve the problem — we need AI for Africa to be developed in Africa",
        "publication": "Nature",
        "citied_by": "0",
        "cover_date": "2024-12-12",
        "Abstract": "Language models developed by big technology companies consistently underperform in African languages. It’s time to focus on local solutions.",
        "DOI": "10.1038/d41586-024-03988-w",
        "paper_author": "Moorosi N.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Evolving AI in Agriculture Value Chain",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2024-12-10",
        "Abstract": "Digital agricultural technologies (DA) have the potential to improve agriculture's complex operational inefficiencies, which are a major drag on the Indian economy. We examine and put together the research that is currently accessible on digital agriculture in India and project its revolutionary potential over the next ten years. A continuous transition from individual farms to the entire value chain is taking place thanks to agritech's ability to enable innovation at numerous points along value chains. Information and communication technology-based solutions are giving way to the Internet of Things and services that are enabled by artificial intelligence and machine learning in this industry. India's governmental policy reveals evidence of extensive collaboration and investment in the field, with a clear emphasis on the growth of data infrastructure. We identify the main determinants of DA's success in India as being smallholder dominance, diversity in production systems, the dominance of commodity crops, proximity to metropolitan markets, and state policy. A digital transformation of Indian agriculture is strongly suggested by the review of the technologies already available and their implementations by the public sector, tech giants, information technology leaders, and agri-food tech entrepreneurs in India.",
        "DOI": "10.1063/5.0245204",
        "paper_author": "Doifode A.",
        "affiliation_name": "Symbiosis School of Banking &amp; Finance",
        "affiliation_city": "Pune",
        "affiliation_country": "India",
        "affiliation_id": "60117483",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "Fact-checking information from large language models can decrease headline discernment",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "0",
        "cover_date": "2024-12-10",
        "Abstract": "Fact checking can be an effective strategy against misinformation, but its implementation at scale is impeded by the overwhelming volume of information online. Recent AI language models have shown impressive ability in fact-checking tasks, but how humans interact with fact-checking information provided by these models is unclear. Here, we investigate the impact of fact-checking information generated by a popular large language model (LLM) on belief in, and sharing intent of, political news headlines in a preregistered randomized control experiment. Although the LLM accurately identifies most false headlines (90%), we find that this information does not significantly improve participants' ability to discern headline accuracy or share accurate news. In contrast, viewing human-generated fact checks enhances discernment in both cases. Subsequent analysis reveals that the AI fact-checker is harmful in specific cases: It decreases beliefs in true headlines that it mislabels as false and increases beliefs in false headlines that it is unsure about. On the positive side, AI fact-checking information increases the sharing intent for correctly labeled true headlines. When participants are given the option to view LLM fact checks and choose to do so, they are significantly more likely to share both true and false news but only more likely to believe false headlines. Our findings highlight an important source of potential harm stemming from AI applications and underscore the critical need for policies to prevent or mitigate such unintended consequences.",
        "DOI": "10.1073/pnas.2322823121",
        "paper_author": "DeVerna M.R.",
        "affiliation_name": "Indiana University Bloomington",
        "affiliation_city": "Bloomington",
        "affiliation_country": "United States",
        "affiliation_id": "60021121",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "SUB-PLAY: Adversarial Policies against Partially Observed Multi-Agent Reinforcement Learning Systems",
        "publication": "CCS 2024 - Proceedings of the 2024 ACM SIGSAC Conference on Computer and Communications Security",
        "citied_by": "0",
        "cover_date": "2024-12-09",
        "Abstract": "Recent advancements in multi-agent reinforcement learning (MARL) have opened up vast application prospects, such as swarm control of drones, collaborative manipulation by robotic arms, and multi-target encirclement. However, potential security threats during the MARL deployment need more attention and thorough investigation. Recent research reveals that attackers can rapidly exploit the victim’s vulnerabilities, generating adversarial policies that result in the failure of specific tasks. For instance, reducing the winning rate of a superhuman-level Go AI to around 20%. Existing studies predominantly focus on two-player competitive environments, assuming attackers possess complete global state observation. In this study, we unveil, for the first time, the capability of attackers to generate adversarial policies even when restricted to partial observations of the victims in multi-agent competitive environments. Specifically, we propose a novel black-box attack (SUB-PLAY) that incorporates the concept of constructing multiple subgames to mitigate the impact of partial observability and suggests sharing transitions among subpolicies to improve attackers’ exploitative ability. Extensive evaluations demonstrate the effectiveness of SUB-PLAY under three typical partial observability limitations. Visualization results indicate that adversarial policies induce significantly different activations of the victims’ policy networks. Furthermore, we evaluate three potential defenses aimed at exploring ways to mitigate security threats posed by adversarial policies, providing constructive recommendations for deploying MARL in competitive environments.",
        "DOI": "10.1145/3658644.3670293",
        "paper_author": "Ma O.",
        "affiliation_name": "Zhejiang University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60003970",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "On the Detectability of ChatGPT Content: Benchmarking, Methodology, and Evaluation Through the Lens of Academic Writing",
        "publication": "CCS 2024 - Proceedings of the 2024 ACM SIGSAC Conference on Computer and Communications Security",
        "citied_by": "0",
        "cover_date": "2024-12-09",
        "Abstract": "With ChatGPT under the spotlight, utilizing large language models (LLMs) to assist academic writing has drawn a significant amount of debate in the community. In this paper, we aim to present a comprehensive study of the detectability of ChatGPT-generated content within the academic literature, particularly focusing on the abstracts of scientific papers, to offer holistic support for the future development of LLM applications and policies in academia. Specifically, we first present GPABench2, a benchmarking dataset of over 2.8 million comparative samples of human-written, GPT-written, GPT-completed, and GPT-polished abstracts of scientific writing in computer science, physics, and humanities and social sciences. Second, we explore the methodology for detecting ChatGPT content. We start by examining the unsatisfactory performance of existing ChatGPT detecting tools and the challenges faced by human evaluators (including more than 240 researchers or students). We then test the hand-crafted linguistic features models as a baseline and develop a deep neural framework named CheckGPT to better capture the subtle and deep semantic and linguistic patterns in ChatGPT written literature. Last, we conduct comprehensive experiments to validate the proposed CheckGPT framework in each benchmarking task over different disciplines. To evaluate the detectability of ChatGPT content, we conduct extensive experiments on the transferability, prompt engineering, and robustness of CheckGPT.",
        "DOI": "10.1145/3658644.3670392",
        "paper_author": "Liu Z.",
        "affiliation_name": "University of Kansas",
        "affiliation_city": "Lawrence",
        "affiliation_country": "United States",
        "affiliation_id": "60015457",
        "affiliation_state": "KS"
    },
    {
        "paper_title": "Responsible artificial intelligence in Africa: towards policy learning",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-09",
        "Abstract": "Several African countries are developing artificial intelligence (AI) strategies and ethics frameworks with the goal of accelerating responsible AI development and adoption. However, many of these governance actions are emerging without consideration for their suitability to local contexts, including whether the proposed policies are feasible to implement and what their impact may be on regulatory outcomes. In response, we suggest that there is a need for more explicit policy learning, by looking at existing governance capabilities and experiences related to algorithms, automation, data, and digital technology in other countries and in adjacent sectors. From such learning, it will be possible to identify where existing capabilities may be adapted or strengthened to address current AI-related opportunities and risks. This paper explores the potential for learning by analysing existing policy and legislation in twelve African countries across three main areas: strategy and multi-stakeholder engagement, human dignity and autonomy, and sector-specific governance. The findings point to a variety of existing capabilities that could be relevant to responsible AI; from existing model management procedures used in banking and air quality assessment to efforts aimed at enhancing public sector skills and transparency around public–private partnerships, and the way in which existing electronic transactions legislation addresses accountability and human oversight. All of these point to the benefit of wider engagement on how existing governance mechanisms are working, and on where AI-specific adjustments or new instruments may be needed.",
        "DOI": "10.1017/dap.2024.60",
        "paper_author": "Plantinga P.",
        "affiliation_name": "Human Sciences Research Council of South Africa",
        "affiliation_city": "Pretoria",
        "affiliation_country": "South Africa",
        "affiliation_id": "60015399",
        "affiliation_state": "Gauteng"
    },
    {
        "paper_title": "AI innovation in healthcare and state platforms under a rights-based perspective: The case of Brazillian RNDS",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-09",
        "Abstract": "This article examines the National Health Data Network (RNDS), the platform launched by the Ministry of Health in Brazil as the primary tool for its Digital Health Strategy 2020-2028, including innovation aspects. The analysis is made through two distinct frameworks: Right to health and personal data protection in Brazil. The first approach is rooted in the legal framework shaped by Brazil's trajectory on health since 1988, marked by the formal acknowledgment of the Right to health and the establishment of the Unified Health System, Brazil's universal access health system, encompassing public healthcare and public health actions. The second approach stems from the repercussions of the General Data Protection Law, enacted in 2018 and the inclusion of Right to personal data protection in Brazilian's Constitution. This legislation, akin to the EU's General Data Protection Regulations, addressed the gap in personal data protection in Brazil and established principles and rules for data processing. The article begins by explanting the two approaches, and then it provides a brief history of health informatics policies in Brazil, leading to the current Digital Health Strategy and the RNDS. Subsequently, it delves into an analysis of the RNDS through the lenses of the two aforementioned approaches. In the final discussion sections, the article attempts to extract lessons from the analyses, particularly in light of ongoing discussions such as the secondary use of data for innovation in the context of different interpretations about innovation policies.",
        "DOI": "10.1017/dap.2024.70",
        "paper_author": "Falcão M.Z.",
        "affiliation_name": "University of Ottawa",
        "affiliation_city": "Ottawa",
        "affiliation_country": "Canada",
        "affiliation_id": "60028897",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Organic or Diffused: Can We Distinguish Human Art from AI-generated Images?",
        "publication": "CCS 2024 - Proceedings of the 2024 ACM SIGSAC Conference on Computer and Communications Security",
        "citied_by": "1",
        "cover_date": "2024-12-09",
        "Abstract": "The advent of generative AI images has completely disrupted the art world. Distinguishing AI generated images from human art is a challenging problem whose impact is growing over time. A failure to address this problem allows bad actors to defraud individuals paying a premium for human art and companies whose stated policies forbid AI imagery. It is also critical for content owners to establish copyright, and for model trainers interested in curating training data in order to avoid potential model collapse. There are several different approaches to distinguishing human art from AI images, including classifiers trained by supervised learning, research tools targeting diffusion models, and identification by professional artists using their knowledge of artistic techniques. In this paper, we seek to understand how well these approaches can perform against today’s modern generative models in both benign and adversarial settings. We curate real human art across 7 styles, generate matching images from 5 generative models, and apply 8 detectors (5 automated detectors and 3 different human groups including 180 crowdworkers, 3800+ professional artists, and 13 expert artists experienced at detecting AI). Both Hive and expert artists do very well, but make mistakes in different ways (Hive is weaker against adversarial perturbations while Expert artists produce higher false positives). We believe these weaknesses will persist, and argue that a combination of human and automated detectors provides the best combination of accuracy and robustness.",
        "DOI": "10.1145/3658644.3670306",
        "paper_author": "Jeong Ha A.Y.",
        "affiliation_name": "The University of Chicago",
        "affiliation_city": "Chicago",
        "affiliation_country": "United States",
        "affiliation_id": "60029278",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "Artificial Intelligence in Higher Education: Examining the AI Policy Landscape at U.S. Institutions",
        "publication": "Proceedings of 25th Annual Conference on Information Technology Education, SIGITE 2024",
        "citied_by": "0",
        "cover_date": "2024-12-08",
        "Abstract": "Addressing a critical need for comprehensive policy development in the area of Artificial Intelligence in Education (AIED), this exploratory study investigates the prevalence and characteristics of emerging AI policies across U.S. higher education institutions. Through a close review of AI policies from a stratified random sample of four-year institutions across the country, variations in policy adoption were examined across different institution types. Official online policy-related resources provided for campus-wide use were observable in less than half of U.S. institutions, and large discrepancies in the quality and quantity of policy guidance provided were found among existing policy resources. Significant disparities were most associated with institution type. Research-intensive universities were more likely to have provided significant AI policy resources compared to smaller institutions. The study identifies a range of policy providers and highlights diverse approaches to AI use, ethical guidelines, and target audiences, which reflect different combinations and degrees of leadership, institutional cultures, resources, and individual initiatives. Considering the social impacts of technologies, these varied results underscore the necessity for a standardized and well-structured policy framework to ensure effective and ethical AI integration in higher education. The lack of consistency in existing policy practices, especially in light of emerging ethical considerations, calls for urgent, multi-disciplinary policy development to harness AI’s potential while mitigating its risks. Implications for future AI policy research, development, and application are discussed.",
        "DOI": "10.1145/3686852.3687076",
        "paper_author": "Kim D.",
        "affiliation_name": "University of Toronto",
        "affiliation_city": "Toronto",
        "affiliation_country": "Canada",
        "affiliation_id": "60016849",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Transformation of Education in the Digital Age: Theory and Practice of Constructing a Digital University and Lifelong Learning System",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-06",
        "Abstract": "In the digital age, the field of education is undergoing unprecedented transformation, the innovation in educational models prompted educational institutions to rapidly adopt digital technologies to meet the challenges of modernizing education. This article delves into the importance of digital transformation in education, analyzing how emerging technologies such as AI, VR, and big data reshape educational models and learning methods while providing innovative approaches to addressing educational inequality. The article takes an international perspective on the trend of digital education, particularly focusing on the national strategic actions for the digitalization of education proposed by the Chinese government to improve the quality of education, promote educational equity and build a lifelong learning society. The article first outlines the theoretical framework of a digital university, emphasizing the key roles of openness, diversity, personalization, and intelligence in constructing a lifelong learning system. Subsequently, it proposes a framework for constructing a digital archive of lifelong learning, covering concepts such as micro-certificates, micro-courses, digital badges, and credit banks. It explores how these concepts facilitate the sharing of educational resources and the certification of learning outcomes. After analyzing the policy support and practical cases of open education digitalization, the article points out current challenges, including data security, privacy protection, inter-departmental cooperation, and students’ awareness and use of digital archives. In response to these issues, the article presents a series of countermeasures, including establishing strict data management systems, promoting the formulation of international standards, and introducing advanced intelligent assessment models. Finally, the article offers a glimpse into the future of digital education, predicting how lifelong learning digital archives will achieve data intelligence, comprehensive learning records, and cross-platform interconnection, and become vital support for certification and career development. The article calls for concerted efforts from the global education community to build a more equitable, efficient, and personalized education system.",
        "DOI": "10.1145/3696230.3696260",
        "paper_author": "Zhang X.B.",
        "affiliation_name": "The Open University of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "132077007",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Legal Innovation in Religious Courts: The Potential Utilization of Artificial Intelligence (AI) in Resolving Contemporary Cases",
        "publication": "MILRev: Metro Islamic Law Review",
        "citied_by": "0",
        "cover_date": "2024-12-06",
        "Abstract": "Religious courts face complex challenges in resolving contemporary cases, such as marital disputes, inheritance distribution, and conflicts in Sharia-based economic matters. In the digital era, Artificial Intelligence (AI) offers innovative solutions to enhance the efficiency and accuracy of legal processes. This study employs a qualitative method with a descriptive-analytical approach to explore the potential use of AI in religious courts. Data was collected through literature reviews and document analysis, focusing on AI applications in inheritance calculations based on Islamic faraidh law, virtual dispute mediation, and Sharia contract analysis. The analysis follows the Miles and Huberman framework, involving data reduction, display, and conclusion drawing. Data validation was carried out through source triangulation to ensure the accuracy and credibility of the findings. The research findings reveal that AI can support digitalizing legal processes in religious courts, such as managing electronic documents, predicting rulings based on legal precedents, and monitoring compliance with sharia principles. Additionally, AI can potentially improve the efficiency of dispute mediation through digital platforms and facilitate automated inheritance calculations in line with Islamic law. However, implementing AI presents challenges, including inadequate regulations, potential algorithmic bias, and compatibility with Islamic legal values. This study’s academic contribution provides a new perspective on integrating modern technology with Islamic law, particularly within the religious court system. The findings are expected to serve as a foundation for developing strategic policies to support AI implementation in Islamic legal systems, addressing societal needs in the contemporary era.",
        "DOI": "10.32332/milrev.v3i2.8199",
        "paper_author": "Sukindar ",
        "affiliation_name": "Universitas 17 Agustus 1945 Samarinda",
        "affiliation_city": "Samarinda",
        "affiliation_country": "Indonesia",
        "affiliation_id": "120605971",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "THE TRANSFORMATIVE IMPACT OF AI ON CSR, ESG, AND SUSTAINABILITY: CRITICAL REVIEW AND CASE STUDIES",
        "publication": "International Finance Review",
        "citied_by": "0",
        "cover_date": "2024-12-06",
        "Abstract": "In this chapter, the utilization of Artificial Intelligence (AI) and Machine Learning (ML) tools, improved by human expertise, offers a detailed investigation into their transformative effects on Corporate Social Responsibility (CSR), Environmental, Social, and Governance (ESG) standards, and sustainability. Initial insights and structural foundations were developed using AI, specifically utilizing ChatGPT-4, with the author significantly enhancing the content through in-depth academic research and analysis. This synergistic approach provides a holistic view of AI and ML’s role in promoting ethical business practices, improving sustainability reporting efficiency, and facilitating informed decision-making within CSR and ESG frameworks. Incorporating extensively verified and expanded real-world examples, the work delves into the practical applications of these technologies and addresses the ethical considerations they raise. This collaboration highlights the evolving role of AI in research and emphasizes the critical importance of integrating AI-generated insights with scholarly research to drive forward sustainable and socially responsible corporate strategies and policies.",
        "DOI": "10.1108/S1569-376720240000023012",
        "paper_author": "Ozkan B.",
        "affiliation_name": "Temple University",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60030398",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Digital agriculture: Integrating IoT and AI for sustainable food production",
        "publication": "Agriculture 4.0: Smart Farming with IoT and Artificial Intelligence",
        "citied_by": "0",
        "cover_date": "2024-12-06",
        "Abstract": "In order to better understand the revolutionary potential of digital agriculture, this chapter examines how Internet of Things (IoT) and artificial intelligence (AI) technologies are being integrated into the field of sustainable food production. The notion of digital agriculture is first presented, along with its applicability in tackling the pressing issues of environmental sustainability, resource conservation, and global food security. A major force behind innovation in agriculture, the confluence of IoT and AI is said to provide data-driven insights and decision-making tools that optimise anything from livestock operations to crop management. We emphasize the pivotal role of sustainability in modern agriculture, showcasing how digital technologies contribute to minimizing waste, conserving resources, and reducing environmental impacts. The chapter provides an in-depth examination of IoT technologies, emphasizing the importance of sensor deployment and data collection for real¬time monitoring and control. AI applications are explored in depth, from predictive analytics to automation, demonstrating how they empower farmers to make informed decisions and streamline operations. We showcase practical implementations through case studies, illustrating how IoT and AI have enhanced crop management, livestock farming, and pest/disease control. Challenges and risks associated with digital agriculture are also examined, underscoring the importance of data security and ethical considerations. In the ever-evolving landscape of agriculture, we conclude by outlining future trends and innovations, as well as policy and regulatory considerations. Our exploration serves as a holistic roadmap, encouraging stakeholders to harness the potential of digital agriculture for a more sustainable, efficient, and secure global food production system.",
        "DOI": "NA",
        "paper_author": "Singh B.K.",
        "affiliation_name": "College of Horticulture &amp; Forestry",
        "affiliation_city": "Kumarganj, U.P.",
        "affiliation_country": "India",
        "affiliation_id": "131756212",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Revolutionizing agriculture with IoT and artificial intelligence",
        "publication": "Agriculture 4.0: Smart Farming with IoT and Artificial Intelligence",
        "citied_by": "0",
        "cover_date": "2024-12-06",
        "Abstract": "In today's rapidly evolving agricultural landscape, the convergence of Internet of Things (IoT) and Artificial Intelligence (AI) technologies is ushering in a profound transformation.The present document delves into the diverse effects of IoT and AI in the field of agriculture, highlighting its crucial functions in promoting intelligent farming methods and transforming conventional techniques. It explores the fundamental elements of this revolution, beginning with the widespread use of sensors and data- gathering tools that allow for the real-time monitoring of several agricultural indicators. These data streams provide farmers with practical insights to improve animal health, manage crops more effectively, and allocate resources more efficiently when combined with cutting-edge data analytics and decision support tools. Artificial intelligence (AI) algorithms are utilized by smart irrigation systems to guarantee accurate water consumption, and pest and disease control leverages AI's predictive power to protect crops. Beyond the farm, IoT and AI improve the quality and traceability of agricultural products by facilitating effective supply chain management and logistics. The paper looks at how these technologies are supporting ecologically conscious farming methods as sustainability gains prominence. The use of agricultural IoT and AI presents both potential and obstacles, which are illustrated with case examples of successful implementations. It also explores upcoming trends and cutting-edge technology that have the potential to significantly transform the agriculture industry. With a nod to the importance of policy and regulation, the document explores the broader implications of this technological revolution and outlines a vision for the future of agriculture, underscoring the need for harmonious integration of IoT and AI to ensure food security and sustainable agriculture on a global scale.",
        "DOI": "NA",
        "paper_author": "Srivastava A.K.",
        "affiliation_name": "DBS",
        "affiliation_city": "Kanpur",
        "affiliation_country": "India",
        "affiliation_id": "131756306",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Emerging Trends in IoT, AI and agricultural science",
        "publication": "Agriculture 4.0: Smart Farming with IoT and Artificial Intelligence",
        "citied_by": "0",
        "cover_date": "2024-12-06",
        "Abstract": "The confluence of artificial intelligence (AI), agricultural science, and the Internet of Things (IoT) has revolutionised the cultivation, management, and optimisation of agricultural operations in recent years. This examines these convergent technologies' changing environment and growing significance in contemporary agriculture. Precision agriculture, where data-driven decision-making enables farmers to maximise yields, minimise environmental impacts, and eliminate resource waste, has been ushered in by the convergence of IoT and AI. We explore the various uses of IoT in agriculture, including supply chain optimisation and resource management, as well as real-time soil monitoring and climate prediction. AI applications are revolutionising crop health assessment, pest and disease detection, and automated agricultural chores like harvesting and weeding all at the same time. We also delve into the field of livestock management, where AI and IoT guarantee the health and welfare of animals while optimising farm productivity overall. But these game-changing possibilities come with drawbacks as well, such as privacy issues, data security, and the requirement for large financial outlays. Additional levels of complexity are created by societal ramifications and ethical considerations, such as fair access to technology in rural areas. This offers case studies that demonstrate effective implementations and sheds light on the legislative and policy frameworks influencing the use of IoT and AI in agriculture. These technologies have a bright future in agriculture, as new developments and worldwide trends have the potential to improve sustainable farming methods even more.",
        "DOI": "NA",
        "paper_author": "Abuzar S.",
        "affiliation_name": "Head- Regularory Affairs APAC",
        "affiliation_city": "Rovensa Asia Sdn Bhd",
        "affiliation_country": "Malaysia",
        "affiliation_id": "131756243",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Adoption challenges and incentives for IoT and AI in agriculture",
        "publication": "Agriculture 4.0: Smart Farming with IoT and Artificial Intelligence",
        "citied_by": "0",
        "cover_date": "2024-12-06",
        "Abstract": "Agriculture could undergo a significant transformation if IoT and AI technologies are adopted, but there are special obstacles to overcome and the correct incentives must be in place for this to happen. The complex terrain of IoT and AI adoption in agriculture, exploring the obstacles to its advancement and the rewards that propel its expansion. Farmers face a number of difficulties as a result of the quick advancement of technology, including limited resources, low digital literacy, inadequate infrastructure, and worries about data security and privacy. These problems are made worse by resistance to changing traditional farming methods. Adoption of IoT and AI, however, has several advantages, including improved efficiency, favourable effects on the environment, and economic gains. Additionally, these technologies are essential for solving global agricultural problems and guaranteeing food security. Government assistance and policy efforts are important motivators because they can offer funding, training, and the establishment of a legal framework that promotes the adoption of new technologies. Innovation in the industry is further encouraged by research and knowledge exchange. In order to effectively overcome these adoption hurdles, a comprehensive strategy is required, encompassing publicprivate partnerships, extensive education and training, and international collaboration and information exchange. Adoption of technology must also take ethics into account. In order to demonstrate the revolutionary possibilities of IoT and AI in agriculture, case studies of effective adoption initiatives are investigated, providing insight into their favourable results and the lessons discovered. In the end, as agriculture develops further, (Vadivelu et al., 2023)the secret to realising the full potential of IoT and AI in farming and opening the door to a more technologically sophisticated, efficient, and sustainable future in agriculture is to strike a balance between these obstacles and favourable incentives.",
        "DOI": "NA",
        "paper_author": "Ansari M.N.",
        "affiliation_name": "College of Agriculture",
        "affiliation_city": "Bihar",
        "affiliation_country": "India",
        "affiliation_id": "131756277",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Ethical Implications of Gen-AI and LLMs in Computing Education",
        "publication": "SIGCSE Virtual 2024 - Proceedings of the 2024 ACM Virtual Global Computing Education Conference V. 2",
        "citied_by": "0",
        "cover_date": "2024-12-05",
        "Abstract": "The panel convenes five educators to discuss the ethical implications of utilising Generative AI (Gen-AI) and Large Language Models (LLMs) in computing education. Their expertise spans various domains, including organising national workshops on the implications of generative AI tools, conducting surveys on their use within curricula, implementing institutional policies related to technology use, and engaging with students directly in the classroom. They reflect on the evolution of Gen-AI and LLMs from challenging-to-use technologies to indispensable tools for users of all levels. Furthermore, they examine the ethical dilemmas arising from the widespread adoption of these technologies in educational contexts, particularly regarding issues of originality, integrity, and responsible use. In addition, they explore practical strategies for integrating ethics education into computing curriculum design and classroom practices. This includes discussions on the role of educators in guiding students towards ethical technology usage, addressing uncertainties surrounding Gen-AI tools, and fostering a culture of responsible innovation within educational institutions. Through their collective insights and experiences, the panel aims to provide recommendations for navigating the ethical complexities inherent in the integration of Gen-AI technologies into computing education curricula.",
        "DOI": "10.1145/3649409.3691074",
        "paper_author": "Zarb M.",
        "affiliation_name": "Robert Gordon University",
        "affiliation_city": "Aberdeen",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60011885",
        "affiliation_state": "Scotland"
    },
    {
        "paper_title": "The use and effect of artificial intelligence in decision-making processes in municipalities: A literature review",
        "publication": "Digital Transformation in Public Administration: Theory and Practices",
        "citied_by": "0",
        "cover_date": "2024-12-05",
        "Abstract": "Municipalities, as the local government units closest to people, have an important role in providing effective and efficient services. Today, all administrations aim to provide efficient and effective services by taking advantage of the opportunities provided by technological improvements. Smart city applications, digital transformation, 5G, and IoT technologies have been used in urban services for a while. Artificial intelligence (AI), which has come to the fore recently, stands out especially in decision-making processes. The correct use of artificial intelligence has brought about successful applications in many fields. Artificial intelligence can drastically change how public services are provided and increase governance effectiveness when it is included in municipal services. Municipalities can employ artificial intelligence in data-driven decision-making to forecast future trends based on historical data. Artificial intelligence can also be applied to urban planning, environmental health, urban transportation, and global problems, among other areas. However, by offering individualized services, enhancing communication, and customizing municipal services to each individual's needs, it is possible to boost public engagement and services. The implementation of artificial intelligence applications in municipal services can facilitate the development of effective and efficient local policies through big data management, enabling managers to make optimally beneficial judgments. It is important to evaluate how artificial intelligence can contribute to the decision-making process in municipal governments and measure its effect on decision-making processes. The aim of this study is to evaluate whether artificial intelligence can have an effect on the decision-making of municipalities for the benefit of the public and to measure its effect on optimal decision-making. In this study, a literature review on municipal governments and artificial intelligence will be conducted using the qualitative research method. Furthermore, it will be analyzed whether there are examples of best practices. The ethical principles related to the use of artificial intelligence will be reflected in the study. Finally, an overview will be obtained with the applied method and findings.",
        "DOI": "NA",
        "paper_author": "Bayraktar H.K.",
        "affiliation_name": "Kafkas Üniversitesi",
        "affiliation_city": "Kars",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60014208",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "How Do You Solve A Problem Like Recruitment? On The Hiring and Retention of Computing Academics",
        "publication": "SIGCSE Virtual 2024 - Proceedings of the 2024 ACM Virtual Global Computing Education Conference V. 1",
        "citied_by": "0",
        "cover_date": "2024-12-05",
        "Abstract": "This paper critically examines persistent inequities in existing computing faculty hiring and retention practices, which gravely impact computing educators from marginalized groups. Throughout these processes, applicants fight against multiple systemic barriers, including but not limited to, biased job ads and discriminatory interview practices. The increasing use of generative AI tools to aid in tasks connected to the hiring process, such as writing recommendation letters, exacerbates these biases. The inequities persist despite global initiatives and legal mandates and serve as a direct contradiction to widespread institutional commitments to diversity and inclusion. By building on literature and the lived experiences of the SIGCSE community represented in a recent Technical Symposium session, we raise concerns about the different stages of this process, highlighting the importance of clear expectations and adequate support. The paper concludes with a call to align hiring practices with inclusive institutional values, requiring the academic community to reflect on and revise hiring policies for a more equitable future. It is of paramount importance to address the role of these practices in the erosion of marginalized communities from the computing education community, a marginalization that occurs in many different contexts and negatively impacts everyone involved.",
        "DOI": "10.1145/3649165.3703622",
        "paper_author": "Alshaigy B.",
        "affiliation_name": "Uppsala Universitet",
        "affiliation_city": "Uppsala",
        "affiliation_country": "Sweden",
        "affiliation_id": "60003858",
        "affiliation_state": "Uppsala"
    },
    {
        "paper_title": "AI Mastery May Not Be For Everyone, But AI Literacy Should Be",
        "publication": "SIGCSE Virtual 2024 - Proceedings of the 2024 ACM Virtual Global Computing Education Conference V. 1",
        "citied_by": "0",
        "cover_date": "2024-12-05",
        "Abstract": "Despite the abundance of advice from policy bodies, professional associations, advocacy groups, and scholars on how K-12 schools should assimilate AI and provide AI education, practical plans are lacking from K-12 education leaders themselves. Education leaders must make strategic decisions about how to prepare teachers and students for an AI-infused future. Simultaneously, educators need immediate support and guidance on how to manage the arrival of tools that render some existing educational practices obsolete and prompt the need to teach new skills and awareness. Near term, it may be unrealistic to expect all students to master the ability to develop AI applications; universal AI literacy is a more feasible goal. We introduce a set of short-format, modular AI literacy courses and report how they were implemented and affected teachers' and students' knowledge and perceptions of AI. Using an online questionnaire, we collected data from 265 individuals worldwide who accessed the courses, including 190 teachers who implemented them with over 11,800 students. We conducted 17 teacher interviews to gather feedback and to better understand how courses were adapted for local contexts. Teachers reported an increase in their own and their students' knowledge of AI concepts; and increased optimism about the potential benefits of AI to society and their ability to influence the future of AI. Key takeaways are that AI literacy instruction should be designed for adaptability to local contexts and cultures and that steps should be taken to institutionalize the integration of AI literacy into the regular school curriculum.",
        "DOI": "10.1145/3649165.3690117",
        "paper_author": "Hollands F.M.",
        "affiliation_name": "EdResearcher",
        "affiliation_city": "Brewster",
        "affiliation_country": "United States",
        "affiliation_id": "132164049",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "AI in and for K-12 Informatics Education. Life after Generative AI",
        "publication": "SIGCSE Virtual 2024 - Proceedings of the 2024 ACM Virtual Global Computing Education Conference V. 2",
        "citied_by": "0",
        "cover_date": "2024-12-05",
        "Abstract": "The use and adoption of Generative AI (GenAI) has revolutionised various sectors, including computing education. However, this narrow focus comes at a cost to the wider AI in and for educational research. This working group aims to explore current trends and explore multiple sources of information to identify areas of AI research in K-12 informatics education that are being underserved but needed in the post-GenAI AI era. Our research focuses on three areas: curriculum, teacher-professional learning and policy. The denouement of this aims to identify trends and shortfalls for AI in and for K-12 informatics education. We will systematically review the current literature to identify themes and emerging trends in AI education at K-12. This will be done under two facets, curricula and teacher-professional learning. In addition, we will conduct interviews and surveys with educators and AI experts. Next, we will examine the current policy (such as the European AI Act, and European Commission guidelines on the use of AI and data in education and training as well as international counterparts). Policies are often developed by both educators and experts in the domain, thus providing a source of topics or areas that may be added to our findings. Finally, by synthesising insights from educators, AI experts, and policymakers, as well as the literature and policy, our working group seeks to highlight possible future trends and shortfalls.",
        "DOI": "10.1145/3649409.3691073",
        "paper_author": "Barendsen E.",
        "affiliation_name": "Radboud Universiteit",
        "affiliation_city": "Nijmegen",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60016529",
        "affiliation_state": "Gelderland"
    },
    {
        "paper_title": "AI for women's financial inclusion—analysis of product design and policy approaches in Nigeria",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-05",
        "Abstract": "Nigeria has a significant gender financial inclusion gap with women disproportionately represented among the financially excluded. Artificial intelligence (AI) powered financial technologies (fintech) present distinctive advantages for enhancing women’s inclusion. This includes efficiency gains, reduced transaction costs, and personalized services tailored to women’s needs. Nonetheless, AI harbours a paradox. While it promises to address financial inclusion, it can also inadvertently perpetuate and amplify gender bias. The critical question is thus, how can AI effectively address the challenges of women’s financial exclusion in Nigeria? Using publicly available data, this research undertakes a qualitative analysis of AI-powered Fintech services in Nigeria. Its objective is to understand how innovations in financial services correspond to the needs of potential users like unbanked or underserved women. The research finds that introducing innovative financial services and technology is insufficient to ensure inclusion. Financial inclusion requires the availability, accessibility, affordability, appropriateness, sustainability, and alignment of services with the needs of potential users, and policy-driven strategies that aid inclusion.",
        "DOI": "10.1017/dap.2024.62",
        "paper_author": "Omotubora A.",
        "affiliation_name": "University of Lagos",
        "affiliation_city": "Lagos",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60006448",
        "affiliation_state": "Lagos"
    },
    {
        "paper_title": "Operationalizing health data governance for AI innovation in low-resource government health systems: a practical implementation perspective from Zanzibar",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-04",
        "Abstract": "Improved health data governance is urgently needed due to the increasing use of digital technologies that facilitate the collection of health data and growing demand to use that data in artificial intelligence (AI) models that contribute to improving health outcomes. While most of the discussion around health data governance is focused on policy and regulation, we present a practical perspective. We focus on the context of low-resource government health systems, using first-hand experience of the Zanzibar health system as a specific case study, and examine three aspects of data governance: informed consent, data access and security, and data quality. We discuss the barriers to obtaining meaningful informed consent, highlighting the need for more research to determine how to effectively communicate about data and AI and to design effective consent processes. We then report on the process of introducing data access management and information security guidelines into the Zanzibar health system, demonstrating the gaps in capacity and resources that must be addressed during the implementation of a health data governance policy in a low-resource government system. Finally, we discuss the quality of service delivery data in low-resource health systems such as Zanzibar's, highlighting that a large quantity of data does not necessarily ensure its suitability for AI development. Poor data quality can be addressed to some extent through improved data governance, but the problem is inextricably linked to the weakness of a health system, and therefore AI-quality data cannot be obtained through technological or data governance measures alone.",
        "DOI": "10.1017/dap.2024.65",
        "paper_author": "Li T.",
        "affiliation_name": "D-tree International",
        "affiliation_city": "Zanzibar City",
        "affiliation_country": "Tanzania",
        "affiliation_id": "123435198",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence, digital colonialism, and the implications for Africa's future development",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-04",
        "Abstract": "In the mid to late 19th century, much of Africa was under colonial rule, with the colonisers exercising power over the labour and territory of Africa. However, as much as Africa has predominantly gained independence from traditional colonial rule, another form of colonial rule still dominates the African landscape. This similitude of these different forms of colonialism is found in the power dominance exhibited by Western technological corporations, just like the traditional colonialists. In this digital age, digital colonialism manifests in Africa through the control and ownership of critical digital infrastructure by foreign entities, leading to unequal data flow and asymmetrical power dynamics. This usually occurs under the guise of foreign corporations providing technological assistance to the continent. By drawing references from the African continent, this article examines the manifestations of digital colonialism and the factors that aid its occurrence on the continent. It further explores the manifestations of digital colonialism in technologies such as Artificial Intelligence (AI) while analysing the occurrence of data exploitation on the continent and the need for African ownership in cultivating the digital future of the African continent. The paper also recognises the benefits linked to the use of AI and makes a cautious approach toward the deployment of AI tools in Africa. It then concludes by recommending the implementation of laws, regulations, and policies that guarantee the inclusiveness, transparency, and ethical values of new technologies, with strategies toward achieving a decolonised digital future on the African continent.",
        "DOI": "10.1017/dap.2024.75",
        "paper_author": "Salami A.O.",
        "affiliation_name": "Technology Consulting and Research",
        "affiliation_city": "Lagos",
        "affiliation_country": "Nigeria",
        "affiliation_id": "129434680",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "FürElise: Capturing and Physically Synthesizing Hand Motion of Piano Performance",
        "publication": "Proceedings - SIGGRAPH Asia 2024 Conference Papers, SA 2024",
        "citied_by": "0",
        "cover_date": "2024-12-03",
        "Abstract": "Piano playing requires agile, precise, and coordinated hand control that stretches the limits of dexterity. Hand motion models with the sophistication to accurately recreate piano playing have a wide range of applications in character animation, embodied AI, biomechanics, and VR/AR. In this paper, we construct a first-of-its-kind large-scale dataset that contains approximately 10 hours of 3D hand motion and audio from 15 elite-level pianists playing 153 pieces of classical music. To capture natural performances, we designed a markerless setup in which motions are reconstructed from multiview videos using state-of-the-art pose estimation models. The motion data is further refined via inverse kinematics using the high-resolution MIDI key-pressing data obtained from sensors in a specialized Yamaha Disklavier piano. Leveraging the collected dataset, we developed a pipeline that can synthesize physically-plausible hand motions for musical scores outside of the dataset. Our approach employs a combination of imitation learning and reinforcement learning to obtain policies for physics-based bimanual control involving the interaction between hands and piano keys. To solve the sampling efficiency problem with the large motion dataset, we use a diffusion model to generate natural reference motions, which provide high-level trajectory and fingering (finger order and placement) information. However, the generated reference motion alone does not provide sufficient accuracy for piano performance modeling. We then further augmented the data by using musical similarity to retrieve similar motions from the captured dataset to boost the precision of the RL policy. With the proposed method, our model generates natural, dexterous motions that generalize to music from outside the training dataset.",
        "DOI": "10.1145/3680528.3687703",
        "paper_author": "Wang R.",
        "affiliation_name": "Stanford University",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60012708",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "International Managerial Skills in Higher Education Institutions",
        "publication": "International Managerial Skills in Higher Education Institutions",
        "citied_by": "0",
        "cover_date": "2024-12-02",
        "Abstract": "International managerial skills are increasingly essential in higher education institutions as they expand their global partnerships, diverse student populations, and cross-border research collaborations. Leaders in this sector need to navigate cultural differences, manage diverse teams, and communicate effectively across languages and backgrounds. Proficiency in international management also involves understanding global educational trends, adapting to varied regulatory environments, and fostering inclusive campus climates that value diversity. By honing these skills, higher education managers can create more globally connected institutions that are responsive to the needs of students and staff from around the world, ultimately strengthening their institution's global presence and impact. International Managerial Skills in Higher Education Institutions explores frameworks for effectively leading diverse, multicultural academic teams and strategies for navigating complex global education policies. It delves into the role of global leadership competencies by advancing institutional goals, enhancing cross-border research initiatives, and building resilient educational networks. Covering topics such as artificial intelligence (AI), entrepreneurial skills, and time management, this book is an excellent resource for higher education leaders, administrators, policy makers, faculty members, educators, researchers, academicians, and more.",
        "DOI": "10.4018/979-8-3373-0791-6",
        "paper_author": "Martinez J.B.",
        "affiliation_name": "Universidad de Cádiz",
        "affiliation_city": "Cadiz",
        "affiliation_country": "Spain",
        "affiliation_id": "60016476",
        "affiliation_state": "Cadiz"
    },
    {
        "paper_title": "AI literacy as civic literacy: A case study of the “AI and human rights” curriculum for middle school students",
        "publication": "First Monday",
        "citied_by": "0",
        "cover_date": "2024-12-02",
        "Abstract": "While the younger generation immerses itself in AI technologies, governmental bodies are at the initial stages of investigating the technology’s implications on our rights and how it will be best regulated. There is an opportunity to complement AI education with civic understanding. This work introduces the “AI and human rights” curriculum, which consists of seven lessons on human rights, how technology shapes our rights, and the Blueprint for an AI Bill of Rights. We summarize the experience of 50 middle school students who participated in a rights-based AI legislative simulation. Lastly, we will provide recommendations for how to engage youth in AI and human rights topics. We aim to share this work to raise awareness about the significance of AI literacy for youth citizenship while providing valuable guidance to educators and policy-makers seeking to implement similar initiatives.",
        "DOI": "10.5210/fm.v29i12.13869",
        "paper_author": "DiPaola D.",
        "affiliation_name": "MIT Media Lab",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60002243",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "StreamSense: Policy-driven Semantic Video Search in Streaming Systems",
        "publication": "Middleware Industrial Track 2024 - Proceedings of the Middleware Industrial Track, Part of: Middleware 2024",
        "citied_by": "0",
        "cover_date": "2024-12-02",
        "Abstract": "Streaming systems are an increasingly appealing substrate for managing video data via the stream abstraction. However, if we consider a large stream collection, it can be hard for data scientists to discover and locate relevant videos, let alone specific video fragments. In this paper, we propose StreamSense: a policy-driven, semantic video search solution for streaming systems. StreamSense allows users to deploy AI models that generate embeddings from video frames via policies. Our system uses such embeddings for building a two-level index in a vector DB that efficiently handles inter/intra video queries. StreamSense abstracts users from vector DB interactions so they can perform semantic search using images as input and visualize the results. We built our prototype on top of a tiered streaming storage system (Pravega) and validated it on a health-related use case. We show that StreamSense allows data scientists to search for video fragments in real surgery datasets in < 30ms. StreamSense also reduces data ingestion related to AI training data loading in +80% compared to simple bulk loading video streams.",
        "DOI": "10.1145/3700824.3701097",
        "paper_author": "Finol G.",
        "affiliation_name": "Universitat Rovira i Virgili",
        "affiliation_city": "Tarragona",
        "affiliation_country": "Spain",
        "affiliation_id": "60022415",
        "affiliation_state": "Tarragona"
    },
    {
        "paper_title": "Setting standards: Developing AI literacy skills at level 4",
        "publication": "Effective Practices in AI Literacy Education: Case Studies and Reflections",
        "citied_by": "0",
        "cover_date": "2024-12-02",
        "Abstract": "Students' generative AI (GAI) skills were assessed through a graded task comparing AI-generated responses with textbook content, fostering critical analysis and ethical considerations. Despite challenges such as defining ethical AI use and the lack of a formal policy, 87% of students passed the GAI assignment component. Future plans include enhancing student performance, addressing GAI use concerns, and ongoing discussions on ethical GAI use to support academic and professional success.",
        "DOI": "10.1108/978-1-83608-852-320241009",
        "paper_author": "Youngson A.L.",
        "affiliation_name": "University of Salford",
        "affiliation_city": "Salford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60008250",
        "affiliation_state": "Greater Manchester"
    },
    {
        "paper_title": "The ethics at the intersection of artificial intelligence and transhumanism: a personhood-based approach",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-02",
        "Abstract": "In this article, I will consider the moral issues that might arise from the possibility of creating more complex and sophisticated autonomous intelligent machines or simply artificial intelligence (AI) that would have the human capacity for moral reasoning, judgment, and decision-making, and (the possibility) of humans enhancing their moral capacities beyond what is considered normal for humanity. These two possibilities raise an urgency for ethical principles that could be used to analyze the moral consequences of the intersection of AI and transhumanism. In this article, I deploy personhood-based relational ethics grounded on Afro-communitarianism as an African ethical framework to evaluate some of the moral problems at the intersection of AI and transhumanism. In doing so, I will propose some Afro-ethical principles for research and policy development in AI and transhumanism.",
        "DOI": "10.1017/dap.2024.59",
        "paper_author": "Chimakonam A.E.",
        "affiliation_name": "University of Fort Hare",
        "affiliation_city": "Alice",
        "affiliation_country": "South Africa",
        "affiliation_id": "60005341",
        "affiliation_state": "Eastern Cape"
    },
    {
        "paper_title": "Human–machine collaboration for enhanced decision-making in governance",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-02",
        "Abstract": "A detailed exploration is presented of the integration of human–machine collaboration in governance and policy decision-making, against the backdrop of increasing reliance on artificial intelligence (AI) and automation. This exploration focuses on the transformative potential of combining human cognitive strengths with machine computational capabilities, particularly emphasizing the varying levels of automation within this collaboration and their interaction with human cognitive biases. Central to the discussion is the concept of dual-process models, namely Type I and II thinking, and how these cognitive processes are influenced by the integration of AI systems in decision-making. An examination of the implications of these biases at different levels of automation is conducted, ranging from systems offering decision support to those operating fully autonomously. Challenges and opportunities presented by human–machine collaboration in governance are reviewed, with a focus on developing strategies to mitigate cognitive biases. Ultimately, a balanced approach to human–machine collaboration in governance is advocated, leveraging the strengths of both humans and machines while consciously addressing their respective limitations. This approach is vital for the development of governance systems that are both technologically advanced and cognitively attuned, leading to more informed and responsible decision-making.",
        "DOI": "10.1017/dap.2024.72",
        "paper_author": "Van Rooy D.",
        "affiliation_name": "Universiteit Antwerpen",
        "affiliation_city": "Antwerpen",
        "affiliation_country": "Belgium",
        "affiliation_id": "60012937",
        "affiliation_state": "VAN"
    },
    {
        "paper_title": "Local regulations for the use of artificial intelligence in the management of public records – a literature review",
        "publication": "Records Management Journal",
        "citied_by": "0",
        "cover_date": "2024-12-02",
        "Abstract": "Purpose: This study investigated the regulatory landscape surrounding artificial intelligence (AI) in the context of e-government development. The purpose of this article is to identify record-keeping challenges, opportunities and weaknesses that emerge from AI loose regulation. The research focuses on Sweden, Finland and South Africa, examining the interplay between existing guidelines, recommendations and legal structures at various levels. Design/methodology/approach: The research adopted comprehensive systematic and scoping literature reviews, encompassing academic papers, reports and legal documents, along with an analysis of non-academic sources relevant to the study. This methodological approach helped to obtain a deep understanding of the evolving AI regulatory frameworks. Findings: There is currently limited research that focuses on the impact AI deployment has on the management of critical records in government administrations. Also, the findings reveal that AI regulatory environment varies from country to country. The European Union stands as a noteworthy example of a comprehensive framework for AI governance. In contrast, South Africa, while at its infancy stage, demonstrates potential initiatives and policies at different levels. There is emphasis on the need to focus on co-operation, skills development and uniform regulatory frameworks. Practical implications: This research holds significant practical implications for policymakers, government bodies and stakeholders involved in AI governance. It emphasizes how crucial it is to incorporate AI alongside a solid records management system. The study advocates for strategic investments in education and skills development to enable individuals to navigate the complexities of AI governance. Originality/value: This research adds to the existing body of knowledge by providing an examination of AI legislation in e-government in the context of public records management. The analysis helps to review literature and other research materials across different geographical areas. The study explores the distinctive strategies used by Sweden, Finland and South Africa. The recommendations offer policymakers and stakeholders suggestions on how to foster effective AI governance and innovation in the public sector but at the same time manage public records effectively.",
        "DOI": "10.1108/RMJ-10-2023-0061",
        "paper_author": "Svärd P.",
        "affiliation_name": "Sorbonne University Abu Dhabi",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60105036",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "Scientific Publications in the Age of Artificial Intelligence",
        "publication": "Scientific and Technical Information Processing",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "Abstract: The integration of artificial intelligence (AI) technologies into scientific publication processes raises a set of issues that require attention from both the academic community and scientific publishers. Despite the editorial policy of many journals, AI authorship remains a controversial issue that actualizes the problems of scientific ethics. The use of AI to check the spelling and grammar of text documents is virtually not questioned, as the embedding of such functions in computer programs is already routine. AI errors in bibliographic references require special attention for the design of reference lists. It is obvious that AI technologies can improve and influence the preparation of scientific publications. However, the efficiency of AI use will largely depend on the rapid response of the scientific community and publishers to new challenges to ensure the integrity and high quality of publications.",
        "DOI": "10.3103/S0147688224700679",
        "paper_author": "Grebenshchikova E.G.",
        "affiliation_name": "Institute of Scientific Information on Social Sciences, Russian Academy of Sciences",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60110463",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Compatibility of emerging AI regulation with GATS and TBT: the EU Artificial Intelligence Act",
        "publication": "Journal of International Economic Law",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "Governments have recently started to design policies that are specific to artificial intelligence (AI), which is projected to become the dominant technology in the decades to come. AI is increasingly permeating all aspects of the digital economy, including trade in goods and services, giving rise to concerns whether emerging AI-specific regulation may run afoul of international economic law (IEL). However, studies on the law of the World Trade Organization have yet to pay close attention to the European Union (EU) Artificial Intelligence Act (AI Act), the first binding regulation of its kind in the world. This paper seeks to address this gap in the literature. It examines the compatibility of emerging AI regulation with multilateral trade rules, using the EU AI Act as a case study. More specifically, it analyses to what extent the EU AI Act's disciplines on prohibited AI systems are likely to violate the EU's existing obligations and commitments enshrined in the Agreement on Technical Barriers to Trade and the General Agreement on Trade in Services. This paper demonstrates that there is potential for conflict between the EU regulation and these two multilateral trade agreements. It also suggests that, although emerging AI regulation can represent a challenge for the future of IEL, the latter can play a role in guiding and shaping AI-specific regulation moving forward.",
        "DOI": "10.1093/jiel/jgae040",
        "paper_author": "Soprana M.",
        "affiliation_name": "London School of Economics and Political Science",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60003059",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Geography of Artificial Intelligence Technologies in Russia",
        "publication": "Regional Research of Russia",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "The geography of innovation makes it possible to identify spatial patterns of creation, implementation, and diffusion of new technologies, but with the development of communications, an illusion appeared that space is insignificant. In accordance with the aim of the study, the article shows that creation and implementation of artificial intelligence (AI) as one of the radical innovations cannot be widespread. It will be concentrated in centers with high innovation potential and specialized tacit knowledge, where the intensity of knowledge spillovers is higher. In Russia, an education in AI can be obtained in 21 regions, research is conducted in 35, and technology is being developed in 40. The article proposes a rating of regional potential for AI creating, assessing scientific and technological development and density of the main elements of regional innovation ecosystems. The rating shows a high concentration of potential in the largest urban agglomeration, Moscow, and several creative cores: Moscow oblast, St. Petersburg, the Republic of Tatarstan, and Novosibirsk oblast. Sixteen centers have been identified capable of both creating and implementing certain AI technologies: Sverdlovsk, Nizhny Novgorod, Chelyabinsk, Samara, Tomsk, and Rostov oblasts, Krasnodar krai, etc.; 23 regions that are predominantly acceptor centers using AI advanced production technologies and 41 regions with minimal potential. Leading regions may receive priority attention and funding by investors. In acceptor regions, public policy priority may be given to supporting production automation, and in lagging regions, preference may be given to increasing the population’s receptivity to digital technologies.",
        "DOI": "10.1134/S2079970524600525",
        "paper_author": "Zemtsov S.P.",
        "affiliation_name": "Russian Presidential Academy of National Economy and Public Administration",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60107804",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Generative artificial intelligence algorithms in Internet of Things blockchain-based fintech management",
        "publication": "Oeconomia Copernicana",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "Research background:Big data-driven artificial Internet of Things (IoT) fintech algorithms can provide real-time personalized financial service access, strengthen risk management, and manage, monitor, and mitigate transaction operational risks by operational credit risk man-agement, suspicious financial transaction abnormal pattern detection, and synthetic financial data-based fraud simulation. Blockchain technologies, automated financial planning and investment advice services, and risk scoring and fraud detection tools can be leveraged in financial trading forecasting and planning, cryptocurrency transactions, and financial work-flow automation and fraud detection. Algorithmic trading and fraud detection tools, distributed ledger and cryptocurrency technologies, and ensemble learning and support vector machine algorithms are pivotal in predictive analytics-based risk mitigation, customer behavior and preference-based financial product and service personalization, and financial transaction and fraud detection automation. Credit scoring and risk management tools can offer financial personalized recommendations based on customer data, behavior, and preferences, in addition to transaction history, by generative adversarial and deep learning recurrent neu-ral networks. Purpose of the article: We show that blockchain and edge computing technologies, generative artificial IoT-based fintech algorithms, and transaction monitoring and credit scoring tools can be harnessed in financial decision-making processes and loan default rate mitigation for transaction, payment, and credit process efficiency. Generative and predictive artificial intelligence (AI) algorithmic trading systems can drive coherent customer service operations, provide tailored financial and investment advice, and influence financial decision processing, while performing real-time risk assessment and financial and trading risk scenario simulation across fluctuating market conditions. Fraud and money laundering prevention tools, block-chain and financial transaction technologies, and federated and decentralized machine learning algorithms can articulate algorithmic profiling-based transaction data patterns and structures, credit assessment, loan repaying likelihood prediction, and interest rate and credit lending risk management by real-time financial pattern and economic forecast-based credit analysis across investment payment and transaction record infrastructures. Methods: Research published between 2023 and 2024 was identified and analyzed across ProQuest, Scopus, and the Web of Science databases by use of screening and quality assessment software systems such as Abstrackr, AMSTAR, AXIS, CADIMA, CASP, Catchii, Distill-erSR, Eppi-Reviewer, MMAT, Nested Knowledge, PICO Portal, Rayyan, ROBIS, and SRDR+. Findings & value added: The main value added derived from the systematic literature review is that generative AI-based operational risk management, fraud detection, and transaction monitoring tools can provide personalized financial support and services and clarify financial and credit decisions and operations by financial decision-making process automation in dynamic business environments based on fraud detection capabilities and transaction data analysis and assessment. The benefits for theory and current state of the art are that credit risk and financial forecasting tools, artificial IoT-based fintech and generative AI algorithms, and algorithmic trading and distributed ledger technologies can be deployed in financial decision-making and customer behavior pattern optimization, credit score assessment, and money laundering and fraudulent payment detection. Policy implications reveal that investment management and algorithmic credit scoring tools can streamline financial activity operational efficiency, design financial planning analysis and forecasting, and carry out financial service and transaction data analysis for informed transaction decision-making and fraudulent behavior pattern and incident detection, taking into account credit history and risk evaluation and improving personalized experiences.",
        "DOI": "10.24136/oc.3283",
        "paper_author": "Andronie M.",
        "affiliation_name": "Universitatea Spiru Haret",
        "affiliation_city": "Bucharest",
        "affiliation_country": "Romania",
        "affiliation_id": "60091072",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital transformation, human capital upgrading, and enterprise ESG performance: Evidence from Chinese listed enterprises",
        "publication": "Oeconomia Copernicana",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "Research background:With the rapid development of digital technologies such as artificial intelligence (AI), big data, cloud computing, and blockchain, the deep integration of digital technology and traditional industries offers unprecedented opportunities and has become an important technological force driving the development of enterprise environmental, social, and governance (ESG) performance. Digital transformation increases the complementarity between the production and operation processes of enterprises and highly skilled labour, specifically manifested in the adaptive change of the human capital structure of enterprises in labour relations. Meanwhile, transforming enterprises’ human capital structure also affects ESG performance. Purpose of the article: This study investigates the effects of digital transformation on enterprise ESG performance and its underlying mechanisms of human capital upgrading. First, it combines cutting-edge literature to analyse the theoretical mechanism between digital trans-formation, human capital upgrading, and enterprise ESG performance, revealing the internal driving factors and implementation paths for improving enterprise ESG performance. Second, we use the data of 3928 listed enterprises in the Shanghai and Shenzhen A-share markets from 2009–2022 to analyse the impact of digital transformation on enterprise ESG performance from the perspective of human capital upgrading as well as the mechanism by which digital transformation affects enterprise ESG performance through human capital upgrading. Third, we provide policy recommendations for optimising the labour structure and enhancing enterprise ESG performance from the perspective of optimising human capital and digital technology applications. Methods: Based on data from 3928 listed enterprises in Chinese A-share markets from 2009-2022, we investigate the effects of digital transformation on enterprise ESG performance and the mechanisms of human capital upgrading. The panel mediation effect model tests the relationships between digital transformation, human capital upgrading, and enterprise ESG performance. Findings & value added: In theory, digital transformation is beneficial for optimising human capital structure, accelerating green technological innovation, and improving management efficiency, thus improving enterprise ESG performance. Mechanism testing shows that digital transformation enhances enterprise ESG performance through human capital upgrading. Heterogeneity analysis shows that the impact of digital transformation on ESG performance is more significant in enterprises that are capital-and technical-intensive, and located in the eastern and central regions. This study examines the microeconomic consequences of digital transformation, contributing to a deeper understanding of the theoretical logic inherent in enterprises’ optimisation of their labour structure. It also provides empirical evidence and decision support for developing industrial talent policies.",
        "DOI": "10.24136/oc.3058",
        "paper_author": "Yu G.",
        "affiliation_name": "Southwest University",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60122052",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Advancing Language Education in Indonesia: Integrating Technology and Innovations",
        "publication": "ASEAN Journal of Science and Engineering",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "Language learning in Indonesia's educational environment is accelerating change due to the introduction of novel technologies and teaching methods. This paper analyzed the essential functions of digital tools, the internet, and contemporary educational approaches to enhancing Indonesian language learning results. When considering the challenges of low penetration in remote areas and fluctuating technological maturity, opportunities exist to explore the potential of technology to bridge the language acquisition gap. Drawing on a review of several projects (i.e., mobile applications, e-learning platforms, and artificial intelligence (AI)-driven language support), the current study outlines their success in fostering multilingualism, enhancing engagement rates, and developing mother tongue and second language skills. The outcome suggests that education through language for Indonesian learners will be successful if there is a balance between traditional teaching advantages, such as face-to-face teaching, and modern technology's power and freedom. Policies, pedagogical, and institutional ideas are proposed to build a sustainable, inclusive, and dynamic model for a language education framework based on the sake of its citizenry.",
        "DOI": "10.17509/ajse.v4i3.79471",
        "paper_author": "Luckyardi S.",
        "affiliation_name": "Universitas Komputer Indonesia",
        "affiliation_city": "Bandung",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60109372",
        "affiliation_state": "West Java"
    },
    {
        "paper_title": "Using ChatGPT in University Academic Writing: A Bibliometric Review Study on the Implications for Writing Reports, Papers, Essays, and Theses",
        "publication": "International Journal of Learning, Teaching and Educational Research",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "The use of ChatGPT in university academic writing has generated a growing debate about its implications for the originality, quality, and authenticity of university writing. Its accelerated adoption in the creation of reports, essays, and theses raises serious questions about academic integrity, the possible increase in plagiarism, and the potential decrease in critical writing skills among students. This bibliometric review study analyzes the implications of the use of ChatGPT in university academic writing, covering both bibliometric indicators and a qualitative analysis to identify the areas on which research in this field has been focused. A mixed and descriptive approach is employed, based on 71 manuscripts reviewed and extracted from the Scopus database. The implications of the use of ChatGPT are identified and distributed in three areas categorized as “Quality and development of writing skills”, “Academic integrity and ethics in writing”, and “Educational assessment”. Despite the observed benefits, such as improved fluency and grammar, significant concerns remain regarding the over-reliance on ChatGPT and its impact on students’ critical thinking skills. It is therefore concluded that, although ChatGPT can complement certain aspects of academic writing, it is essential for students to strengthen their own writing skills to avoid total dependence on AI support. Furthermore, educational institutions need to establish clear policies and guidelines on the use of ChatGPT to ensure academic integrity. It is also recommended that future studies should evaluate the effectiveness of these policies and explore their impact on the development of critical and creative skills in students.",
        "DOI": "10.26803/ijlter.23.12.19",
        "paper_author": "Adauto Medina W.A.",
        "affiliation_name": "Universidad Nacional Tecnológica De Lima Sur",
        "affiliation_city": "Lima",
        "affiliation_country": "Peru",
        "affiliation_id": "60105321",
        "affiliation_state": "Lima"
    },
    {
        "paper_title": "AIEd in Elementary School Nationalism Education: A Systematic Literature Review",
        "publication": "International Journal of Learning, Teaching and Educational Research",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "This paper presents a systematic literature review (SLR) on artificial intelligence in education (AIEd) in elementary school nationalism education based on Scopus literature 2020-2024. This research, using the SLR method and PRISMA protocol, was carried out by means of an article search process through the stages of identification, filtering, eligibility, inclusion, and presentation of analysis with the Scopus database via Publish or Perish 7, VOSviewer and ATLAS.ti. The research findings indicate AIEd integrates AI and artificial technology, Google, Facebook, smartphones, and IoT with education, curriculum, learning, student skills, and assessment for improving nationalism learning in elementary schools. AIEd features have evolved from traditional AI technologies to more advanced ones: intelligent tutors, tutees, learning tools, and policy-making advisors. The AIEd programs include chatbots, ChatGPT, ChatGPT-3, ChatGPT-4, Microsoft Copilot, AI-Writer, Bard, Bing Chat, Botsify, Chat PDF, Claude, Consensus, Copy.ai, Duolingo, Ebbot by Learnify, Elicit, Ernie, Essay Writer, Jasper AI, Jenni AI, Laser AI, Lateral AI, Ludwig, PaperPal, Plaito, Querium, and Quillbot. Further programs include Research Rabbit, Scholarcy, SciSpace, Wisio, Wordtune, Writely AI, ALEKS, Deakin University's Genie, Pounce Chatbot, machine learning (ML), and deep learning (DL). In addition, there are also programs such as neural networks, quantum computing, Google's Teachable Machine, Machine Learning for Kids, Pop Bots, Scratch, Python, Khan Academy, Duolingo, Generative AI, and LLMs. The application of AIEd in elementary nationalism education implies the integration of technological pedagogical content knowledge TPACK, DL, predictive analysis, ML, neural networks, expert systems, and social robotics in fostering democratic and civic awareness with a combination of movies, puppets, comics, nationalism characters, integrity, and textbooks.",
        "DOI": "10.26803/ijlter.23.12.10",
        "paper_author": "Saputra B.D.",
        "affiliation_name": "Universitas Negeri Yogyakarta",
        "affiliation_city": "Yogyakarta",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60087601",
        "affiliation_state": "Yogyakarta"
    },
    {
        "paper_title": "IMPACT OF ENVIRONMENT ON LIMITS OF PROFESSIONAL AUTONOMY IN CONTEXT OF EDUCATIONAL ENGINEERING",
        "publication": "International Journal on Technical and Physical Problems of Engineering",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "This study focuses on the effect of the school environment on the professional autonomy of teachers and their pedagogical practices in teaching French at the qualifying secondary cycle in Morocco. The objective of the study is to evaluate the impact of the school environment on teachers' ability to make independent pedagogical decisions and develop their educational practices, as well as the effect of these changes on teaching quality, using a sample of 104 French teachers from various secondary schools. The results indicate that the school environment, namely school policies, administrative support, and collaboration among colleagues, has a significant impact on teachers' professional autonomy and their pedagogical engineering. The study showed that the dynamics of the school environment can enhance teachers' autonomy, especially when the necessary institutional support is available and the innovation and experimentation of teaching methods are encouraged. The study recommends providing a flexible school environment that supports teachers' autonomy and promotes teaching innovation by improving administrative support and implementing training programs focused on developing critical thinking skills and strengthening teacher collaboration. It also recommends integrating artificial intelligence (AI) and Internet of Things (IoT) devices into the school environment, as these technologies are transforming French language teaching by creating a flexible, efficient, and more cost-effective environment. This integration provides a modern response to contemporary challenges while enhancing the effectiveness of French language teaching and promoting teachers' professional autonomy.",
        "DOI": "NA",
        "paper_author": "Aassif A.",
        "affiliation_name": "Hassan II University of Casablanca",
        "affiliation_city": "Casablanca",
        "affiliation_country": "Morocco",
        "affiliation_id": "60025457",
        "affiliation_state": "Casablanca-Settat"
    },
    {
        "paper_title": "The Dual Impact of ChatGPT on Learning and Ethics among Bachelor of Science in Information Technology (BSIT) Students",
        "publication": "International Journal of Learning, Teaching and Educational Research",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "This study examines the usage and perceptions of ChatGPT, an AI-driven language model, among Bachelor of Science in Information Technology (BSIT) students at the Nueva Ecija University of Science and Technology (NEUST) in Cabanatuan City, Philippines. Utilizing a descriptive research design, the study investigates both the learning outcomes and ethical concerns associated with ChatGPT's application in academic and professional tasks. The research focuses on how ChatGPT influences students' knowledge acquisition, study efficiency, and satisfaction, along with the ethical challenges perceived in relation to academic integrity. Data were collected using a structured survey from a sample of 200 students selected via stratified random sampling to ensure gender- and year-level representation. Data were analyzed using weighted means to measure satisfaction and ethical concerns, while qualitative responses underwent thematic analysis to explore students’ perspectives on the ethical implications of the tool. The findings reveal that students view ChatGPT as a valuable aid in enhancing learning efficiency and accessing knowledge. However, they also acknowledge significant ethical challenges, including risks of academic dishonesty and over-reliance on AI. The study’s key output is a policy brief with actionable recommendations for educators and policymakers, outlining guidelines for balanced AI usage and ethical frameworks to support responsible integration of AI technologies in education.",
        "DOI": "10.26803/ijlter.23.12.5",
        "paper_author": "Luciano R.G.",
        "affiliation_name": "Nueva Ecija University of Science and Technology (NEUST)",
        "affiliation_city": "Cabanatuan",
        "affiliation_country": "Philippines",
        "affiliation_id": "60268234",
        "affiliation_state": "Central Luzon"
    },
    {
        "paper_title": "Technology first, sustainability later: a systematic review on the literature on the policy development of China’s smart city strategy",
        "publication": "Environmental Research: Infrastructure and Sustainability",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "In China, like in other countries, smart cities have been proposed to make cities more efficient and, ideally, also more sustainable and low-carbon. Unlike other countries, China pursued a smart city strategy since 2008 with substantial funding and intermediate goals, resulting in high data and computational-intensive digital infrastructures in some cities. However, there is a lack of systematic understanding of how Chinese smart city policies and practices evolved. It is also unclear if and how smart cities achieve sustainability goals. Here, we fill these gaps by conducting a systematic literature review on the timeline of China’s smart city policies during the past three Five-Year Plans. The literature review, based on screening 7995 papers, and analyzing 364 relevant articles, shows that priority research topics are smart city systems and governance, including surveillance, with a more limited focus on policy. China’s net-zero carbon strategy is far less developed than its smart city strategy. The funding and development of large-scale data and AI technology is exemplified in Hangzhou’s ‘Urban Brain’. While sustainability goals are often associated with smart cities, we find few applications with demonstrated sustainability benefits. We suggest that mutual learning is possible by combining the net zero strategy and sustainable city strategy of cities like Copenhagen, Nairobi, Singapore and Toronto with the urban brain strategy of cities like Hangzhou.",
        "DOI": "10.1088/2634-4505/ad9ed7",
        "paper_author": "Ge K.",
        "affiliation_name": "Technische Universität Berlin",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60011604",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Law and Custom in the Age of Codification. Our Legal Culture from Theoretical Problems to Political Problems (In Memory of Silvana Castignone)",
        "publication": "Materiali per una Storia della Cultura Giuridica",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "From Roman Law to the Enlightenment, there were opinions in favor of the primacy of law over custom, and those in favor of equalizing the two. Codification put an end to this debate in the Western world. Codification and constitutionalism thus appeared to be two sides of the same coin. However, this decision in favor of the primacy of the law left a theoretical question unanswered: What happens to a legislative norm that is generally not followed or applied? In addition, there is a problem of legal policy: constitutionalism and codification are not presented today as two sides of the same coin, but on the contrary as two projects that oppose each other in their foundations, objectives and consequences.",
        "DOI": "10.1436/115383",
        "paper_author": "Hierro L.L.",
        "affiliation_name": "Universidad Autónoma de Madrid",
        "affiliation_city": "Madrid",
        "affiliation_country": "Spain",
        "affiliation_id": "60026796",
        "affiliation_state": "Madrid"
    },
    {
        "paper_title": "Survey evidence on public support for AI safety oversight",
        "publication": "Scientific Reports",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "A number of AI safety concerns are being increasingly discussed by experts, including misinformation, invasion of privacy, job displacement, and criminal misuse. Two exploratory studies conducted in Germany and Spain (combined n = 2864) provide evidence that the general public largely supports strict oversight over safety of commercial artificial intelligence research. Among the factors that are associated with preferences for strict oversight are age, anticipated job displacement, innovativeness, and risk, time and altruistic preferences.",
        "DOI": "10.1038/s41598-024-82977-5",
        "paper_author": "Vesely S.",
        "affiliation_name": "Norges Teknisk-Naturvitenskapelige Universitet",
        "affiliation_city": "Trondheim",
        "affiliation_country": "Norway",
        "affiliation_id": "60013141",
        "affiliation_state": "Trondelag"
    },
    {
        "paper_title": "Science Mapping of AI as an Educational Tool Exploring Digital Inequalities: A Sociological Perspective",
        "publication": "Multimodal Technologies and Interaction",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "This study aims to explore the evolution of the literature on the sociological implications of integrating artificial intelligence (AI) as an educational tool, particularly its influence on digital inequalities. While AI technologies, such as AI-based language models, have begun transforming educational practices by personalizing learning, fostering student autonomy, and supporting educators, concerns remain regarding access disparities, ethical implications, and the potential reinforcement of existing social inequalities. To address these issues, a bibliometric analysis employing science mapping was conducted on 1515 studies sourced from the Web of Science Core Collection. This analysis traces the thematic evolution of social science perspectives on AI’s role in education and its relationship with digital inequalities. The results indicate a growing academic interest in AI in education, with a notable progression from understanding its basic impact to exploring complex themes such as vulnerability, disability, bias, and community. The studies show that AI’s application has expanded from isolated research on specific populations to broader discussions on inclusivity, equity, and the impact of AI on governance, policy, and community. However, the findings also reveal a significant gap in sociological perspectives, particularly regarding issues like digital illiteracy and socio-economic access disparities. Although AI holds promise for promoting more inclusive education, further research is essential to address these sociological concerns and to guide the ethical, equitable implementation of AI as its influence on governance, policy, and community impact continues to grow.",
        "DOI": "10.3390/mti8120106",
        "paper_author": "Mac Fadden I.",
        "affiliation_name": "Universidad de Salamanca",
        "affiliation_city": "Salamanca",
        "affiliation_country": "Spain",
        "affiliation_id": "60025028",
        "affiliation_state": "Salamanca"
    },
    {
        "paper_title": "Transforming Agricultural Productivity with AI-Driven Forecasting: Innovations in Food Security and Supply Chain Optimization",
        "publication": "Forecasting",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "Global food security is under significant threat from climate change, population growth, and resource scarcity. This review examines how advanced AI-driven forecasting models, including machine learning (ML), deep learning (DL), and time-series forecasting models like SARIMA/ARIMA, are transforming regional agricultural practices and food supply chains. Through the integration of Internet of Things (IoT), remote sensing, and blockchain technologies, these models facilitate the real-time monitoring of crop growth, resource allocation, and market dynamics, enhancing decision making and sustainability. The study adopts a mixed-methods approach, including systematic literature analysis and regional case studies. Highlights include AI-driven yield forecasting in European hydroponic systems and resource optimization in southeast Asian aquaponics, showcasing localized efficiency gains. Furthermore, AI applications in food processing, such as plasma, ozone and Pulsed Electric Field (PEF) treatments, are shown to improve food preservation and reduce spoilage. Key challenges—such as data quality, model scalability, and prediction accuracy—are discussed, particularly in the context of data-poor environments, limiting broader model applicability. The paper concludes by outlining future directions, emphasizing context-specific AI implementations, the need for public–private collaboration, and policy interventions to enhance scalability and adoption in food security contexts.",
        "DOI": "10.3390/forecast6040046",
        "paper_author": "Dhal S.B.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "College Station",
        "affiliation_country": "United States",
        "affiliation_id": "60148980",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Examining the Impact of Entrepreneurial Orientation, Self-Efficacy, and Perceived Business Performance on Managers’ Attitudes Towards AI and Its Adoption in Hospitality SMEs",
        "publication": "Systems",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "In the competitive hospitality sector, the adoption of Artificial Intelligence (AI) is essential for enhancing operational efficiency and improving customer experiences. This study explores how key entrepreneurial traits—Entrepreneurial Orientation (EO), Entrepreneurial Self-Efficacy (ESE), and Perceived Business Performance (PBP)—influence managers’ attitudes toward adopting AI in small- and medium-sized enterprises (SMEs). Ts research utilizes data from 287 respondents, gathered through field research with a survey designed to measure the relationships among constructs, employing structural equation modeling (SEM) for analysis. Results reveal that PBP and certain ESE dimensions, such as Initiating Investor Relationships and Developing New Products, have only a modest positive effect on AI adoption. In contrast, EO—specifically Proactiveness and Innovativeness—exhibits a weak negative impact. Importantly, none of these factors directly affect managers’ attitudes toward AI. Instead, this study highlights that managers’ positive attitudes are the strongest predictors of AI adoption, aligning with the Technology Acceptance Model (TAM). The findings offer new insights into key entrepreneurial factors driving AI adoption and emphasize the need for targeted education and supportive policies to facilitate AI integration in hospitality SMEs. Fostering a positive perspective on AI is more important for adoption than overcoming skepticism, as negative attitudes do not influence AI adoption.",
        "DOI": "10.3390/systems12120526",
        "paper_author": "Kukanja M.",
        "affiliation_name": "University of Primorska",
        "affiliation_city": "Koper",
        "affiliation_country": "Slovenia",
        "affiliation_id": "60006286",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Assessing the Guidelines on the Use of Generative Artificial Intelligence Tools in Universities: A Survey of the World’s Top 50 Universities",
        "publication": "Big Data and Cognitive Computing",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "The widespread adoption of Generative Artificial Intelligence (GenAI) tools in higher education has necessitated the development of appropriate and ethical usage guidelines. This study aims to explore and assess publicly available guidelines covering the use of GenAI tools in universities, following a predefined checklist. We searched and downloaded publicly accessible guidelines on the use of GenAI tools from the websites of the top 50 universities globally, according to the 2025 QS university rankings. From the literature on GenAI use guidelines, we created a 24-item checklist, which was then reviewed by a panel of experts. This checklist was used to assess the characteristics of the retrieved university guidelines. Out of the 50 university websites explored, guidelines were publicly accessible on the sites of 41 institutions. All these guidelines allowed for the use of GenAI tools in academic settings provided that specific instructions detailed in the guidelines were followed. These instructions encompassed securing instructor consent before utilization, identifying appropriate and inappropriate instances for deployment, employing suitable strategies in classroom settings and assessment, appropriately integrating results, acknowledging and crediting GenAI tools, and adhering to data privacy and security measures. However, our study found that only a small number of the retrieved guidelines offered instructions on the AI algorithm (understanding how it works), the documentation of prompts and outputs, AI detection tools, and mechanisms for reporting misconduct. Higher education institutions should develop comprehensive guidelines and policies for the responsible use of GenAI tools. These guidelines must be frequently updated to stay in line with the fast-paced evolution of AI technologies and their applications within the academic sphere.",
        "DOI": "10.3390/bdcc8120194",
        "paper_author": "Ullah M.",
        "affiliation_name": "The Aga Khan University",
        "affiliation_city": "Karachi",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60052016",
        "affiliation_state": "Sindh"
    },
    {
        "paper_title": "Adolescence in the Italian Labour Market: In Search of an Equilibrium Among Instability, Uncertainty, and AI Challenges",
        "publication": "Social Sciences",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "The school-to-work transition (STWT) represents a pivotal challenge in individual development, necessitating a global and interdisciplinary approach to address its inherent complexity. This article examines some key characteristics of the current labour market, focusing on the Italian context, which is undergoing profound transformations that disrupt traditional production systems. In the contemporary landscape, labour market instability has become a norm rather than an exception, often resulting in unclear future prospects and leaving individuals—particularly adolescents—grappling with uncertainty and a lack of direction. For younger generations, this sustained uncertainty exacerbates the challenges of an already delicate and transformative phase of life, generating scepticism toward both present realities and future possibilities. The evolving skills required to navigate the STWT present significant challenges for educational planning, particularly within institutional, organizational, and pedagogical dimensions. Emerging technologies, such as artificial intelligence (AI), are reshaping lifestyles and work environments, further complicating the dynamics of STWT transition. It is essential to undertake comprehensive pedagogical reflection and rigorous research to critically evaluate and redefine educational strategies and policies. Such efforts are crucial for equipping adolescents with the resilience and adaptability required to navigate instability and uncertainty, fostering preparedness for an unpredictable future.",
        "DOI": "10.3390/socsci13120688",
        "paper_author": "Mancaniello M.R.",
        "affiliation_name": "Università degli Studi di Siena",
        "affiliation_city": "Siena",
        "affiliation_country": "Italy",
        "affiliation_id": "60002838",
        "affiliation_state": "SI"
    },
    {
        "paper_title": "AI Applications in Transportation and Equity: A Survey of U.S. Transportation Professionals",
        "publication": "Future Transportation",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "This paper reports on a study investigating transportation professionals’ perceptions of AI’s equity impacts in the transportation sector, focusing on demographic variations in views. A survey conducted among U.S. transportation professionals examined their attitudes toward AI’s potential to influence transportation equity and ethics. The findings reveal insights based on gender, employment sector, educational background, and AI knowledge level, with notable differences in confidence towards AI’s ability to reduce bias and engage communities. This research highlights a commonly held opinion that there is a limited understanding of AI ethics within the transportation community, emphasizing the need for ongoing education and adaptation to AI technologies. This study contributes valuable perspectives to the discourse on AI, equity, and ethics in transportation, offering a foundation for future policy and strategy development.",
        "DOI": "10.3390/futuretransp4040056",
        "paper_author": "Sanchez T.W.",
        "affiliation_name": "Texas A&amp;M University",
        "affiliation_city": "College Station",
        "affiliation_country": "United States",
        "affiliation_id": "60020547",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "The Legal Challenges of Realistic and AI-Driven Child Sexual Abuse Material: Regulatory and Enforcement Perspectives in Europe",
        "publication": "Laws",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "Although the escalation in online child sexual abuse material (CSAM) is not a novel problem, recent digital proliferation has brought about new alarming challenges in addressing the issue. CSAM poses significant risks to children and society in general, the most serious being the long-lasting harmful effects on depicted victims. The already distressing problem is exacerbated by the worldwide appearance and spread of AI-driven or virtual CSAM, as AI offers a fast and increasingly profitable means for the sexual exploitation of children. The paper aims to provide a comprehensive review of current legislative measures focusing the European Union for combating online CSAM. With a particular focus on AI-driven CSAM, we will systematically evaluate the effectiveness and applicability of these regulations in addressing virtual CSAM. The paper will conclude with policy recommendations to address identified gaps in the European legislative framework concerning virtual CSAM.",
        "DOI": "10.3390/laws13060067",
        "paper_author": "Parti K.",
        "affiliation_name": "Virginia Polytechnic Institute and State University",
        "affiliation_city": "Blacksburg",
        "affiliation_country": "United States",
        "affiliation_id": "60027090",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "Causal Economic Machine Learning (CEML): “Human AI”",
        "publication": "AI (Switzerland)",
        "citied_by": "0",
        "cover_date": "2024-12-01",
        "Abstract": "This paper proposes causal economic machine learning (CEML) as a research agenda that utilizes causal machine learning (CML), built on causal economics (CE) decision theory. Causal economics is better suited for use in machine learning optimization than expected utility theory (EUT) and behavioral economics (BE) based on its central feature of causal coupling (CC), which models decisions as requiring upfront costs, some certain and some uncertain, in anticipation of future uncertain benefits that are linked by causation. This multi-period causal process, incorporating certainty and uncertainty, replaces the single-period lottery outcomes augmented with intertemporal discounting used in EUT and BE, providing a more realistic framework for AI machine learning modeling and real-world application. It is mathematically demonstrated that EUT and BE are constrained versions of CE. With the growing interest in natural experiments in statistics and causal machine learning (CML) across many fields, such as healthcare, economics, and business, there is a large potential opportunity to run AI models on CE foundations and compare results to models based on traditional decision-making models that focus only on rationality, bounded to various degrees. To be most effective, machine learning must mirror human reasoning as closely as possible, an alignment established through CEML, which represents an evolution to truly “human AI”. This paper maps out how the non-linear optimization required for the CEML structural response functions can be accomplished through Sequential Least Squares Programming (SLSQP) and applied to data sets through the S-Learner CML meta-algorithm. Upon this foundation, the next phase of research is to apply CEML to appropriate data sets in various areas of practice where causality and accurate modeling of human behavior are vital, such as precision healthcare, economic policy, and marketing.",
        "DOI": "10.3390/ai5040094",
        "paper_author": "Horton A.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    }
]