[
    {
        "paper_title": "The Challenges Facing the Development of AI in Africa",
        "publication": "Proceedings of IEEE International Conference on Advent Trends in Multidisciplinary Research and Innovation, ICATMRI 2020",
        "citied_by": "6",
        "cover_date": "2020-12-30",
        "Abstract": "In this article, we provide a non-exhaustive list of solutions and initiatives developed by using Artificial Intelligence (AI) to solve recurring problems in Africa. Despite the existing initiatives, the continent is not fully benefiting from AI. The challenges facing Africa are numerous and diverse. At the forefront are related challenges such as difficult access to large amounts of data, quality of data, data storage, and data regulatory policy. AI technologies require a good quality connection and considerable energy requirements. Unfortunately, the container suffers from lack of broadband and energy infrastructure. Also, the operation of AI requires a skilled workforce while the education system is not conducive to the development of AI skills and schools and universities do not provide enough young graduates in the labor market with a strong competence in AI. In addition, there is a lack of effective policy and funding for AI research and innovation. Nevertheless, initiatives to promote the development of AI on the continent already exist. In addition, we propose possible solutions, from funding for ecosystem building to infrastructure development, education redesign, and national and regional strategy and policy development so that AI can finally be a key technology for Africa's sustainable development.",
        "DOI": "10.1109/ICATMRI51801.2020.9398454",
        "paper_author": "Anicet Kiemde S.M.",
        "affiliation_name": "Ecole Supérieure Multinationale des Télécommunications",
        "affiliation_city": "Dakar",
        "affiliation_country": "Senegal",
        "affiliation_id": "112806036",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Evaluation of AI smart home by 5G IoT",
        "publication": "2nd IEEE International Conference on Architecture, Construction, Environment and Hydraulics 2020, ICACEH 2020",
        "citied_by": "0",
        "cover_date": "2020-12-25",
        "Abstract": "The influencing factors and indicators of smart home product development and design are discussed based on the research results in this study. Based on the traditional concepts of home design and household appliances, the premise of environment friendly planning and design of AI smart home is suggested for the effective decision-making. The results promote the operation of its market expansion and suggest the reference for smart home product developers, designers and policy promoters.",
        "DOI": "10.1109/ICACEH51803.2020.9366270",
        "paper_author": "Paohua Y.",
        "affiliation_name": "Fujian University of Technology",
        "affiliation_city": "Fuzhou",
        "affiliation_country": "China",
        "affiliation_id": "60083503",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "Determination of initial projectile velocity in the presence of static fields using deep actor critic method",
        "publication": "Proceedings of 2020 11th International Conference on Electrical and Computer Engineering, ICECE 2020",
        "citied_by": "1",
        "cover_date": "2020-12-17",
        "Abstract": "The movement of a projectile, which can be a mass or a charge, through a static field, can be important in various fields of physics ranging from particle physics to rocket science. In many cases, the movement of the projectile can be solely dependent on the initial velocity provided to the projectile. The determination of this initial velocity can be very complicated if the existing static field is too complex. In such cases, neural networks can be the key to modelling the environment and accurately estimate the initial velocity. This AI-driven velocity estimation can be extremely difficult using supervised learning due to the lack of seen examples of the state (initial position) to action (velocity) relation, which is also known as the policy. In this work, this problem is treated as a continuous-action-space contextual bandit problem and a neural network-based actor critic method is used to model the environment and determine the action policy. This method is tested on two different static field configurations using a Python-based GUI named Pygame. After training, the success rates of the projectile hitting the targeted destinations are 94.8% and 77.9% respectively, which implies that the proposed method can successfully model the action policy with high accuracy.",
        "DOI": "10.1109/ICECE51571.2020.9393103",
        "paper_author": "Tanveer M.S.",
        "affiliation_name": "Green University of Bangladesh",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60176012",
        "affiliation_state": "Dhaka"
    },
    {
        "paper_title": "Interpretable Sentiment Analysis based on Deep Learning: An overview",
        "publication": "2020 IEEE Pune Section International Conference, PuneCon 2020",
        "citied_by": "7",
        "cover_date": "2020-12-16",
        "Abstract": "Sentiment analysis (SA) or emotion AI or opinion mining uses natural language processing (NLP). Sentiment Analysis identify, study, quantify, obtain, tacit states and subject related information. Broad spectrum of areas influenced due to Sentiment Analysis such as policy making by the government, finding mental health of individuals, finding misuse of drugs in healthcare, fraud detection in the financial sector, covid-19 awareness and impact, Cyber-crime etc. As the amplitude of social media data increases day by day, there is a need to automatically address sentiment analysis. Deep learning handles it very well. It gives very good accuracy but incomprehensibility in decision strategy. For better decision-making trust, believe, fairness, reliability, and unbiasing is important. This paper explores the work done in this area along with popular techniques to address interpretability in sentiment analysis and its evaluation criteria.",
        "DOI": "10.1109/PuneCon50868.2020.9362361",
        "paper_author": "Jawale S.",
        "affiliation_name": "Datta Meghe College of Engineering",
        "affiliation_city": "Navi Mumbai",
        "affiliation_country": "India",
        "affiliation_id": "60272696",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "Current Trends and Practices in Smart Health Monitoring and Clinical Decision Support",
        "publication": "Proceedings - 2020 IEEE International Conference on Bioinformatics and Biomedicine, BIBM 2020",
        "citied_by": "25",
        "cover_date": "2020-12-16",
        "Abstract": "Smart Health indicates the use of new technologies in the healthcare sector. Literally it means 'intelligent health', and the intelligence referred to is digital, guaranteed by innovative tools such as Internet of Things (IoT) devices, communication technologies, cloud computing, artificial intelligence (AI) and big data. Thanks to sensors and devices connected to patients, such as technologically advanced bracelets and watches, it is possible to collect data on the state of health of people and treat them, even remotely, anticipating critical situations before they occur. The use of IoT to support healthcare leads to suitable recommendations and set the best policies for improving the quality of patients life, assisting practitioners and healthcare providers in decision making, collecting and exchanging information, helping to prevent events, such as a heart attack or an illness. This is possible thanks to the use of AI, which process immense amounts of data to anticipate future events. In recent years, AI based on deep learning has sparked tremendous global interest and is impacting also in healthcare. Deep learning has been widely adopted in image recognition, speech recognition and natural language processing. It could be the vehicle for translating big biomedical data into improved human health. The paper presents a literature review conducted to determine the most important technologies, methodologies, algorithms and models for smart health systems. In addition, the main application areas and challenges of smart health were explored.",
        "DOI": "10.1109/BIBM49941.2020.9313449",
        "paper_author": "Comito C.",
        "affiliation_name": "Consiglio Nazionale delle Ricerche",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60021199",
        "affiliation_state": "RM"
    },
    {
        "paper_title": "Accelerating copolymer inverse design using monte carlo tree search",
        "publication": "Nanoscale",
        "citied_by": "24",
        "cover_date": "2020-12-14",
        "Abstract": "There exists a broad class of sequencing problems in soft materials such as proteins and polymers that can be formulated as a heuristic search that involves decision making akin to a computer game. AI gaming algorithms such as Monte Carlo tree search (MCTS) gained prominence after their exemplary performance in the computer Go game and are decision trees aimed at identifying the path (moves) that should be taken by the policy to reach the final winning or optimal solution. Major challenges in inverse sequencing problems are that the materials search space is extremely vast and property evaluation for each sequence is computationally demanding. Reaching an optimal solution by minimizing the total number of evaluations in a given design cycle is therefore highly desirable. We demonstrate that one can adopt this approach for solving the sequencing problem by developing and growing a decision tree, where each node in the tree is a candidate sequence whose fitness is directly evaluated by molecular simulations. We interface MCTS with MD simulations and use a representative example of designing a copolymer compatibilizer, where the goal is to identify sequence specific copolymers that lead to zero interfacial energy between two immiscible homopolymers. We apply the MCTS algorithm to polymer chain lengths varying from 10-mer to 30-mer, wherein the overall search space varies from 210 (1024) to 230 (∼1 billion). In each case, we identify a target sequence that leads to zero interfacial energy within a few hundred evaluations demonstrating the scalability and efficiency of MCTS in exploring practical materials design problems with exceedingly vast chemical/material search space. Our MCTS-MD framework can be easily extended to several other polymer and protein inverse design problems, in particular, for cases where sequence-property data is either unavailable and/or is resource intensive. This journal is",
        "DOI": "10.1039/d0nr06091g",
        "paper_author": "Patra T.K.",
        "affiliation_name": "Indian Institute of Technology Madras",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60025757",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "AI strategy of India: policy framework, adoption challenges and actions for government",
        "publication": "Transforming Government: People, Process and Policy",
        "citied_by": "85",
        "cover_date": "2020-12-12",
        "Abstract": "Purpose: The purpose of this study is to provide recommendations for policy framework on artificial intelligence (AI) in India. Design/methodology/approach: Studies have been conducted through focus group discussion and the other sources such as different company websites using AI, Indian Government strategy reports on AI, literature studies, different policies implemented on AI in different locations and other relevant documents. After those studies, a charter of recommendation has been provided. This will help the authority to frame the AI policy for India. Findings: This study highlights that “National Strategy for AI” for India needs improvement to provide comprehensive inputs for framing policy on AI. This study also implies that focus is to be given on security, privacy issues including issues of governance. Research limitations/implications: AI-related technology has immense potential toward the development of organizations. This study implies the necessity of framing a comprehensive policy on AI for India. If there is a comprehensive policy on AI for India, the Indian industries will derive many benefits. Practical implications: This study provides inputs on how the industries of India can be benefitted with the help of AI and how R&D can develop the AI activities to harness maximum benefits from this innovative technology. Social implications: AI-related policy will have appreciable influence on the society in terms of human–device interactions and communications. The policy framework on AI for India is expected to project far-reaching effects toward deriving benefits to the society. Originality/value: This paper has taken a holistic and unique attempt to provide inputs to the policymakers for framing a comprehensive and meaningful policy on AI for India.",
        "DOI": "10.1108/TG-05-2019-0031",
        "paper_author": "Chatterjee S.",
        "affiliation_name": "Indian Institute of Technology Delhi",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60032730",
        "affiliation_state": "DL"
    },
    {
        "paper_title": "Royale Heroes: A Unique RTS Game Using Deep Reinforcement Learning-based Autonomous Movement",
        "publication": "2020 3rd International Seminar on Research of Information Technology and Intelligent Systems, ISRITI 2020",
        "citied_by": "1",
        "cover_date": "2020-12-10",
        "Abstract": "A game, a set of rules or policies by one or more people to carry out an action that will generate excitement for those who do it, can be developed using one of two types of playing methods: turn-based and real-time. In real-time strategic (RTS) games with many characters like Warcraft and Chess, it is fun to play. However, fun decreases since the players have to focus on many points in the playing area. Hence, autonomous movement (AM), an assistant to move the character, can be one solution. An AM can be implemented using deep reinforcement learning (DRL), a new method that can continue to learn without erasing previously learned memory that makes AM better since it can adapt to the playing style. This paper describes the Royale Heroes, a unique RTS game that implements a DRL-based AM. First, a base model is created using a rule-based model based on conventional artificial intelligence (AI). Next, a DRL model is trained to imitate the behavior of previously created AI. Evaluation of six matches shows that the DRL provides high accuracy of up to 98% to copy a behavior. Hence, it can be used as an AM to help players make choices in playing the game. When the player plays this game, the model will continue learning to imitate the player behavior.",
        "DOI": "10.1109/ISRITI51436.2020.9315441",
        "paper_author": "Ramadhan F.",
        "affiliation_name": "Telkom University",
        "affiliation_city": "Bandung",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60103730",
        "affiliation_state": "West Java"
    },
    {
        "paper_title": "Making AI Machines Work for Humans in FoW",
        "publication": "SIGMOD Record",
        "citied_by": "8",
        "cover_date": "2020-12-09",
        "Abstract": "The Future of Work (FoW) is witnessing an evolution where AI systems are used to the benefit of humans. Work here refers to all forms of paid and unpaid labor in both physical and virtual workplaces and that is enabled by AI systems. This covers crowdsourcing platforms such as Amazon Mechanical Turk, online labor marketplaces such as TaskRabbit and Qapa, but also regular jobs in physical workplaces. Bringing humans back to the frontier of FoW will increase their trust in AI systems and shift their perception to use them as a source of self-improvement, en sure better work performance, and positively shape social and economic outcomes of a society and a nation. To enable that, physical and virtual work places will need to capture human traits, behavior, evolving needs, and provide jobs to all. Attitudes, values, opinions regarding the processes and policies will need to be assessed and considered in the design of FoW ecosystems.",
        "DOI": "10.1145/3442322.3442327",
        "paper_author": "Amer-Yahia S.",
        "affiliation_name": "Université Grenoble Alpes",
        "affiliation_city": "Saint Martin d'Heres",
        "affiliation_country": "France",
        "affiliation_id": "60104653",
        "affiliation_state": "Auvergne-Rhone-Alpes"
    },
    {
        "paper_title": "Critical success factors for integrating artificial intelligence and robotics",
        "publication": "Digital Policy, Regulation and Governance",
        "citied_by": "58",
        "cover_date": "2020-12-03",
        "Abstract": "Purpose: This paper aims to enlighten stakeholders about critical success factors (CSFs) in developing intelligent autonomous systems (IASs) by integrating artificial intelligence (AI) with robotics. It suggests a prioritization hierarchy model for building sustainable ecosystem for developing IASs. Design/methodology/approach: This paper is based on the existing literature and on the opinion of 15 experts. All the experts have minimum of eight years of experience in AI and related technologies. The CSF theory is used as a theoretical lens and total interpretative structure modelling (TISM) is used for the prioritization of CSFs. Findings: Developing countries like India could leverage IASs and associated technologies for solving different societal problems. Policymakers need to develop basic policies regarding data collection, standardized hardware, skilled manpower, funding and start-up culture that can act as building blocks in undertaking sustainable ecosystem for developing IASs and implementing national AI strategy. Clear-cut regulations need to be in place for the proper functioning of the ecosystem. Any technology that can function properly in India has better chances of working at the global level considering the size of the population. Research limitations/implications: This paper had all its experts from India only, and that makes the limitation of this paper, as there is a possibility that some of the factors identified may not hold same significance in other countries. Practical implications: Stakeholders will understand the critical factors that are important in developing sustainable ecosystem for IASs and what should be the possible order of activities corresponding to each CSF. Originality/value: The paper is the first of its kind that has used the CSF theory and TISM methodology for the identification and prioritization of CSFs in developing IASs. Further, eight significant factors, that is, emerging economy multinational enterprises (EMNEs), governance, utility, manpower, capital, software, data and hardware, have come up as the most important factors in integrating AI with robotics in India.",
        "DOI": "10.1108/DPRG-03-2020-0032",
        "paper_author": "Mir U.B.",
        "affiliation_name": "Indian Institute of Technology Delhi",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60032730",
        "affiliation_state": "DL"
    },
    {
        "paper_title": "Recruiting and engaging american indian and alaska native teens and young adults in a sms help-seeking intervention: Lessons learned from the brave study",
        "publication": "International Journal of Environmental Research and Public Health",
        "citied_by": "13",
        "cover_date": "2020-12-02",
        "Abstract": "This paper shares lessons learned recruiting and engaging participants in the BRAVE study, a randomized controlled trial carried out by the Northwest Portland Area Indian Health Board and the mHealth Impact Lab. The team recruited 2330 American Indian/Alaska Native (AI/AN) teens and young adults nationwide (15–24 years old) via social media channels and text message and enrolled 1030 to participate in the 9 month study. Teens and young adults who enrolled in this study received either: 8 weeks of BRAVE text messages designed to improve mental health, help-seeking skills, and promote cultural pride and resilience; or 8 weeks of Science Technology Engineering and Math (STEM) text messages, designed to elevate and re-affirm Native voices in science, technology, engineering, math and medicine; and then received the other set of messages. Results indicate that social media channels like Facebook and Instagram can be used to recruit AI/AN teens and young adults. Retention in this study was high, with 87% of participants completing both the BRAVE and STEM intervention arms. Lessons learned from this process may help teen and young adult-serving organizations, prevention programs, policy makers, researchers, and educators as they support the next generation of AI/AN change makers.",
        "DOI": "10.3390/ijerph17249437",
        "paper_author": "Stephens D.",
        "affiliation_name": "Northwest Portland Area Indian Health Board",
        "affiliation_city": "Portland",
        "affiliation_country": "United States",
        "affiliation_id": "100650375",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "Content Analysis for Artificial Intelligence Planning and Policies in China",
        "publication": "Journal of Modern Information",
        "citied_by": "0",
        "cover_date": "2020-12-01",
        "Abstract": "[Purpose/Significance] The purpose of this study is to identify the structure features by mining the texts of the planning and policies published in 10 provinces or cities, in order to disseminate key points in the texts, help refine the policies and planning, and inform the development of related industries. [Method/Process] The study examined 10 artifi⁃ cial intelligence (AI) policies and planning texts through content analysis and discourse analysis. [Result/Conclusion] The results revealed the similarities and differences in these texts. However, the policies and planning in different provinces and cities usually developed based on their own economic base, geographical characteristics, and cultural features, and thus there were many different features. Finally, the paper discussed some shortcomings in the planning and policies, based on which it gave suggestions for further refining the policies and planning texts.",
        "DOI": "10.3969/j.issn.1008-0821.2020.12.002",
        "paper_author": "Zhang X.",
        "affiliation_name": "Nankai University Business School",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60122450",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Real-Time Assessment of the Burden on the Community of Informal Caregivers. A Pilot Study",
        "publication": "International Journal of Community Well-Being",
        "citied_by": "1",
        "cover_date": "2020-12-01",
        "Abstract": "Good mental health is a critical part of individual well-being, and one of the cornerstones of community well-being. This paper focuses on the community of parents of young psychiatric patients, whose well-being loss is significant because of the enormous burden of suffering that results from their children’s illness. This burden is seldom considered by the ordinary calculations of the costs of mental illness. We suggest that digital daily diaries (DDDs) with instant reporting can become a powerful tool to estimate the intangible costs of mental illness, namely the loss of well-being suffered by the community of informal caregivers. A pilot study was carried out to test the validity of the digital tool. The results of instant reports provide accurate information and are consistent with those obtained through other traditional survey methods. The digital data-gathering tool can be extended to design an affordable, prompt, and cost-effective possible solution for policy-oriented interventions. Besides, this digital tool can easily be extended to collect real-time big data and to use them in conjunction with Artificial Intelligence (AI) to give professionals a powerful tool to face a relevant community issue.",
        "DOI": "10.1007/s42413-020-00083-6",
        "paper_author": "Pettini A.",
        "affiliation_name": "Università degli Studi di Firenze",
        "affiliation_city": "Florence",
        "affiliation_country": "Italy",
        "affiliation_id": "60021859",
        "affiliation_state": "FI"
    },
    {
        "paper_title": "Ethical aspects of bci technology: What is the state of the art?",
        "publication": "Philosophies",
        "citied_by": "30",
        "cover_date": "2020-12-01",
        "Abstract": "Brain–Computer Interface (BCI) technology is a promising research area in many domains. Brain activity can be interpreted through both invasive and non-invasive monitoring devices, allowing for novel, therapeutic solutions for individuals with disabilities and for other non-medical applications. However, a number of ethical issues have been identified from the use of BCI technology. In this paper, we review the academic discussion of the ethical implications of BCI technology in the last five years. We conclude that some emerging applications of BCI technology—including commercial ventures that seek to meld human intelligence with AI—present new and unique ethical concerns. Further, we seek to understand how academic literature on the topic of BCIs addresses these novel concerns. Similar to prior work, we use a limited sample to identify trends and areas of concern or debate among researchers and ethicists. From our analysis, we identify two key areas of BCI ethics that warrant further research: the physical and psychological effects of BCI technology. Additionally, questions of BCI policy have not yet become a frequent point of discussion in the relevant literature on BCI ethics, and we argue this should be addressed in future work. We provide guiding questions that will help ethicists and policy makers grapple with the most important issues associated with BCI technology.",
        "DOI": "10.3390/philosophies5040031",
        "paper_author": "Coin A.",
        "affiliation_name": "NC State University",
        "affiliation_city": "Raleigh",
        "affiliation_country": "United States",
        "affiliation_id": "60004923",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Research on the Development Status and Future Trend of Early-Childhood Education in China under the background of Education Informatization",
        "publication": "Proceedings - 2020 International Conference on Information Science and Education, ICISE-IE 2020",
        "citied_by": "1",
        "cover_date": "2020-12-01",
        "Abstract": "This paper first explains the definition of Early Childhood Education Industry and shows its specific types of subdivision. In the aspect of Kindergarten Education, the author takes the supply-side policy support as the starting point, then calculates the number of single kindergarten students and the Gap of Teachers' Strength, and also finds that there has an obvious problem that teachers' structure hangs upside down between the private and public kindergartens. In addition, in the aspect of Early-Childhood Education other than Kindergarten Education, the author discusses Early Education and Parent-Child Park, Childcare Service and Preschool Training. Finally, this paper studies the education informatization, online education and AI + education in the field of early education, draws the industrial chain structure chart and the profit pattern chart and looks forward to the future development direction from the survey data, to offer suggestions for the related departments and early childhood education practitioners.",
        "DOI": "10.1109/ICISE51755.2020.00091",
        "paper_author": "Liu C.",
        "affiliation_name": "Wenzhou-Kean University",
        "affiliation_city": "Wenzhou",
        "affiliation_country": "China",
        "affiliation_id": "60108882",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "AI-Aided Game: Enhancing the Defense Performance of Scale-Free Network via Deep Reinforcement Learning",
        "publication": "Proceedings - 2020 IEEE 22nd International Conference on High Performance Computing and Communications, IEEE 18th International Conference on Smart City and IEEE 6th International Conference on Data Science and Systems, HPCC-SmartCity-DSS 2020",
        "citied_by": "2",
        "cover_date": "2020-12-01",
        "Abstract": "Scale-free network, as a type of complex network, is prone to various target attacks. Some researches characterize the attack and defense problem of complex network as a game problem, and design the optimal defense strategy from the perspective of achieving the game equilibrium. However, such a game problem in the scale-free network space is very difficult to solve because the strategy space is too large. An effective way to achieve the equilibrium is to train a growing population of player strategies and use heuristic methods to guide the population evolution. The deep reinforcement learning (DRL) has been used to guide the population evolution due to its strong ability to explore new strategies. Inspired by this fact, in this paper we apply an AI-Aided game framework, Policy Space Response Oracle (PSRO), to solve the above game problem. We first abstract the scale-free network as a game environment and design a set of game rules. The confrontation game occurs between two agents acting as the attacker and the defender in the network, respectively. We then use the convolutional neural network (CNN) to evaluate values of actions in deep Q-network (DQN) and extract game states into tensor forms as CNN's inputs. To tackle the targeted attacks against the scale-free networks, we carefully design a specific action value for the defender combining the node weight and network connectivity parameters of a node in CNN. The simulation results show that the defender agent using CNN as strategies can delay the attacker's intrusions under equilibrium, and achieve a balance between protecting high-weight nodes and keeping the network connectivity.",
        "DOI": "10.1109/HPCC-SmartCity-DSS50907.2020.00047",
        "paper_author": "Lu Z.",
        "affiliation_name": "Tianjin University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60019533",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Applying service design in public services: A scientometric review for innovations in public health and administration",
        "publication": "Proceedings - 2020 Management Science Informatization and Economic Innovation Development Conference, MSIEID 2020",
        "citied_by": "1",
        "cover_date": "2020-12-01",
        "Abstract": "As service design thinking in public services has increasingly attracted attention for producing innovative solutions to wicked problems, its application promises great potentials in creating better and more responsive services. However, there is no comprehensive review on the topic specifically on service design for the fields of public health and public administration. Based on the current discussions on the value of design for public health and public administration, the paper presents a systematic literature review into the specific discussions on service design, with the purpose to provide better public service innovations, especially in the context of recognizing the human needs in the technological digital advancement of Artificial Intelligence (AI), Big Data, and Cloud Computing. The paper outlines the areas of applications, issues, and challenges for future research and policy innovations. By analyzing top keywords and authors from 529 articles, collected from the Web of Science database, the scientometric study reveals an emerging loose network of concepts and authors. Although the impact of such work remains limited at its early stage of development, the combination of both human-centered insights and system thinking processes at the organization levels, brought by the service design approach, has shown to tackle some of the wicked problems of public health and public administration. Future research and design workshops can be conducted to reinvigorate the notion of people-centered commitments for public service innovations, with societal relevance and scientific rigor.",
        "DOI": "10.1109/MSIEID52046.2020.00081",
        "paper_author": "Lu P.",
        "affiliation_name": "Nanfang College of Sun Yet-sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60117185",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Developing an intelligent framework for improving the quality of service in the government organizations in the Kingdom of Saudi Arabia",
        "publication": "International Journal of Advanced Computer Science and Applications",
        "citied_by": "3",
        "cover_date": "2020-12-01",
        "Abstract": "—The Kingdom of Saudi Arabia is enhancing the services and applications in government organizations through the number of systems that generate a massive amount of data through Big Data technology. Recently, the Global Artificial Intelligent Summit 2020, Saudi Data and Artificial Intelligence Authority (SDAIA), NEOM have launched an Artificial Intelligence (AI) strategy that aligns with the Kingdom Vision 2030. AI opens a wide door for opportunities and new strategies that will narrow the gap in the skillset of individuals and promote research and innovation in the IT industry. Organizations lack advanced techniques to evaluate the performance of individuals and departments that supports improving the quality of service. The introduction of AI-based applications in the government and private sectors will facilitate decision-makers in tracking and optimizing the efficiency of departments and individuals. This research aims to develop an intelligent framework for government organizations to improve the quality of services rendered to customers and businesses. In addition, it highlights the importance of AI policies in archiving metadata. This paper presents a framework for an organization that contains Chatbot, Sentiment Analysis, and Key Performance Indicators to improve the services. A synthetic dataset is employed as a testbed to evaluate the performance of the framework. The outcome of this study shows that the proposed framework able to improve the performance of organizations. Using this proposed framework, organizations can build a mechanism for their workforce to retrieve meaningful information. Moreover, it provides significant features include efficient data extraction, data management, and AI-based security for effective document management.",
        "DOI": "10.14569/IJACSA.2020.0111233",
        "paper_author": "AlGosaibi A.A.",
        "affiliation_name": "King Faisal University",
        "affiliation_city": "Al-Ahsa",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60030736",
        "affiliation_state": "Ash Sharqiyah"
    },
    {
        "paper_title": "What Information is Required for Explainable AI? : A Provenance-based Research Agenda and Future Challenges",
        "publication": "Proceedings - 2020 IEEE 6th International Conference on Collaboration and Internet Computing, CIC 2020",
        "citied_by": "9",
        "cover_date": "2020-12-01",
        "Abstract": "Deriving explanations of an Artificial Intelligence-based system's decision making is becoming increasingly essential to address requirements that meet quality standards and operate in a transparent, comprehensive, understandable, and explainable manner. Furthermore, more security issues as well as concerns from human perspectives emerge in describing the explainability properties of AI. A full system view is required to enable humans to properly estimate risks when dealing with such systems. This paper introduces open issues in this research area to present the overall picture of explainability and the required information needed for the explanation to make a decision-oriented AI system transparent to humans. It illustrates the potential contribution of proper provenance data to AI-based systems by describing a provenance graph-based design. This paper proposes a six-Ws framework to demonstrate how a security-aware provenance graph-based design can build the basis for providing end-users with sufficient meta-information on AI-based decision systems. An example scenario is then presented that highlights the required information for better explainability both from human and security-aware aspects. Finally, associated challenges are discussed to provoke further research and commentary.",
        "DOI": "10.1109/CIC50333.2020.00030",
        "paper_author": "Jaigirdar F.T.",
        "affiliation_name": "Monash University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60019578",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Artificial intelligence and hybrid imaging: the best match for personalized medicine in oncology",
        "publication": "European Journal of Hybrid Imaging",
        "citied_by": "37",
        "cover_date": "2020-12-01",
        "Abstract": "Artificial intelligence (AI) refers to a field of computer science aimed to perform tasks typically requiring human intelligence. Currently, AI is recognized in the broader technology radar within the five key technologies which emerge for their wide-ranging applications and impact in communities, companies, business, and value chain framework alike. However, AI in medical imaging is at an early phase of development, and there are still hurdles to take related to reliability, user confidence, and adoption. The present narrative review aimed to provide an overview on AI-based approaches (distributed learning, statistical learning, computer-aided diagnosis and detection systems, fully automated image analysis tool, natural language processing) in oncological hybrid medical imaging with respect to clinical tasks (detection, contouring and segmentation, prediction of histology and tumor stage, prediction of mutational status and molecular therapies targets, prediction of treatment response, and outcome). Particularly, AI-based approaches have been briefly described according to their purpose and, finally lung cancer—being one of the most extensively malignancy studied by hybrid medical imaging—has been used as illustrative scenario. Finally, we discussed clinical challenges and open issues including ethics, validation strategies, effective data-sharing methods, regulatory hurdles, educational resources, and strategy to facilitate the interaction among different stakeholders. Some of the major changes in medical imaging will come from the application of AI to workflow and protocols, eventually resulting in improved patient management and quality of life. Overall, several time-consuming tasks could be automatized. Machine learning algorithms and neural networks will permit sophisticated analysis resulting not only in major improvements in disease characterization through imaging, but also in the integration of multiple-omics data (i.e., derived from pathology, genomic, proteomics, and demographics) for multi-dimensional disease featuring. Nevertheless, to accelerate the transition of the theory to practice a sustainable development plan considering the multi-dimensional interactions between professionals, technology, industry, markets, policy, culture, and civil society directed by a mindset which will allow talents to thrive is necessary.",
        "DOI": "10.1186/s41824-020-00094-8",
        "paper_author": "Sollini M.",
        "affiliation_name": "Humanitas University",
        "affiliation_city": "Pieve Emanuele",
        "affiliation_country": "Italy",
        "affiliation_id": "60107210",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "We Are Not Pontius Pilate: Acknowledging Ethics and Policy",
        "publication": "2020 IEEE Symposium Series on Computational Intelligence, SSCI 2020",
        "citied_by": "2",
        "cover_date": "2020-12-01",
        "Abstract": "A new AI system is being developed to optimize vaccination strategies based on the structure and shape of a community's social contact network. The technology is minimally constrained and not bound by preconceived notions or human biases. With this come novel outside the box strategies; however, the system is only capable of optimizing what it is instructed to optimize, and does not consider any ethical or political concerns. With the growing concern for systematic discrimination as a result of artificial intelligence, we acknowledge a number of relevant issues that may arise as a consequence of our new technology and categorize them into three classes. We also introduce four normative ethical approaches that are used as a framework for decision-making. Despite the focus on vaccination strategies, our goal is to improve the discussions surrounding public concern and trust over artificial intelligence and demonstrate that artificial intelligence practitioners are addressing these concerns.",
        "DOI": "10.1109/SSCI47803.2020.9308312",
        "paper_author": "Hughes J.A.",
        "affiliation_name": "St. Francis Xavier University",
        "affiliation_city": "Antigonish",
        "affiliation_country": "Canada",
        "affiliation_id": "60032048",
        "affiliation_state": "NS"
    },
    {
        "paper_title": "Health chatbots for fighting COVID-19: A scoping review",
        "publication": "Acta Informatica Medica",
        "citied_by": "83",
        "cover_date": "2020-12-01",
        "Abstract": "Background: Health chatbots are rising in popularity and capability for fighting the novel SARS-CoV-2 coronavirus (COVID-19). Objectives: This study aims to review the current literature on COVID-19 related chatbots in healthcare, identify and characterize these emerging technologies and their applications for combating COVID-19, and describe related challenges. Methods: The authors conducted a scoping review of peer-reviewed literature on COVID-19, guided by the Arksey and O'Malley framework. PubMed/MEDLINE and Google Scholar were searched over a period between January and September 2020 by using the keywords “COVID* chatbot”, “virtual assistant”, “AI enabled platform COVID” and associated synonyms. Relevant studies' references were checked for further articles. The content of these studies was screened and thematically analyzed by the two authors. Results: Out of 543 articles initially identified, 9 were eligible for inclusion. Studies describing chatbots' development and architecture (n=6) were the most common, and only 3 empirical studies on the user experience were identified. Our scoping review identified five key applications of the current health chatbots, which were: disseminating health information and knowledge; self-triage and personal risk assessment; monitoring exposure and notifications; tracking COVID-19 symptoms and health aspects; and combating misinformation and fake news. Furthermore, these technologies can accomplish the following tasks: ask and answer questions; create health records and history of use; complete forms and generate reports; and take simple actions. Nonetheless, the use of health chatbots poses many challenges both at the level of the social system (i.e., consumers' acceptability) as well as the technical system (i.e., design and usability). Conclusion: Using health chatbots to combat COVID-19 is a practice still in its infancy. We believe that our work will help researchers in this domain gain better understanding of this novel technology's design and applications, which are needed for continuous improvement in the health chatbots' functionalities and their usefulness to fight COVID-19.",
        "DOI": "10.5455/AIM.2020.28.241-247",
        "paper_author": "Almalki M.",
        "affiliation_name": "Jazan University",
        "affiliation_city": "Jizan",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60106293",
        "affiliation_state": "Jazan"
    },
    {
        "paper_title": "Modeling Value-Based Decision-Making Policies Using Genetic Programming: A Proof-of-Concept Study",
        "publication": "Swiss Journal of Psychology",
        "citied_by": "3",
        "cover_date": "2020-12-01",
        "Abstract": "An important way to develop models in psychology and cognitive science is to express them as computer programs. However, computational modeling is not an easy task. To address this issue, some have proposed using artificial-intelligence (AI) techniques, such as genetic programming (GP) to semiautomatically generate models. In this paper, we establish whether models used to generate data can be recovered when GP evolves models accounting for such data. As an example, we use an experiment from decision-making which addresses a central question in decision-making research, namely, to understand what strategy, or policy, agents adopt in order to make a choice. In decision-making, this often means understanding the policy that best explains the distribution of choices and/or reaction times of twoalternative forced-choice decisions. We generated data from three models using different psychologically plausible policies and then evaluated the ability and extent of GP to correctly identify the true generating model among the class of virtually infinite candidate models. Our results show that, regardless of the complexity of the policy, GP can correctly identify the true generating process. Given these results, we discuss implications for cognitive science research and computational scientific discovery as well as possible future applications.",
        "DOI": "10.1024/1421-0185/a000241",
        "paper_author": "Pirrone A.",
        "affiliation_name": "London School of Economics and Political Science",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60003059",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence technologies and related urban planning and development concepts: How are they perceived and utilized in Australia?",
        "publication": "Journal of Open Innovation: Technology, Market, and Complexity",
        "citied_by": "132",
        "cover_date": "2020-12-01",
        "Abstract": "Artificial intelligence (AI) is a powerful technology with an increasing popularity and applications in areas ranging from marketing to banking and finance, from agriculture to healthcare and security, from space exploration to robotics and transport, and from chatbots to artificial creativity and manufacturing. Although many of these areas closely relate to the urban context, there is limited understanding of the trending AI technologies and their application areas—or concepts—in the urban planning and development fields. Similarly, there is a knowledge gap in how the public perceives AI technologies, their application areas, and the AI-related policies and practices of our cities. This study aims to advance our understanding of the relationship between the key AI technologies (n = 15) and their key application areas (n = 16) in urban planning and development. To this end, this study examines public perceptions of how AI technologies and their application areas in urban planning and development are perceived and utilized in the testbed case study of Australian states and territories. The methodological approach of this study employs the social media analytics method, and conducts sentiment and content analyses of location-based Twitter messages (n = 11,236) from Australia. The results disclose that: (a) digital transformation, innovation, and sustainability are the most popular AI application areas in urban planning and development; (b) drones, automation, robotics, and big data are the most popular AI technologies utilized in urban planning and development, and; (c) achieving the digital transformation and sustainability of cities through the use of AI technologies—such as big data, automation and robotics—is the central community discussion topic.",
        "DOI": "10.3390/joitmc6040187",
        "paper_author": "Yigitcanlar T.",
        "affiliation_name": "Queensland University of Technology",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60011019",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Why to buy insurance? An explainable artificial intelligence approach",
        "publication": "Risks",
        "citied_by": "38",
        "cover_date": "2020-12-01",
        "Abstract": "We propose an Explainable AI model that can be employed in order to explain why a customer buys or abandons a non-life insurance coverage. The method consists in applying similarity clustering to the Shapley values that were obtained from a highly accurate XGBoost predictive classification algorithm. Our proposed method can be embedded into a technologically-based insurance service (Insurtech), allowing to understand, in real time, the factors that most contribute to customers’ decisions, thereby gaining proactive insights on their needs. We prove the validity of our model with an empirical analysis that was conducted on data regarding purchases of insurance micro-policies. Two aspects are investigated: the propensity to buy an insurance policy and the risk of churn of an existing customer. The results from the analysis reveal that customers can be effectively and quickly grouped according to a similar set of characteristics, which can predict their buying or churn behaviour well.",
        "DOI": "10.3390/risks8040137",
        "paper_author": "Gramegna A.",
        "affiliation_name": "Università degli Studi di Pavia",
        "affiliation_city": "Pavia",
        "affiliation_country": "Italy",
        "affiliation_id": "60015197",
        "affiliation_state": "PV"
    },
    {
        "paper_title": "Citizens Versus the Internet: Confronting Digital Challenges With Cognitive Tools",
        "publication": "Psychological Science in the Public Interest",
        "citied_by": "225",
        "cover_date": "2020-12-01",
        "Abstract": "The Internet has evolved into a ubiquitous and indispensable digital environment in which people communicate, seek information, and make decisions. Despite offering various benefits, online environments are also replete with smart, highly adaptive choice architectures designed primarily to maximize commercial interests, capture and sustain users’ attention, monetize user data, and predict and influence future behavior. This online landscape holds multiple negative consequences for society, such as a decline in human autonomy, rising incivility in online conversation, the facilitation of political extremism, and the spread of disinformation. Benevolent choice architects working with regulators may curb the worst excesses of manipulative choice architectures, yet the strategic advantages, resources, and data remain with commercial players. One way to address some of this imbalance is with interventions that empower Internet users to gain some control over their digital environments, in part by boosting their information literacy and their cognitive resistance to manipulation. Our goal is to present a conceptual map of interventions that are based on insights from psychological science. We begin by systematically outlining how online and offline environments differ despite being increasingly inextricable. We then identify four major types of challenges that users encounter in online environments: persuasive and manipulative choice architectures, AI-assisted information architectures, false and misleading information, and distracting environments. Next, we turn to how psychological science can inform interventions to counteract these challenges of the digital world. After distinguishing among three types of behavioral and cognitive interventions—nudges, technocognition, and boosts—we focus on boosts, of which we identify two main groups: (a) those aimed at enhancing people’s agency in their digital environments (e.g., self-nudging, deliberate ignorance) and (b) those aimed at boosting competencies of reasoning and resilience to manipulation (e.g., simple decision aids, inoculation). These cognitive tools are designed to foster the civility of online discourse and protect reason and human autonomy against manipulative choice architectures, attention-grabbing techniques, and the spread of false information.",
        "DOI": "10.1177/1529100620946707",
        "paper_author": "Kozyreva A.",
        "affiliation_name": "Max Planck Institute for Human Development",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60026562",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Exploring the dynamics of urban greenness space and their driving factors using geographically weighted regression: A case study in Wuhan Metropolis, China",
        "publication": "Land",
        "citied_by": "13",
        "cover_date": "2020-12-01",
        "Abstract": "Urban greenness plays a vital role in supporting the ecosystem services of a city. Exploring the dynamics of urban greenness space and their driving forces can provide valuable information for making solid urban planning policies. This study aims to investigate the dynamics of urban greenness space patterns through landscape indices and to apply geographically weighted regression (GWR) to map the spatially varied impact on the indices from economic and environmental factors. Two typical landscape indices, i.e., percentage of landscape (PLAND) and aggregation index (AI), which measure the abundance and fragmentation of urban greenness coverage, respectively, were taken to map the changes in urban greenness. As a case study, the metropolis of Wuhan, China was selected, where time-series of urban greenness space were extracted at an annual step from the Landsat collections from Google Earth Engine during 2000–2018. The study shows that the urban greenness space not only decreased significantly, but also tended to be more fragmented over the years. Road network density, normalized difference built-up index (NDBI), terrain elevation and slope, and precipitation were found to significantly correlate to the landscape indices. GWR modeling successfully captures the spatially varied impact from the considered factors and the results from GWR modeling provide a critical reference for making location-specific urban planning.",
        "DOI": "10.3390/land9120500",
        "paper_author": "Yang C.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Mapping the co-evolution of artificial intelligence, robotics, and the internet of things over 20 years (1998-2017)",
        "publication": "PLoS ONE",
        "citied_by": "11",
        "cover_date": "2020-12-01",
        "Abstract": "Understanding the emergence, co-evolution, and convergence of science and technology (S&T) areas offers competitive intelligence for researchers, managers, policy makers, and others. This paper presents new funding, publication, and scholarly network metrics and visualizations that were validated via expert surveys. The metrics and visualizations exemplify the emergence and convergence of three areas of strategic interest: artificial intelligence (AI), robotics, and internet of things (IoT) over the last 20 years (1998-2017). For 32,716 publications and 4,497 NSF awards, we identify their topical coverage (using the UCSD map of science), evolving co-author networks, and increasing convergence. The results support data-driven decision making when setting proper research and development (R&D) priorities; developing future S&T investment strategies; or performing effective research program assessment.",
        "DOI": "10.1371/journal.pone.0242984",
        "paper_author": "Börner K.",
        "affiliation_name": "Luddy School of Informatics, Computing, and Engineering",
        "affiliation_city": "Bloomington",
        "affiliation_country": "United States",
        "affiliation_id": "60010875",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Proceduralizing control and discretion: Human oversight in artificial intelligence policy",
        "publication": "Maastricht Journal of European and Comparative Law",
        "citied_by": "27",
        "cover_date": "2020-12-01",
        "Abstract": "This article is an examination of human oversight in EU policy for controlling algorithmic systems in automated legal decision making. Despite the shortcomings of human control over complex technical systems, human oversight is advocated as a solution against the risks of increasing reliance on algorithmic tools. For law, human oversight provides an attractive, easily implementable and observable procedural safeguard. However, without awareness of its inherent limitations, human oversight is in danger of becoming a value in itself, an empty procedural shell used as a stand-in justification for algorithmization but failing to provide protection for fundamental rights. By complementing socio-legal analysis with Science and Technology Studies, critical algorithm studies, organization studies and human-computer interaction research, the author explores the importance of keeping the human in the loop and asks what the human element at the core of legal decision making is. Through algorithmization it is made visible how law conceptualises decision making through human actors, personalises legal decision making through the decision-maker’s discretionary power that provides proportionality and common sense, prevents gross miscarriages of justice and establishes the human encounter deemed essential for the feeling of being heard. The analysis demonstrates the necessary human element embedded in legal decision making, against which the meaningfulness of human oversight needs to be examined.",
        "DOI": "10.1177/1023263X20978649",
        "paper_author": "Koulu R.",
        "affiliation_name": "Helsingin Yliopisto",
        "affiliation_city": "Helsinki",
        "affiliation_country": "Finland",
        "affiliation_id": "60002952",
        "affiliation_state": "Uusimaa"
    },
    {
        "paper_title": "The ironies of autonomy",
        "publication": "Humanities and Social Sciences Communications",
        "citied_by": "28",
        "cover_date": "2020-12-01",
        "Abstract": "Current research on autonomous vehicles tends to focus on making them safer through policies to manage innovation, and integration into existing urban and mobility systems. This article takes social, cultural and philosophical approaches instead, critically appraising how human subjectivity, and human-machine relations, are shifting and changing through the application of big data and algorithmic techniques to the automation of driving. 20th century approaches to safety engineering and automation—be it in an airplane or automobile-have sought to either erase the human because she is error-prone and inefficient; have design compensate for the limits of the human; or at least mould human into machine through an assessment of the complementary competencies of each. The ‘irony of automation’ is an observation of the tensions emerging therein; for example, that the computationally superior and efficient machine actually needs human operators to ensure that it is working effectively; and that the human is inevitably held accountable for errors, even if the machine is more efficient or accurate. With the emergence of the autonomous vehicle (AV) as simultaneously AI/ ‘robot’, and automobile, and distributed, big data infrastructural platform, these beliefs about human and machine are dissolving into what I refer to as the ironies of autonomy. For example, recent AV crashes suggest that human operators cannot intervene in the statistical operations underlying automated decision-making in machine learning, but are expected to. And that while AVs promise ‘freedom’, human time, work, and bodies are threaded into, and surveilled by, data infrastructures, and re-shaped by its information flows. The shift that occurs is that human subjectivity has socio-economic and legal implications and is not about fixed attributes of human and machine fitting into each other. Drawing on Postphenomenological concepts of embodiment and instrumentation, and excerpts from fieldwork, this article argues that the emergence of AVs in society prompts a rethinking of the multiple relationalities that constitute humanity through machines.",
        "DOI": "10.1057/s41599-020-00646-0",
        "paper_author": "Ganesh M.I.",
        "affiliation_name": "Leuphana Universität Lüneburg",
        "affiliation_city": "Luneburg",
        "affiliation_country": "Germany",
        "affiliation_id": "60072202",
        "affiliation_state": "Niedersachsen"
    },
    {
        "paper_title": "Artificial intelligence in low- And middle-income countries: Innovating global health radiology",
        "publication": "Radiology",
        "citied_by": "100",
        "cover_date": "2020-12-01",
        "Abstract": "Scarce or absent radiology resources impede adoption of artificial intelligence (AI) for medical imaging by resource-poor health institutions. They face limitations in local equipment, personnel expertise, infrastructure, data-rights frameworks, and public policies. The trustworthiness of AI for medical decision making in global health and low-resource settings is hampered by insufficient data diversity, nontransparent AI algorithms, and resource-poor health institutions' limited participation in AI production and validation. RAD-AID's three-pronged integrated strategy for AI adoption in resource-poor health institutions is presented, which includes clinical radiology education, infrastructure implementation, and phased AI introduction. This strategy derives from RADAID's more-than-a-decade experience as a nonprofit organization developing radiology in resource-poor health institutions, both in the United States and in low- and middle-income countries. The three components synergistically provide the foundation to address health care disparities. Local radiology personnel expertise is augmented through comprehensive education. Software, hardware, and radiologic and networking infrastructure enables radiology workflows incorporating AI. These educational and infrastructure developments occur while RAD-AID delivers phased introduction, testing, and scaling of AI via global health collaborations.",
        "DOI": "10.1148/radiol.2020201434",
        "paper_author": "Mollura D.J.",
        "affiliation_name": "RAD-AID International",
        "affiliation_city": "Chevy Chase",
        "affiliation_country": "United States",
        "affiliation_id": "109127988",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "Access to Finance for Artificial Intelligence Regulation in the Financial Services Industry",
        "publication": "European Business Organization Law Review",
        "citied_by": "55",
        "cover_date": "2020-12-01",
        "Abstract": "This paper discusses the design of the legal and regulatory framework for using artificial intelligence (AI) in the financial services markets to enhance access to finance (financial inclusion). The author argues that the development of AI should continue to adhere to the regulatory objectives of market safety, consumer protection, and market integrity. However, to ensure equality and fairness, access to finance should be made a clear policy choice. In the first part, the author discusses how AI can lead to systemic risks and market manipulation on trading platforms. For example, by examining the use of algorithms for trading on the capital market, the author discerns the regulatory objectives and the possible methods of regulation for peer-to-peer platforms. In the second part, the author discusses how the use of AI to provide consumers with investment advice, such as financial advice provided from robo-advisers, can close the investment advisory gap and provide consumers with access to finance. The current regime does not provide adequate protection to financial consumers in this regard. In the third part, the author discusses how AI can be used as a form of RegTech to streamline compliance processes, thereby increasing competition in financial markets and providing a benefit to consumers. However, this use may be in conflict with privacy, data protection, and ethical concerns. The author makes policy recommendations and suggests some directions for governance in the use of AI in financial services to enhance access to finance. The findings of this paper are relevant to research on the future governance of AI in financial services, public policy innovation, and urban development.",
        "DOI": "10.1007/s40804-020-00200-0",
        "paper_author": "Lee J.",
        "affiliation_name": "University of Exeter",
        "affiliation_city": "Exeter",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026479",
        "affiliation_state": "Devon"
    },
    {
        "paper_title": "Towards Transparency by Design for Artificial Intelligence",
        "publication": "Science and Engineering Ethics",
        "citied_by": "228",
        "cover_date": "2020-12-01",
        "Abstract": "In this article, we develop the concept of Transparency by Design that serves as practical guidance in helping promote the beneficial functions of transparency while mitigating its challenges in automated-decision making (ADM) environments. With the rise of artificial intelligence (AI) and the ability of AI systems to make automated and self-learned decisions, a call for transparency of how such systems reach decisions has echoed within academic and policy circles. The term transparency, however, relates to multiple concepts, fulfills many functions, and holds different promises that struggle to be realized in concrete applications. Indeed, the complexity of transparency for ADM shows tension between transparency as a normative ideal and its translation to practical application. To address this tension, we first conduct a review of transparency, analyzing its challenges and limitations concerning automated decision-making practices. We then look at the lessons learned from the development of Privacy by Design, as a basis for developing the Transparency by Design principles. Finally, we propose a set of nine principles to cover relevant contextual, technical, informational, and stakeholder-sensitive considerations. Transparency by Design is a model that helps organizations design transparent AI systems, by integrating these principles in a step-by-step manner and as an ex-ante value, not as an afterthought.",
        "DOI": "10.1007/s11948-020-00276-4",
        "paper_author": "Felzmann H.",
        "affiliation_name": "University of Galway",
        "affiliation_city": "Galway",
        "affiliation_country": "Ireland",
        "affiliation_id": "60008539",
        "affiliation_state": "Connacht"
    },
    {
        "paper_title": "A rule-based model for victim prediction",
        "publication": "International Journal of Law, Crime and Justice",
        "citied_by": "0",
        "cover_date": "2020-12-01",
        "Abstract": "The present study proposes a novel automated model, called Vulnerability Index for Population at Risk (VIPAR) scores, to identify rare populations for their future shooting victimizations. Likewise, the focused deterrence approach identifies vulnerable individuals and offers certain treatments (e.g., outreach services) to prevent violence in communities. Our rule-based engine model is the first AI-based model for victim prediction purposes. The model merit is the usage of criminology studies to construct the rule-based engine to predict victims. This paper aims to compare the list of focused deterrence strategy with the VIPAR score list regarding their predictive power for the future shooting victimizations. Drawing on the criminological studies, this study uses age, past criminal history, and peer influence as the main predictors of future violence. Network graph analysis is employed to measure the influence of peers on the outcome variable. The proposed model also uses logistic regression analysis to verify the variable selections in the model. Following the analytical process, the current research creates an automated model (VIPAR scores) to predict vulnerable populations for their future shooting involvements. Our empirical results show that VIPAR scores predict 25.8% of future shooting victims and 32.2% of future shooting suspects, whereas the focused deterrence list predicts 13% of future shooting victims and 9.4% of future shooting suspects. The proposed model outperforms the intelligence list of focused deterrence policies in predicting the future fatal and non-fatal shootings. Furthermore, this paper discusses the concerns about the presumption of innocence right.",
        "DOI": "10.1016/j.ijlcj.2020.100440",
        "paper_author": "Ozer M.",
        "affiliation_name": "University of Cincinnati",
        "affiliation_city": "Cincinnati",
        "affiliation_country": "United States",
        "affiliation_id": "60025152",
        "affiliation_state": "OH"
    },
    {
        "paper_title": "Dark Nudges and Sludge in Big Alcohol: Behavioral Economics, Cognitive Biases, and Alcohol Industry Corporate Social Responsibility",
        "publication": "Milbank Quarterly",
        "citied_by": "92",
        "cover_date": "2020-12-01",
        "Abstract": "Policy Points Nudges steer people toward certain options but also allow them to go their own way. “Dark nudges” aim to change consumer behavior against their best interests. “Sludge” uses cognitive biases to make behavior change more difficult. We have identified dark nudges and sludge in alcohol industry corporate social responsibility (CSR) materials. These undermine the information on alcohol harms that they disseminate, and may normalize or encourage alcohol consumption. Policymakers and practitioners should be aware of how dark nudges and sludge are used by the alcohol industry to promote misinformation about alcohol harms to the public. Context: “Nudges” and other behavioral economic approaches exploit common cognitive biases (systematic errors in thought processes) in order to influence behavior and decision-making. Nudges that encourage the consumption of harmful products (for example, by exploiting gamblers’ cognitive biases) have been termed “dark nudges.” The term “sludge” has also been used to describe strategies that utilize cognitive biases to make behavior change harder. This study aimed to identify whether dark nudges and sludge are used by alcohol industry (AI)–funded corporate social responsibility (CSR) organizations, and, if so, to determine how they align with existing nudge conceptual frameworks. This information would aid their identification and mitigation by policymakers, researchers, and civil society. Methods: We systematically searched websites and materials of AI CSR organizations (e.g., IARD, Drinkaware, Drinkwise, Éduc'alcool); examples were coded by independent raters and categorized for further analysis. Findings: Dark nudges appear to be used in AI communications about “responsible drinking.” The approaches include social norming (telling consumers that “most people” are drinking) and priming drinkers by offering verbal and pictorial cues to drink, while simultaneously appearing to warn about alcohol harms. Sludge, such as the use of particular fonts, colors, and design layouts, appears to use cognitive biases to make health-related information about the harms of alcohol difficult to access, and enhances exposure to misinformation. Nudge-type mechanisms also underlie AI mixed messages, in particular alternative causation arguments, which propose nonalcohol causes of alcohol harms. Conclusions: Alcohol industry CSR bodies use dark nudges and sludge, which utilize consumers’ cognitive biases to promote mixed messages about alcohol harms and to undermine scientific evidence. Policymakers, practitioners, and the public need to be aware of how such techniques are used to nudge consumers toward industry misinformation. The revised typology presented in this article may help with the identification and further analysis of dark nudges and sludge.",
        "DOI": "10.1111/1468-0009.12475",
        "paper_author": "Petticrew M.",
        "affiliation_name": "London School of Hygiene &amp; Tropical Medicine",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60031331",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence and business models in the sustainable development goals perspective: A systematic literature review",
        "publication": "Journal of Business Research",
        "citied_by": "619",
        "cover_date": "2020-12-01",
        "Abstract": "This paper investigates the literary corpus on the role of Artificial Intelligence (AI) in the construction of sustainable business models (SBMs). It provides a quantitative overview of the academic literature that constitutes the field. The paper discusses the relationships between AI and rapid developments in machine learning and sustainable development (SD). Specifically, the aim is to understand whether this branch of computer science can influence production and consumption patterns to achieve sustainable resource management according to Sustainable Development Goals (SDGs) outlined in the UN 2030 Agenda. Moreover, the paper aims to highlight the role of Knowledge Management Systems (KMS) in the cultural drift toward the spread of AI for SBMs. Despite the importance of the topic, there is no comprehensive review of the AI and SBM literature in light of SDGs. Based on a database containing 73 publications in English with publication dates from 1990 to 2019, a bibliometric analysis is conducted. The findings show that the innovation challenge involves ethical, social, economic, and legal aspects. Thus, considering that the development potential of AI is linked to the UN 2030 Agenda for SD, especially to SDG#12, our results also outline the framework of the existing literature on AI and SDGs, especially SDG#12, including AI's association with the cultural drift (CD) in the SBMs. The paper highlights the key contributions, which are: i) a comprehensive review of the key underlying relationship between AI and SBMs, offering a holistic view as needed, ii) identifying a research gap regarding KMS through AI, and iii) the implications of AI concerning SDG#12. Academic and managerial implications are also discussed regarding KMS in the SBMs, where the AI can represent the vehicle to meet the SDGs allowing for the identification of the cultural change required by enterprises to achieve sustainable goals. Thus, business companies, academic research practitioners, and state policy should focus on the further development of the use of AI in SBMs.",
        "DOI": "10.1016/j.jbusres.2020.08.019",
        "paper_author": "Di Vaio A.",
        "affiliation_name": "Parthenope University of Naples",
        "affiliation_city": "Naples",
        "affiliation_country": "Italy",
        "affiliation_id": "60025235",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Deliberative democracy and historical perspectives on American Indian/Alaska native political decision-making practices",
        "publication": "Humanities and Social Sciences Communications",
        "citied_by": "10",
        "cover_date": "2020-12-01",
        "Abstract": "Public deliberation has risen to the forefront of governance as a technique for increasing participation in policy making. Scholars and practitioners have also noted the potential for deliberation to give greater influence to historically marginalized populations, such as Indigenous peoples. However, there has been less attention paid to the potential fit between the ideals of deliberation and the governance and decision making practices of American Indian and Alaska Native (AI/AN) peoples. In this paper, we begin to address this gap by analyzing accounts of AI/AN governance from the perspective of deliberation, and note areas of overlap, synergy, and conflict. We conduct a close reading of key historical and ethnographic accounts of four historical AI/AN contexts—the Iroquois Confederation under the Great Law of Peace, 19th century accounts of the Ojibwa village, the Santa Clara Pueblo government in pre-19th century, and Yup’ik village life in the early 20th century—and a more contemporary case in the form of the Santa Clara Pueblo’s Constitution from the Indian Reorganization Act period. We then apply two sets of key criteria for deliberative democracy—from the scholars Robert Dahl and John Gastil—to these accounts and note the ways in which each system is or is not congruent with these frameworks of deliberation. We find variations between these historical tribal contexts in our analysis. Social components of deliberation, such as respectful discussion and equal opportunities to participate, were partially or fully present in many accounts of governance practices, but it was less clear whether the analytic components, such as discussion of a range of solutions, were included in some forms of tribal governance. We then explore the potential implications of our findings for public deliberation within and in AI/AN tribes. We note that deliberative scholars and practitioners should be wary of overgeneralizing about AI/AN tribes.",
        "DOI": "10.1057/s41599-020-0506-4",
        "paper_author": "Reedy J.",
        "affiliation_name": "The University of Oklahoma",
        "affiliation_city": "Norman",
        "affiliation_country": "United States",
        "affiliation_id": "60030931",
        "affiliation_state": "OK"
    },
    {
        "paper_title": "A critical review on computer vision and artificial intelligence in food industry",
        "publication": "Journal of Agriculture and Food Research",
        "citied_by": "322",
        "cover_date": "2020-12-01",
        "Abstract": "Emerging technologies such as computer vision and Artificial Intelligence (AI) are estimated to leverage the accessibility of big data for active training and yielding operational real time smart machines and predictable models. This phenomenon of applying vision and learning methods for the improvement of food industry is termed as computer vision and AI driven food industry. This review contributes to provide an insight into state-of-the-art AI and computer vision technologies that can assist farmers in agriculture and food processing. This paper investigates various scenarios and use cases of machine learning, machine vision and deep learning in global perspective with the lens of sustainability. It explains the increasing demand towards the AgTech industry using computer vision and AI which might be a path towards sustainable food production to feed the future. Also, this review tosses some implications regarding challenges and recommendations in inclusion of technologies in real time farming, substantial global policies and investments. Finally, the paper discusses the possibility of using Fourth Industrial Revolution [4.0 IR] technologies such as deep learning and computer vision robotics as a key for sustainable food production.",
        "DOI": "10.1016/j.jafr.2020.100033",
        "paper_author": "Kakani V.",
        "affiliation_name": "Inha University",
        "affiliation_city": "Incheon",
        "affiliation_country": "South Korea",
        "affiliation_id": "60028876",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Deep Reinforcement Learning for Collaborative Edge Computing in Vehicular Networks",
        "publication": "IEEE Transactions on Cognitive Communications and Networking",
        "citied_by": "190",
        "cover_date": "2020-12-01",
        "Abstract": "Mobile edge computing (MEC) is a promising technology to support mission-critical vehicular applications, such as intelligent path planning and safety applications. In this paper, a collaborative edge computing framework is developed to reduce the computing service latency and improve service reliability for vehicular networks. First, a task partition and scheduling algorithm (TPSA) is proposed to decide the workload allocation and schedule the execution order of the tasks offloaded to the edge servers given a computation offloading strategy. Second, an artificial intelligence (AI) based collaborative computing approach is developed to determine the task offloading, computing, and result delivery policy for vehicles. Specifically, the offloading and computing problem is formulated as a Markov decision process. A deep reinforcement learning technique, i.e., deep deterministic policy gradient, is adopted to find the optimal solution in a complex urban transportation network. By our approach, the service cost, which includes computing service latency and service failure penalty, can be minimized via the optimal workload assignment and server selection in collaborative computing. Simulation results show that the proposed AI-based collaborative computing approach can adapt to a highly dynamic environment with outstanding performance.",
        "DOI": "10.1109/TCCN.2020.3003036",
        "paper_author": "Li M.",
        "affiliation_name": "University of Waterloo",
        "affiliation_city": "Waterloo",
        "affiliation_country": "Canada",
        "affiliation_id": "60014171",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Determining Effective Nutrition Intervention Strategies and the Subsequent Impact on Nutrition Knowledge, Dietary Adherence, and Health Outcomes among American Indian/Alaska Native Youth (2–18 Years of Age): a Systematic Review",
        "publication": "Journal of Racial and Ethnic Health Disparities",
        "citied_by": "5",
        "cover_date": "2020-12-01",
        "Abstract": "The PRISMA style literature review was used to determine effective nutrition intervention strategies and their subsequent impact on nutrition knowledge, dietary adherence, and health outcomes among American Indian/Alaskan Native (AI/AN) youth. Peer-reviewed articles published between January 1980 and December 2019 were extracted from PubMed, CINAHL, Cochrane, and PsychInfo databases. A 4-point inclusion criterion was established to include articles with AI/AN youth, nutrition intervention, and presented health outcomes. A quality criteria checklist was used to assess the articles. A total of 12 studies were included in this study. Interventions that incorporated cultural adaptations (e.g., storytelling), theoretical frameworks (e.g., community-based participatory), active learning (e.g., cooking), tribal partnership, and caregiver involvement slightly improved nutrition knowledge, dietary adherence, and health outcomes. Overall, this review revealed that incorporating cultural aspects with input from the community in a nutrition program has a positive impact on AI/AN youths. Steps can be taken at the policy level to direct obesity and non-communicable disease prevention efforts among AI/AN youth.",
        "DOI": "10.1007/s40615-020-00745-3",
        "paper_author": "Andreo C.L.",
        "affiliation_name": "University of Florida Institute of Food and Agricultural Sciences",
        "affiliation_city": "Gainesville",
        "affiliation_country": "United States",
        "affiliation_id": "60010177",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "AI in the headlines: the portrayal of the ethical issues of artificial intelligence in the media",
        "publication": "AI and Society",
        "citied_by": "130",
        "cover_date": "2020-12-01",
        "Abstract": "As artificial intelligence (AI) technologies become increasingly prominent in our daily lives, media coverage of the ethical considerations of these technologies has followed suit. Since previous research has shown that media coverage can drive public discourse about novel technologies, studying how the ethical issues of AI are portrayed in the media may lead to greater insight into the potential ramifications of this public discourse, particularly with regard to development and regulation of AI. This paper expands upon previous research by systematically analyzing and categorizing the media portrayal of the ethical issues of AI to better understand how media coverage of these issues may shape public debate about AI. Our results suggest that the media has a fairly realistic and practical focus in its coverage of the ethics of AI, but that the coverage is still shallow. A multifaceted approach to handling the social, ethical and policy issues of AI technology is needed, including increasing the accessibility of correct information to the public in the form of fact sheets and ethical value statements on trusted webpages (e.g., government agencies), collaboration and inclusion of ethics and AI experts in both research and public debate, and consistent government policies or regulatory frameworks for AI technology.",
        "DOI": "10.1007/s00146-020-00965-5",
        "paper_author": "Ouchchy L.",
        "affiliation_name": "NC State University",
        "affiliation_city": "Raleigh",
        "affiliation_country": "United States",
        "affiliation_id": "60004923",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Scalable diagnostic screening of mild cognitive impairment using AI dialogue agent",
        "publication": "Scientific Reports",
        "citied_by": "18",
        "cover_date": "2020-12-01",
        "Abstract": "The search for early biomarkers of mild cognitive impairment (MCI) has been central to the Alzheimer’s Disease (AD) and dementia research community in recent years. To identify MCI status at the earliest possible point, recent studies have shown that linguistic markers such as word choice, utterance and sentence structures can potentially serve as preclinical behavioral markers. Here we present an adaptive dialogue algorithm (an AI-enabled dialogue agent) to identify sequences of questions (a dialogue policy) that distinguish MCI from normal (NL) cognitive status. Our AI agent adapts its questioning strategy based on the user’s previous responses to reach an individualized conversational strategy per user. Because the AI agent is adaptive and scales favorably with additional data, our method provides a potential avenue for large-scale preclinical screening of neurocognitive decline as a new digital biomarker, as well as longitudinal tracking of aging patterns in the outpatient setting.",
        "DOI": "10.1038/s41598-020-61994-0",
        "paper_author": "Tang F.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "East Lansing",
        "affiliation_country": "United States",
        "affiliation_id": "60146411",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Deep-reinforcement-learning based autonomous control and decision making for power systems",
        "publication": "Electric Power Engineering Technology",
        "citied_by": "13",
        "cover_date": "2020-11-28",
        "Abstract": "Modern power grids are facing grand operational challenges due to highly intermittent and uncertain renewable energies as well as new types of loads, etc. In recent years, the rapid development of artificial intelligence (AI) technology has brought up new solutions for optimal control problems with high dimension, high nonlinearity and high dynamics. Based on deep reinforcement learning (DRL), a novel autonomous control platform is presented, which can realize online learning and decision making for power system dispatch and control. The target of the proposed control platform is to transform massive real-time measurements directly into control decisions within sub-second. In order to fully demonstrate the feasibility of the \"grid mind\", autonomous voltage control and line flow control are taken as two examples to formulate the methodology of DRL-based power system dispatch and control problem. Finally, both deep-Q-network and deep deterministic policy gradient algorithms are applied to demonstrate the strong learning capability of DRL agents and their effectiveness through extensive simulation results.",
        "DOI": "10.12158/j.2096-3203.2020.06.006",
        "paper_author": "Wang Z.",
        "affiliation_name": "Global Energy Interconnection Research Institute North America",
        "affiliation_city": "San Jose",
        "affiliation_country": "United States",
        "affiliation_id": "118859345",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Handbook of Artificial Intelligence and Robotic Process Automation: Policy and Government Applications",
        "publication": "Handbook of Artificial Intelligence and Robotic Process Automation: Policy and Government Applications",
        "citied_by": "1",
        "cover_date": "2020-11-27",
        "Abstract": "On the commercial side, artificial intelligence applications are powering many sectors. Globally, governments are exploring how to comprehend, incorporate, apply, and use artificial intelligence technologies. The scope of government use of artificial intelligence technology goes beyond that of commercial organizations and is far more complex. In government, the challenges will be as follows: (1) How can governments use artificial intelligence technology to improve their efficiencies? (2) How can governments become more citizen-centric, service based, accessible, and responsive? (3) How can governments protect their citizens from the misuse of artificial intelligence (e.g., alleged Russian bots' interference in U.S. elections)? (4) How can governments use artificial intelligence technology to make better policy decisions and avoid wrong decisions (economic, social etc.)? (5) How can governments develop new standards to govern and manage the deployment of artificial intelligence technologies (e.g., autonomous cars, financial markets and trading, healthcare bots)? (6) How will the legislative bodies respond to the rise of intelligent machines? (7) How will the use of artificial intelligence in the military change the arms race? (8) What roles governments will need to play in developing global standards related to artificial intelligence (United Nations)? (9) How can governments improve their countries' productivity with artificial intelligence? (10) How can governments handle the upcoming unemployment that would result from AI automation? All the above questions are at an early stage of exploration and many have not been addressed comprehensively. This book deals with all the above issues and provides the first guide to governments and policy makers of the world on artificial intelligence.",
        "DOI": "NA",
        "paper_author": "Munoz J.M.",
        "affiliation_name": "Millikin University",
        "affiliation_city": "Decatur",
        "affiliation_country": "United States",
        "affiliation_id": "60016705",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "Deep reinforcement learning for optimization",
        "publication": "Research Anthology on Artificial Intelligence Applications in Security",
        "citied_by": "0",
        "cover_date": "2020-11-27",
        "Abstract": "Deep reinforcement learning (DRL) has transformed the field of artificial intelligence (AI) especially after the success of Google DeepMind. This branch of machine learning epitomizes a step toward building autonomous systems by understanding of the visual world. Deep reinforcement learning (RL) is currently applied to different sorts of problems that were previously obstinate. In this chapter, at first, the authors started with an introduction of the general field of RL and Markov decision process (MDP). Then, they clarified the common DRL framework and the necessary components RL settings. Moreover, they analyzed the stochastic gradient descent (SGD)-based optimizers such as ADAM and a non-specific multi-policy selection mechanism in a multi-objective Markov decision process. In this chapter, the authors also included the comparison for different Deep Q networks. In conclusion, they describe several challenges and trends in research within the deep reinforcement learning field. Copyright",
        "DOI": "10.4018/978-1-7998-7705-9.ch070",
        "paper_author": "Hasan M.M.",
        "affiliation_name": "Anglia Ruskin University",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60000913",
        "affiliation_state": "Cambridgeshire"
    },
    {
        "paper_title": "Exploring the impact of security policy on compliance",
        "publication": "Research Anthology on Artificial Intelligence Applications in Security",
        "citied_by": "0",
        "cover_date": "2020-11-27",
        "Abstract": "The objective of this chapter is to discuss the integration of advancements made in the field of artificial intelligence into the existing business intelligence tools. Specifically, it discusses how the business intelligence tool can integrate time series analysis, supervised and unsupervised machine learning techniques and natural language processing in it and unlock deeper insights, make predictions, and execute strategic business action from within the tool itself. This chapter also provides a high-level overview of current state of the art AI techniques and provides examples in the realm of business intelligence. The eventual goal of this chapter is to leave readers thinking about what the future of business intelligence would look like and how enterprise can benefit by integrating AI in it.",
        "DOI": "10.4018/978-1-7998-7705-9.ch017",
        "paper_author": "Yaokumah W.",
        "affiliation_name": "Pentecost University College",
        "affiliation_city": "Accra",
        "affiliation_country": "Ghana",
        "affiliation_id": "60121900",
        "affiliation_state": "Greater Accra"
    },
    {
        "paper_title": "Challenges facing technology standardization in the age of digital transformation",
        "publication": "Research Anthology on Artificial Intelligence Applications in Security",
        "citied_by": "0",
        "cover_date": "2020-11-27",
        "Abstract": "It is widely recognized that we are in rapid transition to the so-called fourth industrial revolution, a world of digitalization and mass interconnectedness enabled by a plethora of emergent powerful technologies including artificial intelligence (AI), internet of things (IoT), and distributed ledgers (DLT). A key element of this \"revolution\" is the move to digital manufacturing. While undoubtedly exciting, this transition presents challenges to policymakers, industry, and societal stakeholders alike. One such challenge is defining an optimum level for any market intervention measure(s), such that a balance is struck between ensuring a pro-industrial and economic innovation-friendly approach and guaranteeing adequate levels of consumer-focused protection. Standardization can be leveraged as one element of interventionary policy designed to help strike the required balance, both in its well-proven bottom-up and industry-led voluntary application and as a tool to support implementation of regulations. With a focus on digital transformation, this chapter will analyze the readiness of the current standardization system to support this significant transition focusing on strengths and challenges to be addressed from the perspective of industry, policymakers, and standards-setting organizations.",
        "DOI": "10.4018/978-1-7998-7705-9.ch081",
        "paper_author": "McAuliffe B.",
        "affiliation_name": "HP Inc.",
        "affiliation_city": null,
        "affiliation_country": "Ireland",
        "affiliation_id": "129899759",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Government 4.0 and evidencebased policies: AI and data analytics to the rescue",
        "publication": "Handbook of Artificial Intelligence and Robotic Process Automation: Policy and Government Applications",
        "citied_by": "0",
        "cover_date": "2020-11-27",
        "Abstract": "NA",
        "DOI": "NA",
        "paper_author": "de Marcellis-Warin N.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence for political decision-making in the European Union: Effects on citizens' perceptions of input, throughput, and output legitimacy",
        "publication": "Data and Policy",
        "citied_by": "47",
        "cover_date": "2020-11-27",
        "Abstract": "A lack of political legitimacy undermines the ability of the European Union (EU) to resolve major crises and threatens the stability of the system as a whole. By integrating digital data into political processes, the EU seeks to base decision-making increasingly on sound empirical evidence. In particular, artificial intelligence (AI) systems have the potential to increase political legitimacy by identifying pressing societal issues, forecasting potential policy outcomes, and evaluating policy effectiveness. This paper investigates how citizens' perceptions of EU input, throughput, and output legitimacy are influenced by three distinct decision-making arrangements: (a) independent human decision-making by EU politicians; (b) independent algorithmic decision-making (ADM) by AI-based systems; and (c) hybrid decision-making (HyDM) by EU politicians and AI-based systems together. The results of a preregistered online experiment (n = 572) suggest that existing EU decision-making arrangements are still perceived as the most participatory and accessible for citizens (input legitimacy). However, regarding the decision-making process itself (throughput legitimacy) and its policy outcomes (output legitimacy), no difference was observed between the status quo and HyDM. Respondents tend to perceive ADM systems as the sole decision-maker to be illegitimate. The paper discusses the implications of these findings for (a) EU legitimacy and (b) data-driven policy-making and outlines (c) avenues for future research.",
        "DOI": "10.1017/dap.2020.19",
        "paper_author": "Starke C.",
        "affiliation_name": "Heinrich-Heine-Universität Düsseldorf",
        "affiliation_city": "Dusseldorf",
        "affiliation_country": "Germany",
        "affiliation_id": "60025310",
        "affiliation_state": "Nordrhein-Westfalen"
    },
    {
        "paper_title": "Protecting consumers from collusive prices due to AI: Price-setting algorithms can lead to noncompetitive prices, but the law is ill equipped to stop it",
        "publication": "Science",
        "citied_by": "41",
        "cover_date": "2020-11-27",
        "Abstract": "NA",
        "DOI": "10.1126/science.abe3796",
        "paper_author": "Calvano E.",
        "affiliation_name": "Alma Mater Studiorum Università di Bologna",
        "affiliation_city": "Bologna",
        "affiliation_country": "Italy",
        "affiliation_id": "60028218",
        "affiliation_state": "BO"
    },
    {
        "paper_title": "13th CMI Conference on Cybersecurity and Privacy - Digital Transformation - Potentials and Challenges, CMI 2020",
        "publication": "13th CMI Conference on Cybersecurity and Privacy - Digital Transformation - Potentials and Challenges, CMI 2020",
        "citied_by": "0",
        "cover_date": "2020-11-26",
        "Abstract": "The proceedings contain 18 papers. The topics discussed include: AI or human: the socio-ethical implications of AI-generated media content; media technologies and policies; affordances and IT design: a typology for social media and platform affordances; machine learning-based cocoa e-health system; critical infrastructure - what is it, and what are the implications?; the impact of game censorship and regulations on foreign game consoles in china; a survey and comparison of secure software development standards; the proposed Baltic Sea region cross-border business registration service; situated learning in teaching business English in the age of digital transformations; surveillance capitalism - a new techno-economic paradigm?; privacy in time of a pandemic; and the next-generation television broadcasting test platform in Copenhagen.",
        "DOI": "NA",
        "paper_author": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Challenges to HR 4.0 in global business scenario",
        "publication": "Innovations and Challenges in Human Resource Management for HR4.0",
        "citied_by": "0",
        "cover_date": "2020-11-24",
        "Abstract": "The Human Resources department faces a huge number of challenges which are interconnected with every discipline. The traditional functions of the Human Resource department can be broken down into procurement, development of personnel, compensation management, integration and maintenance. These challenges get even more intricate and complex with the emergence of various technologies such as AI, Internet of Things, augmented reality, virtual reality, automation and many more. The adoption of these technologies has been termed as HR 4.0 which is a relatively new concept still in its infancy stage characterized by rapid and constant innovations in various technologies. Some of the key challenges HR managers would face in the future are compatibility of these technologies with legacy systems which are more often than not outdated, the failure of current office infrastructure and HR policies in accomodating flexible work of the future, managing security of data especially in an IoT connected office with lots of sensitive and private employee data, bridging the gap between knowledge management and knowledge transfer, basing recruitment and training on unique and constantly changing skillsets. Establishing an organization culture would be a great challenge with the replacement of humans with machines. Dealing with employee compensation will be a challenge as it needs to shift towards value based dynamic compensation. This article also discusses about various other challenges of the future such as EQ testing, de-stressing, maintaining work-life balance and much more. HR managers will have to adapt to the fast and dynamic changing environment which will present them with an array of distinctive issues.",
        "DOI": "NA",
        "paper_author": "Harish V.",
        "affiliation_name": "PSG College of Technology",
        "affiliation_city": "Coimbatore",
        "affiliation_country": "India",
        "affiliation_id": "60026157",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Artificial intelligence-based public sector data analytics for economic crisis policymaking",
        "publication": "Transforming Government: People, Process and Policy",
        "citied_by": "28",
        "cover_date": "2020-11-23",
        "Abstract": "Purpose: Public sector has started exploiting artificial intelligence (AI) techniques, however, mainly for operational but much less for tactical or level tasks. The purpose of this study is to exploit AI for the highest strategic-level task of government: to develop an AI-based public sector data analytics methodology for supporting policymaking for one of the most serious and large-scale challenges that governments repeatedly face, the economic crises that lead to economic recessions (though the proposed methodology is of much more general applicability). Design/methodology/approach: A public sector data analytics methodology has been developed, which enables the exploitation of existing public and private sector data, through advanced processing of them using a big data-oriented AI technique, “all-relevant” feature selection, to identify characteristics of firms as well as their external environment that affect (positively or negatively) their resilience to economic crisis. Findings: A first application of the proposed public sector data analytics methodology has been conducted, using Greek firms’ data concerning the economic crisis period 2009–2014, which has led to interesting conclusions and insights, revealing factors affecting the extent of sales revenue decrease in Greek firms during the above crisis period and providing a first validation of the methodology used in this study. Research limitations/implications: This paper contributes to the advancement of two emerging highly important, for the society, but minimally researched, digital government research domains: public sector data analytics (and especially policy analytics) and government exploitation of AI. It exploits an AI feature selection algorithm, the Boruta “all-relevant” variables identification algorithm, which has been minimally exploited in the past for public sector data analytics, to support the design of public policies for addressing one of the most serious and large-scale economic challenges that governments repeatedly face: the economic crises. Practical implications: The proposed methodology allows the identification of characteristics of firms as well as their external environment that affect positively or negatively their resilience to economic crisis. This enables a better understanding of the kinds of firms that are more strongly hit by the crisis, which is quite useful for the design of public policies for supporting them; and at the same time reveals firms’ practices, resources, capabilities, etc. that enhance their ability to cope with economic crisis, to design policies for promoting them through educational and support activities. Social implications: This methodology can be very useful for the design of more effective public policies for reducing the negative impacts of economic crises on firms, and therefore mitigating their negative consequences for the society, such as unemployment, poverty and social exclusion. Originality/value: This study develops a novel approach to the exploitation of public and private sector data, based on a minimally exploited, for such purposes, AI technique (“all-relevant” feature selection), to support the design of public policies for addressing one of the most threatening disruptions that modern economies and societies repeatedly face, the economic crises.",
        "DOI": "10.1108/TG-11-2019-0113",
        "paper_author": "Loukis E.N.",
        "affiliation_name": "University of the Aegean",
        "affiliation_city": "Mytilene",
        "affiliation_country": "Greece",
        "affiliation_id": "60017404",
        "affiliation_state": "North Aegean"
    },
    {
        "paper_title": "Next generation of intelligent cities: Case studies from Europe",
        "publication": "Developing and Monitoring Smart Environments for Intelligent Cities",
        "citied_by": "2",
        "cover_date": "2020-11-20",
        "Abstract": "Over the past decade, intelligent cities have undergone rapid transformation. The definition of an intelligent city may vary based on the context and the purpose served. However, the next generation of intelligent cities will have unique characteristics that will set them apart from the existing intelligent cities. They will be more people-centered, and they will be formed through the fusion of technology, government, organizations, and people. This chapter explores four intelligent cities in Europe that are setting examples for innovation, ingenuity, technology, public policy making, and sustainable development: London, Amsterdam, Vienna, and Stockholm. With growing emphasis on people involvement in decision making, the intelligent city ecosystem is continuously evolving. However, technology continues to play a prominent role in shaping the intelligent city paradigm. In this contribution, the authors also examine different emerging technologies such as quantum computing, autonomous vehicles, AI, ML, etc. that could potentially impact the next generation of such cities.",
        "DOI": "10.4018/978-1-7998-5062-5.ch004",
        "paper_author": "Varadharajan V.",
        "affiliation_name": "Infosys Ltd.",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "116463626",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Designing Artificial Intelligence/International Relations (AI/IR) Platform: Foreign Policy Decision-Making Simulation in ASEAN Negotiation",
        "publication": "7th International Conference on ICT for Smart Society: AIoT for Smart Society, ICISS 2020 - Proceeding",
        "citied_by": "0",
        "cover_date": "2020-11-19",
        "Abstract": "The growing interest in artificial intelligence (AI) application into foreign policy decision making and negotiation among scholars and policy-makers demonstrates an inherent transition of International Relations both as a field and practice into the so-called Fourth Industrial Revolution. This study examines the application of AI in providing a computerized decision-making support system and how the production of such a system would assist both practitioners and learners of International Relations in understanding the state's foreign policy decision making process and strategies during diplomatic negotiations. This study offers a design of AI/IR systems which adopts the Expert System framework and employs the strategy of Forward Chaining. This study provides a framework for developing a rule-based system to identify possible foreign policy alternatives and their consequences by adopting the Rational Choice model as the basis of knowledge engineering. Given the remarkable growth of the Southeast Asia region in recent years, this study is particularly interested in developing a computerized decision-making system that can promptly respond to the region's dynamics.",
        "DOI": "10.1109/ICISS50791.2020.9307582",
        "paper_author": "Kusuma Putri R.A.A.",
        "affiliation_name": "Bina Nusantara University",
        "affiliation_city": "Jakarta",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60103610",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Conversational Agent for Database Query: A Use Case for Thai People Map and Analytics Platform",
        "publication": "Proceedings - 2020 15th International Joint Symposium on Artificial Intelligence and Natural Language Processing, iSAI-NLP 2020",
        "citied_by": "3",
        "cover_date": "2020-11-18",
        "Abstract": "Since 2018, Thai People Map and Analytics Platform (TPMAP) has been developed with the aims of supporting government officials and policy makers with integrated household and community data to analyze strategic plans, implement policies and decisions to alleviate poverty. However, to acquire complex information from the platform, non-technical users with no database background have to ask a programmer or a data scientist to query data for them. Such a process is time-consuming and might result in inaccurate information retrieved due to miscommunication between non-technical and technical users. In this paper, we have developed a Thai conversational agent on top of TPMAP to support self-service data analytics on complex queries. Users can simply use natural language to fetch information from our chatbot and the query results are presented to users in easy-to-use formats such as statistics and charts. The proposed conversational agent retrieves and transforms natural language queries into query representations with relevant entities, query intentions, and output formats of the query. We employ Rasa, an open-source conversational AI engine, for agent development. The results show that our system yields Fl-score of 0.9747 for intent classification and 0.7163 for entity extraction. The obtained intents and entities are then used for query target information from a graph database. Finally, our system achieves end-to-end performance with accuracies ranging from 57.5%-80.0%, depending on query message complexity. The generated answers are then returned to users through a messaging channel.",
        "DOI": "10.1109/iSAI-NLP51646.2020.9376833",
        "paper_author": "Simud T.",
        "affiliation_name": "Kasetsart University",
        "affiliation_city": "Bangkok",
        "affiliation_country": "Thailand",
        "affiliation_id": "60021944",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Improving operational efficiency of government using artificial intelligence",
        "publication": "IOP Conference Series: Materials Science and Engineering",
        "citied_by": "6",
        "cover_date": "2020-11-18",
        "Abstract": "In this paper we developed a technique for Improving the operational efficiency of the government using Artificial Intelligence, we discussed the concept of insurance and how the concept of insurance will change and Artificial Intelligence (AI) is already disrupting the state of this industry. Insurers worldwide are using AI to automatize processes and tasks, such as fraud detection, underwriting, and claims processing. Additionally, there has been a rise of new competitors in the market, such as InsurTechs, that are bringing innovative solutions for insurance using Artificial neural network (ANN), responding to the new trends in customers' lifestyles and behaviors, that are more demanding for services directed for their needs. This study aims to understand how personalization of insurance policies, created with Artificial Intelligence and how its efficiency can be improved, and how it will disrupt this industry in the future and what will be the impact on the government's operational efficiency. We have chosen worldwide Governance indicator dataset which is publically available the personalization of an insurance policy with AI would encompass the definition of the coverages and premiums more appropriate for an individual customer and do the risk evaluation, in a market of one strategy. This innovation would take advantage of the accrual of Big Data from customers for the optimization, as people are each time more connected and information about them is constantly being shared, allowing companies to use it to know consumers better and for the training, testing and validation a well-known MATLAB R2019a software was used for this purpose. We achieved an accuracy of 95.25% using 9-Fold cross-validation.",
        "DOI": "10.1088/1757-899X/928/2/022014",
        "paper_author": "Al-Witwit S.S.I.",
        "affiliation_name": "Altinbas Universitesi",
        "affiliation_city": "Istanbul",
        "affiliation_country": "Turkey",
        "affiliation_id": "60104489",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "When AI Gossips",
        "publication": "International Symposium on Technology and Society, Proceedings",
        "citied_by": "1",
        "cover_date": "2020-11-12",
        "Abstract": "The concept of AI Gossip is presented. It is analogous to the traditional understanding of a pernicious human failing. It is made more egregious by the technology of AI, internet, current privacy policies, and practices. The recognition by the technological community of its complacency is critical to realizing its damaging influence on human rights. A current example from the medical field is provided to facilitate the discussion and illustrate the seriousness of AI Gossip. Further study and model development is encouraged to support and facilitate the need to develop standards to address the implications and consequences to human rights and dignity.",
        "DOI": "10.1109/ISTAS50296.2020.9462207",
        "paper_author": "Ferraro A.",
        "affiliation_name": "Molinaroli College of Engineering and Computing",
        "affiliation_city": "Columbia",
        "affiliation_country": "United States",
        "affiliation_id": "60152637",
        "affiliation_state": "SC"
    },
    {
        "paper_title": "Access Denied",
        "publication": "International Symposium on Technology and Society, Proceedings",
        "citied_by": "0",
        "cover_date": "2020-11-12",
        "Abstract": "Artificial intelligence (AI) and biometric technology, some would argue as innovative and responsible, yet over time other researchers have seen the less inclusive environment these technologies create. Additionally, the gaps in these predictive technology systems may deny access to some individuals and, in some cases, deem the technology as a truth-telling mechanism even when proper identification is presented. This paper highlights a literature review and discussion around the ways we may responsibly innovate. Responsible innovation, anticipatory governance, and policy decision making can shape innovative practices' fabrication molded for an inclusive environment. The paper also bridges a collective discussion of researchers who argue the harmful impacts within these innovative technology systems that guide our social environments. Oftentimes, we assume the systems innovated, such as AI and biometric technology, provide a path for control and safety. Yet, we need to reconsider the undesirable impact and discover new ways to create inclusive technology that does not wrongfully deny access to some citizens. The governance of technology may be a path for responsibly structuring for the public's interest. These innovative systems are theoretically set for shaping our future, yet some researchers argue these technology systems contain archaic social system practices.",
        "DOI": "10.1109/ISTAS50296.2020.9462190",
        "paper_author": "Madril D.",
        "affiliation_name": "Arizona State University",
        "affiliation_city": "Tempe",
        "affiliation_country": "United States",
        "affiliation_id": "60003892",
        "affiliation_state": "AZ"
    },
    {
        "paper_title": "Artificial intelligence in personnel management: the development of APM model",
        "publication": "Bottom Line",
        "citied_by": "31",
        "cover_date": "2020-11-12",
        "Abstract": "Purpose: Managers have mixed views of how artificial intelligence (AI) affects personnel management (PM). The purpose of this paper is to identify potential knowledge gap and bring new insights to the AI-personnel-management literature. Design/methodology/approach: Both applicability and theoretical perspectives are adopted to critically discuss the constraint and opportunity of AI in PM. Tables and narrative analysis are used to clarify the role of AI in managerial practices. Findings: Research findings have helped to develop a new model titled AI in Personnel Management (APM). The APM model unfolds itself in three levels, followed by potential outcome. The three levels comprise “organizational, managerial and individual job levels,” and the outcome comprises “organizational performance, employees’ well-being and staff turnover rate”. Research limitations/implications: The APM model helps managers to understand the implication of AI in their workplace. With better understanding of AI’s implication, managers are more likely to develop appropriate AI-driven managerial policies, which in turn benefit employees and their organizations. The APM model acts as a reference guide, helping managers to evaluate the AI’s constraint and opportunity in their managerial practices. Originality/value: The APM model is valuable and informative to the academic researchers, as it has first responded to Malik et al. (2019)’s call (re: the absence of AI and management literature), and, more importantly, it has advanced the knowledge of AI–management relationship, supporting scholars to further understand the role of AI in PM.",
        "DOI": "10.1108/BL-08-2020-0055",
        "paper_author": "Chang K.",
        "affiliation_name": "University of Sharjah",
        "affiliation_city": "Sharjah",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60070813",
        "affiliation_state": "Sharjah"
    },
    {
        "paper_title": "Artificial intelligence and mobile apps for mental healthcare: a social informatics perspective",
        "publication": "Aslib Journal of Information Management",
        "citied_by": "44",
        "cover_date": "2020-11-12",
        "Abstract": "Purpose: For decades, artificial intelligence (AI) has been utilized within the field of mental healthcare. This paper aims to examine AI chatbots, specifically as offered through mobile applications for mental healthcare (MHapps), with attention to the social implications of these technologies. For example, AI chatbots in MHapps are programmed with therapeutic techniques to assist people with anxiety and depression, but the promise of this technology is tempered by concerns about the apps' efficacy, privacy, safety and security. Design/methodology/approach: Utilizing a social informatics perspective, a literature review covering MHapps, with a focus on AI chatbots was conducted from the period of January–April 2019. A borrowed theory approach pairing information science and social work was applied to analyze the literature. Findings: Rising needs for mental healthcare, combined with expanding technological developments, indicate continued growth of MHapps and chatbots. While an AI chatbot may provide a person with a place to access tools and a forum to discuss issues, as well as a way to track moods and increase mental health literacy, AI is not a replacement for a therapist or other mental health clinician. Ultimately, if AI chatbots and other MHapps are to have a positive impact, they must be regulated, and society must avoid techno-fundamentalism in relation to AI for mental health. Originality/value: This study adds to a small but growing body of information science research into the role of AI in the support of mental health.",
        "DOI": "10.1108/AJIM-11-2019-0316",
        "paper_author": "Gamble A.",
        "affiliation_name": "Simmons University",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60006186",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Application of FinTech, Machine learning and Artificial Intelligence in programmed decision making and the perceived benefits",
        "publication": "2020 International Conference on Decision Aid Sciences and Application, DASA 2020",
        "citied_by": "4",
        "cover_date": "2020-11-08",
        "Abstract": "The objective of this study is to examine the perceived benefits of the application of FinTech, Machine Learning and Artificial Intelligence (AI) or (FMAI) in programmed decision making for the consumers, producers or employers. The study is based on a theoretical model, developed step by step to explain consumers' satisfaction and employers' benefits when the company or the employer introduces FinTech, Machine learning and AI for implementing the policies in programmed decisions. The results and findings show that the application of FinTech, Machine learning and AI will maximize the consumers' satisfaction and employers' benefits. The application of FMAI saves time for the consumers, minimizes the number of trips to the offices, and reduces the confrontations with the unpleasant customer service representatives. FMAI are user friendly, and it has the potential to increase consumers' satisfaction as well as employers' benefits by nicely settling the issues with the consumers and other stakeholders. The consumers remain the focal point and will make sure that consumers will not desert the company. This is perhaps one of the latest studies which blends FMAI with programmed decision-making process and shows perceived benefits for both consumers and producers and thus society's total wellbeing will be the maximum.",
        "DOI": "10.1109/DASA51403.2020.9317266",
        "paper_author": "Selim M.",
        "affiliation_name": "University of Bahrain",
        "affiliation_city": "Zallaq",
        "affiliation_country": "Bahrain",
        "affiliation_id": "60000237",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Heuristic Gait Learning of Quadruped Robot Based on Deep Deterministic Policy Gradient Algorithm",
        "publication": "Proceedings - 2020 Chinese Automation Congress, CAC 2020",
        "citied_by": "4",
        "cover_date": "2020-11-06",
        "Abstract": "The gait control of the quadruped robot has always been a hot topic in the field of robot research. At present, the traditional control methods have many limitations such as low intelligence and poor autonomy. With the development of artificial intelligence technology, the application of reinforcement learning to the quadruped robot autonomous learning strategy provides a promising solution. Deep deterministic policy gradient (DDPG) algorithm has achieved good performance in continuous control tasks, but such value-based reinforcement learning algorithms have the problem of too high epoch estimates when performing function approximation, then reached a bad strategy actually. In order to solve the above-mentioned problem, this paper proposed a heuristic gait learning method for quadruped robot based on DDPG, inspired by the Double Q-learning algorithm, two independent critics were used to select the smaller value to update the parameters. The Open AI Gym platform was used for experimental verification, which proved that the proposed improved DDPG algorithm had better performance.",
        "DOI": "10.1109/CAC51589.2020.9326973",
        "paper_author": "Wang M.",
        "affiliation_name": "Beijing University of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022281",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Comparative Study of AI-based Predictive Models for Cardiovascular Disease (CVD) Prevention in Next Generation Primary Healthcare Services",
        "publication": "2020 IEEE International Conference for Innovation in Technology, INOCON 2020",
        "citied_by": "1",
        "cover_date": "2020-11-06",
        "Abstract": "Primary Healthcare Service (PHS) is an important area of concern for the policy makers of every nation. Key components of PHS include preventive services that require early disease detection. One major disease where mortality rate can be reduced significantly, if diagnosed early, is Cardio Vascular Disease (CVD). In this work, we have used different Machine Learning models for CVD prediction to compare their performances in terms of accuracy, and found Multilayer Perceptron as a better suited model. Since prediction of the model depends on data set, the model needs as usual continuous learning post deployment too.",
        "DOI": "10.1109/INOCON50539.2020.9298299",
        "paper_author": "Mandal T.",
        "affiliation_name": "Kalinga Institute of Industrial Technology, Bhubaneswar",
        "affiliation_city": "Bhubaneswar",
        "affiliation_country": "India",
        "affiliation_id": "60079452",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "Stock Price Prognosticator using Machine Learning Techniques",
        "publication": "Proceedings of the 4th International Conference on Electronics, Communication and Aerospace Technology, ICECA 2020",
        "citied_by": "3",
        "cover_date": "2020-11-05",
        "Abstract": "Stock market price prediction is one of the favourite research topics under consideration for professionals from various fields like mathematics, statistics, history, finance, computer science engineering etc., as it requires a set of skills to predict variation of price of shares in a very volatile and challenging share market scenario. Share market trading is mostly dependent on sentiments of investors and other factors like economic policies, political changes, natural disasters etc., Many theories were forwarded, mathematical and statistical applications in conjunction with probability, to simplify the complex process. After the advent of computers, it got further simplified but still challenging due to various external influential factors ruling the volatility of the market prices. Thus, AI and ML algorithms were being developed, but for only for next day using Linear Regression procedures.Our project aims to predict the prices of shares more precisely and accurately using special algorithms using RNN by improvising the back propagation, feedback routines to overcome the short-term memory loss involved in RNN thus providing efficiency in LSTM applications.Our project emphasizes how the LSTM applications perform with datasets of extreme, larger and minimal fluctuating data.",
        "DOI": "10.1109/ICECA49313.2020.9297644",
        "paper_author": "Nishitha S.N.T.",
        "affiliation_name": "K L Deemed to be University",
        "affiliation_city": "Vaddeswaram",
        "affiliation_country": "India",
        "affiliation_id": "60079446",
        "affiliation_state": "AP"
    },
    {
        "paper_title": "Converging artificial intelligence and blockchain technology using oracle contract in ethereum blockchain platform",
        "publication": "2020 5th International Conference on Informatics and Computing, ICIC 2020",
        "citied_by": "4",
        "cover_date": "2020-11-03",
        "Abstract": "Artificial Intelligence (AI) and blockchain are two emerging concepts that explored exponentially in recent years. In software development, artificial Intelligence offers a sophisticated enhancement on the programming logic, while blockchain technology provides transparency and relief the obligation to trust in a central party. Both are two different technologies but considered a disruptive technology in recent years. Artificial Intelligence faces several issues related to the validity of data, algorithms, and policies, while blockchain is called so 'friendly' with transparency, trust, and immutability. Both technologies are still in the early stages of their development age. Always, the opportunity for both technologies to converge in some ways would be an exciting area to be explored. This research elaborates on the technical possibilities of application development on the blockchain platform that communicate with AI to do prediction task. Oracle contract allows the data inside Ethereum blockchain to interact with the external data source.",
        "DOI": "10.1109/ICIC50835.2020.9288611",
        "paper_author": "Richard ",
        "affiliation_name": "Bina Nusantara University",
        "affiliation_city": "Jakarta",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60103610",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Experimental model of the system for intelligent power plant management",
        "publication": "16th International Conference on Network and Service Management, CNSM 2020, 2nd International Workshop on Analytics for Service and Application Management, AnServApp 2020 and 1st International Workshop on the Future Evolution of Internet Protocols, IPFuture 2020",
        "citied_by": "1",
        "cover_date": "2020-11-02",
        "Abstract": "In the present paper the authors have introduced the definitions, unique attributes and resources of Intelligent Organisations. The authors have justified the abilities to flexibly adjust the supply of electricity produced in micro-installations of Renewable Energy Sources (RES) to the dynamically changing demand on the side of final customers. Additionally, the nature of \"learning\"of VPP has been indicated, in particular the system learning through utilisation of learning qualities of Artificial Intelligence (AI) generators. The objective function determining system learning has been adopted with regard to balancing the electricity supply and demand, considering non-linearity of RES micro-installations generation and non-linearity of the demand for this type of energy. Having defined the objective function the authors have included the logical and functional presentation of the experimental model of the System for Intelligent Power Plant Management (SIPPM) developed based on available laboratory generators of Artificial Intelligence.",
        "DOI": "10.23919/CNSM50824.2020.9269039",
        "paper_author": "Kuceba R.",
        "affiliation_name": "Częstochowa University Of Technology",
        "affiliation_city": "Czestochowa",
        "affiliation_country": "Poland",
        "affiliation_id": "60009913",
        "affiliation_state": "Silesian"
    },
    {
        "paper_title": "Academic policy regarding sustainability and artificial intelligence (Ai)",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "43",
        "cover_date": "2020-11-02",
        "Abstract": "Artificial intelligence (AI) has grown, and technologies have intensified across all fields of life, particularly in education. AI has been applied to resources to improve skills giving teachers the time and freedom to provide understanding and adaptability and drive performance. This paper, written for policymakers in the field of education, highlights the impact of AI and advancements in academic policy. These academic policymakers generate ideas and strategies for applying AI across various disciplines. There is also discussion around AI implementation in education throughout developing nations for moving towards and ensuring affordable, high-quality education for every individual. Education for sustainable development (ESD) aims to promote the development of knowledge, skills, understanding, values and actions necessary to build a sustainable world, to protect and preserve the environment, and promote social equity and economic sustainability. This paper analyses how AI can be used to update learning probabilities by providing examples of how it can be integrated with existing educational systems, using data to improve educational capital and quality in developing countries. It goes on to discuss whether policymakers and institutions can reinvent and rework educational programs to polish graduates’ skills for the growing presence of AI across all disciplines. There are four main parts to this work: (1) different dimensions regarding the complexities and potential implications, (2) the pros and cons of educational sustainability policy related to AI, (3) carving out AI and its outstanding execution, and finally (4) the linkage of AI with higher education within the context of educational expansions. In conclusion, the paper focuses on AI’s applications, benefits and sustainable development education challenges.",
        "DOI": "10.3390/su12229435",
        "paper_author": "Tanveer M.",
        "affiliation_name": "Lincoln University College, Malaysia",
        "affiliation_city": "Petaling Jaya",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60107209",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Artificial Intelligence in Health Care: Current Applications and Issues",
        "publication": "World Journal of Orthopedics",
        "citied_by": "75",
        "cover_date": "2020-11-02",
        "Abstract": "In recent years, artificial intelligence (AI) technologies have greatly advanced and become a reality in many areas of our daily lives. In the health care field, numerous efforts are being made to implement the AI technology for practical medical treatments. With the rapid developments in machine learning algorithms and improvements in hardware performances, the AI technology is expected to play an important role in effectively analyzing and utilizing extensive amounts of health and medical data. However, the AI technology has various unique characteristics that are different from the existing health care technologies. Subsequently, there are a number of areas that need to be supplemented within the current health care system for the AI to be utilized more effectively and frequently in health care. In addition, the number of medical practitioners and public that accept AI in the health care is still low; moreover, there are various concerns regarding the safety and reliability of AI technology implementations. Therefore, this paper aims to introduce the current research and application status of AI technology in health care and discuss the issues that need to be resolved.",
        "DOI": "10.3346/jkms.2020.35.e379",
        "paper_author": "Park C.W.",
        "affiliation_name": "Samsung Medical Center, Sungkyunkwan university",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60020857",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Systematic Review on AI Platform for Public Sector",
        "publication": "Journal of Korean Institute of Communications and Information Sciences",
        "citied_by": "2",
        "cover_date": "2020-11-01",
        "Abstract": "In recent years, ICBM (Internet of Things (IoT), Cloud Computing, Big Data, and Mobile) has developed to a high level, and the artificial intelligence, which is rapidly developing on top of ICBM, is being implemented at a level beyond human capabilities in a variety of fields. In addition, artificial intelligence technology is making remarkable developments based on big data that can learn enormous amounts of data and convert it into meaningful information. This study presents the results of the analysis of the current status and features of AI platforms to enhance AI technology based on data in the public sector, and technical factors for application in the public sector using systematic analysis methods. In particular, the AI platform’s conditions required in the public sector are examined through investigating the components and characteristics of the AI platform at domestic and abroad by conducting systematic analysis research based on thesis and technical documents and public information of the companies. The results of this study will help in establishing and spreading AI platforms in the public sector, and it is also expected to be used in policies and strategies for reducing gaps with advanced countries in the AI sector.",
        "DOI": "10.7840/kics.2020.45.11.1994",
        "paper_author": "Yun C.H.",
        "affiliation_name": "Kyungpook National University (KNU)",
        "affiliation_city": "Daegu",
        "affiliation_country": "South Korea",
        "affiliation_id": "60012704",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Investigation of Heavy Metals on Water Quality and Sediment: A Case Study Bireuen, Aceh Utara and Lhokseumawe City",
        "publication": "Jurnal Kimia Valensi",
        "citied_by": "1",
        "cover_date": "2020-11-01",
        "Abstract": "Environmental pollution around the world in the last 10 years has continued to increase with increasing industrial growth. Environmental pollution has reduced the availability of clean water. Clean water is the main thing for all living things on this earth. Therefore, environmental pollution that occurs in the clean water crisis must be handled as soon as possible and reduced by various effective policies. The main focus of this research is to analyze heavy metal pollution on the surface of the water, clean water, and sediments caused by industrial activities. This research is a field study by taking samples directly at the location and then analyzing them in the laboratory. The results of the analysis showed that the highest heavy metal Fe on the water surface was found in Bireuen Regency by 0.28% compared to Lhokseumawe City with 0.0029% and Aceh Utara 0.0029%. Meanwhile, the highest heavy metals contained in clean water were recorded in Bireuen and Lhokseumawe City at 0.007% and 0.0064%, respectively. The results of the heavy metal analysis in the highest sediment were found in North Aceh at 42.93% compared to 8.02% and 18.12% for Bireuen and Lhokseumawe. Overall, the analysis carried out in this study shows that the surface water, clean water, and sediments have been contaminated by heavy metals. Meanwhile, the quality standard for surface water is 0.3 mg/l, net ai is 1.0 mg/l, and sediment is 20bj.",
        "DOI": "10.15408/jkv.v6i2.15745",
        "paper_author": "Mahidin ",
        "affiliation_name": "Universitas Syiah Kuala",
        "affiliation_city": "Banda Aceh",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60069406",
        "affiliation_state": "Aceh"
    },
    {
        "paper_title": "Media history in China: From opening-up policies to the most recent developments",
        "publication": "Sulla Via del Catai",
        "citied_by": "0",
        "cover_date": "2020-11-01",
        "Abstract": "NA",
        "DOI": "NA",
        "paper_author": "Negro G.",
        "affiliation_name": "Università degli Studi di Siena",
        "affiliation_city": "Siena",
        "affiliation_country": "Italy",
        "affiliation_id": "60002838",
        "affiliation_state": "SI"
    },
    {
        "paper_title": "Can a Patent Be Granted for an AI-Generated Invention?",
        "publication": "GRUR International",
        "citied_by": "4",
        "cover_date": "2020-11-01",
        "Abstract": "Three patent offices had to answer the question of whether a patent can be granted for an invention for which an Artificial Intelligence (AI) system called DABUS was named as inventor. All applications were dismissed, but for different reasons. While the European Patent Office focused on formal rules, the UK Intellectual Property Office considered more substantive aspects, and the US Patent and Trademark Office relied on statutory language. From a policy perspective, the decisions find support in the fact that there is no clear consensus for AI to be recognized as an inventor, and that difficult questions would ensue if this were accepted. From a doctrinal perspective, the decisions do not rule out the patentability of AI-assisted inventions in general, as it remains possible to designate a human inventor when AI has merely facilitated the inventive process. This leaves the question of who should own a patent for an AI-generated invention, if patentability for such inventions is considered desirable. A possible solution could be to grant ownership directly to the company operating or owning the AI.",
        "DOI": "10.1093/grurint/ikaa117",
        "paper_author": "Engel A.",
        "affiliation_name": "Gottfried Wilhelm Leibniz Universität Hannover",
        "affiliation_city": "Hannover",
        "affiliation_country": "Germany",
        "affiliation_id": "60004935",
        "affiliation_state": "Niedersachsen"
    },
    {
        "paper_title": "What we talk about when we talk about trust: Theory of trust for AI in healthcare",
        "publication": "Intelligence-Based Medicine",
        "citied_by": "88",
        "cover_date": "2020-11-01",
        "Abstract": "Artificial intelligence (AI) is at the forefront of innovation in medicine. Researchers and AI developers have often claimed that “trust” is a critical determinant of the successful adoption of AI in medicine. Despite the pivotal role of trust and the emergence of an array of expert-informed guidelines on how to design and implement “trustworthy AI” in medicine, we found little common understanding across these guidelines on what constitutes user trust in AI and what the requirements are for its realization. In this article, we call for a conceptual framework of trust in health-related AI which is based not just on expert opinion, but first and foremost on sound empirical research and conceptual rigor. Only with a well-grounded and comprehensive understanding of the trust construct, we will be able to inform AI design and acceptance in medicine in a meaningful way.",
        "DOI": "10.1016/j.ibmed.2020.100001",
        "paper_author": "Gille F.",
        "affiliation_name": "ETH Zürich",
        "affiliation_city": "Zurich",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60025858",
        "affiliation_state": "ZH"
    },
    {
        "paper_title": "On the Governance of Artificial Intelligence through Ethics Guidelines",
        "publication": "Asian Journal of Law and Society",
        "citied_by": "68",
        "cover_date": "2020-11-01",
        "Abstract": "This article uses a socio-legal perspective to analyze the use of ethics guidelines as a governance tool in the development and use of artificial intelligence (AI). This has become a central policy area in several large jurisdictions, including China and Japan, as well as the EU, focused on here. Particular emphasis in this article is placed on the Ethics Guidelines for Trustworthy AI published by the EU Commission's High-Level Expert Group on Artificial Intelligence in April 2019, as well as the White Paper on AI, published by the EU Commission in February 2020. The guidelines are reflected against partially overlapping and already-existing legislation as well as the ephemeral concept construct surrounding AI as such. The article concludes by pointing to (1) the challenges of a temporal discrepancy between technological and legal change, (2) the need for moving from principle to process in the governance of AI, and (3) the multidisciplinary needs in the study of contemporary applications of data-dependent AI.",
        "DOI": "10.1017/als.2020.19",
        "paper_author": "Larsson S.",
        "affiliation_name": "Lunds Universitet",
        "affiliation_city": "Lund",
        "affiliation_country": "Sweden",
        "affiliation_id": "60029170",
        "affiliation_state": "Skane"
    },
    {
        "paper_title": "Derived metrics for the game of Go – intrinsic network strength assessment and cheat-detection",
        "publication": "Proceedings - 2020 8th International Symposium on Computing and Networking, CANDAR 2020",
        "citied_by": "5",
        "cover_date": "2020-11-01",
        "Abstract": "—The widespread availability of superhuman AI engines is changing how we play the ancient game of Go. The open-source software packages developed after the AlphaGo series shifted focus from producing strong playing entities to providing tools for analyzing games. Here we describe two ways of how the innovations of the second generation engines (e.g. score estimates, variable komi) can be used for defining new metrics that help deepen our understanding of the game. First, we study how much information the search component contributes in addition to the raw neural network policy output. This gives an intrinsic strength measurement for the neural network. Second, we define the effect of a move by the difference in score estimates. This gives a fine-grained, move-by-move performance evaluation of a player. We use this in combating the new challenge of detecting online cheating.",
        "DOI": "10.1109/CANDAR51075.2020.00010",
        "paper_author": "Egri-Nagy A.",
        "affiliation_name": "Akita International University",
        "affiliation_city": "Akita",
        "affiliation_country": "Japan",
        "affiliation_id": "60033480",
        "affiliation_state": "Akita"
    },
    {
        "paper_title": "Taxing artificial intelligence and robots: Critical assessment of potential policy solutions and recommendation for alternative approaches-Sovereign measure: Education taxes/global measure: Global education tax or planetary tax",
        "publication": "World Tax Journal",
        "citied_by": "10",
        "cover_date": "2020-11-01",
        "Abstract": "In recent years, investments in technology have resulted in an exponential growth of AI/robots. It is argued that some of these innovations are able to outperform and replace humans in various types of jobs. Accordingly, concerns regarding government revenues have been raised, as AI/robots could trigger widespread unemployment with the result that less tax revenue will accrue to the government. This contribution, as a start, analyses whether or not this is truly a concern. In order to do so, the authors map the Industrial Revolution(s) that humankind has witnessed and then conduct a literature review of economic and demographic studies relevant to the debate. The economic studies indicate two different directions, that is, some argue that AI/robots (Industry 4.0) will increase human jobs whereas others argue that jobs could disappear. At the same time, the demographic perspective indicates that a purely economic employment-focused view of AI/robots is bound to lead to inconclusive results. Assuming that this is a probable concern, the authors summarize selected measures taken by governments as well as the various options that have been considered in academic literature to introduce taxes on AI/robots. Subsequently, the authors analyse the various \"taxing\" options from the perspective of commonly accepted tax policy principles applicable to electronic commerce (Ottawa Taxation Framework conditions). This analysis indicates that several proposals (e.g. proposals that treat AI/robots as independently taxable subjects or proposals that attribute income to owners of AI/robots) breach the principles of (i) neutrality; (ii) simplicity and certainty; (iii) efficiency; (iv) effectiveness and fairness; and (v) flexibility. Thus, such measures should not be pursued. The authors also conclude that, at this stage, targeted taxes on AI/robots should not be introduced, as this would also be contrary to the measures taken by governments globally to promote research and development (R and D) (input or output incentives). The present contribution therefore suggests that governments need to be proactive rather than reactive in this area. This could be achieved by monitoring the impact of AI/robots on a regular basis, and if the trend indicates that jobs are disappearing or revenues are declining, then the article suggests that states raise funds from an earmarked education tax. The funds raised from this tax, among other objectives, should be used to finance and foster professional educational programmes to reskill workers, besides assisting and guiding them to transition into new roles. However, a national measure may not be sufficient to tackle the issue (issues) at stake, especially in light of the demographic perspective discussed in the contribution. Thus, considering some jurisdictions may not be in a position to implement or fully benefit from an education tax, the authors also discuss the possibility of implementing a global fiscal redistribution mechanism (multilateral solution) from developed (surrender jurisdictions) to developing countries (recipient jurisdictions). The latter, depending on its scope, could be in the form of a global education tax or more broadly a planetary tax.",
        "DOI": "10.59403/2sjxe4d",
        "paper_author": "Chand V.",
        "affiliation_name": "Université de Lausanne (UNIL)",
        "affiliation_city": "Lausanne",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60000239",
        "affiliation_state": "VD"
    },
    {
        "paper_title": "A robot in ip-the issues and need for legislation",
        "publication": "Journal of Intellectual Property Rights",
        "citied_by": "1",
        "cover_date": "2020-11-01",
        "Abstract": "Advent of economy and information technology has transformed the world from manual to one touch dependence on computer-based technology and Artificial Intelligence (AI). A robot can create something without any instructions at its own free will; the question that arises here is, whether such asset created by a robot would qualify for the grant of IP protection? If it is granted, who would be qualified to own the IP protection? The questions remain unsettled. The paper elucidates the basic idea of AI, its current scenario in relation to the concept of legal entity as a juristic person in different jurisdictions followed by illustrations and circumstances of the difficulties and challenges faced by the creators of AI in the field of patent using the concept of inventorship, inventive step, non-obviousness and theoretical analysis by subject matter patentability. And finally, the legal status and a policy suggestion as a conclusion on how it would help in improving the patent laws through TRIPS. The rapid increase in creation of intangible asset is astonishing and it becomes an absolute necessity to focus on the subject of AI and define it by law as the technology advances.",
        "DOI": "NA",
        "paper_author": "Madhumitha D.S.",
        "affiliation_name": "Tamil Nadu National Law University",
        "affiliation_city": "Tiruchirappalli",
        "affiliation_country": "India",
        "affiliation_id": "60115055",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "SUESSA: Sustainable Ultra-Elastic Stack Security Architecture for Securing IoT Networks of Future Smart Cities",
        "publication": "Proceedings - 2020 8th International Symposium on Computing and Networking Workshops, CANDARW 2020",
        "citied_by": "4",
        "cover_date": "2020-11-01",
        "Abstract": "Recently, the concept of a super smart city has received special attention and has become the most popular agenda among city planners, policy makers and IT industries around the globe. In this paper, we proposed a novel Sustainable Ultra-Elastic Stack Security Architecture (SUESSA) which can address various future security challenges of artificial intelligence (AI), big data and communication networks. Our architecture employs the holistic approach based on sustainability of network security which is different than that of the prevailing security practices. We propose to apply the sustainable approach in the Network security architecture through augmentation of cloud, networks and end-point level, our approach provides a robust and ultra-elastic mechanism of security that surpasses the prevailing architecture. We evaluated the feasibility and performance of the security stack containing a machine learning component, Elastic search engine, Kibana and Logstash as the building blocks of the architecture. Based on our survey, SUESSA architecture overcomes the disadvantages of current architecture specifically solving the problem of sustainability strongly demanded in security architecture of the future smart cities.",
        "DOI": "10.1109/CANDARW51189.2020.00079",
        "paper_author": "Gautam B.P.",
        "affiliation_name": "Kanazawa Gakuin University",
        "affiliation_city": "Kanazawa",
        "affiliation_country": "Japan",
        "affiliation_id": "60004720",
        "affiliation_state": "Ishikawa"
    },
    {
        "paper_title": "Poster: Configuration Management for Internet Services at the Edge: A Data-Driven Approach",
        "publication": "Proceedings - 2020 IEEE/ACM Symposium on Edge Computing, SEC 2020",
        "citied_by": "1",
        "cover_date": "2020-11-01",
        "Abstract": "Internet services are increasingly pushed from the remote cloud to the edge sites close to data sources to offer fast response time and low energy footprint. However, software deployed at edge sites must be updated frequently. Performing updates as soon as they are available consumes a large amount of energy. Configuration management tools that install software updates and manage allowed staleness can inflate energy demands, especially when updates interrupt idle periods at the edge site and block processors from entering power-saving modes. Our research studies configuration management policies, their effect on energy footprint and strategies to optimize them. We have observed that policies yielding low energy footprint differ from site to site and over time. We propose a data-driven approach that uses data collected at each edge site to predict an energy-efficient policy and also guards against worst-case performance if data-driven predictions error occurs. We use a novel randomwalk approach to manage data-driven policies that yield a low footprint for a representative trace of updates observed at an edge site. We are setting up 4 edge service benchmarks powered by AI inference to create realistic software update traces.",
        "DOI": "10.1109/SEC50012.2020.00020",
        "paper_author": "Zhang Y.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Columbus",
        "affiliation_country": "United States",
        "affiliation_id": "60149838",
        "affiliation_state": "OH"
    },
    {
        "paper_title": "Semantic Descriptor for Intelligence Services",
        "publication": "Proceedings - IEEE Congress on Cybermatics: 2020 IEEE International Conferences on Internet of Things, iThings 2020, IEEE Green Computing and Communications, GreenCom 2020, IEEE Cyber, Physical and Social Computing, CPSCom 2020 and IEEE Smart Data, SmartData 2020",
        "citied_by": "2",
        "cover_date": "2020-11-01",
        "Abstract": "The exposition and discovery of intelligence especially for connected devices and autonomous systems have become an important area of the research towards an all-intelligent world. In this article, it a semantic description of functions is proposed and used to provide intelligence services mainly for networked devices. The semantic descriptors aim to provide interoperability between multiple domains' vocabularies, data models, and ontologies, so that device applications become able to deploy them autonomously once they are onboarded in the device or system platform. The proposed framework supports the discovery, onboarding, and updating of the services by providing descriptions of their execution environment, software dependencies, policies and data inputs required, as well as the outputs produced, to enable application decoupling from the AI functions.",
        "DOI": "10.1109/iThings-GreenCom-CPSCom-SmartData-Cybermatics50389.2020.00027",
        "paper_author": "Ramos E.",
        "affiliation_name": "Oy LM Ericsson Ab",
        "affiliation_city": "Jorvas",
        "affiliation_country": "Finland",
        "affiliation_id": "60102007",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Blockchain-Based Platform for Trusted Collaborations on Data and AI Models",
        "publication": "Proceedings - 2020 IEEE International Conference on Blockchain, Blockchain 2020",
        "citied_by": "5",
        "cover_date": "2020-11-01",
        "Abstract": "Data analytics and artificial intelligence are extensively used by enterprises today and they increasingly span organization boundaries. Such collaboration between organizations today happens in an ad hoc manner, with very little visibility and systemic control on who is accessing the data, how, and for what purpose. When sharing data and AI models with other organizations, the owners desire the ability to control access, have visibility into the entire data pipeline and lineage, and ensure integrity. In this work, we present a decentralized trusted data and model platform for collaborative AI, that leverages blockchain as an immutable metadata store of data and model resources and operations performed on them, to support and enforce ownership, authenticity, integrity, lineage and auditability properties. Smart contracts enforce policies specified on data, including hierarchical and composite policies that are uniquely enabled by the use of blockchain. We demonstrate that our system is light-weight and can support over 1000 transactions per second with sub-second latency, significantly lower than the time taken to execute data pipelines.",
        "DOI": "10.1109/Blockchain50366.2020.00018",
        "paper_author": "Kannan K.",
        "affiliation_name": "Hewlett Packard Enterprises",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "125633076",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An Intelligent Routing Technology Based on Deep Reinforcement Learning",
        "publication": "Tien Tzu Hsueh Pao/Acta Electronica Sinica",
        "citied_by": "6",
        "cover_date": "2020-11-01",
        "Abstract": "With the expansion of network scale and network complexity, traditional routing algorithms cannot ensure both the calculation complexity and performance under the large fluctuation of spatial-temporal distribution of network traffic.In recent years, with the development of Software-Defined Networking (SDN) and Artificial Intelligence (AI), AI-based methods of automatic routing strategies are gaining attention.In this paper, we propose an intelligent network routing technology called SmartPath based on Deep Reinforcement Learning (DRL).With dynamic collection of network status, we can use DRL to generate routing policies automatically, thus ensuring that the routing policy can dynamically adapt to the change of network traffic.Experiment result shows that the proposed scheme can adjust the routing strategy dynamically without human experience on traffic analysis and can reduce the average end-to-end transmission delay by at least 10% compared with the state-of-art schemes.",
        "DOI": "10.3969/j.issn.0372-2112.2020.11.011",
        "paper_author": "Sun P.H.",
        "affiliation_name": "Information Engineering University China",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60069731",
        "affiliation_state": "Henan"
    },
    {
        "paper_title": "A Data-driven Method for Fast AC Optimal Power Flow Solutions via Deep Reinforcement Learning",
        "publication": "Journal of Modern Power Systems and Clean Energy",
        "citied_by": "75",
        "cover_date": "2020-11-01",
        "Abstract": "With the increasing penetration of renewable energy, power grid operators are observing both fast and large fluctuations in power and voltage profiles on a daily basis. Fast and accurate control actions derived in real time are vital to ensure system security and economics. To this end, solving alternating current (AC) optimal power flow (OPF) with operational constraints remains an important yet challenging optimization problem for secure and economic operation of the power grid. This paper adopts a novel method to derive fast OPF solutions using state-of-the-art deep reinforcement learning (DRL) algorithm, which can greatly assist power grid operators in making rapid and effective decisions. The presented method adopts imitation learning to generate initial weights for the neural network (NN), and a proximal policy optimization algorithm to train and test stable and robust artificial intelligence (AI) agents. Training and testing procedures are conducted on the IEEE 14-bus and the Illinois 200-bus systems. The results show the effectiveness of the method with significant potential for assisting power grid operators in real-time operations.",
        "DOI": "10.35833/MPCE.2020.000522",
        "paper_author": "Zhou Y.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Arlington",
        "affiliation_country": "United States",
        "affiliation_id": "60137461",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Fragmentation and the Future: Investigating Architectures for International AI Governance",
        "publication": "Global Policy",
        "citied_by": "42",
        "cover_date": "2020-11-01",
        "Abstract": "The international governance of artificial intelligence (AI) is at a crossroads: should it remain fragmented or be centralised? We draw on the history of environment, trade, and security regimes to identify advantages and disadvantages in centralising AI governance. Some considerations, such as efficiency and political power, speak for centralisation. The risk of creating a slow and brittle institution, and the difficulty of pairing deep rules with adequate participation, speak against it. Other considerations depend on the specific design. A centralised body may be able to deter forum shopping and ensure policy coordination. However, forum shopping can be beneficial, and fragmented institutions could self-organise. In sum, these trade-offs should inform development of the AI governance architecture, which is only now emerging. We apply the trade-offs to the case of the potential development of high-level machine intelligence. We conclude with two recommendations. First, the outcome will depend on the exact design of a central institution. A well-designed centralised regime covering a set of coherent issues could be beneficial. But locking-in an inadequate structure may pose a fate worse than fragmentation. Second, fragmentation will likely persist for now. The developing landscape should be monitored to see if it is self-organising or simply inadequate.",
        "DOI": "10.1111/1758-5899.12890",
        "paper_author": "Cihon P.",
        "affiliation_name": "University of Oxford",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026851",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "How should we understand the digital economy in Asia? Critical assessment and research agenda",
        "publication": "Electronic Commerce Research and Applications",
        "citied_by": "230",
        "cover_date": "2020-11-01",
        "Abstract": "By Asian digital economy, we refer to high-tech developments, business and social transformations, and information-driven changes in the region's growth. We discuss its background and foundations, significance in Asia and contribution to removal of historical barriers in traditional business. We assess how new value chains are transforming country-level involvement in worldwide manufacturing and note “smiling curve theory” predictions about the global value chain in Asia for high-tech firms and their economies. The takeaway is that the digital economy in Asian nations involves revamping business processes through technology innovation, government policies for growth, and digital entrepreneurship. We analyze the “digital economy and society index”, and attributes of nations, societies and economies, as a basis for framing our ideas. We consider research directions prompted by data analytics and AI, the platform economy, digital trade, fintech innovation, and societal and economic sustainability. We further highlight new issues in light of the COVID-19 pandemic.",
        "DOI": "10.1016/j.elerap.2020.101004",
        "paper_author": "Li K.",
        "affiliation_name": "Nankai University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60018038",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An Autonomous Lane-Changing System with Knowledge Accumulation and Transfer Assisted by Vehicular Blockchain",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "36",
        "cover_date": "2020-11-01",
        "Abstract": "Inappropriate lane following and changing behaviors of connected and autonomous vehicles (CAVs) can result in accidents, such as rear-end collision and side collision. To remedy that, the use of deep reinforcement learning (DRL) for autonomous driving decisions is currently a widely used promising solution. In this case, the accuracy and effectiveness of such a machine learning (ML) model is quite essential for this artificial intelligence (AI)-enabled CAVs. This article proposes a blockchain-based collective learning (BCL) framework for autonomous lane-changing systems. Four key issues, namely, learning efficiency, data security, users' privacy, as well as communication burden, are addressed by applying collective learning, vehicular blockchain, and knowledge transfer. First, we model the lane-changing problem as a DRL process and learn the autonomous lane-changing strategy through the deep deterministic policy gradient (DDPG) algorithm. Second, a single CAV involves a limited number of driving scenarios, and the independent learning method has the problem of inefficiency. Therefore, we propose a collective learning framework to utilize the 'collective intelligence' shared by CAVs. Third, a vehicular blockchain is then applied to ensure the security and privacy of the user and data. In addition, the introduction of the blockchain can incentivize more users to participate in collective learning. Finally, in order to accelerate the learning process and achieve higher level performance while further reducing the communication burden, we use the corresponding knowledge extracted from the ML model such as human learning, as privileged information for sharing instead of directly sharing local ML models. Extensive simulation results validate the effectiveness and efficiency of our proposal in terms of learning efficiency, driving safety, as well as system security and robustness.",
        "DOI": "10.1109/JIOT.2020.2994975",
        "paper_author": "Fu Y.",
        "affiliation_name": "Xidian University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60025578",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Impact of Social Distancing to Mitigate the Spread of COVID-19 in a Virtual Environment",
        "publication": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST",
        "citied_by": "8",
        "cover_date": "2020-11-01",
        "Abstract": "A novel strand of Coronavirus has spread in the past months to the point of becoming a pandemic of massive proportions. In order to mitigate the spread of this disease, many different policies have been adopted, including a strict national lockdown in some countries or milder government policies: one common aspect is that they mostly rely around keeping distance between individuals. The aim of this work is to provide means of visualizing the impact of social distancing in an immersive environment by making use of the virtual reality technology. To this aim, we create a virtual environment which resembles a university setting (we based it on the University of Derby), and populate it with a number of AI agents. We assume that the minimum social distance is 2 meters. The main contribution of this work is twofold: the multi-disciplinary approach that results from visualizing the social distancing in an effort to mitigate the spread of the COVID-19, and the digital twin application in which the users can navigate the virtual environment whilst receiving visual feedback in the proximity of other agents. We named our application SoDAlVR, which stands for Social Distancing Algorithm in Virtual Reality.",
        "DOI": "10.1145/3385956.3422093",
        "paper_author": "Marti Mason D.",
        "affiliation_name": "University of Derby",
        "affiliation_city": "Derby",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60014145",
        "affiliation_state": "Derbyshire"
    },
    {
        "paper_title": "National Varieties of Artificial Intelligence Discourses: Myth, Utopianism, and Solutionism in West European Policy Expectations",
        "publication": "Computer",
        "citied_by": "36",
        "cover_date": "2020-11-01",
        "Abstract": "Global actors and various nations have introduced artificial intelligence (AI) agendas where AI appears as a slippery, politicized phenomenon. In this article, we reveal that AI is mythologized as a benevolent, heroic force shaping nations in accord with political ambitions; that policies communicate utopian beliefs stating AI will transform national concerns favorably; and that technological solutionist expectations present AI as the answer to national challenges.",
        "DOI": "10.1109/MC.2020.2992290",
        "paper_author": "Ossewaarde M.",
        "affiliation_name": "Universiteit Twente",
        "affiliation_city": "Enschede",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60020599",
        "affiliation_state": "Overijssel"
    },
    {
        "paper_title": "Trust, transparency, and openness: How inclusion of cultural values shapes Nordic national public policy strategies for artificial intelligence (AI)",
        "publication": "Technology in Society",
        "citied_by": "167",
        "cover_date": "2020-11-01",
        "Abstract": "Using textual analysis methodology with Hofstede's cultural dimensions as basis for cross-national comparison, the manuscript explores the influence of cultural values of trust, transparency, and openness in Nordic national artificial intelligence (AI) policy documents. Where many AI processes are technologies hidden from view of the citizen, how can public institutions support and ensure these high levels of trust, transparency, and openness in Nordic culture and extend these concepts of “digital trust” to AI? One solution is by authoring national policy that upholds cultural values and personal rights, ultimately reinforcing these values in their societies. The paper highlights differences in how Nordic nations position themselves using cultural values as organizing principles, with the author showing these values (i.e., trust through clear information and information security, transparency through AI literacy education and clear algorithmic decision making, and openness by creating data lakes and data trusts) support the development of AI technology in society. The analysis shows that three cultural values are upheld and influence Nordic national AI strategies, while themes of privacy, ethics, and autonomy are present, and democracy, a societal building block in the Nordics, is especially prominent in the policies. For policy development, policy leaders must understand that without citizen involvement in AI implementation or lacking citizen AI education, we risk alienating those for who these services are meant to utilize and improve access for.",
        "DOI": "10.1016/j.techsoc.2020.101421",
        "paper_author": "Robinson S.C.",
        "affiliation_name": "Linköpings Universitet",
        "affiliation_city": "Linkoping",
        "affiliation_country": "Sweden",
        "affiliation_id": "60009358",
        "affiliation_state": "Östergötland"
    },
    {
        "paper_title": "Review of artificial intelligence applied in decision-making processes in agricultural public policy",
        "publication": "Processes",
        "citied_by": "20",
        "cover_date": "2020-11-01",
        "Abstract": "The objective of this article is to review how Artificial Intelligence (AI) tools have helped the process of formulating agricultural public policies in the world. For this, a search process was carried out in the main scientific repositories finding different publications. The findings have shown that, first, the most commonly used AI tools are agent-based models, cellular automata, and genetic algorithms. Secondly, they have been utilized to determine land and water use, and agricultural production. In the end, the large usefulness that AI tools have in the process of formulating agricultural public policies is concluded.",
        "DOI": "10.3390/pr8111374",
        "paper_author": "Sánchez J.M.",
        "affiliation_name": "Universidad Distrital Francisco José de Caldas",
        "affiliation_city": "Bogota",
        "affiliation_country": "Colombia",
        "affiliation_id": "60104009",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An assessment of smart factories in Korea: An exploratory empirical investigation",
        "publication": "Applied Sciences (Switzerland)",
        "citied_by": "13",
        "cover_date": "2020-11-01",
        "Abstract": "After the Industry 4.0 discussion in Germany in 2011, much attention has been paid to smart factory in Korea. Since 2014, smart factories have been established and expanded in Korea. However, about 80% of them were established at a low level. In this paper, we analyze smart factory statuses in detail through an empirical research on 113 manufacturing companies that have established smart factories in Korea. We build a framework based on the resource-based view (RBV) and IT value creation process and analyze the results of five constructs—manufacturing strategy, organization, system, process, and performance—using basic statistical methodologies to derive the current statuses of manufacturing companies that have established smart factories. Our results show that implementing advanced technologies such as AI technology that can implement semi-finished and finished product quality inspection, manufacturing process optimization and product demand forecast is a challenge, particularly for SMEs. We also find that securing and managing facility data is a difficult problem. In addition, while output and material management ranked high, the utilization of integration systems, which is important when building a smart factory, was found to be extremely low. Lastly, the performance indicator results showed that yield management and defect rate were most important, while job creation through the introduction of smart factories was low. Based on the results of this study, the government may be able to determine effective smart factory policies and provide manufacturing companies with a guide on establishing a smart factory.",
        "DOI": "10.3390/app10217486",
        "paper_author": "Ko M.",
        "affiliation_name": "Korea Institute of Industrial Technology",
        "affiliation_city": "Cheonan",
        "affiliation_country": "South Korea",
        "affiliation_id": "60080940",
        "affiliation_state": "Chungcheongnam-do"
    },
    {
        "paper_title": "The U.S. High-Performance Computing Consortium in the Fight against COVID-19",
        "publication": "Computing in Science and Engineering",
        "citied_by": "12",
        "cover_date": "2020-11-01",
        "Abstract": "U.S. computing leaders, including Department of Energy National Laboratories, have partnered with universities, government agencies, and the private sector to research responses to COVID-19, providing an unprecedented collection of resources that include some of the fastest computers in the world. For HPC users, these leadership machines will drive the AI to accelerate the discovery of promising treatments, enable at-scale simulations to understand the virus's protein structure and attack mechanisms, and help inform policymakers to deploy resources effectively.",
        "DOI": "10.1109/MCSE.2020.3019744",
        "paper_author": "Hack J.J.",
        "affiliation_name": "Oak Ridge National Laboratory",
        "affiliation_city": "Oak Ridge",
        "affiliation_country": "United States",
        "affiliation_id": "60024266",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Global Collaboration in Artificial Intelligence: Bibliometrics and Network Analysis from 1985 to 2019",
        "publication": "Journal of Data and Information Science",
        "citied_by": "14",
        "cover_date": "2020-11-01",
        "Abstract": "This study aims to explore the trend and status of international collaboration in the field of artificial intelligence (AI) and to understand the hot topics, core groups, and major collaboration patterns in global AI research. We selected 38,224 papers in the field of AI from 1985 to 2019 in the core collection database of Web of Science (WoS) and studied international collaboration from the perspectives of authors, institutions, and countries through bibliometric analysis and social network analysis. The bibliometric results show that in the field of AI, the number of published papers is increasing every year, and 84.8% of them are cooperative papers. Collaboration with more than three authors, collaboration between two countries and collaboration within institutions are the three main levels of collaboration patterns. Through social network analysis, this study found that the US, the UK, France, and Spain led global collaboration research in the field of AI at the country level, while Vietnam, Saudi Arabia, and United Arab Emirates had a high degree of international participation. Collaboration at the institution level reflects obvious regional and economic characteristics. There are the Developing Countries Institution Collaboration Group led by Iran, China, and Vietnam, as well as the Developed Countries Institution Collaboration Group led by the US, Canada, the UK. Also, the Chinese Academy of Sciences (China) plays an important, pivotal role in connecting the these institutional collaboration groups. First, participant contributions in international collaboration may have varied, but in our research they are viewed equally when building collaboration networks. Second, although the edge weight in the collaboration network is considered, it is only used to help reduce the network and does not reflect the strength of collaboration. The findings fill the current shortage of research on international collaboration in AI. They will help inform scientists and policy makers about the future of AI research. This work is the longest to date regarding international collaboration in the field of AI. This research explores the evolution, future trends, and major collaboration patterns of international collaboration in the field of AI over the past 35 years. It also reveals the leading countries, core groups, and characteristics of collaboration in the field of AI.",
        "DOI": "10.2478/jdis-2020-0027",
        "paper_author": "Hu H.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Co-inections of domestic and wild birds with avian influenza and Newcastle disease viruses: implications for control and genetic mutations",
        "publication": "Veterinary Research Communications",
        "citied_by": "5",
        "cover_date": "2020-11-01",
        "Abstract": "Co-infections of birds’ upper respiratory tract by avian pathogens are common and cause increasing economic losses. This study determines co-infection status of avian influenza (AI) and Newcastle disease (ND) in birds in two Nigerian states with different highly pathogenic avian influenza (HPAI) records and where modified stamping out policy contained the virus for seven years after which the virus resurged with higher infectivity in 2015. A cross-sectional study sampling 910 apparently healthy domestic and 90 wild birds from wild habitats, commercial poultry farms, households and live bird markets (LBMs) was conducted. Cloacal and tracheal swabs were tested for AI H5 and ND viruses using conventional reverse transcriptase polymerase chain reaction (RT-PCR). Overall detection rates of 3% and 18% for AI and ND were obtained. There was an equivalence of 8.5% ND detection rate in poultry and wild birds in the two states. Co-infection (0.2%) of a local chicken from a live bird market (LBM) and crown crane (Balearica regulorum) from a household to AI H5 and ND viruses occurred, respectively. Exposure of birds to AI and ND was significantly detected in apparently healthy domestic and wild birds. The probability of these viruses exchanging genetic materials to resurge with increasing virulence is foreseen. Therefore, routine AI and ND control measures should incorporate virus surveillance and instituting appropriate preventive measures in domestic and wild birds held in households, commercial farms and LBMs.",
        "DOI": "10.1007/s11259-020-09783-y",
        "paper_author": "Musa W.I.",
        "affiliation_name": "Ahmadu Bello University",
        "affiliation_city": "Zaria",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60010799",
        "affiliation_state": "Kaduna"
    },
    {
        "paper_title": "Answerable and Unanswerable Questions in Risk Analysis with Open-World Novelty",
        "publication": "Risk Analysis",
        "citied_by": "5",
        "cover_date": "2020-11-01",
        "Abstract": "Decision analysis and risk analysis have grown up around a set of organizing questions: what might go wrong, how likely is it to do so, how bad might the consequences be, what should be done to maximize expected utility and minimize expected loss or regret, and how large are the remaining risks? In probabilistic causal models capable of representing unpredictable and novel events, probabilities for what will happen, and even what is possible, cannot necessarily be determined in advance. Standard decision and risk analysis questions become inherently unanswerable (“undecidable”) for realistically complex causal systems with “open-world” uncertainties about what exists, what can happen, what other agents know, and how they will act. Recent artificial intelligence (AI) techniques enable agents (e.g., robots, drone swarms, and automatic controllers) to learn, plan, and act effectively despite open-world uncertainties in a host of practical applications, from robotics and autonomous vehicles to industrial engineering, transportation and logistics automation, and industrial process control. This article offers an AI/machine learning perspective on recent ideas for making decision and risk analysis (even) more useful. It reviews undecidability results and recent principles and methods for enabling intelligent agents to learn what works and how to complete useful tasks, adjust plans as needed, and achieve multiple goals safely and reasonably efficiently when possible, despite open-world uncertainties and unpredictable events. In the near future, these principles could contribute to the formulation and effective implementation of more effective plans and policies in business, regulation, and public policy, as well as in engineering, disaster management, and military and civil defense operations. They can extend traditional decision and risk analysis to deal more successfully with open-world novelty and unpredictable events in large-scale real-world planning, policymaking, and risk management.",
        "DOI": "10.1111/risa.13553",
        "paper_author": "Cox L.A.",
        "affiliation_name": "University of Colorado Denver",
        "affiliation_city": "Denver",
        "affiliation_country": "United States",
        "affiliation_id": "60010307",
        "affiliation_state": "CO"
    },
    {
        "paper_title": "Artificial intelligence in detection and segmentation of internal auditory canal and its nerves using deep learning techniques",
        "publication": "International Journal of Computer Assisted Radiology and Surgery",
        "citied_by": "17",
        "cover_date": "2020-11-01",
        "Abstract": "Purpose: Artificial intelligence (AI) in medical imaging is a burgeoning topic that involves the interpretation of complex image structures. The recent advancements in deep learning techniques increase the computational powers to extract vital features without human intervention. The automatic detection and segmentation of subtle tissue such as the internal auditory canal (IAC) and its nerves is a challenging task, and it can be improved using deep learning techniques. Methods: The main scope of this research is to present an automatic method to detect and segment the IAC and its nerves like the facial nerve, cochlear nerve, inferior vestibular nerve, and superior vestibular nerve. To address this issue, we propose a Mask R-CNN approach driven with U-net to detect and segment the IAC and its nerves. The Mask R-CNN with its backbone network of the RESNET50 model learns a background-based localization policy to produce an actual bounding box of the IAC. Furthermore, the U-net segments the structure related information of IAC and its nerves by learning its features. Results: The proposed method was experimented on clinical datasets of 50 different patients including adults and children. The localization of IAC using Mask R-CNN was evaluated using Intersection of Union (IoU), and segmentation of IAC and its nerves was evaluated using Dice similarity coefficient. Conclusions: The localization result shows that mean IoU of RESNET50, RESNET101 are 0.79 and 0.74, respectively. The Dice similarity coefficient of IAC and its nerves using region growing, PSO and U-net method scored 92%, 94%, and 96%, respectively. The result shows that the proposed method outperform better in localization and segmentation of IAC and its nerves. Thus, AI aids the radiologists in making the right decisions as the localization and segmentation of IAC is accurate.",
        "DOI": "10.1007/s11548-020-02237-5",
        "paper_author": "Jeevakala S.",
        "affiliation_name": "Indian Institute of Technology Madras",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60025757",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "The disruptive power of Artificial Intelligence. Ethical aspects of gerontechnology in elderly care",
        "publication": "Archives of Gerontology and Geriatrics",
        "citied_by": "69",
        "cover_date": "2020-11-01",
        "Abstract": "Gerontechnology based on Artificial Intelligence (AI) is expected to fulfill the promise of the so-called 4p-medicine and enable a predictive, personalized, preventive, and participatory elderly care. Although empirical evidence shows positive health outcomes, commentators are concerned that AI-based gerontechnology could bring along the disruption of elderly care. A systematic conceptualization of these concerns is lacking. In this paper, such a conceptualization is suggested by analyzing the risks of AI in elderly care as “4d-risks”: the depersonalization of care through algorithm-based standardization, the discrimination of minority groups through generalization, the dehumanization of the care relationship through automatization, and the disciplination of users through monitoring and surveillance. Based on the 4d-model, strategies for a patient-centered AI in elderly care are outlined. Whether AI-based gerontechnology will actualize the 4p-perspective or bring about the 4d-scenario depends on whether joint efforts of users, caregivers, care providers, engineers, and policy makers will be made.",
        "DOI": "10.1016/j.archger.2020.104186",
        "paper_author": "Rubeis G.",
        "affiliation_name": "Universität Heidelberg",
        "affiliation_city": "Heidelberg",
        "affiliation_country": "Germany",
        "affiliation_id": "60016908",
        "affiliation_state": "Baden-Wurttemberg"
    },
    {
        "paper_title": "Pesticides Hazardous Hotspots: Empirical Evidences from North India",
        "publication": "Environmental Management",
        "citied_by": "15",
        "cover_date": "2020-11-01",
        "Abstract": "The pesticide use in Indian agriculture showed a declining trend in the late 1990s and early 2000s. Since 2007, pesticide use gained an upward trend. To study the pesticide use pattern and identify pesticide hotspots, we collected data from a sample of 1201 apple, rice, vegetable, and cotton growers from the temperate Kashmir Valley, subtropical Jammu, and Punjab. Our study provided some interesting empirical results: prophylactic pesticide applications in apple crop making it a pesticide guzzler [25.2 kg of active ingredient (ai)/ha] with use of riskiest carcinogen pesticides (9 kg of a.i/ha) and field use environmental impact quotient (FEIQ) (620.4/ha) being the highest, the Kashmir Valley is the “pesticide hottest spot”, followed by cotton and rice areas of Punjab and vegetable cultivation in Jammu subtropics. Pesticides banned for use in vegetables, such as monocrotophos were also applied by farmers in vegetable crops. However, rice areas in Kashmir and Jammu were only treated with herbicides. The protective measures taken by farmers while mixing and applying pesticides were primitive, resulting in localized mild/moderate pesticide poisoning besides loss of consciousness. We also found that the official data on the pesticide use are underreported and hence unreliable. Our study shows that neither the pesticide use by mass nor the pesticide use frequency, in combination or alone, is the robust indicator to measure the pesticide hazardous hotspots; besides these, FEIQ and less hazardous pesticides that are not probable or possible carcinogen should be rather used in conjunction.",
        "DOI": "10.1007/s00267-020-01317-1",
        "paper_author": "Peshin R.",
        "affiliation_name": "Sher-e-Kashmir University of Agricultural Sciences and Technology of Jammu",
        "affiliation_city": "Jammu",
        "affiliation_country": "India",
        "affiliation_id": "60069543",
        "affiliation_state": "JK"
    },
    {
        "paper_title": "ETIP: a lengthy nested NER problem for Chinese insurance policy analysis",
        "publication": "Pattern Analysis and Applications",
        "citied_by": "2",
        "cover_date": "2020-11-01",
        "Abstract": "Contract analysis can significantly ease the work for humans using AI techniques. This paper shows a lengthy nested NER problem of element tagging on insurance policy (ETIP). Compared to NER, ETIP deals with not only different types of entities which vary from a short phrase to a long sentence, but also phrase or clause entities that could be nested. We present a novel hybrid framework of deep learning and heuristic filtering method to recognize the lengthy nested elements. First, a convolutional neural network is constructed to obtain good initial candidates of sliding windows with high softmax probability. Then, the concatenation operator on adjacent candidate segments is introduced to create phrase, clause, or sentence candidates. We design an effective voting strategy to resolve the classification conflict of the concatenated candidates and present a theoretical proof of F1-score optimization. In experiments, we have collected a large Chinese insurance contract dataset to test the performance of the proposed method. An extensive set of experiments is performed to investigate how sliding window candidates can work effectively in our filtering and voting strategy. The optimal parameters are determined by statistical analysis of the experimental data. The results show the promising performance of our method in the ETIP problem.",
        "DOI": "10.1007/s10044-020-00885-6",
        "paper_author": "Sun L.",
        "affiliation_name": "Hangzhou City University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60098513",
        "affiliation_state": "Zhejiang"
    }
]