[
    {
        "paper_title": "Eco-engineering approaches for ocean negative carbon emission",
        "publication": "Science Bulletin",
        "citied_by": "32",
        "cover_date": "2022-12-31",
        "Abstract": "The goal of achieving carbon neutrality in the next 30–40 years is approaching worldwide consensus and requires coordinated efforts to combat the increasing threat of climate change. Two main sets of actions have been proposed to address this grand goal. One is to reduce anthropogenic CO2 emissions to the atmosphere, and the other is to increase carbon sinks or negative emissions, i.e., removing CO2 from the atmosphere. Here we advocate eco-engineering approaches for ocean negative carbon emission (ONCE), aiming to enhance carbon sinks in the marine environment. An international program is being established to promote coordinated efforts in developing ONCE-relevant strategies and methodologies, taking into consideration ecological/biogeochemical processes and mechanisms related to different forms of carbon (inorganic/organic, biotic/abiotic, particulate/dissolved) for sequestration. We focus on marine ecosystem-based approaches and pay special attention to mechanisms that require transformative research, including those elucidating interactions between the biological pump (BP), the microbial carbon pump (MCP), and microbially induced carbonate precipitation (MICP). Eutrophic estuaries, hypoxic and anoxic waters, coral reef ecosystems, as well as aquaculture areas are particularly considered in the context of efforts to increase their capacity as carbon sinks. ONCE approaches are thus expected to be beneficial for both carbon sequestration and alleviation of environmental stresses.",
        "DOI": "10.1016/j.scib.2022.11.016",
        "paper_author": "Zhang C.",
        "affiliation_name": "Southern Marine Science and Engineering Guangdong Laboratory",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60272288"
    },
    {
        "paper_title": "Silk fibroin based interpenetrating network hydrogel for corneal stromal regeneration",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "26",
        "cover_date": "2022-12-31",
        "Abstract": "There is a need to develop tissue engineering based approaches to address the shortage of donor corneas worldwide for transplantation. To do this a novel approach to fabricate three-dimensional hydrogels using free-radical polymerization was investigated to generate constructs for corneal stromal tissue regeneration. Different ratios of silk fibroin (SF) to polyacrylamide (PA) were used to fabricate semi-interpenetrating hydrogels. Scanning electron micrograph displayed the interconnectivity of pores within the fabricated hydrogels. Pore sizes ranged from 25 to 66 μm. Scaffolds with increasing concentration of SF had enhanced β-sheet structure (verified by Fourier transform infrared spectroscopy). The biological response of human corneal stromal cells to these hydrogels was examined using cellular adhesion, proliferation, cytoskeleton organization, gene expression and immunocytochemical analysis. The fabricated hydrogels possess rapid gelation (∼3 min) at 37 °C, 84 % porosity facilitating keratocyte migration during healing, improved cellular adhesion and no cytotoxicity, indicating their efficiency for in-situ corneal tissue regeneration. Presence of SF in semi-interpenetrating network hydrogel enhanced cellular proliferation, elevated GAG deposition, and increased expression of keratocyte genes, normally associated with healthy corneal stromal tissue. This study acts as an initial step towards fabricating SF based semi-interpenetrating network hydrogels for developing clinically applicable ocular implants.",
        "DOI": "10.1016/j.ijbiomac.2022.11.021",
        "paper_author": "Bhattacharjee P.",
        "affiliation_name": "Trinity College Dublin",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60011149"
    },
    {
        "paper_title": "Polyhydroxybutyrate-starch/carbon nanotube electrospun nanocomposite: A highly potential scaffold for bone tissue engineering applications",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "21",
        "cover_date": "2022-12-31",
        "Abstract": "Blend nanofibers composed of synthetic and natural polymers with carbon nanomaterial, have a great potential for bone tissue engineering. In this study, the electrospun nanocomposite scaffolds based on polyhydroxybutyrate(PHB)-Starch-multiwalled carbon nanotubes (MWCNTs) were fabricated with different concentrations of MWCNTs including 0.5, 0.75 and 1 wt%. The synthesized scaffolds were characterized in terms of morphology, porosity, thermal and mechanical properties, biodegradation, bioactivity, and cell behavior. The effect of the developed structures on MG63 cells was determined by real-time PCR quantification of collagen type I, osteocalcin, osteopontin and osteonectin genes. Our results showed that the scaffold containing 1 wt% MWCNTs presented the lowest fiber diameter (124 ± 44 nm) with a porosity percentage above 80 % and the highest tensile strength (24.37 ± 0.22 MPa). The addition of MWCNTs has a positive effect on surface roughness and hydrophilicity. The formation of calcium phosphate sediments on the surface of the scaffolds after immersion in SBF is observed by SEM and verified by EDS and XRD analysis.MG63 cells were well cultured on the scaffold containing MWCNTs and presented more cell viability, ALP secretion, calcium deposition and gene expression compared to the scaffolds without MWCNTs. The PHB-starch-1wt.%MWCNTs scaffold can be considerable for studies of supplemental bone tissue engineering applications.",
        "DOI": "10.1016/j.ijbiomac.2022.11.023",
        "paper_author": "Asl M.A.",
        "affiliation_name": "Islamic Azad University, Central Tehran Branch",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60102242"
    },
    {
        "paper_title": "Fabrication and characterization of bilayer scaffolds - nanocellulosic cryogels - for skin tissue engineering by co-culturing of fibroblasts and keratinocytes",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "9",
        "cover_date": "2022-12-31",
        "Abstract": "This study focuses on developing a microarchitectural bilayer structure for stimulating the two top layers of skin tissue (epidermis and dermis) fabricated using a one-step freeze-drying method. Cellulose nanofibers (CNFs) and poly (vinyl) alcohol (PVA) were used as a biocompatible scaffolding material, and the composition was designed in such a way that it provides physical and biological property attributes. In this work, scaffolding materials with integrated layer structures and well interconnected and open pore structures were obtained. This bilayer structure had porosity with a pore size of 19.72 μm and 90.71 μm for the simulation of the epidermis and dermis, respectively. The production and expression of laminin, collagen IV, and keratin 10 proteins in the bilayer cryogel scaffolds obtained from the immunofluorescence study were 49.7 %, 63.8 %, and 49.3 %, respectively. The extracellular matrix (ECM) was produced in each scaffold layer. The observations confirmed that the porosity and pore size of both N1 and N2 layers were appropriate for the fibroblast and keratinocyte cells, respectively. H&E stained cross-sections of bilayer cryogel scaffolds illustrated epidermal and dermal layers produced by co-culturing keratinocytes and fibroblasts. Based on the results, the bilayer CNF/PVA scaffold can be used in skin tissue engineering applications. However, more experiments and in vivo evaluations are needed to express this conclusion more accurately.",
        "DOI": "10.1016/j.ijbiomac.2022.10.281",
        "paper_author": "Ghafari R.",
        "affiliation_name": "University of Tehran",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60022927"
    },
    {
        "paper_title": "Numerical and experimental flow investigation using ultrasonic PIV for optimizing mechanically agitated lab-scale anaerobic digesters",
        "publication": "Chemical Engineering Science",
        "citied_by": "8",
        "cover_date": "2022-12-31",
        "Abstract": "In this article, a non-invasive ultrasonic flow field measurement method is studied to investigate its applicability to resolve fluid flow in bio- and chemical engineering reactors. In detail, the proposed flow field investigation method is applied to mechanically agitated lab-scale reactors for the validation of anaerobic digester mixing simulations. Two reactors with different geometries, which are cold models of real-life anaerobic digesters, are studied. Since conventional non-invasive flow field measurement techniques are not suitable for the investigated reactor geometries, the applicability of ultrasonic measurement is demonstrated. The experimental results are compared to Computational Fluid Dynamics (CFD) simulations using the Finite Volume Method with multiple reference frames to account for the stirrer-induced mixing. It is shown that ultrasonic measurement is an easily applicable non-invasive method for resolving flow fields of opaque fluids found in chemical, mechanical and biological engineering. The study highlights the benefits of the non-invasive measurement approach and also demonstrates the suitability of this flow measurement technique for further applications such as the optimization of the mixing time characteristics of paints and coatings or silicone production. The resolved flow fields are in accordance with numerical reference results with minor deviations of up to 9% for velocity measurements aligned with the main axis of the ultrasound probe. The validated CFD model can be used as a template for modelling similar chemical engineering processes where the mixing time characteristic is critical. It is further shown that the accuracy of this flow measurement method decreases with increased offsets from the main axis. In addition to the axis alignment, the impact of different fluid properties and reactor geometries is also discussed.",
        "DOI": "10.1016/j.ces.2022.118129",
        "paper_author": "Neuner T.",
        "affiliation_name": "MCI - The Entrepreneurial School",
        "affiliation_city": "Innsbruck",
        "affiliation_country": "Austria",
        "affiliation_id": "60004100"
    },
    {
        "paper_title": "Goals, Key Technologies, and Regional Models of Smart Farming for Field Crops in China",
        "publication": "Smart Agriculture",
        "citied_by": "2",
        "cover_date": "2022-12-30",
        "Abstract": "Smart farming for field crops is a significant part of the smart agriculture. It aims at crop production, integrating modern sensing technology, new generation mobile communication technology, computer and network technology, Internet of Things(IoT), big data, cloud computing, blockchain and expert wisdom and knowledge. Deeply integrated application of biotechnology, engineering technology, information technology and management technology, it realizes accurate perception, quantitative decision-making, intelligent operation and intelligent service in the process of crop production, to significantly improve land output, resource utilization and labor productivity, comprehensively improves the quality, and promotes efficiency of agricultural products. In order to promote the sustainable development of the smart farming, through the analysis of the development process of smart agriculture, the overall objectives and key tasks of the development strategy were clarified, the key technologies in smart farming were condensed. Analysis and breakthrough of smart farming key technologies were crucial to the industrial development strategy. The main problems of the smart farming for field crops include: the lack of in-situ accurate measurement technology and special agricultural sensors, the large difference between crop model and actual production, the instantaneity, reliability, universality, and stability of the information transmission technologies, and the combination of intelligent agricultural equipment with agronomy. Based on the above analysis, five primary technologies and eighteen corresponding secondary technologies of smart farming for field crops were proposed, including: sensing technologies of environmental and biological information in field, agricultural IoT technologies and mobile internet, cloud computing and cloud service technologies in agriculture, big data analysis and decision-making technology in agriculture, and intelligent agricultural machinery and agricultural robots in fireld production. According to the characteristics of China's cropping region, the corresponding smart farming development strategies were proposed: large-scale smart production development zone in the Northeast region and Inner Mongolia region, smart urban agriculture and water-saving agriculture development zone in the region of Beijing, Tianjin, Hebei and Shandong, large-scale smart farming of cotton and smart dry farming green development comprehensive test zone in the Northwest arid region, smart farming of rice comprehensive development test zone in the Southeast coast region, and characteristic smart farming development zone in the Southwest mountain region. Finally, the suggestions were given from the perspective of infrastructure, key technology, talent and policy.",
        "DOI": "10.12133/j.smartag.SA202207003",
        "paper_author": "Li L.",
        "affiliation_name": "Key Laboratory of Agricultural Information Acquisition Technology, Ministry of Agriculture",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60124082"
    },
    {
        "paper_title": "Ultrasound-activated luminescence with color tunability enabled by mechanoluminescent colloids and perovskite quantum dots",
        "publication": "Nanoscale",
        "citied_by": "15",
        "cover_date": "2022-12-28",
        "Abstract": "Ultrasound represents a wireless and non-contact route for energy delivery and device control, owing to its ability to propagate and focus in various mediums including biological tissue. Specifically, ultrasound-activated mechanoluminescence from a colloidal suspension of mechanoluminescent (ML) nanocrystals offers a wireless means to remotely control a light source, such as wirelessly addressing a multicolor display. However, the limited color purity and tunability, as well as the large sizes of conventional ML materials prevent their use in an ultrasound-mediated flexible color display. Here, we apply a biomineral-inspired suppressed dissolution approach to synthesize ML colloids with bright blue emission under ultrasound and small sizes down to 20 nm. In addition, we leverage the bandgap engineering strategy of all-inorganic perovskite quantum dots (PQDs) to achieve wavelength tunability of the mechanoluminescence of ML colloid/PQD composites. Remarkably, the ultrasound-activated emission of the ML colloid/PQD composites exhibits a highly saturated color gamut covering the entire visible spectrum. Based on these advantages, we assembled a pixel array composed of different ML colloid/PQD composites in a silicone elastomer and demonstrated the proof-of-concept of a flexible and wireless multicolor display with each pixel individually addressed by scanning focused ultrasound.",
        "DOI": "10.1039/d2nr06129e",
        "paper_author": "Yang F.",
        "affiliation_name": "Stanford Engineering",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60141508"
    },
    {
        "paper_title": "Ir Cluster-Anchored MOFs as Peroxidase-Mimetic Nanoreactors for Diagnosing Hydrogen Peroxide-Related Biomarkers",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "30",
        "cover_date": "2022-12-28",
        "Abstract": "Exploring multifaceted and highly sensitive biosensors is a major challenge in biotechnology and medical diagnosis. Here, we create a new iridium (Ir) cluster-anchored metal-organic framework (MOF, namely, IrNCs@Ti-MOF via a coordination-assisted strategy) as a peroxidase (POD)-mimetic nanoreactor for colorimetrically diagnosing hydrogen peroxide-related biomarkers. Owing to the IrNCs-N/O coordination of Ti-MOF and unique enzymatic properties of Ir clusters, the IrNCs@Ti-MOF exhibits exceptional and exclusive POD-mimetic activities (Km = 3.94 mM, Vmax = 1.70 μM s-1, and turnover number = 39.64 × 10-3 s-1 for H2O2), thus demonstrating excellent POD-mimetic detecting activity and also super substrate selectivity, which is considerably more efficient than recently reported POD mimetics. Colorimetric studies disclose that this IrNCs@Ti-MOF-based nanoreactor shows multifaceted and efficient diagnosing activities and substrate selectivity, such as a limit of detection (LOD): 14.12 μM for H2O2 at a range of 0-900 μM, LOD: 3.41 μM for l-cysteine at a range of 0-50 μM, and LOD: 20.0 μM for glucose at a range of 0-600 μM, which enables an ultrasensitive and visual determination of abundant H2O2-related biomarkers. The proposed design will not only provide highly sensitive and cheap colorimetric biosensors in medical resource-limited areas but also offer a new path to engineering customizable enzyme-mimetic nanoreactors as a powerful tool for accurate and rapid diagnosis.",
        "DOI": "10.1021/acsami.2c18676",
        "paper_author": "Mu S.",
        "affiliation_name": "State Key Laboratory of Polymer Materials Engineering",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60128315"
    },
    {
        "paper_title": "Quasi-Volatile MoS<inf>2</inf> Barristor Memory for 1T Compact Neuron by Correlative Charges Trapping and Schottky Barrier Modulation",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "7",
        "cover_date": "2022-12-28",
        "Abstract": "Artificial neurons as the basic units of spiking neural network (SNN) have attracted increasing interest in energy-efficient neuromorphic computing. 2D transition metal dichalcogenide (TMD)-based devices have great potential for high-performance and low-power artificial neural devices, owing to their unique ion motion, interface engineering, and resistive switching behaviors. Although there are widespread applications of TMD-based artificial synapses in neural networks, TMD-based neurons are seldom reported due to the lack of bio-plausible multi-mechanisms to mimic leaking, integrating, and firing biological behaviors without external assistance. In this work, for the first time, a methodology is developed by introducing the hybrid effect of charge trapping (CT) and Schottky barrier (SB) in MoS2 FETs for barristor memory and one-transistor (1T) compact artificial neuron realization. By correlating the CT and SB processes, quasi-volatile and resistive switching behaviors are realized on the fabricated MoS2 FET and utilized to mimic the accumulating, leaking, and firing biological behaviors of neurons. Therefore, based on a single quasi-volatile CT-SB MoS2 barristor memory, a 1T compact neuron of the basic leaky-integral-and-fire (LIF) function is demonstrated without a peripheral circuit. Furthermore, a spiking neural network (SNN) based on the CT-SB MoS2 barristor neurons is simulated and implemented in pattern classification with high accuracy approaching 95.82%. This work provides a highly integrated and inherently low-energy implementation for neural networks.",
        "DOI": "10.1021/acsami.2c18561",
        "paper_author": "Huo J.",
        "affiliation_name": "Institute of Microelectronics Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027799"
    },
    {
        "paper_title": "Unraveling How Cholesterol Affects Multivalency-Induced Membrane Deformation of Sub-100 nm Lipid Vesicles",
        "publication": "Langmuir",
        "citied_by": "3",
        "cover_date": "2022-12-27",
        "Abstract": "Cholesterol plays a critical role in modulating the lipid membrane properties of biological and biomimetic systems and recent attention has focused on its role in the functions of sub-100 nm lipid vesicles and lipid nanoparticles. These functions often rely on multivalent ligand-receptor interactions involving membrane attachment and dynamic shape transformations while the extent to which cholesterol can influence such interaction processes is largely unknown. To address this question, herein, we investigated the attachment of sub-100 nm lipid vesicles containing varying cholesterol fractions (0-45 mol %) to membrane-mimicking supported lipid bilayer (SLB) platforms. Biotinylated lipids and streptavidin proteins were used as model ligands and receptors, respectively, while the localized surface plasmon resonance sensing technique was employed to track vesicle attachment kinetics in combination with analytical modeling of vesicle shape changes. Across various conditions mimicking low and high multivalency, our findings revealed that cholesterol-containing vesicles could bind to receptor-functionalized membranes but underwent appreciably less multivalency-induced shape deformation than vesicles without cholesterol, which can be explained by a cholesterol-mediated increase in membrane bending rigidity. Interestingly, the extent of vesicle deformation that occurred in response to increasingly strong multivalent interactions was less pronounced for vesicles with greater cholesterol fraction. The latter trend was rationalized by taking into account the strong dependence of the membrane bending energy on the area of the vesicle-SLB contact region and such insights can aid the engineering of membrane-enveloped nanoparticles with tailored biophysical properties.",
        "DOI": "10.1021/acs.langmuir.2c02252",
        "paper_author": "Park H.",
        "affiliation_name": "Sungkyunkwan University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60007511"
    },
    {
        "paper_title": "Phase-Separation-Induced Porous Hydrogels from Amphiphilic Triblock Copolymer with High Permeability and Mechanical Strength",
        "publication": "Chemistry of Materials",
        "citied_by": "13",
        "cover_date": "2022-12-27",
        "Abstract": "Porous hydrogels, possessing both high mechanical strength and high permeability, are sought after in energy storage, soft robotics, solar vapor generation, and tissue engineering. However, there is always a trade-off between mechanical strength and permeability. In general, high porosity promotes molecular mass transportation (permeability) but sacrifices mechanical strength. To address this issue, in this work, micro/nanoporous hydrogels with high mechanical strength are fabricated from the self-assembly of amphiphilic triblock copolymers consisting of hydrophilic end blocks and hydrophobic midblocks. The chemically distinct blocks induce the phase separation, yielding a hydrogel network consisting of nanopores dispersed in the micrometer-thick sponge-like base support with an ordered lamellar structure. The soft water-depleted phase is dynamic, forming a transient network that allows chain exchange and coalescence between different phases. This reversible process not only dissipates energy to toughen hydrogels but also enables self-recovery. By systematically altering the length of end blocks and midblocks, one can synthesize hydrogels with tunable mechanical properties, including an elastic modulus of 87-884 kPa, a fracture stress of 63-584 kPa, a fracture strain of 1-20, and work of extension of 217-2104 kJ/m3. The gels with a porous size in the range of 1-8 μm also exhibit self-recovery behavior and a high permeability of 10-12 and 10-11 m2. The porous hydrogels show a fracture energy of ∼2000 J/m2, several orders of magnitude higher than common porous hydrogels (gelatin, agarose, and polyacrylamide) and comparable to soft biological tissues. The preparation process also endows the foreseeable potential as injectable hydrogels for applications in soft robotics and 3D printing.",
        "DOI": "10.1021/acs.chemmater.2c03004",
        "paper_author": "Lu M.",
        "affiliation_name": "South China University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60024542"
    },
    {
        "paper_title": "Photoactive Nanomaterials for Wireless Neural Biomimetics, Stimulation, and Regeneration",
        "publication": "ACS Nano",
        "citied_by": "20",
        "cover_date": "2022-12-27",
        "Abstract": "Nanomaterials at the neural interface can provide the bridge between bioelectronic devices and native neural tissues and achieve bidirectional transmission of signals with our brain. Photoactive nanomaterials, such as inorganic and polymeric nanoparticles, nanotubes, nanowires, nanorods, nanosheets or related, are being explored to mimic, modulate, control, or even substitute the functions of neural cells or tissues. They show great promise in next generation technologies for the neural interface with excellent spatial and temporal accuracy. In this review, we highlight the discovery and understanding of these nanomaterials in precise control of an individual neuron, biomimetic retinal prosthetics for vision restoration, repair or regeneration of central or peripheral neural tissues, and wireless deep brain stimulation for treatment of movement or mental disorders. The most intriguing feature is that the photoactive materials fit within a minimally invasive and wireless strategy to trigger the flux of neurologically active molecules and thus influences the cell membrane potential or key signaling molecule related to gene expression. In particular, we focus on worthy pathways of photosignal transduction at the nanomaterial-neural interface and the behavior of the biological system. Finally, we describe the challenges on how to design photoactive nanomaterials specific to neurological disorders. There are also some open issues such as long-term interface stability and signal transduction efficiency to further explore for clinical practice.",
        "DOI": "10.1021/acsnano.2c08543",
        "paper_author": "Zhao D.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100"
    },
    {
        "paper_title": "Site-specific labelling and biological evaluation of PD-L1 targeted single-domain antibody",
        "publication": "Chinese Journal of Nuclear Medicine and Molecular Imaging",
        "citied_by": "0",
        "cover_date": "2022-12-25",
        "Abstract": "Objective To synthesize a novel site-specifically labelled probe 68Ga-1, 4, 7, 10-tetraazacyclododecane-1, 4, 7, 10-tetraacetic acid (DOTA)-Cys-Asp-Val (CDV)-Nb109 and explore its potential for detection of the programmed cell death ligand 1 (PD-L1) expression level in different tumors. Methods Firstly, CDV was inserted into the tail of the sequence of Nb109 by genetic engineering. Then the precursor DOTA-CDV-Nb109 was prepared by mixing the maleimide-DOTA and the single-domain antibody CDV-Nb109 (amount of substance ratio 1∶1) via the maleimide-cysteine site-specific coupling strategy. Subsequently, the DOTA-CDV-Nb109 was labeled with 68Ga and purified by PD-10 column. Human melanoma A375, human PD-L1 transfected melanoma A375-hPD-L1 and human glioma U87 tumor-bearing mice models were established, and the diagnostic value of 68Ga-DOTA-CDV-Nb109 was evaluated by stability assay, cellular uptake, and microPET imaging. One-way analysis of variance and the least significant difference t test were used to analyze the data. Results The probe 68Ga-DOTA-CDV-Nb109 was obtained with the radiochemical yield of (69.79±4.69)%, radiochemical purity more than 97%, and molar activity of (12.85±1.51) GBq/μmol. 68Ga-DOTA-CDV-Nb109 had strong binding affinity for A375-hPD-L1 with the dissociation constant (Kd) of (66.43±17.89) nmol/L. The uptake of 68Ga-DOTA-CDV-Nb109 in A375-hPD-L1 and U87 cells were (3.17±0.15) percentage of the added radioactivity dose (%AD) and (2.08±0.03) %AD respectively, which were significantly higher than that in A375 cells ((1.21±0.14) %AD; F=82.87, t values: 15.23, 9.98, P values: <0.001, 0.003). The tumor uptake of the probe in A375-hPD-L1 ((5.21±0.35) percentage of injected dose per ml (%ID/ml)) and U87 tumor-bearing mice ((3.44±0.69) %ID/ml) were significantly higher than that in A375 tumor-bearing mice ((2.17±0.36) %ID/ml; F=249.72, t values: 35.70, 3.43, both P<0.001). Conclusion The site-specifically labelled probe 68Ga-DOTA-CDV-Nb109, which can non-invasively and dynamically monitor the change of PD-L1 expression level in different tumors and help screen patients who can benefit from PD-L1 immune checkpoint blocking therapy, is successfully synthesized with high radiochemical purity.",
        "DOI": "10.3760/cma.j.cn321828-20220509-00151",
        "paper_author": "Chen Y.",
        "affiliation_name": "Jiangsu Institute of Nuclear Medicine",
        "affiliation_city": "Wuxi",
        "affiliation_country": "China",
        "affiliation_id": "60083494"
    },
    {
        "paper_title": "Design and Experimental Study of Full-ocean-depth Macro-organisms Pressure-retaining Sampling-culture System",
        "publication": "Zhongguo Jixie Gongcheng/China Mechanical Engineering",
        "citied_by": "0",
        "cover_date": "2022-12-25",
        "Abstract": "A new design method of a macro-biological pressure-retaining sampling-culture system at full-ocean depth(operating water depth of 11 000 m) was presented. The system might realize macro-biological pressure-retaining sampling in the full-ocean-depth environment, and at the same time met the requirements of pressure-free transferring and in-situ culture in the laboratory. The basic structure and working principles of the full-ocean-depth macro-biological pressure-retaining sampling-culture system were introduced in details, and the full-ocean-depth macro-biological pressure-retaining sampling-culture system were designed and analyzed. With the developed engineering prototype of the full-ocean-depth macro-biological pressure-retaining sampling, the pressure-retaining performance and sample transfer tests of the full-ocean-depth macro-biological pressure-retaining sampling were carried out. The experimental results show that the full-ocean-depth macro-biological pressure-retaining sampling may bear the pressure of 127 MPa, and the greater the internal pressure of the sampler, the better the pressure-retaining performance, and the transfer without pressure drop is realized in the ultra-high pressure environments, to provide high-quality macro-biological pressure-retaining samples for deep seabed scientific research.",
        "DOI": "10.3969/j.issn.1004-132X.2022.24.001",
        "paper_author": "Liu G.",
        "affiliation_name": "Hunan University of Science and Technology",
        "affiliation_city": "Xiangtan",
        "affiliation_country": "China",
        "affiliation_id": "60024617"
    },
    {
        "paper_title": "BOPPPS teaching method-based effective online teaching strategies and practices for Biopharmaceutical Engineering",
        "publication": "Shengwu Gongcheng Xuebao/Chinese Journal of Biotechnology",
        "citied_by": "3",
        "cover_date": "2022-12-25",
        "Abstract": "Due to the COVID-19 pandemic, the teaching of Biopharmaceutical Engineering course was carried out online and completed with satisfactory outcomes. In order to improve the efficiency of online teaching, ensure the substantive equivalence between online and offline teaching and achieve effective teaching, this article summarized the exploration and practical experience of online teaching, taking the Biopharmaceutical Engineering course as an example. This includes analysis of learner characteristics, selection of online teaching platform, development of teaching resources, optimization of teaching contents, BOPPPS teaching method-based design of teaching structure, and reflection of effective teaching. This paper is expected to provide a useful reference for online teaching.",
        "DOI": "10.13345/j.cjb.220238",
        "paper_author": "Sun F.",
        "affiliation_name": "Xi'an Polytechnic University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60104931"
    },
    {
        "paper_title": "Advances on microbial synthesis of L-proline and trans-4-hydroxy-L-proline",
        "publication": "Shengwu Gongcheng Xuebao/Chinese Journal of Biotechnology",
        "citied_by": "4",
        "cover_date": "2022-12-25",
        "Abstract": "L-proline (L-Pro) is the only imino acid among the 20 amino acids that constitute biological proteins, and its main hydroxylated product is trans-4-hydroxy-L-proline (T-4-Hyp). Both of them have unique biological activities and play important roles in biomedicine, food and beauty industry. With the in-depth exploration of the functions of L-Pro and T-4-Hyp, the demand for them is gradually increasing. Traditional methods of biological extraction and chemical synthesis are unable to meet the demand of “green, environmental protection and high efficiency”. In recent years, synthetic biology has developed rapidly. Through the intensive analysis of the synthetic pathways of L-Pro and T-4-Hyp, microbial cell factories were constructed for large-scale production, which opened a new chapter for the green and efficient production of L-Pro and T-4-Hyp. This paper reviews the application and production methods of L-Pro and T-4-Hyp, the metabolic pathways for microbial synthesis of L-Pro and T-4-Hyp, and the engineering strategies and advances on microbial production of L-Pro and T-4-Hyp, aiming to provide a theoretical basis for the “green bio-manufacturing” of L-Pro and T-4-Hyp and promote their industrial production.",
        "DOI": "10.13345/j.cjb.220739",
        "paper_author": "Hu X.",
        "affiliation_name": "Fujian Normal University",
        "affiliation_city": "Fuzhou",
        "affiliation_country": "China",
        "affiliation_id": "60018844"
    },
    {
        "paper_title": "Experimental observation of a confined bubble moving in shear-thinning fluids",
        "publication": "Journal of Fluid Mechanics",
        "citied_by": "10",
        "cover_date": "2022-12-25",
        "Abstract": "The motion of a long gas bubble in a confined capillary tube is ubiquitous in a wide range of engineering and biological applications. While the understanding of the deposited thin viscous film near the tube wall in Newtonian fluids is well developed, the deposition dynamics in commonly encountered non-Newtonian fluids remains much less studied. Here, we investigate the dynamics of a confined bubble moving in shear-thinning fluids with systematic experiments, varying the zero-shear-rate capillary number in the range of considering the zero-shear-rate viscosity. The thickness of the deposited liquid film, the bubble speed and the bubble front/rear menisci are measured, which are further rationalized with the recent theoretical studies based on appropriate rheological models. Compared with Newtonian fluids, the film thickness decreases for both the carboxymethyl cellulose and Carbopol solutions when the shear-thinning effect dominates. We show that the film thickness follows the scaling law from Aussillous & Quéré (Phys. Fluids, vol. 12, no. 10, 2000, pp. 2367-2371) with an effective capillary number, considering the characteristic shear rate in the film as proposed by Picchi et al. (J. Fluid Mech., vol. 918, no. A7, 2021, pp. 1-30). is calculated by the Carreau number and the power-law index from the Carreau-Yasuda rheological model. The shear-thinning effect also influences the bubble speed and delays the transition to the parabolic region in the bubble front and rear menisci. In particular, a high degree of undulations on the bubble surface results in an intricate rear viscosity distribution for the rear meniscus and the deviation between the experiments and theory may require a further investigation to resolve the axial velocity field. Our study may advance the fundamental understandings and engineering guidelines for coating processes involving thin-film flows and non-Newtonian fluids.",
        "DOI": "10.1017/jfm.2022.926",
        "paper_author": "Chun S.G.",
        "affiliation_name": "The Grainger College of Engineering",
        "affiliation_city": "Urbana",
        "affiliation_country": "United States",
        "affiliation_id": "60158506"
    },
    {
        "paper_title": "CaRA – A multi-purpose phage display library for selection of calcium-regulated affinity proteins",
        "publication": "New Biotechnology",
        "citied_by": "5",
        "cover_date": "2022-12-25",
        "Abstract": "Protein activity regulated by interactions with metal ions can be utilized for many different purposes, including biological therapies and bioprocessing, among others. Calcium ions are known to interact with the frequently occurring EF-hand motif, which can alter protein activity upon binding through an induced conformational change. The calcium-binding loop of the EF-hand motif has previously been introduced into a small protein domain derived from staphylococcal Protein A in a successful effort to render antibody binding dependent on calcium. Presented here, is a combinatorial library for calcium-regulated affinity, CaRA, based on this domain. CaRA is the first alternative scaffold library designed to achieve novel target specificities with metal-dependent binding. From this library, several calcium-dependent binders could be isolated through phage display campaigns towards a set of unrelated target proteins (IgE Cε3-Cε4, TNFα, IL23, scFv, tPA, PCSK9 and HER3) useful for distinct applications. Overall, these monomeric CaRA variants showed high stability and target affinities within the nanomolar range. They displayed considerably higher melting temperatures in the presence of 1 mM calcium compared to without calcium. Further, all discovered binders proved to be calcium-dependent, with the great majority showing complete lack of target binding in the absence of calcium. As demonstrated, the CaRA library is highly capable of providing protein-binding domains with calcium-dependent behavior, independent of the type of target protein. These binding domains could subsequently be of great use in gentle protein purification or as novel therapeutic modalities.",
        "DOI": "10.1016/j.nbt.2022.11.005",
        "paper_author": "Jönsson M.",
        "affiliation_name": "The Royal Institute of Technology (KTH)",
        "affiliation_city": "Stockholm",
        "affiliation_country": "Sweden",
        "affiliation_id": "60002014"
    },
    {
        "paper_title": "Decellularized extracellular matrix (d-ECM): the key role of the inflammatory process in pre-regeneration after implantation",
        "publication": "Biomaterials Science",
        "citied_by": "15",
        "cover_date": "2022-12-23",
        "Abstract": "Clinical medicine is encountering the challenge of repairing soft-tissue defects. Currently, natural and synthetic materials have been developed as natural scaffolds. Among them, the decellularized extracellular matrix (d-ECM) can achieve tissue remodeling following injury and, thus, replace defects due to its advantages of the extensiveness of the source and excellent biological and mechanical properties. However, by analyzing the existing decellularization techniques, we found that different preparation methods directly affect the residual components of the d-ECM, and further have different effects on inflammation and regeneration of soft tissues. Therefore, we analyzed the role of different residual components of the d-ECM after decellularization. Then, we explored the inflammatory process and immune cells in an attempt to understand the mechanisms and causes of tissue degeneration and regeneration after transplantation. In this paper, we summarize the current studies related to updated protocols for the preparation of the d-ECM, biogenic and exogenous residual substances, inflammation, and immune cells influencing the fate of the d-ECM.",
        "DOI": "10.1039/d2bm01204a",
        "paper_author": "Long J.",
        "affiliation_name": "Xijing Hospital",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60069708"
    },
    {
        "paper_title": "Hyaluronic acid-based nanofibers: Electrospun synthesis and their medical applications; recent developments and future perspective",
        "publication": "Frontiers in Chemistry",
        "citied_by": "14",
        "cover_date": "2022-12-23",
        "Abstract": "Hyaluronan is a biodegradable, biopolymer that represents a major part of the extracellular matrix and has the potential to be fabricated in a fibrous form conjugated with other polymers via electrospinning. Unique physicochemical features such as viscoelasticity, conductivity, and biological activity mainly affected by molecular weight attracted the attention of biomedical researchers to utilize hyaluronan for designing novel HA-based nano-devices. Particularly HA-based nanofibers get focused on a diverse range of applications in medical like tissue implants for regeneration of damaged tissue or organ repair, wound dressings, and drug delivery carriers to treat various disorders. Currently, electrospinning represents an effective available method for designing highly porous, 3D, HA-based nanofibers with features similar to that of the extra-cellular matrix making them a promising candidate for designing advanced regenerative medicines. This review highlights the structural and physicochemical features of HA, recently cited protocols in literature for HA production via microbial fermentation with particular focus on electrospun fabrication of HA-based nanofibers and parameters affecting its synthesis, current progress in medical applications of these electrospun HA-based nanofibers, their limitations and future perspective about the potential of these HA-based nanofibers in medical field.",
        "DOI": "10.3389/fchem.2022.1092123",
        "paper_author": "Humaira ",
        "affiliation_name": "University of Sargodha",
        "affiliation_city": "Sargodha",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60038659"
    },
    {
        "paper_title": "Bonding of Neuropeptide Y on Graphene Oxide for Drug Delivery Applications to the Central Nervous System",
        "publication": "ACS Applied Nano Materials",
        "citied_by": "9",
        "cover_date": "2022-12-23",
        "Abstract": "Nanoscale graphene-based materials (GBMs) enable targeting subcellular structures of the nervous system, a feature crucial for the successful engineering of alternative nanocarriers to deliver drugs and to treat neurodisorders. Among GBMs, graphene oxide (GO) nanoflakes, showing good dispersibility in water solution and being rich of functionalizable oxygen groups, are ideal core structures for carrying biological active molecules to the brain, such as the neuropeptide Y (NPY). In addition, when unconjugated, these nanomaterials have been reported to modulate neuronal function per se. Although some GBM-based nanocarriers have been tested both in vitro and in vivo, a thorough characterization of covalent binding impact on the biological properties of the carried molecule and/or of the nanomaterial is still missing. Here, a copper(I)-catalyzed alkyne-azide cycloaddition strategy was employed to synthesize the GO-NPY complex. By investigating through electrophysiology the impact of these conjugates on the activity of hippocampal neurons, we show that the covalent modification of the nanomaterial, while making GO an inert platform for the vectorized delivery, enhances the duration of NPY pharmacological activity. These findings support the future use of GO for the development of smart platforms for nervous system drug delivery.",
        "DOI": "10.1021/acsanm.2c03409",
        "paper_author": "Cellot G.",
        "affiliation_name": "Scuola Internazionale Superiore di Studi Avanzati",
        "affiliation_city": "Trieste",
        "affiliation_country": "Italy",
        "affiliation_id": "60012227"
    },
    {
        "paper_title": "Chimeric antigen receptor T-cell therapy for multiple myeloma",
        "publication": "Frontiers in Immunology",
        "citied_by": "11",
        "cover_date": "2022-12-22",
        "Abstract": "Multiple myeloma (MM) is a malignant plasma cell disorder that remains incurable for most patients, as persistent clonal evolution drives new mutations which confer MM high-risk signatures and resistance to standard care. The past two decades have significantly refashioned the therapeutic options for MM, especially adoptive T cell therapy contributing to impressive response rate and clinical efficacy. Despite great promises achieved from chimeric antigen receptor T-cell (CAR-T) therapy, the poor durability and severe toxicity (cytokine release syndrome and neurotoxicity) are still huge challenges. Therefore, relapsed/refractory multiple myeloma (RRMM), characterized by the nature of clinicopathologic and molecular heterogeneity, is frequently associated with poor prognosis. B Cell Maturation Antigen (BCMA) is the most successful target for CAR-T therapy, and other potential targets either for single-target or dual-target CAR-T are actively being studied in numerous clinical trials. Moreover, mechanisms driving resistance or relapse after CAR-T therapy remain uncharacterized, which might refer to T-cell clearance, antigen escape, and immunosuppressive tumor microenvironment. Engineering CAR T-cell to improve both efficacy and safety continues to be a promising area for investigation. In this review, we aim to describe novel tumor-associated neoantigens for MM, summarize the data from current MM CAR-T clinical trials, introduce the mechanism of disease resistance/relapse after CAR-T infusion, highlight innovations capable of enhanced efficacy and reduced toxicity, and provide potential directions to optimize manufacturing processes.",
        "DOI": "10.3389/fimmu.2022.1050522",
        "paper_author": "Wang Z.",
        "affiliation_name": "First Affiliated Hospital of Zhengzhou University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60102075"
    },
    {
        "paper_title": "Biomaterializing the advances in uterine tissue engineering",
        "publication": "iScience",
        "citied_by": "9",
        "cover_date": "2022-12-22",
        "Abstract": "The uterus is considered to be a unique wound-healing model and distinguished by the repeated shedding of the endometrium and self-traceless regeneration. Common curettage, cesarean section, and other operations often cause endometrial and myometrial defects and obstetric and gynecological complications, leading to a high demand for uterine repair or partial replacement. However, the structure and function of the uterus are complicated. Functional uterine tissue engineering requires highly specialized biomaterials with a natural extracellular microenvironment. Currently, no biomaterial can fully simulate the structural and biomechanical properties of the uterus. Many efforts have been made to develop highly functional materials and tissue structures that may provide uterine tissue engineering constructs for reducing obstetric and gynecological complications. Continuous efforts will likely facilitate the development of scalable cells and biomaterial technologies for clinical use. This review summarizes the recent applications of biomaterials and tissue engineering in rebuilding a portion of or the entire uterus.",
        "DOI": "10.1016/j.isci.2022.105657",
        "paper_author": "Wei Z.",
        "affiliation_name": "Shenzhen People's Hospital",
        "affiliation_city": "Shenzhen",
        "affiliation_country": "China",
        "affiliation_id": "60073665"
    },
    {
        "paper_title": "Urea is a drop-in nitrogen source alternative to ammonium sulphate in Yarrowia lipolytica",
        "publication": "iScience",
        "citied_by": "8",
        "cover_date": "2022-12-22",
        "Abstract": "Media components, including the nitrogen source, are significant cost factors in cultivation processes. The nitrogen source also influences cell behavior and production performance. Ammonium sulfate is a widely used nitrogen source for microorganisms’ cultivation. Urea is a sustainable and cheap alternative nitrogen source. We investigated the influence of urea as a nitrogen source compared to ammonium sulfate by cultivating phenotypically different Yarrowia lipolytica strains in chemostats under carbon or nitrogen limitation. We found no significant coherent changes in growth and lipid production. RNA sequencing revealed no significant concerted changes in the transcriptome. The genes involved in urea uptake and degradation are not upregulated on a transcriptional level. Our findings support urea usage, indicating that previous metabolic engineering efforts where ammonium sulfate was used are likely translatable to the usage of urea and can ease the way for urea as a cheap and sustainable nitrogen source in more applications.",
        "DOI": "10.1016/j.isci.2022.105703",
        "paper_author": "Konzock O.",
        "affiliation_name": "Chalmers University of Technology",
        "affiliation_city": "Gothenburg",
        "affiliation_country": "Sweden",
        "affiliation_id": "60000990"
    },
    {
        "paper_title": "Genome editing is induced in a binary manner in single human cells",
        "publication": "iScience",
        "citied_by": "2",
        "cover_date": "2022-12-22",
        "Abstract": "Even when precise nucleotide manipulations are intended, the outcomes of genome editing can be diverse, often including random insertions and deletions. The combinations and frequencies of these different outcomes in single cells are critical not only in the generation of genetically modified cell lines but also in the evaluation of the clinical effects of genome editing therapies. However, current methods only analyze cell populations, not single cells. Here, we utilized the Single Particle isolation System (SPiS) for the efficient isolation of single cells to systematically analyze genome editing results in individual human cultured cells. As a result, we discovered that genome editing induction has a binary nature, that is, the target alleles of cells tend to be all edited or not edited at all. This study enhances our understanding of the induction pattern of genome editing and provides a new strategy to analyze genome editing outcomes in single cells.",
        "DOI": "10.1016/j.isci.2022.105619",
        "paper_author": "Takahashi G.",
        "affiliation_name": "Tokyo Metropolitan Institute of Medical Science",
        "affiliation_city": "Tokyo",
        "affiliation_country": "Japan",
        "affiliation_id": "60002783"
    },
    {
        "paper_title": "Sustainable phage-based strategies to control bacterial diseases in agriculture",
        "publication": "Agricultural Biocatalysis: Biological and Chemical Applications",
        "citied_by": "1",
        "cover_date": "2022-12-22",
        "Abstract": "One of the major causes of agricultural crop loss is disease-causing bacteria, which pose a heavy burden to global food supplies. Traditional chemical and antibiotic treatments are common regimens used to curb plant diseases. However, their rampant and uncontrolled use resulted in the evolution and eventual spread of pathogen-resistant strains putting the global food supply at risk of a major collapse. Biological agents such as bacteriophages (or phages) and their enzymes that target and kill these bacteria are now being considered as an eco-friendly alternative to traditional plant disease control strategies. Here, we present several approaches by which phages are tailored and harnessed as effective biocontrol agents. Natural lytic phages, in single or cocktail preparations, and phage-derived enzymes can be utilized as targeted bacterial killers. Several genetic engineering strategies can be employed to increase host range, lytic activities, and stability of phages. Moreover, temperate phages can be modified to deliver lethal genes, cargoes, and sequences that can make bacteria more susceptible to conventional antimicrobial treatments. Lastly, we present current research exploring the applications of phages in controlling bacterial infections affecting selected crops.",
        "DOI": "NA",
        "paper_author": "Ascaño M.A.",
        "affiliation_name": "University of the Philippines Diliman",
        "affiliation_city": "Quezon City",
        "affiliation_country": "Philippines",
        "affiliation_id": "60071491"
    },
    {
        "paper_title": "Domain-selective disruption and compression of phase-separated lipid vesicles by amphiphilic Janus nanoparticles",
        "publication": "iScience",
        "citied_by": "3",
        "cover_date": "2022-12-22",
        "Abstract": "Janus nanoparticles (NPs) with anisotropic surface functionalities enable unique biomedical applications, but their interaction with the biomembranes cannot be predicted by models derived from nanoparticles with uniform surface chemistry. Here, we combine experiments with molecular dynamics (MD) simulations to investigate the interaction of amphiphilic Janus NPs, which are cationic and hydrophobic on opposite sides, with lipid vesicles exhibiting phase-separated microdomains. We demonstrate that Janus NPs preferentially bind to and extract lipids from liquid-disordered domains over a broad range of vesicle compositions. This domain-selective membrane disruption and the inter-particle attractions concurrently generate a compression force on the vesicle, causing the remaining liquid-ordered domains to bulge and the entire vesicle to wrinkle. The NP-induced membrane compression and deformation are critically driven by the surface anisotropy of the Janus NPs. The findings highlight the feasibility of using the surface anisotropy of NPs to tailor their interactions with different biological membranes.",
        "DOI": "10.1016/j.isci.2022.105525",
        "paper_author": "Wiemann J.T.",
        "affiliation_name": "Indiana University Bloomington",
        "affiliation_city": "Bloomington",
        "affiliation_country": "United States",
        "affiliation_id": "60021121"
    },
    {
        "paper_title": "Single-cell transcriptomic mapping of intestinal epithelium that undergoes 3D morphogenesis and mechanodynamic stimulation in a gut-on-a-chip",
        "publication": "iScience",
        "citied_by": "7",
        "cover_date": "2022-12-22",
        "Abstract": "The human gut-on-a-chip has demonstrated in vivo-relevant cellular fidelity and physiological functions of Caco-2 intestinal epithelium compared to its static cultures. However, transcriptomic dynamics that controls the morphogenic and mechanodynamic perturbation of Caco-2 epithelium in a microphysiological culture remain elusive. Single-cell transcriptomic analysis revealed that a gut-on-a-chip culture drives three clusters that illustrate distinct gene expressions and their spatial representation in three-dimensional (3D) epithelial layers. A pseudotemporal trajectory analysis elucidated the evolutionary transition from a homogeneous ancestral genotype in Transwell cultures into heterogeneous transcriptomes in gut-on-a-chip cultures, verified in cell cycle perturbation, cytodifferentiation, and intestinal functions in digestion, transport, and drug metabolism. Furthermore, the inversed transcriptomic signature of oncogenes and tumor-suppressor genes of Caco-2 cells confirmed that gut-on-a-chip cultures induce post-mitotic reprogramming of cancer-associated genes. Our study suggests that a physiological gut-on-a-chip culture induces the transcriptomic perturbation of Caco-2 epithelium to elicit in vivo-relevant morphogenesis and restoration of normal physiological functions.",
        "DOI": "10.1016/j.isci.2022.105521",
        "paper_author": "Shin W.",
        "affiliation_name": "Harvard University",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60009982"
    },
    {
        "paper_title": "Biofabrication of synthetic human liver tissue with advanced programmable functions",
        "publication": "iScience",
        "citied_by": "3",
        "cover_date": "2022-12-22",
        "Abstract": "Advances in cellular engineering, as well as gene, and cell therapy, may be used to produce human tissues with programmable genetically enhanced functions designed to model and/or treat specific diseases. Fabrication of synthetic human liver tissue with these programmable functions has not been described. By generating human iPSCs with target gene expression controlled by a guide RNA-directed CRISPR-Cas9 synergistic-activation-mediator, we produced synthetic human liver tissues with programmable functions. Such iPSCs were guide-RNA-treated to enhance expression of the clinically relevant CYP3A4 and UGT1A1 genes, and after hepatocyte-directed differentiation, cells demonstrated enhanced functions compared to those found in primary human hepatocytes. We then generated human liver tissue with these synthetic human iPSC-derived hepatocytes (iHeps) and other non-parenchymal cells demonstrating advanced programmable functions. Fabrication of synthetic human liver tissue with modifiable functional genetic programs may be a useful tool for drug discovery, investigating biology, and potentially creating bioengineered organs with specialized functions.",
        "DOI": "10.1016/j.isci.2022.105503",
        "paper_author": "Florentino R.M.",
        "affiliation_name": "University of Pittsburgh School of Medicine",
        "affiliation_city": "Pittsburgh",
        "affiliation_country": "United States",
        "affiliation_id": "60001361"
    },
    {
        "paper_title": "Engineering naturally occurring CD7<sup>−</sup> T cells for the immunotherapy of hematological malignancies",
        "publication": "Blood",
        "citied_by": "40",
        "cover_date": "2022-12-22",
        "Abstract": "Chimeric antigen receptor (CAR) T-cell therapy targeting T-cell acute lymphoblastic leukemia (T-ALL) faces limitations such as antigen selection and limited T-cell persistence. CD7 is an attractive antigen for targeting T-ALL, but overlapping expression on healthy T cells leads to fratricide of CD7-CAR T cells, requiring additional genetic modification. We took advantage of naturally occurring CD7− T cells to generate CD7-CAR (CD7-CARCD7−) T cells. CD7-CARCD7− T cells exhibited a predominantly CD4+ memory phenotype and had significant antitumor activity upon chronic antigen exposure in vitro and in xenograft mouse models. Based on these encouraging results, we next explored the utility of CD7− T cells for the immunotherapy of CD19+ hematological malignancies. Direct comparison of nonselected (bulk) CD19-CAR and CD19-CARCD7− T cells revealed that CD19-CARCD7− T cells had enhanced antitumor activity compared with their bulk counterparts in vitro and in vivo. Lastly, to gain insight into the behavior of CD19-CAR T cells with low levels of CD7 gene expression (CD7lo) in humans, we mined single-cell gene and T-cell receptor (TCR) expression data sets from our institutional CD19-CAR T-cell clinical study. CD19-CARCD7lo T cells were present in the initial CD19-CAR T-cell product and could be detected postinfusion. Intriguingly, the only functional CD4+ CD19-CAR T-cell cluster observed postinfusion exhibited CD7lo expression. Additionally, samples from patients responsive to therapy had a higher proportion of CD7lo T cells than nonresponders (NCT03573700). Thus, CARCD7− T cells have favorable biological characteristics and may present a promising T-cell subset for adoptive cell therapy of T-ALL and other hematological malignancies.",
        "DOI": "10.1182/blood.2021015020",
        "paper_author": "Freiwan A.",
        "affiliation_name": "St. Jude Children's Research Hospital",
        "affiliation_city": "Memphis",
        "affiliation_country": "United States",
        "affiliation_id": "60019905"
    },
    {
        "paper_title": "A concentration-descending washing strategy with methanol for the enhancement of protein imaging in biological tissues by MALDI-MS",
        "publication": "Analyst",
        "citied_by": "3",
        "cover_date": "2022-12-21",
        "Abstract": "Matrix-assisted laser desorption/ionization mass spectrometry imaging (MALDI-MSI) is a powerful approach that has been widely used for in situ detection of various endogenous compounds in tissues. However, there are still challenges with in situ analysis of proteins using MALDI-MSI due to the ion suppression effects of small molecules in tissue sections. Therefore, tissue-washing steps are crucial for protein MALDI tissue imaging to remove these interfering molecules. Here, we successfully developed a new method named the concentration-descending washing strategy (CDWS) with methanol (MeOH), i.e., washing of biological tissue with 100%, 95%, and 70% MeOH solutions, for the enhancement of endogenous in situ protein detection and imaging in tissues using MALDI-MS. The method of MeOH-based CDWS (MeOH-CDWS) led to the successful in situ detection of 272 ± 3, 185 ± 4, and 134 ± 2 protein ion signals from rat liver, rat brain, and germinating Chinese-yew seed tissue sections, respectively. By comparison, 161 ± 2, 121 ± 1, and 114 ± 2 protein ions were detected by three commonly used methods, i.e., Carnoy's wash, ethanol (EtOH)-based CAWS (i.e., concentration-ascending washing strategy, 70% EtOH followed by 90% EtOH/9% AcOH), and isopropanol (iPrOH)-based CAWS (70% iPrOH followed by 95% iPrOH), respectively, in rat liver tissue sections, indicating that 68.9 ± 3.1%, 124.8 ± 3.3%, and 138.6 ± 4.4% more protein ion signals could be detected by the use of MeOH-CDWS than the three abovementioned washing strategies. Our results show that the use of MeOH-CDWS improves the performance of MALDI-MSI for in situ protein detection such as the number and intensity of proteins. The use of MeOH-CDWS improves the fixation of proteins and thus reduces the loss of proteins, which significantly reduces protein delocalization in tissue and enhances the performance of MALDI tissue imaging of protein. Thus, the use of MeOH-CDWS improves the quality of protein images in tissue sections through MALDI-MSI and has the potential to be used as standard practice for MALDI tissue imaging of proteins.",
        "DOI": "10.1039/d2an01678h",
        "paper_author": "Xu H.",
        "affiliation_name": "Minzu University of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60032275"
    },
    {
        "paper_title": "Periodic spatial patterning with a single morphogen",
        "publication": "Cell Systems",
        "citied_by": "7",
        "cover_date": "2022-12-21",
        "Abstract": "During multicellular development, periodic spatial patterning systems generate repetitive structures, such as digits, vertebrae, and teeth. Turing patterning provides a foundational paradigm for understanding such systems. The simplest Turing systems are believed to require at least two morphogens to generate periodic patterns. Here, using mathematical modeling, we show that a simpler circuit, including only a single diffusible morphogen, is sufficient to generate long-range, spatially periodic patterns that propagate outward from transient initiating perturbations and remain stable after the perturbation is removed. Furthermore, an additional bistable intracellular feedback or operation on a growing cell lattice can make patterning robust to noise. Together, these results show that a single morphogen can be sufficient for robust spatial pattern formation and should provide a foundation for engineering pattern formation in the emerging field of synthetic developmental biology.",
        "DOI": "10.1016/j.cels.2022.11.001",
        "paper_author": "Wang S.",
        "affiliation_name": "Division of Biology and Biological Engineering",
        "affiliation_city": "Pasadena",
        "affiliation_country": "United States",
        "affiliation_id": "60143895"
    },
    {
        "paper_title": "The sound of silence: Transgene silencing in mammalian cell engineering",
        "publication": "Cell Systems",
        "citied_by": "50",
        "cover_date": "2022-12-21",
        "Abstract": "To elucidate principles operating in native biological systems and to develop novel biotechnologies, synthetic biology aims to build and integrate synthetic gene circuits within native transcriptional networks. The utility of synthetic gene circuits for cell engineering relies on the ability to control the expression of all constituent transgene components. Transgene silencing, defined as the loss of expression over time, persists as an obstacle for engineering primary cells and stem cells with transgenic cargos. In this review, we highlight the challenge that transgene silencing poses to the robust engineering of mammalian cells, outline potential molecular mechanisms of silencing, and present approaches for preventing transgene silencing. We conclude with a perspective identifying future research directions for improving the performance of synthetic gene circuits.",
        "DOI": "10.1016/j.cels.2022.11.005",
        "paper_author": "Cabrera A.",
        "affiliation_name": "George R. Brown School of Engineering and Computing",
        "affiliation_city": "Houston",
        "affiliation_country": "United States",
        "affiliation_id": "60148288"
    },
    {
        "paper_title": "Modular Peroxidase-Based Reporters for Detecting Protease Activity and Protein Interactions with Temporal Gating",
        "publication": "Journal of the American Chemical Society",
        "citied_by": "4",
        "cover_date": "2022-12-21",
        "Abstract": "Enzymatic reporters have been widely applied to study various biological processes because they can amplify signal through enzymatic reactions and provide good sensitivity. However, there is still a need for modular motifs for designing a series of enzymatic reporters. Here, we report a modular peroxidase-based motif, named CLAPon, that features acid-base coil-caged enhanced ascorbate peroxidase (APEX). We demonstrate the modularity of CLAPon by designing a series of reporters for detecting protease activity and protein-protein interactions (PPIs). CLAPon for protease activity showed a 390-fold fluorescent signal increase upon tobacco etch virus protease cleavage. CLAPon for PPI detection (PPI-CLAPon) has two variants, PPI-CLAPon1.0 and 1.1. PPI-CLAPon1.0 showed a signal-to-noise ratio (SNR) of up to 107 for high-affinity PPI pairs and enabled imaging with sub-cellular spatial resolution. However, the more sensitive PPI-CLAPon1.1 is required for detecting low-affinity PPI pairs. PPI-CLAPon1.0 was further engineered to a reporter with light-dependent temporal gating, called LiPPI-CLAPon1.0, which can detect a 3-min calcium-dependent PPI with an SNR of 17. LiPPI-CLAPon enables PPI detection within a specific time window with rapid APEX activation and diverse readout. Lastly, PPI-CLAPon1.0 was designed to have chemical gating, providing more versatility to complement the LiPPI-CLAPon. These CLAPon-based reporter designs can be broadly applied to study various signaling processes that involve protease activity and PPIs and provide a versatile platform to design various genetically encoded reporters.",
        "DOI": "10.1021/jacs.2c08280",
        "paper_author": "Zhou G.",
        "affiliation_name": "University of Michigan, Ann Arbor",
        "affiliation_city": "Ann Arbor",
        "affiliation_country": "United States",
        "affiliation_id": "60025778"
    },
    {
        "paper_title": "Terahertz Circular Dichroism Spectroscopy of Molecular Assemblies and Nanostructures",
        "publication": "Journal of the American Chemical Society",
        "citied_by": "28",
        "cover_date": "2022-12-21",
        "Abstract": "Chemical, physical, biological and materials engineering disciplines use a variety of chiroptical spectroscopies to probe geometrical and optical asymmetry in molecules and particles. Electronic (ECD) and vibrational (VCD) circular dichroism are the most common of these techniques and collectively enable the studies of electronic and vibronic transitions with energies between 0.1 and 5.0 eV. The vibrational states with characteristic energies in the range of 0.001-0.01 eV carry valuable information about concerted intermolecular motions in molecules and crystals involving multiple atoms. These vibronic transitions located in the terahertz (THz) part of the spectrum become increasingly more important for the chemistry, physics, and biology of complex molecules and materials However, the methodology and hardware of THz circular dichroism (TCD) are much less developed than the chiroptical spectroscopies for ultraviolet, visible, near- and mid infrared photons. Here we provide theoretical foundations, practical implementations, comparative assessments, and exemplary applications of TCD spectroscopy. We show that the sign, intensity, and position of TCD peaks are highly sensitive to the three-dimensional structure and long-range organization of molecular crystals, which offer unique capabilities to study (bio) molecules, their crystals, and nanoscale assemblies and apply the novel data processing methodologies. TCD also offers a convenient toolbox to identify new physical phenomena, such as chiral phonons and their propagation in nanostructured matter. We also discuss the major challenges, emerging opportunities and promising research directions, including broad investigation of chiral phonons observed in chiral (nano) crystals and emerging machine learning methodologies for TCD in biological and nanoscale structures. Ubiquity of low-frequency vibrations with rotational components in biomolecular structures, combined with sharpness of peaks in TCD spectra, enables a variety of technological translations.",
        "DOI": "10.1021/jacs.2c04817",
        "paper_author": "Choi W.J.",
        "affiliation_name": "University of Michigan, Ann Arbor",
        "affiliation_city": "Ann Arbor",
        "affiliation_country": "United States",
        "affiliation_id": "60025778"
    },
    {
        "paper_title": "Direct stress computations in arbitrarily shaped thin shells and elliptic bulge tests",
        "publication": "Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences",
        "citied_by": "2",
        "cover_date": "2022-12-21",
        "Abstract": "Most of engineering and biological thin shell structures are characterized by non-axisymmetric and statically indeterminate configurations, which often require the knowledge of the constitutive material model to determine the stress state. In this work, a forward elastostatic method is introduced for the direct stress measurements in elastic homogeneous thin shells of arbitrary shape. The stress distribution is proven to be independent of the material properties for incompressible solids, while in compressible materials it depends only on the Poisson's ratio, which is shown to have a negligible influence on the stress state. Hence, the proposed technique enables the direct assessment of the stress field in statically indeterminate thin shells without a known material model. The shell formulation is implemented using the finite difference method to independently measure the stresses during finite inflation of planar elliptical membranes and from the deformed shapes obtained through digital image correlation during bulge tests on a hyperelastic material, showing very good agreement with finite-element predictions and the applicability of the method to nonlinear elastic materials. Therefore, the procedure can be coupled with imaging techniques for the direct assessment of stresses in thin shell structures and in the identification of material parameters through non-axisymmetric bulge tests.",
        "DOI": "10.1098/rspa.2022.0619",
        "paper_author": "Suleman K.",
        "affiliation_name": "University College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60022148"
    },
    {
        "paper_title": "Engineering Heart Valve Interfaces Using Melt Electrowriting: Biomimetic Design Strategies from Multi-Modal Imaging",
        "publication": "Advanced Healthcare Materials",
        "citied_by": "17",
        "cover_date": "2022-12-21",
        "Abstract": "Interfaces within biological tissues not only connect different regions but also contribute to the overall functionality of the tissue. This is especially true in the case of the aortic heart valve. Here, melt electrowriting (MEW) is used to engineer complex, user-defined, interfaces for heart valve scaffolds. First, a multi-modal imaging investigation into the interfacial regions of the valve reveals differences in collagen orientation, density, and recruitment in previously unexplored regions including the commissure and inter-leaflet triangle. Overlapping, suturing, and continuous printing methods for interfacing MEW scaffolds are then investigated for their morphological, tensile, and flexural properties, demonstrating the superior performance of continuous interfaces. G-codes for MEW scaffolds with complex interfaces are designed and generated using a novel software and graphical user interface. Finally, a singular MEW scaffold for the interfacial region of the aortic heart valve is presented incorporating continuous interfaces, gradient porosities, variable layer numbers across regions, and tailored fiber orientations inspired by the collagen distribution and orientation from the multi-modal imaging study. The scaffold exhibits similar yield strain, hysteresis, and relaxation behavior to porcine heart valves. This work demonstrates the ability of a bioinspired approach for MEW scaffold design to address the functional complexity of biological tissues.",
        "DOI": "10.1002/adhm.202201028",
        "paper_author": "Vernon M.J.",
        "affiliation_name": "The Harry Perkins Institute of Medical Research",
        "affiliation_city": "Perth",
        "affiliation_country": "Australia",
        "affiliation_id": "60005202"
    },
    {
        "paper_title": "Engineering and Validation of a Peptide-Stabilized Poly(lactic- co-glycolic) Acid Nanoparticle for Targeted Delivery of a Vascular Disruptive Agent in Cancer Therapy",
        "publication": "Bioconjugate Chemistry",
        "citied_by": "0",
        "cover_date": "2022-12-21",
        "Abstract": "Developing a biocompatible and biodegradable nanoparticle (NP) carrier that integrates drug-loading capability, active targeting, and imaging modality is extremely challenging. Herein, we report an NP with a core of poly(lactic-co-glycolic) acid (PLGA) chemically modified with the drug combretastatin A4 (CA4), a vascular disrupting agent (VDA) in clinical development for ovarian cancer (OvCA) therapy. The NP is stabilized with a short arginine-glycine-aspartic acid-phenylalanine x3 (RGDFFF) peptide via self-assembly of the peptide on the PLGA surface. Importantly, the use of our RGDFFF coating replaces the commonly used polyethylene glycol (PEG) polymer that itself often induces an unwanted immunogenic response. In addition, the RGD motif of the peptide is well-known to preferentially bind to αvβ3 integrin that is implicated in tumor angiogenesis and is exploited as the NP's targeting component. The NP is enhanced with an optical imaging fluorophore label via chemical modification of the PLGA. The RGDFFF-CA4 NPs are synthesized using a nanoprecipitation method and are ∼75 ± 3.7 nm in diameter, where a peptide coating comprises a 2-3 nm outer layer. The NPs are serum stable for 72 h. In vitro studies using human umbilical cord vascular endothelial cells (HUVEC) confirmed the high uptake and biological activity of the RGDFFF-CA4 NP. NP uptake and viability reduction were demonstrated in OvCA cells grown in culture, and the NPs efficiently accumulated in tumors in a preclinical OvCA mouse model. The RGDFFF NP did not induce an inflammatory response when cultured with immune cells. Finally, the NP was efficiently taken up by patient-derived OvCA cells, suggesting a potential for future clinical applications.",
        "DOI": "10.1021/acs.bioconjchem.2c00418",
        "paper_author": "Dragulska S.A.",
        "affiliation_name": "Brooklyn College",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60023814"
    },
    {
        "paper_title": "3D-Printed Centrifugal Pump Driven by Magnetic Force in Applications for Microfluidics in Biological Analysis",
        "publication": "Advanced Healthcare Materials",
        "citied_by": "7",
        "cover_date": "2022-12-21",
        "Abstract": "In recent years, microfluidic systems have been extensively utilized for biological analysis. The integration of pumps in microfluidic systems requires precise control of liquids and effort-intensive set-ups for multiplexed experiments. In this study, a 3D-printed centrifugal pump driven by magnetic force is presented for microfluidics and biological analysis. The permanent magnets implemented in the centrifugal pump synchronized the rotation of the driving and operating parts. Precise control of the flow rate and a wide range and variety of flow profiles are achieved by controlling the rotational speed of the motor in the driving part. The compact size and contactless driving part allow simple set-ups within commercially available culture dishes and tubes. It is demonstrated that the fabricated 3D-printed centrifugal pump can induce laminar flow in a microfluidic device, perfusion culture of in vitro tissues, and alignment of cells under shear stress. This device has a high potential for applications in microfluidic devices and perfusion culture of cells.",
        "DOI": "10.1002/adhm.202200593",
        "paper_author": "Jo B.",
        "affiliation_name": "University of Tokyo, Graduate School of Information Science and Technology",
        "affiliation_city": "Tokyo",
        "affiliation_country": "Japan",
        "affiliation_id": "60103904"
    },
    {
        "paper_title": "Functional Gene Introduction and Gene Editing of Probiotics",
        "publication": "Chinese Journal of Biochemistry and Molecular Biology",
        "citied_by": "0",
        "cover_date": "2022-12-20",
        "Abstract": "Probiotics have been used in clinical and food fields for many years, and their safety and effectiveness have been widely recognized. The engineered probiotics with functional exogenous genes have entered the stage of clinical application as new drugs or vaccines with the development of molecular biology technology. The engineered probiotics with functional exogenous genes were also a kind of colonized microorganisms in the human intestine for gene expression and controlled release of functional proteins, which have achieved dual effects of probiotics and functional genes. Probiotics can act in combination with functional genes to treat some difficult diseases as living drugs in the clinical research. These genetically modified microorganisms have shown that the mucosal administration of therapeutic molecules was able to induce an immune response mediated by specific serum IgG and mucosal IgA antibodies along with mucosal cell-mediated immune responses. This is a safer oral vaccine route that has attracted widespread attention. Clustered regular interspaced short palindromic repeats (CRISPR) and its related proteins (CRISPR associated, Cas) have promoted the development of probiotics gene editing with their high efficiency and convenience. This review introduces the application of the CRISPR-Cas9 operating system in probiotics. The CRISPR/ Cas9 technology is more simple, efficient and easy for the genome editing of probiotics, such as gene knockout, gene knock-in, gene mutation or gene regulation, especially those that are difficult to manipulate using the traditional genetic operation method. CRISPR/ Cas9, CRISPRa and CRISPRi have great application potentials in genome editing of probiotics for the regulation of gene expression, metabolic engineering and other fields, such as the acquisition of important products related to medicine, food or industry. This review introduces the application of functional gene introduction and gene editing of probiotics in the production of biological products. Finally, the future research directions of the engineered probiotics are proposed.",
        "DOI": "10.13865/j.cnki.cjbmb.2022.03.1608",
        "paper_author": "Xu G.X.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100"
    },
    {
        "paper_title": "Foliar application effect of gibberellic acid on growth, yield components and some qualitative characteristics of linseed (Linium usitatissimum l.)",
        "publication": "Zanco Journal of Pure and Applied Sciences",
        "citied_by": "0",
        "cover_date": "2022-12-20",
        "Abstract": "Understanding the effects of spraying five levels of gibberellic acid (0,125,250 375 and 500) mg L-1 on growth, yield and quality of two flax cultivars (Syrian local and Poland), using factorial randomized complete block design (RCBD) by three replications which was applied as experimental design, at Grdarasha experimental field of the College of Agricultural Engineering Science, Salahaddin University, Erbil, with GPS reading of (Latitude 36. 10116 N and Longitude 44.00925 E), and elevation of 415 meter s above sea level. The statistical analysis indicated to significant effect of both factors and their interactions on most of the studied traits, foliar application of gibberellic acid caused significant increase in seed yield (Mg ha-1), biological yield (Mg ha-1), HI %, oil % and oil yield (Mg ha-1) which were the highest values about (1.69, 7.01, 24.28, 46.10 and 0.78), respectively recorded by applying 500 mg L-1 of GA3. The highest values of all growth and seed yield characteristics; plant height, fruit length, no. of branch, stem width, no. of capsules plant-1, seed yield and HI by (51.48 cm, 31.08 cm,7.30 branches plant-1, 2.58 mm, 29.98 capsules plant-1, 1.34(Mg ha-1) and 20.61%) respectively were obtained from Poland cultivar. The highest values (22.16, 18.63, 0.44, 5.58 and 7.25) % for oleic, linoleic, linolenic, palmitic and stearic acid respectively which were recorded from the interaction treatment of GA3 (375 mg L-1) x Syrian Cultivar. Strong positive correlation was found between seed yield to each of (plant height (cm), fruiting stem (cm), number of branch plant-1, stem width (mm), number of capsule plant-1, number seed capsule-1, seed index (g), harvest index %, oil yield (Mg ha-1) with the correlation coefficient(r) values of (0.87**,0.86**,0.89**.0.81**,0.79**,0.77**,0.98**,0.96**and 0.99**.",
        "DOI": "10.21271/ZJPAS.34.6.8",
        "paper_author": "Mahmood B.J.",
        "affiliation_name": "Salahaddin University-Erbil",
        "affiliation_city": "Erbil",
        "affiliation_country": "Iraq",
        "affiliation_id": "60071161"
    },
    {
        "paper_title": "Biosynthesis and Molecular Regulation of Microbial Lipopeptides",
        "publication": "Chinese Journal of Biochemistry and Molecular Biology",
        "citied_by": "1",
        "cover_date": "2022-12-20",
        "Abstract": "Microbial lipopeptides have a variety of biological activities, such as inhibiting the growth of fungi and bacteria, antiviral and anti-tumor activities, and have great application potential in agricultural biological control, clinical medicine, environmental management and other fields. However, low yield has always been the bottleneck problem affecting its popularization and application. Deeper understanding the key factors and regulation strategies of lipopeptide synthesis is essential to improve its yield and purity. In this paper, the structures, functions and application prospects of three lipopeptide families containing surfactin, fengycin and iturin are sketched, and the domains and functions of NRPS and NRPS-PKS synthesis systems are introduced. Furthermore, the module assembly and enzyme catalysis activity in three stages of the process of lipopeptide biosynthesis including the synthesis of side-chain fatty acids, the activation of fatty acids and their connection to amino acids, the extension and cyclization of peptide chains, and the composition of open reading frames of biosynthesis operons of three major lipopeptide families are expounded; the effects of various genetic manipulations on the production of lipopeptide, such as transformation or deletion of key genes, site-directed mutation, module replacement, strong promoter replacement, and modification of precursor pathways, as well as the regulation of the expression of lipopeptide synthesis gene by global regulatory factors such as quorum sensing peptide pheromone and sigma factor, are summarized. Using conjoint analysis of multiomics to explore global molecular regulation mechanism of lipopeptide synthesis and strengthening the research on structure domain protein interactions and molecular dynamics are theoretical basis for enhancing lipopeptide yield and purity and creating novel lipopeptide. Strategies using gene assembly and editing methods of synthetic biology and metabolic engineering technology to improve the targeting of lipopeptide production and mining new lipopeptide are also summarized, which may provide scientific reference for accelerating the process of production and application of lipopeptide.",
        "DOI": "10.13865/j.cnki.cjbmb.2022.05.1571",
        "paper_author": "Liu W.",
        "affiliation_name": "Heilongjiang University",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "60033495"
    },
    {
        "paper_title": "Advances and perspectives on perylenequinone biosynthesis",
        "publication": "Frontiers in Microbiology",
        "citied_by": "11",
        "cover_date": "2022-12-20",
        "Abstract": "Under illumination, the fungal secondary metabolites, perylenequinones (PQs) react with molecular oxygen to generate reactive oxygen species (ROS), which, in excess can damage cellular macromolecules and trigger apoptosis. Based on this property, PQs have been widely used as photosensitizers and applied in pharmaceuticals, which has stimulated research into the discovery of new PQs and the elucidation of their biosynthetic pathways. The PQs-associated literature covering from April 1967 to September 2022 is reviewed in three sections: (1) the sources, structural diversity, and biological activities of microbial PQs; (2) elucidation of PQ biosynthetic pathways, associated genes, and mechanisms of regulation; and (3) advances in pathway engineering and future potential strategies to modify cellular metabolism and improve PQ production.",
        "DOI": "10.3389/fmicb.2022.1070110",
        "paper_author": "Deng H.",
        "affiliation_name": "Shenzhen Institute of Advanced Technology",
        "affiliation_city": "Shenzhen",
        "affiliation_country": "China",
        "affiliation_id": "60102083"
    },
    {
        "paper_title": "Metabolic glycoengineering - exploring glycosylation with bioorthogonal chemistry",
        "publication": "Chemical Society Reviews",
        "citied_by": "48",
        "cover_date": "2022-12-20",
        "Abstract": "Glycans are involved in numerous biological recognition events. Being secondary gene products, their labeling by genetic methods - comparable to GFP labeling of proteins - is not possible. To overcome this limitation, metabolic glycoengineering (MGE, also known as metabolic oligosaccharide engineering, MOE) has been developed. In this approach, cells or organisms are treated with synthetic carbohydrate derivatives that are modified with a chemical reporter group. In the cytosol, the compounds are metabolized and incorporated into newly synthesized glycoconjugates. Subsequently, the reporter groups can be further derivatized in a bioorthogonal ligation reaction. In this way, glycans can be visualized or isolated. Furthermore, diverse targeting strategies have been developed to direct drugs, nanoparticles, or whole cells to a desired location. This review summarizes research in the field of MGE carried out in recent years. After an introduction to the bioorthogonal ligation reactions that have been used in in connection with MGE, an overview on carbohydrate derivatives for MGE is given. The last part of the review focuses on the many applications of MGE starting from mammalian cells to experiments with animals and other organisms.",
        "DOI": "10.1039/d2cs00764a",
        "paper_author": "Kufleitner M.",
        "affiliation_name": "Universität Konstanz",
        "affiliation_city": "Konstanz",
        "affiliation_country": "Germany",
        "affiliation_id": "60025525"
    },
    {
        "paper_title": "Anion Effects on the Supramolecular Self-Assembly of Cationic Phenylalanine Derivatives",
        "publication": "Langmuir",
        "citied_by": "10",
        "cover_date": "2022-12-20",
        "Abstract": "Supramolecular hydrogels have emerged as a class of promising biomaterials for applications such as drug delivery and tissue engineering. Self-assembling peptides have been well studied for such applications, but low molecular weight (LMW) amino acid-derived gelators have attracted interest as low-cost alternatives with similar emergent properties. Fluorenylmethyloxycarbonyl-phenylalanine (Fmoc-Phe) is one such privileged motif often chosen due to its inherent self-assembly potential. Previously, we developed cationic Fmoc-Phe-DAP gelators that assemble into hydrogel networks in aqueous NaCl solutions of sufficient ionic strength. The chloride anions in these solutions screen the cationic charge of the gelators to enable self-assembly to occur. Herein, we report the effects of varying the anions of sodium salts on the gelation potential, nanoscale morphology, and hydrogel viscoelastic properties of Fmoc-Phe-DAP and two of its fluorinated derivatives, Fmoc-3F-Phe-DAP and Fmoc-F5-Phe-DAP. It was observed that both the anion identity and gelator structure had a significant impact on the self-assembly and gelation properties of these derivatives. Changing the anion identity resulted in significant polymorphism of the nanoscale morphology of the assembled states that was dependent on the chemical structure of the gelator. The emergent viscoelastic character of the hydrogel networks was also found to be reliant on the anion identity and gelator structure. These results demonstrate the complex interplay between the gelator and environment that have a profound and often unpredictable impact on both self-assembly properties and emergent viscoelasticity in supramolecular hydrogels formed by LMW compounds. This work also illustrates the current lack of understanding that limits the rational design of potential biomaterials that will be in contact with complex biological fluids and provides motivation for additional research to correlate the chemical structure of LMW gelators with the structure and emergent properties of the resulting supramolecular assemblies as a function of environment.",
        "DOI": "10.1021/acs.langmuir.2c01394",
        "paper_author": "Abraham B.L.",
        "affiliation_name": "University of Rochester",
        "affiliation_city": "Rochester",
        "affiliation_country": "United States",
        "affiliation_id": "60027165"
    },
    {
        "paper_title": "Preface: International Conference on Biological Engineering and Medical Science (ICBioMed)",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2022-12-19",
        "Abstract": "NA",
        "DOI": "10.1063/12.0012966",
        "paper_author": "Li L.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA"
    },
    {
        "paper_title": "Proceedings of the 2021 International Conference on Biological Engineering and Medical Science",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2022-12-19",
        "Abstract": "The proceedings contain 35 papers. The topics discussed include: tumor purity predicted by statistical methods; prognosis and risk factors of advanced breast cancer; Parkinson’s disease: pathology and treatment; application of rehabilitation techniques against pediatric cerebral palsy; advances in molecular mechanism of horticultural crops response to adversity stress; correlation analysis between expression levels of BRCA1 and SQLE in cross-subtype diversity of breast cancer and prognosis; analysis of the COVID-19 virus: conformation, treatments, and vaccine production; the understanding of heartworm disease: diagnosis and treatments; the release mechanism of BDNF: synthesis, processing, sorting and release; ginger extract compounds in treatment of ischemic stroke: mechanisms and applications; and correlation analysis of expression levels of NUSAP1 and NEK2 with different subtypes of breast cancer prognosis.",
        "DOI": "NA",
        "paper_author": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA"
    },
    {
        "paper_title": "Development of GelMA ink for multi-scale biological 3D printing",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2022-12-19",
        "Abstract": "More and more advanced technologies are applied to improve the therapy quality with the unceasingof the technical progress. Bio-printing has become one of the most microfabrication methods which could be used in the fields of craniofacial transplantation, crown and tooth repair, prosthetic devices, medical equipment, organ printing, bold tissue engineering scaffold and so on. However, most of the existing bio-ink materials could have the disadvantages of poor conductivity. To solve this problem, several ways of optimizing and improving the bio-ink formula will be proposed, including electric field assisted bioprinting of cell-loaded GelMA microspheres, nano-clay-assisted 3D printing of complex bio hydrogel scaffolds, biological 3D printing with fiber microspheres, using new materials such as MC/Gelma with high shape integrity and applying HGSM in bioprinting to improve the overall properties of the product. And in this paper, GelMA ink is used as the basic material for subsequent research so that the problem of how to construct highly bioactive tissue structure to realize printing structure functionalization can be solved to some extent.",
        "DOI": "10.1063/5.0123152",
        "paper_author": "Yang S.",
        "affiliation_name": "University of Melbourne",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60026553"
    },
    {
        "paper_title": "An Enzymatically Gated Catalytic Hairpin Assembly Delivered by Lipid Nanoparticles for the Tumor-Specific Activation of Signal Amplification in miRNA Imaging",
        "publication": "Angewandte Chemie - International Edition",
        "citied_by": "62",
        "cover_date": "2022-12-19",
        "Abstract": "MicroRNA (miRNA) imaging in disease sites is vital to elucidate their role in cancer progression. However, limited tumor specificity remains a major barrier for traditional amplification approaches due to associated background signal leakage. Here, we report a generalizable approach via the combination of enzymatically triggered catalytic hairpin assembly with lipid nanoparticles (LNPs)-based delivery strategy for tumor-specific activation of signal amplification and therefore sensitive miRNA imaging. The signal amplification is established via engineering of traditional catalytic hairpin assembly with enzymatically activated motifs to achieve triggable miRNA imaging in cancer cells. Furthermore, by the introduction of LNPs to combat biological barriers, we demonstrate that the system enables amplified miRNA imaging in vivo with reduced off-tumor signal, leading to enhanced tumor-to-background contrast compared with traditional methods. This approach that relies on specific triggers and controlled delivery to distinguish miRNA in cancer cells from normal cells should be useful in tumor diagnosis.",
        "DOI": "10.1002/anie.202214230",
        "paper_author": "Liu Q.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835"
    },
    {
        "paper_title": "Decellularized Spinach Biomaterials Support Physiologically Relevant Mechanical Cyclic Strain and Prompt a Stretch-Induced Cellular Response",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "5",
        "cover_date": "2022-12-19",
        "Abstract": "Recently, decellularized plant biomaterials have been explored for their use as tissue engineered substitutes. Herein, we expanded upon the investigation of the mechanical properties of these materials to explore their elasticity as many anatomical areas of the body require biomechanical dynamism. We first constructed a device to secure the scaffold and induce a strain within the physiological range of the normal human adult lung during breathing (12-20 movements/min; 10-20% elongation). Results showed that decellularized spinach leaves can support cyclic strain for 24 h and displayed heterogeneous local strain values (7.76-15.88%) as well as a Poisson's ratio (0.12) similar to that of mammalian lungs (10.67-19.67%; 0.01), as opposed to an incompressible homogeneous standard polymer (such as PDMS (10.85-12.71%; 0.4)). Imaging and mechanical testing showed that the vegetal scaffold exhibited strain hardening but maintained its structural architecture and water retention capacity, suggesting an unaltered porosity. Interestingly, we also showed that cells seeded on the scaffold can also sense the mechanical strain as demonstrated by a nuclear reorientation perpendicular to strain direction (63.3° compared to 41.2° for nonstretched cells), a nuclear location of YAP and increased expression of YAP target genes, a high cytoplasmic calcium level, and an elevated expression level of collagen genes (COL1A1, COL3A1, COL4A1, and COL6A) with an increased collagen secretion at the protein level. Taken together, these data demonstrated that decellularized plant leaf tissues have an inherent elastic property similar to that found in the mammalian system to which cells can sense and respond. copy; 2022 American Chemical Society.",
        "DOI": "10.1021/acsabm.2c00721",
        "paper_author": "Harris A.F.",
        "affiliation_name": "University of Arizona College of Medicine – Phoenix",
        "affiliation_city": "Phoenix",
        "affiliation_country": "United States",
        "affiliation_id": "60007834"
    },
    {
        "paper_title": "Biohydrogen production: An outlook on methods, constraints, economic analysis and future prospect",
        "publication": "International Journal of Hydrogen Energy",
        "citied_by": "38",
        "cover_date": "2022-12-19",
        "Abstract": "Utilization of hydrogen as fuel lights into various technological, economic and ecological challenges. High production cost and low yield are main drawbacks of commercial hydrogen production methods. Hydrogen production by biological methods helps to overcome these issues owing to its merit such as cost-effective, non-pollutant, recyclability and efficiency in energy conversion. Research has been conducted in utilizing cyanobacteria and algal species for producing biohydrogen utilizing solar light and other sources. Developments have been made for improving biohydrogen productivity through genetic and metabolic engineering. This review outlines the importance of biohydrogen and the constraints in producing biohydrogen in detail. Biohydrogen production can be facilitated using photolysis, fermentation and electrochemical processes. Bioreactors can be used effectively with specific designs and configuration for increasing productivity. The challenges faced during biological production and methods to overcome those demerits are also included for bringing the uncharted principles for producing biohydrogen in an efficient method.",
        "DOI": "10.1016/j.ijhydene.2022.07.082",
        "paper_author": "Yaashikaa P.R.",
        "affiliation_name": "Saveetha School of Engineering",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60109336"
    },
    {
        "paper_title": "Biological characteristics of sheep peripheral blood mesenchymal stem cell",
        "publication": "Beijing da xue xue bao. Yi xue ban = Journal of Peking University. Health sciences",
        "citied_by": "0",
        "cover_date": "2022-12-18",
        "Abstract": "OBJECTIVE: To obtain eripheral blood mesenchymal stem cells (PBMSCs) from sheep and rabbits by continuous mobilization of granulocyte colony-stimulating factor (G-CSF), and by comparing the success rates, cell yields and biological characteristics of the two sources of PBMSCs, and to provide the experimental basis for the preclinical study of PBMSCs transplantation to repair articular cartilage injury and cartilage tissue engineering. METHODS: Through morphological characteristics, flow cytometry analysis of its surface markers, and induction of trilineage differentiation of the two cells in vitro (ie: adipogenic differentiation, osteogenic differentiation, chondrogenic differentiation), the obtained cells were finally confirmed to be PBMSCs. The colony-forming units (CFUs) and the acquisition success rates of the two PBMSCs were counted and compared, and the production of the second generation of the two PBMSCs was counted and compared by hemocytometer, and the cell counting kit-8 was used to detect the doubling time of the two PBMSCs, and the results of trilineage differentiation were quantitatively analyzed by image processing. RESULTS: Microscopically, the PBMSCs of fusiform sheep and rabbits were arranged in fish group, and the second generation of sheep and rabbit PBMSCs expressed CD44 and CD90, but not CD34 and CD45. The induction of trilineage differentiation of the two cells in vitro were successful. The CFUs of primary sheep and rabbits PBMSCs were: 7.27±1.56, 5.73±1.62, and the success rate of acquisition of sheep and rabbits PBMSCs were 78.57% and 36.67%. The number of the second-generation sheep and rabbits PBMSCs that obtained per milliliter of peripheral blood were: 29 582±2 138, 26 732±2 286, and the cell doubling times (h) of the third-generation sheep and rabbits PBMSCs were: 22.32±0.28, 33.21±0.64, the cell doubling time (h) of the fourth generation sheep and rabbits PBMSCs were: 23.62±0.56, 35.30±0.38, and the quantitative lipid ratio of sheep and rabbit PBMSCs were: 7.77%±3.81%, 17.05%±1.52%, sheep and rabbit PBMSCs chondroglobus acid mucopolysaccharide positive ratios were: 11.67%±0.53%, 8.14%±0.57%. There were statistical differences among the above groups (P < 0.05). CONCLUSION: The continuous mobilization of G-CSF to obtain sheep PBMSCs is more efficient. Sheep PBMSCs have more abundant yield and stronger proliferation ability.Sheep PBMSCs can produce more acidic mucopolysaccharides and have lower adipogenic abi-lity under appropriate conditions. Sheep PBMSCs have good research prospects in repair of articular cartilage injury with autologous stem cell transplantation and preclinical animal in vivo experiment of cartilage tissue engineering.This experiment provides further experimental basis for this kind of research.",
        "DOI": "10.19723/j.issn.1671-167X.2022.06.015",
        "paper_author": "Han C.",
        "affiliation_name": "Weifang Medical University",
        "affiliation_city": "Weifang",
        "affiliation_country": "China",
        "affiliation_id": "60023230"
    },
    {
        "paper_title": "The Application of Computer Virtual Simulation Technology in General Biological Experiment Teaching",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2022-12-16",
        "Abstract": "The application of computer technology to higher education is a revolution in the educational model of the 21st century. Using computer virtual simulation technology to build a virtual platform, Through the application in general biology experimental teaching, the integration of information technology and biology is realized, which improves students' experimental interest, hands-on ability, independent problem analysis and problem-solving ability, and promotes students' all-round development. Deepen the reform of experimental teaching and significantly improve the efficiency and quality of experimental teaching.",
        "DOI": "10.1145/3582580.3582599",
        "paper_author": "Li H.",
        "affiliation_name": "Suzhou University",
        "affiliation_city": "Suzhou",
        "affiliation_country": "China",
        "affiliation_id": "123505405"
    },
    {
        "paper_title": "Integrating mechanical sensor readouts into organ-on-a-chip platforms",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "13",
        "cover_date": "2022-12-16",
        "Abstract": "Organs-on-a-chip have emerged as next-generation tissue engineered models to accurately capture realistic human tissue behaviour, thereby addressing many of the challenges associated with using animal models in research. Mechanical features of the culture environment have emerged as being critically important in designing organs-on-a-chip, as they play important roles in both stimulating realistic tissue formation and function, as well as capturing integrative elements of homeostasis, tissue function, and tissue degeneration in response to external insult and injury. Despite the demonstrated impact of incorporating mechanical cues in these models, strategies to measure these mechanical tissue features in microfluidically-compatible formats directly on-chip are relatively limited. In this review, we first describe general microfluidically-compatible Organs-on-a-chip sensing strategies, and categorize these advances based on the specific advantages of incorporating them on-chip. We then consider foundational and recent advances in mechanical analysis techniques spanning cellular to tissue length scales; and discuss their integration into Organs-on-a-chips for more effective drug screening, disease modeling, and characterization of biological dynamics.",
        "DOI": "10.3389/fbioe.2022.1060895",
        "paper_author": "Morales I.A.",
        "affiliation_name": "School of Medicine",
        "affiliation_city": "Montreal",
        "affiliation_country": "Canada",
        "affiliation_id": "60191838"
    },
    {
        "paper_title": "Multidimensional control of therapeutic human cell function with synthetic gene circuits",
        "publication": "Science",
        "citied_by": "67",
        "cover_date": "2022-12-16",
        "Abstract": "Synthetic gene circuits that precisely control human cell function could expand the capabilities of gene- and cell-based therapies. However, platforms for developing circuits in primary human cells that drive robust functional changes in vivo and have compositions suitable for clinical use are lacking. Here, we developed synthetic zinc finger transcription regulators (synZiFTRs), which are compact and based largely on human-derived proteins. As a proof of principle, we engineered gene switches and circuits that allow precise, user-defined control over therapeutically relevant genes in primary T cells using orthogonal, US Food and Drug Administration–approved small-molecule inducers. Our circuits can instruct T cells to sequentially activate multiple cellular programs such as proliferation and antitumor activity to drive synergistic therapeutic responses. This platform should accelerate the development and clinical translation of synthetic gene circuits in diverse human cell types and contexts.",
        "DOI": "10.1126/science.ade0156",
        "paper_author": "Li H.S.",
        "affiliation_name": "Boston University",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60019674"
    },
    {
        "paper_title": "Poly-γ-Glutamic Acid Production by Engineering a DegU Quorum-Sensing Circuit in Bacillus subtilis",
        "publication": "ACS Synthetic Biology",
        "citied_by": "14",
        "cover_date": "2022-12-16",
        "Abstract": "As a natural biological macromolecule, γ-polyglutamic acid (γ-PGA) plays a significant role in medicine, food, and cosmetic industries owing to its unique properties of biocompatibility, biodegradability, water solubility, and viscosity. Although many strategies have been adopted to increase the yield of γ-PGA in Bacillus subtilis, the effectiveness of these common approaches is not high because the strong viscosity affects cell growth. However, dynamic regulation based on quorum sensing (QS) has been extensively applied as a fundamental tool for fine-tuning gene expression in reaction to changes in cell density without adding expensive inducers. A modular PhrQ-RapQ-DegU QS system is developed based on promoter PD4, which is upregulated by phosphorylated DegU (DegU-P). In this study, first, we analyzed the DegU-based gene expression regulation system in B. subtilis 168. We constructed a promoter library of different abilities, selected suitable promoters from the library, and performed mutation screening on the selected promoters and degU region. Furthermore, we constructed a PhrQ-RapQ-DegU QS system to dynamically control the synthesis of γ-PGA in BS168. Cell growth and efficient synthesis of the target product can be dynamically balanced by the QS system. Our dynamic adjustment approach increased the yield of γ-PGA to 6.53-fold of that by static regulation in a 3 L bioreactor, which verified the effectiveness of this strategy. In summary, the PhrQ-RapQ-DegU QS system has been successfully integrated with biocatalytic functions to achieve dynamic metabolic pathway control in BS168, which can be stretched to a large number of microorganisms to fine-tune gene expression and enhance the production of metabolites.",
        "DOI": "10.1021/acssynbio.2c00464",
        "paper_author": "Hu L.X.",
        "affiliation_name": "Anhui Polytechnic University",
        "affiliation_city": "Wuhu",
        "affiliation_country": "China",
        "affiliation_id": "60083914"
    },
    {
        "paper_title": "Ribosome Stalling of N-Linked Glycoproteins in Cell-Free Extracts",
        "publication": "ACS Synthetic Biology",
        "citied_by": "3",
        "cover_date": "2022-12-16",
        "Abstract": "Ribosome display is a powerful in vitro method for selection and directed evolution of proteins expressed from combinatorial libraries. However, the ability to display proteins with complex post-translational modifications such as glycosylation is limited. To address this gap, we developed a set of complementary methods for producing stalled ribosome complexes that displayed asparagine-linked (N-linked) glycoproteins in conformations amenable to downstream functional and glycostructural interrogation. The ability to generate glycosylated ribosome-nascent chain (glycoRNC) complexes was enabled by integrating SecM-mediated translation arrest with methods for cell-free N-glycoprotein synthesis. This integration enabled a first-in-kind method for ribosome stalling of target proteins modified efficiently and site-specifically with different N-glycan structures. Moreover, the observation that encoding mRNAs remained stably attached to ribosomes provides evidence of a genotype-glycophenotype link between an arrested glycoprotein and its RNA message. We anticipate that our method will enable selection and evolution of N-glycoproteins with advantageous biological and biophysical properties.",
        "DOI": "10.1021/acssynbio.2c00311",
        "paper_author": "Chung S.S.",
        "affiliation_name": "Cornell University",
        "affiliation_city": "Ithaca",
        "affiliation_country": "United States",
        "affiliation_id": "60007776"
    },
    {
        "paper_title": "Assembly of plant virus agroinfectious clones using biological material or DNA synthesis",
        "publication": "STAR Protocols",
        "citied_by": "5",
        "cover_date": "2022-12-16",
        "Abstract": "Infectious clone technology is universally applied for biological characterization and engineering of viruses. This protocol describes procedures that implement synthetic biology advances for streamlined assembly of virus infectious clones. Here, I detail homology-based cloning using biological material, as well as SynViP assembly using type IIS restriction enzymes and chemically synthesized DNA fragments. The assembled virus clones are based on compact T-DNA binary vectors of the pLX series and are delivered to host plants by Agrobacterium-mediated inoculation. For complete details on the use and execution of this protocol, please refer to Pasin et al. (2017, 2018) and Pasin (2021).",
        "DOI": "10.1016/j.xpro.2022.101716",
        "paper_author": "Pasin F.",
        "affiliation_name": "Consejo Superior de Investigaciones Científicas",
        "affiliation_city": "Madrid",
        "affiliation_country": "Spain",
        "affiliation_id": "60006754"
    },
    {
        "paper_title": "pH-Responsive Self-Assembled Compartments as Tuneable Model Protocellular Membrane Systems**",
        "publication": "ChemBioChem",
        "citied_by": "1",
        "cover_date": "2022-12-16",
        "Abstract": "Prebiotically plausible single-chain amphiphiles are enticing as model protocellular compartments to study the emergence of cellular life, owing to their self-assembling properties. Here, we investigated the self-assembly behaviour of mono-N-dodecyl phosphate (DDP) and mixed systems of DDP with 1-dodecanol (DDOH) at varying pH conditions. Membranes composed of DDP showed pH-responsive vesicle formation in a wide range of pH with a low critical bilayer concentration (CBC). Further, the addition of DDOH to DDP membrane system enhanced vesicle formation and stability in alkaline pH regimes. We also compared the high-temperature behaviour of DDP and DDP:DDOH membranes with conventional fatty acid membranes. Both, DDP and DDP:DDOH mixed membranes possess packing that is similar to decanoic acid membrane. However, the micropolarity of these systems is similar to phospholipid membranes. Finally, the pH-dependent modulation of different phospholipid membranes doped with DDP was also demonstrated to engineer tuneable membranes with potential translational implications.",
        "DOI": "10.1002/cbic.202200371",
        "paper_author": "Sarkar S.",
        "affiliation_name": "Indian Institute of Science Education and Research Pune",
        "affiliation_city": "Pune",
        "affiliation_country": "India",
        "affiliation_id": "60103628"
    },
    {
        "paper_title": "The pupal moulting fluid has evolved social functions in ants",
        "publication": "Nature",
        "citied_by": "19",
        "cover_date": "2022-12-15",
        "Abstract": "Insect societies are tightly integrated, complex biological systems in which group-level properties arise from the interactions between individuals1–4. However, these interactions have not been studied systematically and therefore remain incompletely known. Here, using a reverse engineering approach, we reveal that unlike solitary insects, ant pupae extrude a secretion derived from the moulting fluid that is rich in nutrients, hormones and neuroactive substances. This secretion elicits parental care behaviour and is rapidly removed and consumed by the adults. This behaviour is crucial for pupal survival; if the secretion is not removed, pupae develop fungal infections and die. Analogous to mammalian milk, the secretion is also an important source of early larval nutrition, and young larvae exhibit stunted growth and decreased survival without access to the fluid. We show that this derived social function of the moulting fluid generalizes across the ants. This secretion thus forms the basis of a central and hitherto overlooked interaction network in ant societies, and constitutes a rare example of how a conserved developmental process can be co-opted to provide the mechanistic basis of social interactions. These results implicate moulting fluids in having a major role in the evolution of ant eusociality.",
        "DOI": "10.1038/s41586-022-05480-9",
        "paper_author": "Snir O.",
        "affiliation_name": "Rockefeller University",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60026827"
    },
    {
        "paper_title": "Recombinant protein condensation inside E. coli enables the development of building blocks for bioinspired materials engineering – Biomimetic spider silk protein as a case study",
        "publication": "Materials Today Bio",
        "citied_by": "11",
        "cover_date": "2022-12-15",
        "Abstract": "Recombinant expression of proteins destined to form biological materials often results in poor production yields or loss of their function due to premature aggregation. Recently, liquid-liquid phase separation has been proposed as a mechanism to control protein solubility during expression and accumulation in the cytoplasm. Here, we investigate this process in vivo during the recombinant overexpression of the mimetic spider silk mini-spidroin NT2RepCT in Escherichia coli. The protein forms intracellular liquid-like condensates that shift to a solid-like state triggered by a decrease in their microenvironmental pH. These features are also maintained in the purified sample in vitro both in the presence of a molecular crowding agent mimicking the bacterial intracellular environment, and during a biomimetic extrusion process leading to fiber formation. Overall, we demonstrate that characterization of protein condensates inside E. coli could be used as a basis for selecting proteins for both materials applications and their fundamental structure-function studies.",
        "DOI": "10.1016/j.mtbio.2022.100492",
        "paper_author": "Gabryelczyk B.",
        "affiliation_name": "Aalto University",
        "affiliation_city": "Espoo",
        "affiliation_country": "Finland",
        "affiliation_id": "60103653"
    },
    {
        "paper_title": "Dual-catalytic CuTPP/TiO<inf>2</inf> nanoparticles for surface catalysis engineering of cardiovascular materials",
        "publication": "Materials Today Bio",
        "citied_by": "6",
        "cover_date": "2022-12-15",
        "Abstract": "Endowing materials with catalytic activities analogous to those of the natural endothelium to thus enhance their biological performance has become an option for constructing advanced blood-contact materials. The electron transfer between Cu2+ and Cu+ in the porphyrin center can catalyze the reaction of GSH and GSNO to generate NO, and this electron transfer can also catalyze the decomposition of ROS. Based on this, we created a dual-catalytic surface possessing NO-generating and ROS-scavenging activities to better mimic the versatile catalytic abilities of the endothelium. Copper tetraphenylporphyrin/titanium dioxide nanoparticles (CuTPP/TiO2-NPs) exhibiting excellent NO-generating and ROS-scavenging activities were synthesized and immobilized on the material surface to form a dual-catalytic film (CuTPP/TiO2-film) with the help of the catechol chemistry technique. Unlike most single catalytic surfaces, the dual-catalytic CuTPP/TiO2-film effectively regulated the microenvironment surrounding the implanted device by releasing NO signaling molecules and scavenging harmful ROS. This dual-catalytic film exhibited excellent biosafety and biocompatibility with anti-thrombosis, vascular wall cells (ECs and SMCs) modulation, and anti-inflammatory properties. We envision that this dual-catalytic endothelial bionic strategy may provide a promising solution to the clinical problems plaguing blood-contact devices and provide a novel basis for the further development of surface catalytic-engineered biomaterials.",
        "DOI": "10.1016/j.mtbio.2022.100494",
        "paper_author": "Liu L.",
        "affiliation_name": "Southwest Jiaotong University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60010421"
    },
    {
        "paper_title": "Decellularized tilapia fish skin: A novel candidate for tendon tissue engineering",
        "publication": "Materials Today Bio",
        "citied_by": "18",
        "cover_date": "2022-12-15",
        "Abstract": "The poor regenerative ability of injured tendon tissues remains a clinical challenge. However, decellularized extracellular matrix (ECM) combined with stem cells shows promise. In contrast to bovine and porcine ECM, marine-derived decellularized ECM has several advantages; it is easily obtained, poses less biological risk, and is not contraindicated on religious grounds. This study successfully fabricated decellularized tilapia fish skin (DTFS) with copious preserved collagen fibers and natural pore structures. The outer layer is smooth and dense, while the inner layer has a soft structure with a rough surface. After crosslinking with 1-ethyl-3-(3-dimethylaminopropyl)-carbodiimide (EDC) and N-hydroxysuccinimide (NHS), crosslinked DTFS (C-DTFS) showed improved mechanics in dry and wet conditions. In vitro, the leach liquor of crosslinked DTFS showed no cytotoxicity and promoted migration and tenonic differentiation of tendon-derived stem cells (TDSCs). Meanwhile, TDSCs seeded in the inner surface of DTFS maintained viability, differentiated, and exhibited spreading. Furthermore, cell-seeded scaffolds guided the regeneration of tendon tissue in a rat Achilles tendon defect model. Our results suggest that DTFS combined with TDSCs is a novel and promising therapeutic option for tendon tissue engineering.",
        "DOI": "10.1016/j.mtbio.2022.100488",
        "paper_author": "Liu Z.",
        "affiliation_name": "Shanghai Sixth People's Hospital",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60122016"
    },
    {
        "paper_title": "An Electrochemical-Electret Coupled Organic Synapse with Single-Polarity Driven Reversible Facilitation-to-Depression Switching",
        "publication": "Advanced Materials",
        "citied_by": "10",
        "cover_date": "2022-12-15",
        "Abstract": "Neuromorphic engineering and artificial intelligence demands hardware elements that emulates synapse algorithms. During the last decade electrolyte-gated organic conjugated materials have been explored as a platform for artificial synapses for neuromorphic computing. Unlike biological synapses, in current devices the synaptic facilitation and depression are triggered by voltages with opposite polarity. To enhance the reliability and simplify the operation of the synapse without lowering its sophisticated functionality, here, an electrochemical-electret coupled organic synapse (EECS) possessing a reversible facilitation-to-depression switch, is devised. Electret charging counterbalances channel conductance changes due to electrochemical doping, inducing depression without inverting the gate polarity. Overall, EECS functions as a threshold-controlled synaptic switch ruled by its amplitude-dependent, dual-modal operation, which can well emulate information storage and erase as in real synapses. By varying the energy level offset between the channel material and the electret, the EECS's transition threshold can be adjusted for specific applications, e.g., imparting additional light responsiveness to the device operation. The novel device architecture represents a major step forward in the development of artificial organic synapses with increased functional complexity and it opens new perspectives toward the fabrication of abiotic neural networks with higher reliability, efficiency, and endurance.",
        "DOI": "10.1002/adma.202205945",
        "paper_author": "Wang H.",
        "affiliation_name": "Institut de Science et d’Ingénierie Supramoléculaires",
        "affiliation_city": "Strasbourg",
        "affiliation_country": "France",
        "affiliation_id": "60121685"
    },
    {
        "paper_title": "Recent advances on bioactive baghdadite ceramic for bone tissue engineering applications: 20 years of research and innovation (a review)",
        "publication": "Materials Today Bio",
        "citied_by": "50",
        "cover_date": "2022-12-15",
        "Abstract": "Various artificial bone graft substitutes based on ceramics have been developed over the last 20 years. Among them, calcium-silicate-based ceramics, which are osteoconductive and can attach directly to biological organs, have received great attention for bone tissue engineering applications. However, the degradation rate of calcium-silicate and bone formation is often out of balance, resulting in stress shielding (osteopenia). A new strategy to improve the drawbacks of these ceramics is incorporating trace elements such as Zn, Mg, and Zr into their lattice structures, enhancing their physical and biological properties. Recently, baghdadite (Ca3ZrSi2O9) ceramic, one of the most appealing calcium-silicate-based ceramics, has demonstrated high bioactivity, biocompatibility, biodegradability, and cell interaction. Because of its physical, mechanical, and biological properties and ability to be shaped using various fabrication techniques, baghdadite has found high potential in various biomedical applications such as coatings, fillers, cement, scaffolds, and drug delivery systems. Undoubtedly, there is a high potential for this newly developed ceramic to contribute significantly to therapies to provide a tremendous clinical outcome. This review paper aims to summarize and discuss the most relevant studies performed on baghdadite-based ceramics and composites by focusing on their behavior in vivo and in vitro.",
        "DOI": "10.1016/j.mtbio.2022.100473",
        "paper_author": "Sadeghzade S.",
        "affiliation_name": "Southern University of Science and Technology",
        "affiliation_city": "Shenzhen",
        "affiliation_country": "China",
        "affiliation_id": "60105683"
    },
    {
        "paper_title": "Continuous immobilization of lead by biomineralization in a fluidized-bed biofilm reactor",
        "publication": "Journal of Cleaner Production",
        "citied_by": "4",
        "cover_date": "2022-12-15",
        "Abstract": "Microbial-induced phosphate precipitation (MIPP) is a promising biomineralization technology to immobilize lead in wastewater. However, more in-depth biological principles and reactor models with more biomass need to be further explored to guide its engineering applications. In this study, a fluidized-bed biofilm reactor with biomineralization capability was proposed for immobilizing lead continuously and circularly. The optimal operating parameters for the reactor stages of start-up, operation and circulation were investigated. Stable biofilms could be formed by circulating Lysinibacillus suspension into the column containing the polypropylene fiber with the addition of montmorillonite. Its lead removal efficiency reached above 80% within 3 h and decreased to 23% after 12 h continuous operation. Besides, the reactor could maintain a high lead removal efficiency after multiple elutions and had a better performance without secondary pollution in treating practical wastewater due to the organic matter contained. The functional bacteria stability of the dominant position and functions was the main reason for keeping high removal efficiency during the process. This research provided an effective method for the engineering application of biomineralization for lead removal.",
        "DOI": "10.1016/j.jclepro.2022.134765",
        "paper_author": "Li X.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306"
    },
    {
        "paper_title": "The translational paradigm of nanobiomaterials: Biological chemistry to modern applications",
        "publication": "Materials Today Bio",
        "citied_by": "48",
        "cover_date": "2022-12-15",
        "Abstract": "Recently nanotechnology has evolved as one of the most revolutionary technologies in the world. It has now become a multi-trillion-dollar business that covers the production of physical, chemical, and biological systems at scales ranging from atomic and molecular levels to a wide range of industrial applications, such as electronics, medicine, and cosmetics. Nanobiomaterials synthesis are promising approaches produced from various biological elements be it plants, bacteria, peptides, nucleic acids, etc. Owing to the better biocompatibility and biological approach of synthesis, they have gained immense attention in the biomedical field. Moreover, due to their scaled-down sized property, nanobiomaterials exhibit remarkable features which make them the potential candidate for different domains of tissue engineering, materials science, pharmacology, biosensors, etc. Miscellaneous characterization techniques have been utilized for the characterization of nanobiomaterials. Currently, the commercial transition of nanotechnology from the research level to the industrial level in the form of nano-scaffolds, implants, and biosensors is stimulating the whole biomedical field starting from bio-mimetic nacres to 3D printing, multiple nanofibers like silk fibers functionalizing as drug delivery systems and in cancer therapy. The contribution of single quantum dot nanoparticles in biological tagging typically in the discipline of genomics and proteomics is noteworthy. This review focuses on the diverse emerging applications of Nanobiomaterials and their mechanistic advancements owing to their physiochemical properties leading to the growth of industries on different biomedical measures. Alongside the implementation of such nanobiomaterials in several drug and gene delivery approaches, optical coding, photodynamic cancer therapy, and vapor sensing have been elaborately discussed in this review. Different parameters based on current challenges and future perspectives are also discussed here.",
        "DOI": "10.1016/j.mtbio.2022.100463",
        "paper_author": "Sinha A.",
        "affiliation_name": "Kalinga Institute of Industrial Technology, Bhubaneswar",
        "affiliation_city": "Bhubaneswar",
        "affiliation_country": "India",
        "affiliation_id": "60079452"
    },
    {
        "paper_title": "Antibacterial Ti–Cu implants: A critical review on mechanisms of action",
        "publication": "Materials Today Bio",
        "citied_by": "55",
        "cover_date": "2022-12-15",
        "Abstract": "Titanium (Ti) has been widely used for manufacturing of bone implants because of its mechanical properties, biological compatibility, and favorable corrosion resistance in biological environments. However, Ti implants are prone to infection (peri-implantitis) by bacteria which in extreme cases necessitate painful and costly revision surgeries. An emerging, viable solution for this problem is to use copper (Cu) as an antibacterial agent in the alloying system of Ti. The addition of copper provides excellent antibacterial activities, but the underpinning mechanisms are still obscure. This review sheds light on such mechanisms and reviews how incorporation of Cu can render Ti–Cu implants with antibacterial activity. The review first discusses the fundamentals of interactions between bacteria and implanted surfaces followed by an overview of the most common engineering strategies utilized to endow an implant with antibacterial activity. The underlying mechanisms for antibacterial activity of Ti–Cu implants are then discussed in detail. Special attention is paid to contact killing mechanisms because the misinterpretation of this mechanism is the root of discrepancies in the literature.",
        "DOI": "10.1016/j.mtbio.2022.100447",
        "paper_author": "Mahmoudi P.",
        "affiliation_name": "Sharif University of Technology",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60027666"
    },
    {
        "paper_title": "Bioinspired sandwich-like hybrid surface functionalized scaffold capable of regulating osteogenesis, angiogenesis, and osteoclastogenesis for robust bone regeneration",
        "publication": "Materials Today Bio",
        "citied_by": "35",
        "cover_date": "2022-12-15",
        "Abstract": "Recently, strategies that focus on biofunctionalized implant surfaces to enhance bone defect healing through the synergistic regulation of osteogenesis, angiogenesis, and osteoclastogenesis have attracted increasing attention in the bone tissue engineering field. Studies have shown that the Wnt/β-catenin signaling pathway has an imperative effect of promoting osteogenesis and angiogenesis while reducing osteoclastogenesis. However, how to prepare biofunctionalized bone implants with balanced osteogenesis, angiogenesis, and osteoclastogenesis by activating the Wnt/β-catenin pathway has seldom been investigated. Herein, through a bioinspired dopamine chemistry and self-assembly method, BML-284 (BML), a potent and highly selective Wnt signaling activator, was loaded on a mussel-inspired polydopamine (PDA) layer that had been immobilized on the porous beta-tricalcium calcium phosphate (β-TCP) scaffold surface and subsequently modified by a biocompatible carboxymethyl chitosan hydrogel to form a sandwich-like hybrid surface. β-TCP provides a biomimetic three-dimensional porous microenvironment similar to that of natural cancellous bone, and the BML-loaded sandwich-like hybrid surface endows the scaffold with multifunctional properties for potential application in bone regeneration. The results show that the sustained release of BML from the sandwich-like hybrid surface significantly facilitates the adhesion, migration, proliferation, spreading, and osteogenic differentiation of MC3T3-E1 cells as well as the angiogenic activity of human umbilical vein endothelial cells. In addition to osteogenesis and angiogenesis, the hybrid surface also exerts critical roles in suppressing osteoclastic activity. Remarkably, in a critical-sized cranial defect model, the biofunctionalized β-TCP scaffold could potentially trigger a chain of biological events: stimulating the polarization of M2 macrophages, recruiting endogenous stem cells and endothelial cells at the injury site to enable a favorable microenvironment for greatly accelerating bone ingrowth and angiogenesis while compromising osteoclastogenesis, thereby promoting bone healing. Therefore, these surface-biofunctionalized β-TCP implants, which regulate the synergies of osteogenesis, angiogenesis, and anti-osteoclastogenesis, indicate strong potential for clinical application as advanced orthopedic implants.",
        "DOI": "10.1016/j.mtbio.2022.100458",
        "paper_author": "Wu M.",
        "affiliation_name": "Zhongnan Hospital of Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60122389"
    },
    {
        "paper_title": "Adding recombinant AAVs to the cancer therapeutics mix",
        "publication": "Molecular Therapy Oncolytics",
        "citied_by": "4",
        "cover_date": "2022-12-15",
        "Abstract": "Gene therapy is a powerful biological tool that is reshaping therapeutic landscapes for several diseases. Researchers are using both non-viral and viral-based gene therapy methods with success in the lab and the clinic. In the cancer biology field, gene therapies are expanding treatment options and the possibility of favorable outcomes for patients. While cellular immunotherapies and oncolytic virotherapies have paved the way in cancer treatments based on genetic engineering, recombinant adeno-associated virus (rAAV), a viral-based module, is also emerging as a potential cancer therapeutic through its malleability, specificity, and broad application to common as well as rare tumor types, tumor microenvironments, and metastatic disease. A wide range of AAV serotypes, promoters, and transgenes have been successful at reducing tumor growth and burden in preclinical studies, suggesting more groundbreaking advances using rAAVs in cancer are on the horizon.",
        "DOI": "10.1016/j.omto.2022.09.009",
        "paper_author": "Mulcrone P.L.",
        "affiliation_name": "Indiana University-Purdue University Indianapolis",
        "affiliation_city": "Indianapolis",
        "affiliation_country": "United States",
        "affiliation_id": "60024609"
    },
    {
        "paper_title": "Natural occurrence, bioactivity, and biosynthesis of triene-ansamycins",
        "publication": "European Journal of Medicinal Chemistry",
        "citied_by": "3",
        "cover_date": "2022-12-15",
        "Abstract": "Triene-ansamycins such as ansatrienins and cytotrienins are characterized by three conjugated double bond motifs within a 21-membered benzenoid ansamycins. Their structural diversity exists in the different substituents in the C-11 or C-13 side chain or in the 3-amino-5-hydroxy benzoic acid moiety. More complex derivatives have been reported with fused ring systems which may be produced via intramolecular cycloaddition between phenol and triene. The biosynthetic gene clusters and biosynthetic pathway of ansatrienins and cytotrienins have been characterized. Based on biosynthetic knowledge, a series of structural analogs has been prepared by genomic manipulation. Triene-ansamycins exhibit significant anticancer activity. The structure-activity relationships and biological targets have been investigated. This mini-review presents a comprehensive survey of triene-ansamycins, which covers natural occurrence, biological activity, biosynthesis, structural derivatization, structure-activity relationships, and biological targets from 1967 to 2022. Eighty triene-ansamycins have been reported.",
        "DOI": "10.1016/j.ejmech.2022.114815",
        "paper_author": "Yang X.",
        "affiliation_name": "Naval Medical University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025234"
    },
    {
        "paper_title": "Biological modulating organic photoelectrochemical transistor through in situ enzymatic engineering of photoactive gate for sensitive detection of serum alkaline phosphatase",
        "publication": "Biosensors and Bioelectronics",
        "citied_by": "25",
        "cover_date": "2022-12-15",
        "Abstract": "Innovative optoelectronics are expected to play more important role in clinical diagnosis. In this study, on the basis of sensitive gating effect by in situ enzymatic functionalization of semiconductors, a novel organic photoelectrochemical transistor (OPECT) detection of serum alkaline phosphatase (ALP) level was demonstrated. Specifically, the OPECT detection operates upon the ALP-catalyzed hydrolysis of sodium thiophosphate to yield hydrogen sulfide (H2S), which could in situ generate CdS on the TiO2 electrode in the presence of Cd2+ cations. Correlated to the ALP level, the CdS directly formed on and interfacing with the TiO2 could sensitively gating the poly(3,4-ethylenedioxythiophene):poly(styrene sulfonate) (PEDOT:PSS) channel, allowing unique optoelectronic detection of serum ALP level with a linear range from 0.005 to 15 U L−1 and a detection limit corresponding to 0.0012 U L−1 (S/N = 3). This study offers not only an optoelectronic method for detection of serum ALP level, but also a perspective for unique OPECT gating and application. Moreover, the general catalytic abilities of enzymes to produce functional species and their rich interactions with various gate substrates further provide great space for futuristic OPECT detection in enzyme-associated diseases.",
        "DOI": "10.1016/j.bios.2022.114752",
        "paper_author": "Ban R.",
        "affiliation_name": "Guizhou Minzu University",
        "affiliation_city": "Guiyang",
        "affiliation_country": "China",
        "affiliation_id": "60138506"
    },
    {
        "paper_title": "Assessment of BPA and BPS exposure in the general population in Guangzhou, China - Estimation of daily intakes based on urinary metabolites",
        "publication": "Environmental Pollution",
        "citied_by": "18",
        "cover_date": "2022-12-15",
        "Abstract": "Human exposure to bisphenol A (BPA) and bisphenol S (BPS) has garnered considerable global health concerns. In this paper, the daily intake (DI) of BPA and BPS in the general population of Guangzhou, China, were back-calculated using the biomarkers BPA glucuronides (BPA-G) and BPS glucuronides (BPS-G), respectively. The biomarkers are preferable to total BPA and BPS measurements because they are not susceptible to external contamination. A total of 1440 urine samples were gathered from the general population in Guangzhou, China, which were classified by age and sex into 36 pooled urine samples. 100% and 98% of pooled urine samples contained BPA-G and BPS-G at median values of 1.57 and 0.38 ng/mL, respectively. Based on urinary BPA-G and BPS-G concentrations, we determined the median DI of BPA and BPS to be 31.07 and 7.37 ng/(kg bw*d), respectively, and the highest values to be 106.77 ng/(kg bw*d) and 18.19 ng/(kg bw*d), respectively. Furthermore, our results showed that for the entire dataset, the DI of BPA and BPS were considerably greater in males than in females (p < 0.01)and declined significantly with age (p < 0.05). For risk assessment, the estimated DIs of BPA and BPS were much lower than the European Food Safety Authority’ s (EFSA) the temporary acceptable reference dose of 4 μg/(kg bw*d) advised for BPA, suggesting that the exposure risk of BPA and BPS for Guangzhou population is within a controllable safety range. This is the first study to investigate BPA and BPS exposure in the general population of Guangzhou, China, on the basis of urinary metabolites.",
        "DOI": "10.1016/j.envpol.2022.120375",
        "paper_author": "Wang H.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182"
    },
    {
        "paper_title": "Enzyme-driven oxygen-fuelled pathway selectivity of tyrosine-containing peptide oxidation evolution",
        "publication": "Chemical Engineering Journal",
        "citied_by": "7",
        "cover_date": "2022-12-15",
        "Abstract": "The pathway selectivity of chemical evolution controlled by enzymes, with proteins and peptides as substrates, is of critical significance to determine biological processes and functions. In nature, organisms utilize tyrosinase to catalyse oxidation reactions of tyrosine to produce multifunctional compounds in different pathways. However, it remains a great challenge to manipulate the pathway selection of tyrosinase-guided chemical evolution for achieving biomaterials with on-demand functions. We herein report that controlling oxygen concentration is effective in regulating the evolution of tyrosinase-catalysed oxygenation pathways of tyrosine-containing peptides and even proteins. The melanin formation pathway predominates under oxygen-enriched conditions, while fluorescent compounds are preferentially generated under hypoxic conditions. The chemical evolution of tyrosine-containing peptides, regardless of their neighbouring amino acid types and sequences, tends to be governed by these two competitive pathways. These competitive pathways are manipulated by conformational transformation of tyrosinase active centre that is determined by oxygen concentration. Moreover, the oxygen-controlled chemical evolution of tyrosine-containing biomolecules can be broadly realized by tyrosinase to obtain melanin-based photothermal materials or multicolour fluorescent materials. This work reveals the plausible role of oxygen in the pathway selectivity of enzyme-controlled chemical evolution of tyrosine-containing peptides and verifies the possibility of fluorescent detection in living cultured melanoma cells, which provides a versatile strategy for precise design and engineering of tyrosine-involved multifunctional biomaterials.",
        "DOI": "10.1016/j.cej.2022.138293",
        "paper_author": "Ren X.",
        "affiliation_name": "Institute of Process Engineering Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027470"
    },
    {
        "paper_title": "Poly(ether ester) and related block copolymers via organocatalytic ring-opening polymerization",
        "publication": "Journal of Polymer Science",
        "citied_by": "8",
        "cover_date": "2022-12-15",
        "Abstract": "Poly(p-dioxanone) (PPDO) produced by ring-opening polymerization (ROP) of p-dioxanone (PDO) has been attracted intensive attention in bioengineering and environmental materials due to the coexistence of ester and ether bonds in the repeating units. Herein, we systematically study the ROP behavior of PDO using classical organic amidine and guanidine compounds. The cyclic and linear PPDO homopolymers are efficiently produced and confirmed by the combination of 1H, 13C NMR and MALDI-TOF MS spectra. Furthermore, triblock copolymers (PPDO-b-PCL-b-PPDO) containing poly(ε-caprolactone) (PCL) as the soft segment and PPDO as the hard segment are prepared in the presence of ethylene glycol. The resultant block copolymers are well characterized using NMR, gel permeation chromatography, differential scanning calorimetry, and thermogravimetric analysis. It is found that the prepared triblock copolymers exhibit tunable flexibility, stabilization, hydrophilicity, and mechanical strength, which could be used as thermoplastic materials in biological and tissue engineering areas.",
        "DOI": "10.1002/pol.20210820",
        "paper_author": "Li B.",
        "affiliation_name": "Hangzhou Normal University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60069717"
    },
    {
        "paper_title": "3D tumor explant as a novel platform to investigate therapeutic pathways and predictive biomarkers in cancer patients",
        "publication": "Frontiers in Immunology",
        "citied_by": "5",
        "cover_date": "2022-12-14",
        "Abstract": "Immunotherapy with immune checkpoint inhibitors can induce durable clinical responses in different human malignancies but the number of responding patients remains globally modest. The limited therapeutic efficacy of ICI depends on multiple factors, among which the immune suppressive features of the tumor microenvironment play a key role. For this reason, experimental models that enable dissection of the immune-hostile tumor milieu components are required to unravel how to overcome resistance and obtain full-fledged anti-tumor immunity. Recent evidence supports the usefulness of 3D ex vivo systems in retaining features of tumor microenvironment to elucidate molecular and immunologic mechanisms of response and resistance to immune checkpoint blockade. In this perspective article we discuss the recent advances in patient-derived 3D tumor models and their potential in support of treatment decision making in clinical setting. We will also share our experience with dynamic bioreactor tumor explant culture of samples from melanoma and sarcoma patients as a reliable and promising platform to unravel immune responses to immune checkpoint inhibitors.",
        "DOI": "10.3389/fimmu.2022.1068091",
        "paper_author": "Rodolfo M.",
        "affiliation_name": "Fondazione IRCCS Istituto Nazionale dei Tumori, Milan",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60006583"
    },
    {
        "paper_title": "Autophagy in glaucoma pathogenesis: Therapeutic potential and future perspectives",
        "publication": "Frontiers in Cell and Developmental Biology",
        "citied_by": "10",
        "cover_date": "2022-12-14",
        "Abstract": "Glaucoma is a common blinding eye disease characterized by progressive loss of retinal ganglion cells (RGCs) and their axons, progressive loss of visual field, and optic nerve atrophy. Autophagy plays a pivotal role in the pathophysiology of glaucoma and is closely related to its pathogenesis. Targeting autophagy and blocking the apoptosis of RGCs provides emerging guidance for the treatment of glaucoma. Here, we provide a systematic review of the mechanisms and targets of interventions related to autophagy in glaucoma and discuss the outlook of emerging ideas, techniques, and multidisciplinary combinations to provide a new basis for further research and the prevention of glaucomatous visual impairment.",
        "DOI": "10.3389/fcell.2022.1068213",
        "paper_author": "Li M.",
        "affiliation_name": "School of Basic Medicine Science of Central South University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60023373"
    },
    {
        "paper_title": "Recent advances in electronic skins: material progress and applications",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "15",
        "cover_date": "2022-12-14",
        "Abstract": "Electronic skins are currently in huge demand for health monitoring platforms and personalized medicine applications. To ensure safe monitoring for long-term periods, high-performance electronic skins that are softly interfaced with biological tissues are required. Stretchability, self-healing behavior, and biocompatibility of the materials will ensure the future application of electronic skins in biomedical engineering. This mini-review highlights recent advances in mechanically active materials and structural designs for electronic skins, which have been used successfully in these contexts. Firstly, the structural and biomechanical characteristics of biological skins are described and compared with those of artificial electronic skins. Thereafter, a wide variety of processing techniques for stretchable materials are reviewed, including geometric engineering and acquiring intrinsic stretchability. Then, different types of self-healing materials and their applications in electronic skins are critically assessed and compared. Finally, the mini-review is concluded with a discussion on remaining challenges and future opportunities for materials and biomedical research.",
        "DOI": "10.3389/fbioe.2022.1083579",
        "paper_author": "Cao H.L.",
        "affiliation_name": "The Second Affiliated Hospital Zhejiang University School of Medicine",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60118432"
    },
    {
        "paper_title": "Engineered cell culture microenvironments for mechanobiology studies of brain neural cells",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "16",
        "cover_date": "2022-12-14",
        "Abstract": "The biomechanical properties of the brain microenvironment, which is composed of different neural cell types, the extracellular matrix, and blood vessels, are critical for normal brain development and neural functioning. Stiffness, viscoelasticity and spatial organization of brain tissue modulate proliferation, migration, differentiation, and cell function. However, the mechanical aspects of the neural microenvironment are largely ignored in current cell culture systems. Considering the high promises of human induced pluripotent stem cell- (iPSC-) based models for disease modelling and new treatment development, and in light of the physiological relevance of neuromechanobiological features, applications of in vitro engineered neuronal microenvironments should be explored thoroughly to develop more representative in vitro brain models. In this context, recently developed biomaterials in combination with micro- and nanofabrication techniques 1) allow investigating how mechanical properties affect neural cell development and functioning; 2) enable optimal cell microenvironment engineering strategies to advance neural cell models; and 3) provide a quantitative tool to assess changes in the neuromechanobiological properties of the brain microenvironment induced by pathology. In this review, we discuss the biological and engineering aspects involved in studying neuromechanobiology within scaffold-free and scaffold-based 2D and 3D iPSC-based brain models and approaches employing primary lineages (neural/glial), cell lines and other stem cells. Finally, we discuss future experimental directions of engineered microenvironments in neuroscience.",
        "DOI": "10.3389/fbioe.2022.1096054",
        "paper_author": "Castillo Ransanz L.",
        "affiliation_name": "Vrije Universiteit Amsterdam",
        "affiliation_city": "Amsterdam",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60008734"
    },
    {
        "paper_title": "A biotin-stabilized HKUST-1/ADM scaffold for facilitating MSC endothelial differentiation and vascularization in diabetic wound healing",
        "publication": "Biomaterials Science",
        "citied_by": "7",
        "cover_date": "2022-12-14",
        "Abstract": "Inadequate angiogenesis in diabetic wound healing has been identified as one of the most difficult issues to treat. Copper ions (Cu2+) have been confirmed to stimulate angiogenesis; nevertheless, the rapid rise in non-physiological Cu2+ concentrations increases the danger of ion poisoning. For the first time, biotin was used to stabilize a copper-based metal-organic framework (HKUST-1) to change its hydrophobicity and achieve sustained release of Cu2+. The inability to offer a suitable area for the dynamic interaction between cells and growth factors still restricts the use of nanomaterials for the regeneration of injured skin in diabetes. Acellular dermal matrix (ADM) scaffolds are collagen fibers with natural spatial tissue that can create a biological “niche” for cell attachment and growth. In this study, biotin-stabilized HKUST-1 (B-HKUST-1) nanoparticles were modified with an ADM to form a novel scaffold (ADM-B-HKUST-1). Notably, Cu2+ and mesenchymal stem cells (MSCs) released by the composite scaffold may synergistically promote MSC adhesion, proliferation and endothelial differentiation by upregulating the expression of transforming growth factor-β (TGF-β), vascular endothelial growth factor (VEGF) and alpha-smooth muscle actin (α-SMA). Overall, the ADM-B-HKUST1 scaffold combines the dual advantages of the sustained release of Cu2+ and creating a biological “niche” can provide a potential strategy for enhancing angiogenesis and promoting diabetic wound healing.",
        "DOI": "10.1039/d2bm01443b",
        "paper_author": "Zhang Q.",
        "affiliation_name": "South China Normal University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60005816"
    },
    {
        "paper_title": "Toxic effect and inability of L-homoserine to be a nitrogen source for growth of Escherichia coli resolved by a combination of in vivo evolution engineering and omics analyses",
        "publication": "Frontiers in Microbiology",
        "citied_by": "0",
        "cover_date": "2022-12-13",
        "Abstract": "L-homoserine is a pivotal intermediate in the carbon and nitrogen metabolism of E. coli. However, this non-canonical amino acid cannot be used as a nitrogen source for growth. Furthermore, growth of this bacterium in a synthetic media is potently inhibited by L-homoserine. To understand this dual effect, an adapted laboratory evolution (ALE) was applied, which allowed the isolation of a strain able to grow with L-homoserine as the nitrogen source and was, at the same time, desensitized to growth inhibition by this amino acid. Sequencing of this evolved strain identified only four genomic modifications, including a 49 bp truncation starting from the stop codon of thrL. This mutation resulted in a modified thrL locus carrying a thrL* allele encoding a polypeptide 9 amino acids longer than the thrL encoded leader peptide. Remarkably, the replacement of thrL with thrL* in the original strain MG1655 alleviated L-homoserine inhibition to the same extent as strain 4E, but did not allow growth with this amino acid as a nitrogen source. The loss of L-homoserine toxic effect could be explained by the rapid conversion of L-homoserine into threonine via the thrL*-dependent transcriptional activation of the threonine operon thrABC. On the other hand, the growth of E. coli on a mineral medium with L-homoserine required an activation of the threonine degradation pathway II and glycine cleavage system, resulting in the release of ammonium ions that were likely recaptured by NAD(P)-dependent glutamate dehydrogenase. To infer about the direct molecular targets of L-homoserine toxicity, a transcriptomic analysis of wild-type MG1655 in the presence of 10 mM L-homoserine was performed, which notably identified a potent repression of locomotion-motility-chemotaxis process and of branched-chain amino acids synthesis. Since the magnitude of these effects was lower in a ΔthrL mutant, concomitant with a twofold lower sensitivity of this mutant to L-homoserine, it could be argued that growth inhibition by L-homoserine is due to the repression of these biological processes. In addition, L-homoserine induced a strong upregulation of genes in the sulfate reductive assimilation pathway, including those encoding its transport. How this non-canonical amino acid triggers these transcriptomic changes is discussed.",
        "DOI": "10.3389/fmicb.2022.1051425",
        "paper_author": "Alkim C.",
        "affiliation_name": "INSA Toulouse",
        "affiliation_city": "Toulouse",
        "affiliation_country": "France",
        "affiliation_id": "60024614"
    },
    {
        "paper_title": "Effects of External Perturbations on Protein Systems: A Microscopic View",
        "publication": "ACS Omega",
        "citied_by": "7",
        "cover_date": "2022-12-13",
        "Abstract": "Protein folding can be viewed as the origami engineering of biology resulting from the long process of evolution. Even decades after its recognition, research efforts worldwide focus on demystifying molecular factors that underlie protein structure-function relationships; this is particularly relevant in the era of proteopathic disease. A complex co-occurrence of different physicochemical factors such as temperature, pressure, solvent, cosolvent, macromolecular crowding, confinement, and mutations that represent realistic biological environments are known to modulate the folding process and protein stability in unique ways. In the current review, we have contextually summarized the substantial efforts in unveiling individual effects of these perturbative factors, with major attention toward bottom-up approaches. Moreover, we briefly present some of the biotechnological applications of the insights derived from these studies over various applications including pharmaceuticals, biofuels, cryopreservation, and novel materials. Finally, we conclude by summarizing the challenges in studying the combined effects of multifactorial perturbations in protein folding and refer to complementary advances in experiment and computational techniques that lend insights to the emergent challenges.",
        "DOI": "10.1021/acsomega.2c06199",
        "paper_author": "Dutta P.",
        "affiliation_name": "Indian Institute of Science Education and Research Kolkata",
        "affiliation_city": "Mohanpur",
        "affiliation_country": "India",
        "affiliation_id": "60103615"
    },
    {
        "paper_title": "Strain effect on the field-effect sensing property of Si wires",
        "publication": "Physical Chemistry Chemical Physics",
        "citied_by": "2",
        "cover_date": "2022-12-12",
        "Abstract": "Silicon-based field effect transistor (FET) sensors with high sensitivity are emerging as powerful sensors for detecting chemical/biological species. Strain engineering has been demonstrated as an effective means to improve the performance of Si-based devices. However, the strain effect on the field-effect sensing property of silicon materials has not been studied yet. Here, we investigate the strain effect on the field-effect sensing property of silicon wires by taking humidity sensing as an example. The humidity sensitivity of FET sensors based on silicon wires increases with increasing tensile strain but decreases with increasing compressive strain. The sensitivity is very responsive to strain with an enhancement factor of 67 for tensile strain. Theoretical analysis shows that the sensitivity variation under different strains is mainly attributed to the change in adsorption energy between silicon wires and water molecules. This work indicates that strain engineering can be an effective route to modulate the field-effect sensing property of Si wires for constructing highly sensitive Si-based FET sensors.",
        "DOI": "10.1039/d2cp04805a",
        "paper_author": "Lin Y.",
        "affiliation_name": "Soochow University",
        "affiliation_city": "Suzhou",
        "affiliation_country": "China",
        "affiliation_id": "60010432"
    },
    {
        "paper_title": "Co-Doped Fe<inf>3</inf>S<inf>4</inf>Nanoflowers for Boosting Electrocatalytic Nitrogen Fixation to Ammonia under Mild Conditions",
        "publication": "Inorganic Chemistry",
        "citied_by": "12",
        "cover_date": "2022-12-12",
        "Abstract": "Compared with the Haber Bosch process, the electrochemical nitrogen reduction reaction (NRR) under mild conditions provides an alternative and promising route for ammonia synthesis due to its green and sustainable features. However, the great energy barrier to break the stable NN bond hinders the practical application of NRR. Though Fe is the only common metal element in all biological nitrogenases in nature, there is still a lack of study on developing highly efficient and low-cost Fe-based catalysts for N2fixation. Herein, Co-doped Fe3S4nanoflowers were fabricated as the intended catalyst for NRR. The results indicate that 4% Co-doped Fe3S4nanoflowers achieve a high Faradaic efficiency of 17% and a NH3yield rate of 37.5 μg·h-1·mg-1cat.at-0.55 V versus RHE potential in 0.1 M HCl, which is superior to most Fe-based catalysts. The introduction of Co atoms can not only shift the partial density states of Fe3S4toward the Fermi level but also serve as new active centers to promote N2absorption, lowering the energy barrier of the potential determination step to accelerate the catalytic process. This work paves a pathway of the morphology and doping engineering for Fe-based electrocatalysts to enhance ammonia synthesis.",
        "DOI": "10.1021/acs.inorgchem.2c03578",
        "paper_author": "Chen X.",
        "affiliation_name": "Qufu Normal University",
        "affiliation_city": "Qufu",
        "affiliation_country": "China",
        "affiliation_id": "60026320"
    },
    {
        "paper_title": "Engineering Biomimetic Trogocytosis with Farnesylated Chemically Self-Assembled Nanorings",
        "publication": "Biomacromolecules",
        "citied_by": "5",
        "cover_date": "2022-12-12",
        "Abstract": "Inspired by the natural intercellular material-transfer process of trans-endocytosis or trogocytosis, we proposed that targeted farnesylated chemically self-assembled nanorings (f-CSANs) could serve as a biomimetic trogocytosis vehicle for engineering directional cargo transfer between cells, thus allowing cell-cell interactions to be monitored and facilitating cell-cell communications. The membranes of sender cells were stably modified by hydrophobic insertion with the targeted f-CSANs, which were efficiently transferred to receiver cells expressing the appropriate receptors by endocytosis. CSAN-assisted cell-cell cargo transfer (C4T) was demonstrated to be receptor specific and dependent on direct cell-cell interactions, the rate of receptor internalization, and the level of receptor expression. In addition, C4T was shown to facilitate cell-to-cell delivery of an apoptosis inducing drug, as wells as antisense oligonucleotides. Taken together, the C4T approach is a potentially versatile biomimetic trogocytosis platform that can be deployed as a macro-chemical biological tool for monitoring cell-cell interactions and engineering cell-cell communications.",
        "DOI": "10.1021/acs.biomac.2c00837",
        "paper_author": "Wang Y.",
        "affiliation_name": "College of Science and Engineering",
        "affiliation_city": "Minneapolis",
        "affiliation_country": "United States",
        "affiliation_id": "60152345"
    },
    {
        "paper_title": "Review of Physical, Mechanical, and Biological Characteristics of 3D-Printed Bioceramic Scaffolds for Bone Tissue Engineering Applications",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "20",
        "cover_date": "2022-12-12",
        "Abstract": "This review focuses on the advancements in additive manufacturing techniques that are utilized for fabricating bioceramic scaffolds and their characterizations leading to bone tissue regeneration. Bioscaffolds are made by mimicking the human bone structure, material composition, and properties. Calcium phosphate apatite materials are the most commonly used scaffold materials as they closely resemble live bone in their inorganic composition. The functionally graded scaffolds are fabricated by utilizing the right choice of the 3D printing method and material combinations to achieve the requirement of the bioscaffold. To tailor the physical, mechanical, and biological properties of the scaffold, certain materials are reinforced, doped, or coated to incorporate the functionality. The biomechanical loading conditions that involve flexion, torsion, and tension exerted on the implanted scaffold are discussed. The finite element analysis (FEA) technique is used to investigate the mechanical property of the scaffold before fabrication. This helps in reducing the actual number of samples used for testing. The FEA simulated results and the experimental result are compared. This review also highlights some of the challenges associated while processing the scaffold such as shrinkage, mechanical instability, cytotoxicity, and printability. In the end, the new materials that are evolved for tissue engineering applications are compiled and discussed.",
        "DOI": "10.1021/acsbiomaterials.2c00793",
        "paper_author": "Thangavel M.",
        "affiliation_name": "Vellore Institute of Technology",
        "affiliation_city": "Vellore",
        "affiliation_country": "India",
        "affiliation_id": "60010618"
    },
    {
        "paper_title": "Effect of Boron-Doped Mesoporous Bioactive Glass Nanoparticles on C2C12 Cell Viability and Differentiation: Potential for Muscle Tissue Application",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "30",
        "cover_date": "2022-12-12",
        "Abstract": "Mesoporous bioactive glasses (MBGs) exhibit a high surface area and a highly ordered mesoporous structure. MBGs have potential for both hard and soft tissue engineering applications. MBGs may be doped with biologically active ions to tailor their biological activity. Boron is being widely studied as a dopant of bioactive glasses. Recently, research has demonstrated the potential of boron-containing bioactive glasses for muscle regeneration. In this study, boron-containing MBGs, 10B-MBG and 18B-MBG nanoparticles, were produced by a microemulsion-assisted sol-gel approach for potential muscle regeneration applications. First, X-ray diffraction (XRD), Fourier transform infrared (FTIR), and energy-dispersive X-ray spectroscopy (EDX) analyses were conducted to study the chemical structure and composition of the nanoparticles. To examine the nanoparticle morphology, scanning electron microscopy (SEM) and transmission electron microscopy (TEM) images were analyzed. Both SEM images and particle size distribution determined by dynamic light scattering (DLS) indicated a decrease of the average particle size after boron doping. TEM images indicated a slit-shaped mesoporous structure of nanoparticles for all compositions. The ζ potential was measured, and a negative surface charge was found for all study groups due to the presence of silanol groups. Cytocompatibility and fluorescence microscopy studies were also carried out. The results indicated that low concentrations (0.1 and 1 mg mL-1) of all MBG nanoparticles led to high viability of C2C12 cells. Fluorescence microscopy images indicated that at lower nanoparticle concentrations (0.1 and 1 mg mL-1), C2C12 cells appeared to differentiate into myotubes, which was indicated by a spindle-shaped morphology. For 10 mg mL-1concentration of nanoparticles, C2C12 cells had a lower aspect ratio (estimated qualitatively by inspection of the images), which implied a lower degree of differentiation. Boron-doped MBG nanoparticles in reduced concentrations are suitable to induce differentiation of C2C12 cells into myotubes, indicating their potential for applications in muscle tissue repair.",
        "DOI": "10.1021/acsbiomaterials.2c00876",
        "paper_author": "Ege D.",
        "affiliation_name": "Boğaziçi Üniversitesi",
        "affiliation_city": "Bebek",
        "affiliation_country": "Turkey",
        "affiliation_id": "60005803"
    },
    {
        "paper_title": "Mechanical Unfolding and Refolding of NanoLuc via Single-Molecule Force Spectroscopy and Computer Simulations",
        "publication": "Biomacromolecules",
        "citied_by": "1",
        "cover_date": "2022-12-12",
        "Abstract": "A highly bioluminescent protein, NanoLuc (Nluc), has seen numerous applications in biological assays since its creation. We recently engineered a NanoLuc polyprotein that showed high bioluminescence but displayed a strong misfolding propensity after mechanical unfolding. Here, we present our single-molecule force spectroscopy (SMFS) studies by atomic force microscopy (AFM) and steered molecular dynamics (SMD) simulations on two new hybrid protein constructs comprised of Nluc and I91 titin domains, I91-I91-Nluc-I91-I91-I91-I91 (I912-Nluc-I914) and I91-Nluc-I91-Nluc-I91-Nluc-I91, to characterize the unfolding behavior of Nluc in detail and to further investigate its misfolding properties that we observed earlier for the I912-Nluc3-I912construct. Our SMFS results confirm that Nluc's unfolding proceeds similarly in all constructs; however, Nluc's refolding differs in these constructs, and its misfolding is minimized when Nluc is monomeric or separated by I91 domains. Our simulations on monomeric Nluc, Nluc dyads, and Nluc triads pinpointed the origin of its mechanical stability and captured interesting unfolding intermediates, which we also observed experimentally.",
        "DOI": "10.1021/acs.biomac.2c00997",
        "paper_author": "Apostolidou D.",
        "affiliation_name": "Pratt School of Engineering",
        "affiliation_city": "Durham",
        "affiliation_country": "United States",
        "affiliation_id": "60140102"
    },
    {
        "paper_title": "Programmed Iteration Controls the Assembly of the Nonanoic Acid Side Chain of the Antibiotic Mupirocin",
        "publication": "Angewandte Chemie - International Edition",
        "citied_by": "5",
        "cover_date": "2022-12-12",
        "Abstract": "Mupirocin is a clinically important antibiotic produced by Pseudomonas fluorescens NCIMB 10586 that is assembled by a complex trans-AT polyketide synthase. The polyketide fragment, monic acid, is esterified by a 9-hydroxynonanoic acid (9HN) side chain which is essential for biological activity. The ester side chain assembly is initialised from a 3-hydroxypropionate (3HP) starter unit attached to the acyl carrier protein (ACP) MacpD, but the fate of this species is unknown. Herein we report the application of NMR spectroscopy, mass spectrometry, chemical probes and in vitro assays to establish the remaining steps of 9HN biosynthesis. These investigations reveal a complex interplay between a novel iterative or “stuttering” KS-AT didomain (MmpF), the multidomain module MmpB and multiple ACPs. This work has important implications for understanding the late-stage biosynthetic steps of mupirocin and will be important for future engineering of related trans-AT biosynthetic pathways (e.g. thiomarinol).",
        "DOI": "10.1002/anie.202212393",
        "paper_author": "Winter A.J.",
        "affiliation_name": "University of Bristol",
        "affiliation_city": "Bristol",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020650"
    },
    {
        "paper_title": "Silk Fibroin/Collagen/Hydroxyapatite Scaffolds Obtained by 3D Printing Technology and Loaded with Recombinant Human Erythropoietin in the Reconstruction of Alveolar Bone Defects",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "26",
        "cover_date": "2022-12-12",
        "Abstract": "The fast osteogenesis of the large alveolar fossa and the maintenance of the height of the alveolar ridge after tooth extraction have always been a clinical challenge. Therefore, this work describes the creation of innovative silk fibroin/collagen/hydroxyapatite (SCH) biological scaffolds by 3D printing technology, which are loaded with recombinant human erythropoietin (rh-EPO) for the reconstruction of bone defects. Low-temperature 3D printing can maintain the biological activity of silk fibroin and collagen. The SCH scaffolds showed the ideal water absorption and porosity, being a sustained-release carrier of rh-EPO. The optimized scaffolds had ideal mechanical properties in vitro, and MC3T3-E1 cells could easily adhere and proliferate on it. In vivo experiments in rabbits demonstrated that the composite scaffolds gradually degraded and promoted the accumulation and proliferation of osteoblasts and the formation of collagen fibers, significantly promoting the reconstruction of mandibular defects. In this study, a novel composite biological scaffold was prepared using 3D printing technology, and the scaffold was innovatively combined with the multifunctional growth factor rh-EPO. This provides a new optimized composite material for the reconstruction of irregular mandible defects, and this biomaterial is promising for clinical reconstruction of alveolar bone defects.",
        "DOI": "10.1021/acsbiomaterials.2c00690",
        "paper_author": "Liu H.",
        "affiliation_name": "Nankai University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60018038"
    },
    {
        "paper_title": "Study on aging resistance and micro characteristics of bio-asphalt/TLA composite modified asphalt binder",
        "publication": "Construction and Building Materials",
        "citied_by": "16",
        "cover_date": "2022-12-12",
        "Abstract": "With the development of road engineering, non-renewable petroleum asphalt binder is increasingly scarce. It is of great significance to replace part of petroleum asphalt binder with renewable biological asphalt binder in road engineering for sustainable social development. To solve the shortcomings of poor aging resistance of bio-asphalt, 25% of Trinidad Lake Asphalt (TLA) is added into different contents of bio-asphalt modified asphalt binder in this paper to prepare bio-asphalt/TLA composite modified asphalt binder to improve its aging resistance. Then physical property tests, Fourier transform infrared spectroscopy (FTIR) tests, scanning electron microscopy (SEM), and atomic force microscopy (AFM) tests are conducted to study the aging resistance and mechanism. The physical property test shows that compared with petroleum asphalt binder, the bio-asphalt/TLA composite modified asphalt binder has lower softening point increment, viscosity aging index, complex modulus aging index and higher residual penetration; The micro test shows that the order of CI growth rate of 6 asphalt binder from large to small is: O > 12B/T > 9B/T > 6B/T > 3B/T > T; Biological asphalt binder, TLA and petroleum asphalt binder have good compatibility and can form a new and more stable system. Bio-asphalt/TLA composite modified asphalt binder has good anti-aging performance.",
        "DOI": "10.1016/j.conbuildmat.2022.129566",
        "paper_author": "Meng Y.",
        "affiliation_name": "Guangxi University",
        "affiliation_city": "Nanning",
        "affiliation_country": "China",
        "affiliation_id": "60030270"
    },
    {
        "paper_title": "Study on the dense structure and properties of cement-stabilized coral aggregates",
        "publication": "Construction and Building Materials",
        "citied_by": "8",
        "cover_date": "2022-12-12",
        "Abstract": "The performance of cement stabilized coral aggregates semi-rigid base of pavement with coral reef limestone fragments and biological debris as the main materials is essential in the current reef engineering constructions. The performance of inorganic mixtures such as cement-stabilized coral aggregates mainly depends on the packing state of aggregates and the interfacial bonding among each component. Via digital image analysis theory, a simulation model of the dense packing of particles method was established, considering the influence of arbitrary particles shape distribution, upper limit of particles size, and aggregates gradation. The influencing mechanism of different factors on the packing state was revealed. It was found that the dense packing of coral aggregates is a strong suspension dense structure which did not form the skeleton structure. The strengthening mechanism of the coral particle-coated cement slurry was studied through the experimental analysis of the pore structure of coral rocks and debris particles and the crushing strength of particle-coated cement slurry, combined with the microhardness test of the cement- coral particle interface and the analysis of hydration products. The physicochemical excitation mechanism of hydration products densification，“physical interlocking” and “micro pump” effect at the interface of the cement-coral particle was revealed. Furthermore, based on the macroscopic mechanical properties of cement stabilized coral aggregates, the optimal design ratio of coral aggregates with upper limit particle size of 53mm, fine aggregates content of 45% and cement content of 8% was proposed. The findings of this study can provide a reference for the design and application of cement stabilized coral aggregates semi-rigid pavement base.",
        "DOI": "10.1016/j.conbuildmat.2022.129465",
        "paper_author": "Zeng Z.",
        "affiliation_name": "Southeast University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60005244"
    },
    {
        "paper_title": "Expression of a mosquito larvicidal gene in chloroplast and nuclear compartments of Chlamydomonas reinhardtii",
        "publication": "Journal of Biotechnology",
        "citied_by": "1",
        "cover_date": "2022-12-10",
        "Abstract": "As a part of the search for environment-friendly biocontrol of mosquito-borne diseases, mosquito larvicidal potential of Bacillus thuringiensis subsp. jegathesan (Btj) Cry toxins is explored for toxins with increased toxicity. Safe delivery of the Cry toxins to mosquito larvae in aquatic habitats is a major concern. This is because in water bodies Bacillus thuringiensis (Bt) protein formulations degrade by sunlight, can sink down and get adsorbed by the silt. So, because of its short persistence the toxin requires repeated applications at the given site. Therefore, an upcoming approach is incorporating the Bt toxins in Chlamydomonas reinhardtii (C. reinhardtii) because it is a food of mosquito larvae in water and its molecular toolkit is well investigated for foreign gene expression. The present work aimed to compare the feasibility of C. reinhardtii chloroplast and nuclear compartments for stable expression of Cry11Ba toxin as this is the most toxic Btj protein to date, lethal to different mosquito species. With chloroplast expression of cry11Ba gene we were able to generate marker-free C. reinhardtii strain stably expressing Cry11Ba protein and demonstrating mortality against Aedes aegypti larvae. Moreover, for nuclear expression linking the cry11Ba gene to zeocin via foot and mouth disease virus (FMDV) 2A peptide resulted in the selection of transformants with increased cry11Ba mRNA expression levels by semi-quantitative reverse transcriptase PCR. Obtained results lay a foundation for the C. reinhardtii chloroplast expression system to be used for genetic engineering with Bt toxins which possess enhanced toxicity.",
        "DOI": "10.1016/j.jbiotec.2022.11.004",
        "paper_author": "Pervaiz R.",
        "affiliation_name": "University of the Punjab",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60053707"
    },
    {
        "paper_title": "Native and engineered extracellular vesicles for wound healing",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "25",
        "cover_date": "2022-12-09",
        "Abstract": "Extracellular vesicles (EVs) that act as messengers mediate communication between parent and recipient cells through their contents, including nucleic acids, proteins, and lipids. These endogenous vesicles have emerged as a novel cell-free strategy for the treatment of diseases. EVs can be released by various types of cells with unique biological properties. Recent studies have shown that native EVs are used as therapeutic agents to promote tissue repair by delivering various growth factors and trophic factors including VEGF, EGF, TFN-α, IL-1β, and TGF-β to participate in all physiological processes of wound healing. Furthermore, to improve their specificity, safety, and efficiency for wound healing, the content and surface of EVs can be designed, modified, and engineered. The engineering strategies of EVs are divided into parent cell modification and indirect modification of EVs. The therapeutic potential of current EVs and engineered EVs for wound healing still requires the exploration of their large-scale clinical applications through innovative approaches. Herein, we provide an overview of the current biological knowledge about wound healing and EVs, as well as the application of native EVs in promoting wound healing. We also outline recent advances in engineering EV methodologies to achieve ideal therapeutic potential. Finally, the therapeutic applications of engineered EVs in wound healing are reviewed, and the challenges and prospects for the translation of engineered EVs to clinical applications are discussed.",
        "DOI": "10.3389/fbioe.2022.1053217",
        "paper_author": "Lu S.",
        "affiliation_name": "Central South University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60017060"
    },
    {
        "paper_title": "Effect of Treatment Solution Chemistry and Soil Engineering Properties due to Microbially Induced Carbonate Precipitation Treatments on Vegetation Health and Growth",
        "publication": "ACS ES and T Engineering",
        "citied_by": "6",
        "cover_date": "2022-12-09",
        "Abstract": "Microbially induced carbonate precipitation (MICP) is a soil stabilization technique that relies on natural biological processes to improve engineering properties of soil. This biological soil improvement method has gained popularity over the last decade. However, the unanticipated consequences of this method on vegetation and the environment are still unclear. This study presents the first attempt to strategically investigate the interaction between the MICP-treatment technique and vegetation health and growth. Bermuda grass was treated with different concentrations of MICP solution constituents and byproducts to identify the chemical(s) responsible for changes in plant health (e.g., dry blades) and to establish an appropriate concentration range. In addition, phosphorus was added to the treatment solution to mitigate the dryness of MICP-treated plants. Visual MINTEQ analyses were used to determine the optimum phosphorus concentration to still encourage sufficient calcite precipitation. Elemental analyses were used to confirm the compatibility of the added phosphorus concentrations with MICP. Post-treatment effect of MICP on seed growth was investigated by planting seeds in soils treated to varying cementation levels. Up to a certain improvement level, cementation formation did not affect seed germination and growth. However, higher levels of cementation hindered root growth and vegetation coverage. The findings of this study provide implications and directions regarding vegetation growth and establishment for future field implementation of MICP.",
        "DOI": "10.1021/acsestengg.2c00196",
        "paper_author": "Ghasemi P.",
        "affiliation_name": "NC State College of Engineering",
        "affiliation_city": "Raleigh",
        "affiliation_country": "United States",
        "affiliation_id": "60279548"
    },
    {
        "paper_title": "Recent Advances in DNA-Based Cell Surface Engineering for Biological Applications",
        "publication": "Chemistry - A European Journal",
        "citied_by": "9",
        "cover_date": "2022-12-09",
        "Abstract": "Due to its excellent programmability and biocompatibility, DNA molecule has unique advantages in cell surface engineering. Recent progresses provide a reliable and feasible way to engineer cell surfaces with diverse DNA molecules and DNA nanostructures. The abundant form of DNA nanostructures has greatly expanded the toolbox of DNA-based cell surface engineering and gave rise to a variety of novel and fascinating applications. In this review, we summarize recent advances in DNA-based cell surface engineering and its biological applications. We first introduce some widely used methods of immobilizing DNA molecules on cell surfaces and their application features. Then we discuss the approaches of employing DNA nanostructures and dynamic DNA nanotechnology as elements for creating functional cell surfaces. Finally, we review the extensive biological applications of DNA-based cell surface engineering and discuss the challenges and prospects of DNA-based cell surface engineering.",
        "DOI": "10.1002/chem.202202070",
        "paper_author": "Li L.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356"
    },
    {
        "paper_title": "OPTICAL CHARACTERISTICS OF SILVER NANOPARTICLES OBTAINED USING Artemisia tilesii Ledeb. \"HAIRY\" ROOT EXTRACTS WITH HIGH FLAVONOID CONTENT",
        "publication": "Innovative Biosystems and Bioengineering",
        "citied_by": "0",
        "cover_date": "2022-12-08",
        "Abstract": "Background. \"Hairy\" roots can be used for production of plant-derived secondary metabolites, such as flavo-noids, which have antioxidant and reducing properties. It seems promising to use the process of silver nano-particles formation as a method of determining the level of reducing power. This approach allows simul-taneously to obtain nanoparticles with different biological activity and evaluate the reducing potential of different plants. Objective. The aim of the study was to determine the dependence of optical properties (ultraviolet/visible spectroscopy, UV-Vis spectra) of solutions of silver nanoparticles obtained using wormwood \"hairy\" root extracts on the content of flavonoids as compounds with reducing activity. Methods. Four Artemisia tilesii “hairy” root lines from the collection of the Institute of Cell Biology and Genetic Engineering NAS of Ukraine were grown for five weeks in liquid 1/2 MS medium with 20 g/l sucrose. \"Hairy\" roots were homogenized in 70% ethanol, the extracts were centrifuged, total flavonoid content was determined, and extracts were used for the silver nanoparticles preparation via reduction of Ag+ to Ag0 from AgNO3. UV-Vis spectra at 300–600 nm range were recorded right after colloid solution preparation, in five, and in nine days. Results. Total flavonoid content varied from 4.01 ± 0.39 to 15.37 ± 1.08 mg RE/g FW. The UV-Vis spectra curves of absorption increased with the course of time, mostly from day 0 to day 5. At this period, absorption at 370–500 nm wavelength increased almost twofold. The peak absorption of all samples was detected at 440 nm, and the maximum values at the wavelength of 440 nm correlated with the content of flavonoids. This correlation did not change over time. Conclusions. The optical properties of silver nanoparticles colloid solutions obtained using A. tilesii \"hairy\" root extracts correlated with the total flavonoid content of the samples. Even though the absorbance of the colloid solutions increased with time, those increases correlated with flavonoid content as well. The determi-nation of the optical properties of AgNPs colloid solution can be used as a convenient way of quickly com-paring the reducing ability of extracts both right after the formation of a colloidal solution and after some time of its storage.",
        "DOI": "10.20535/ibb.2022.6.3-4.271259",
        "paper_author": "Bohdanovych T.A.",
        "affiliation_name": "Institute of Cell Biology and Genetic Engineering, National Academy of Sciences of Ukraine",
        "affiliation_city": "Kyiv",
        "affiliation_country": "Ukraine",
        "affiliation_id": "60104367"
    },
    {
        "paper_title": "Regulatory roles of RpoS in the biosynthesis of antibiotics 2,4-diacetyphloroglucinol and pyoluteorin of Pseudomonas protegens FD6",
        "publication": "Frontiers in Microbiology",
        "citied_by": "6",
        "cover_date": "2022-12-08",
        "Abstract": "The rhizosphere microbe Pseudomonas protegens FD6 possesses beneficial traits such as the production of antibiotics like pyoluteorin (Plt) and 2,4-diacetylphloroglucinol (2,4-DAPG). The alternative RpoS (σ38 factor), as a master regulator, activates or inhibits the transcription of stationary phase genes in several biocontrol organisms. Here, we investigated the complicated function and regulatory mechanism of RpoS in the biosynthesis of 2,4-DAPG and Plt in strain FD6. Phenotypic assays suggested that ΔrpoS was impaired in biofilm formation, swimming motility, swarming motility, and resistance to stress, such as heat, H2O2 and 12% ethanol. The RpoS mutation significantly increased both 2,4-DAPG and Plt production and altered the transcription and translation of the biosynthetic genes phlA and pltL, indicating that RpoS inhibited antibiotic production by FD6 at both the transcriptional and translational levels. RpoS negatively controlled 2,4-DAPG biosynthesis and transcription of the 2,4-DAPG operon phlACBD by directly interacting with the promoter sequences of phlG and phlA. In addition, RpoS significantly inhibited Plt production and the expression of its operon pltLABCDEFG by directly binding to the promoter regions of pltR, pltL and pltF. Further analyzes demonstrated that a putative R147 mutation in the RpoS binding domain abolished its inhibitory activity on the expression of pltL and phlA. Overall, our results reveal the pleiotropic regulatory function of RpoS in P. protegens FD6 and provide the basis for improving antibiotic biosynthesis by genetic engineering in biocontrol organisms.",
        "DOI": "10.3389/fmicb.2022.993732",
        "paper_author": "Zhang Q.X.",
        "affiliation_name": "Yangzhou University",
        "affiliation_city": "Yangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60007381"
    },
    {
        "paper_title": "Multi-omics revolution to promote plant breeding efficiency",
        "publication": "Frontiers in Plant Science",
        "citied_by": "38",
        "cover_date": "2022-12-08",
        "Abstract": "Crop production is the primary goal of agricultural activities, which is always taken into consideration. However, global agricultural systems are coming under increasing pressure from the rising food demand of the rapidly growing world population and changing climate. To address these issues, improving high-yield and climate-resilient related-traits in crop breeding is an effective strategy. In recent years, advances in omics techniques, including genomics, transcriptomics, proteomics, and metabolomics, paved the way for accelerating plant/crop breeding to cope with the changing climate and enhance food production. Optimized omics and phenotypic plasticity platform integration, exploited by evolving machine learning algorithms will aid in the development of biological interpretations for complex crop traits. The precise and progressive assembly of desire alleles using precise genome editing approaches and enhanced breeding strategies would enable future crops to excel in combating the changing climates. Furthermore, plant breeding and genetic engineering ensures an exclusive approach to developing nutrient sufficient and climate-resilient crops, the productivity of which can sustainably and adequately meet the world’s food, nutrition, and energy needs. This review provides an overview of how the integration of omics approaches could be exploited to select crop varieties with desired traits.",
        "DOI": "10.3389/fpls.2022.1062952",
        "paper_author": "Mahmood U.",
        "affiliation_name": "Southwest University",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60122052"
    },
    {
        "paper_title": "Recent advances of graphene-biomacromolecule nanocomposites in medical applications",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "16",
        "cover_date": "2022-12-08",
        "Abstract": "In recent years, graphene-based composites have received increasing attention due to their high biocompatibility, large specific surface area, high electrical conductivity and unique mechanical properties. The combination of biomacromolecules and graphene provides a promising route for the preparation of novel graphene-based nanocomposites. Novel graphene-based nanocomposites with unique functions could be applied to medicine, biology, biosensors, environmental science, energy storage and other fields. Graphene-biomacromolecule nanocomposites have excellent biocompatibility, outstanding biofunctionality and low cytotoxicity, and have more advantages and development prospects than other traditional graphene-based materials in biological and biomedical fields. In this work, we summarize the research on the covalent and non-covalent interactions between different biomacromolecules (peptides, DNA/RNA, proteins and enzymes) and graphene, as well as the synthesis methods of novel functionalized graphene-biomacromolecule composites in recent years. We mainly introduce the recent advances (last 5 years) of graphene-biomacromolecule nanocomposites in medical applications, such as medical detection and disease treatment. We hope that this review will help readers to understand the methods and mechanisms of biomolecules modifying the surface of graphene, as well as the synthesis and application of graphene-based nanocomposites, which will promote the future developments of graphene-biomolecule composites in biomedicine, tissue engineering, materials engineering, and so on.",
        "DOI": "10.1039/d2tb01962k",
        "paper_author": "Wang Y.",
        "affiliation_name": "Jilin Normal University",
        "affiliation_city": "Siping",
        "affiliation_country": "China",
        "affiliation_id": "60016112"
    }
]