[
    {
        "paper_title": "Modeling and simulation of whole-link SNR of fluorescence endoscope",
        "publication": "Infrared and Laser Engineering",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "Objective For fluorescence endoscopic imaging system, the depth of tumor detection determined by the signal-to-noise ratio of the fluorescence image is the core index of its detection ability, which directly affects the effect of tumor resection. During the design process of rigid endoscopic systems, under the condition of working distance determination, the signal-to-noise ratio is determined by the entrance pupil diameter, excitation light irradiance, fluorescent probe concentration, integration time, noise and so on together. Traditional design methods do not consider either the propagation process of illumination light in biological tissues nor the response of the detector, so that the optical design and biological tissues are isolated from each other. The overall performance of endoscope system cannot be optimized theoretically. The overall design index lacks the theoretical guidance of the signal-to-noise ratio model. At present, most of the tumor depth is estimated by CT, ultrasound and other diagnostic means, and there is a lack of assessment methods using fluorescence endoscopy. So, it’s necessary to apply auxiliary diagnosis by other methods while using fluorescence endoscopy, which does not meet the practical application requirements. Therefore, it is necessary to establish an whole-link signal-to-noise model, which not only provides theoretical guidance and basis for the design of fluorescent rigid endoscopes, but also aids in intraoperative tumor localization by combining the advantages of fluorescent endoscopes in terms of high image contrast, fast imaging speed, low adverse reaction and non-contact measurement. Methods Firstly, starting from the illumination of the end face of the optical fiber, photometric theory is used to calculate the luminescence intensity and the surface irradiance of biological tissues at the working distance of the endoscope. And then the propagation of photons in the tissue body is simulated through the Monte Carlo method, some of the fluorescence generated by it will be transmitted outside the tissues at the same time. The internal distribution of light in biological tissues and its external radiation intensity are calculated based on theory, which can help to obtain the irradiance at the pupil entrance of the fluorescent endoscope. Secondly, the fluorescence is gain-focused on a CMOS detector image through the fluorescent endoscope optics. The noise of the background, detector, and readout circuit is taken into account subsequently. So, the relationship between the signal-to-noise ratio of fluorescence endoscopic imaging and the depth of tumor detection is finally derived (Fig.2). Results and Discussions When a Gaussian beam with a total power of 2 W, divergence half angle of 45°, and wavelength of 808 nm is incident vertically (Tab.1) and transmitted to a depth of greater than 46 mm from the light source, the irradiance of the excited fluorescence reaching the surface of tissue is much less than 10-30 W/m2, which can hardly be received by the detector (Fig.6). When the tumor radius increases from 0.5 mm to 5 mm,the maximum depth of the tumor that fluorescence can reach the surface of tissue increases from 36 mm to 44 mm from the light source (Tab.4). Moreover, when the tumor center is 35 mm from the light source, the fluorescence center irradiance on tissue surface of the tumor with a radius of 5 mm and that of the tumor with a radius of 2.5 mm increases by a factor of 63. The mean irradiance values of fluorescence excited at a depth of 6 mm within the tissue body and at the surface of the tissue body for tumors of radius 2 mm, 3 mm, 4 mm, and 5 mm centered at z=35 mm from the light source are roughly 100-fold, 50-fold, 10-fold, and 5-fold different, respectively, for tumors of the same radius (Fig.7). The fluorescence center irradiance of a tumor with a radius of 5 mm and a center distance of 35 mm from the light source on the surface of the tissue is 35.28 W/m2. And the signal-to-noise ratio of the whole-link system is 34.64 dB under the circumstances, which is of good imaging quality (Fig.8). As the radius of the tumor decreases and the center of the tumor deepens, the number and energy of fluorescent photon packets reaching the surface of the tissue are reduced, which results in non-statistical simulation results, so that the signal-to-noise ratio of the whole-link system fluctuates and attenuates. In addition, when the radius of the tumor is less than 2 mm, it is beyond the endoscopic detection ability to measure small volume tumors in deeper locations. Conclusions The process of establishing the whole-link signal-to-noise ratio model of the fluorescence endoscope system and using it to simulate the depth of tumor detection is proposed. Not only a two-layer tissue-tumor model is established, but also the interaction of photons with the tissue body and the process of fluorescent molecular probes being excited to fluorescence are taken into account. According to the above, the in vivo light distribution law of the biological tissues is obtained and the relationship between the fluorescence endoscopic whole-link signal-to-noise ratio and the depth of tumor detection has been analyzed. This fluorescence endoscopic tumor detection depth analysis method provides theoretical guidance to reduce the detection error. Therefore, it can improve the detection depth and sensitivity of small tumors and metastatic lesion, providing a guarantee for accurate tumor resection.",
        "DOI": "10.3788/IRLA20240356",
        "paper_author": "Qiu M.",
        "affiliation_name": "Yantai University",
        "affiliation_city": "Yantai",
        "affiliation_country": "China",
        "affiliation_id": "60025939"
    },
    {
        "paper_title": "Non-thermal processing of functional foods",
        "publication": "Non-Thermal Processing of Functional Foods",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "Functional foods, also known as nutraceuticals, began to gain prominence in the 1980s in Japan as \"foods for specified health use\" and became more widely recognized in the 1990s as research and interest in foods that could provide specific health benefits beyond essential nutrition grew worldwide. These foods are typically enriched with bioactive components or formulated to contain substances or live microorganisms with a possible health-enhancing or disease-preventing value and at a safe and sufficiently high concentration to achieve the intended benefit. Usually, the added ingredients are classified as nutrients, dietary fiber, phytochemicals, other substances, or probiotics. The production, storage, and consumer consumption of these functional foods require special attention to preserve quality attributes. The production process of these foods can be classified as conventionally used thermal processing methods and non-thermal alternatives. In addition, these processes may be combined with biological approaches involving enzymatic treatment and fermentation. The various non-thermal processes, such as ultrasounds, high-hydrostatic pressure, vacuum impregnation, high-voltage electrical discharge, cold plasma, pulsed light, ozonation, etc., can be utilized for a product to sustain/preserve quality attributes of the ingredients, long shelf life, and sensory qualities. This book compiles the latest non-thermal processing technologies to develop functional foods. The book discusses bioactivity, bioaccessibility, and bioavailability related to nutrition and functional food ingredients. It has 16 articles on different aspects of non-thermal processing technologies. Chapter 1 has discussed a general overview of emerging technologies, and various non-thermal processing techniques are discussed in Chapters 2-6, 8-9, and 12. Chapters 7, 11, 13, 15, and 16 discuss food safety and preservation. We have discussed the functional foods and bioactive compounds in Chapters 10 and 14. A few of these reviews discuss the impact of developing non-thermal technologies on several food components (proteins, carbohydrates, lipids, minerals, vitamins, polyphenols, glucosinolates, fragrance compounds, and enzymes) while maintaining the structure and functional properties. This book is an excellent source of information for professionals, postgraduate students, and researchers in food sciences and chemical engineering.",
        "DOI": "10.1201/9781003436560",
        "paper_author": "Pattanayek S.K.",
        "affiliation_name": "Indian Institute of Technology Delhi",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60032730"
    },
    {
        "paper_title": "Bright Quantum-Grade Fluorescent Nanodiamonds",
        "publication": "ACS Nano",
        "citied_by": "1",
        "cover_date": "2024-12-31",
        "Abstract": "Optically accessible spin-active nanomaterials are promising as quantum nanosensors for probing biological samples. However, achieving bioimaging-level brightness and high-quality spin properties for these materials is challenging and hinders their application in quantum biosensing. Here, we demonstrate bright fluorescent nanodiamonds (NDs) containing 0.6-1.3-ppm negatively charged nitrogen-vacancy (NV) centers by spin-environment engineering via enriching spin-less 12C-carbon isotopes and reducing substitutional nitrogen spin impurities. The NDs, readily introduced into cultured cells, exhibited improved optically detected magnetic resonance (ODMR) spectra; peak splitting (E) was reduced by 2-3 MHz, and microwave excitation power required was 20 times lower to achieve a 3% ODMR contrast, comparable to that of conventional type-Ib NDs. They show average spin-relaxation times of T1 = 0.68 ms and T2 = 3.2 μs (1.6 ms and 5.4 μs maximum) that were 5- and 11-fold longer than those of type-Ib, respectively. Additionally, the extended T2 relaxation times of these NDs enable shot-noise-limited temperature measurements with a sensitivity of approximately (Formula Presented). The combination of bulk-like NV spin properties and enhanced fluorescence significantly improves the sensitivity of ND-based quantum sensors for biological applications.",
        "DOI": "10.1021/acsnano.4c03424",
        "paper_author": "Oshimi K.",
        "affiliation_name": "Okayama University",
        "affiliation_city": "Okayama",
        "affiliation_country": "Japan",
        "affiliation_id": "60023147"
    },
    {
        "paper_title": "In Vivo Surface-Enhanced Transmission Raman Spectroscopy and Impact of Frozen Biological Tissues on Lesion Depth Prediction",
        "publication": "ACS Nano",
        "citied_by": "1",
        "cover_date": "2024-12-31",
        "Abstract": "Plasmonic surface-enhanced transmission Raman spectroscopy (SETRS) has emerged as a promising optical technique for detecting and predicting the depths of deep-seated lesions in biological tissues. However, in vivo studies using SETRS are scarce and typically show shallow penetration depths. Moreover, the optical parameters used in the prediction process are often derived from frozen samples and there is limited understanding of how freezing affects the optical properties of biological tissues and the accuracy of depth prediction in living models. In this work, we conduct in vivo SETRS measurements on thick abdominal tissue region of the live rats to investigate the impact of freezing on the measured optical properties for the purpose of depth prediction. First, we fabricated ultrahigh bright surface-enhanced Raman spectroscopy (SERS) nanotags and utilized a custom transmission Raman system. We then measured the change of optical attenuation at two different wavelengths (Δμ) for four types of rat tissues (including skin, fat, muscle, and liver) following freezing. The freezing process dramatically affects Δμ values, even after only 1 day of freezing. In contrast, Δμ values obtained from fresh samples enable precise localization of SERS lesion phantoms in the live rat with only 5% deviation. The total thickness of the live rat is 2.6 cm, which, to the best of our knowledge, is the highest value of in vivo SETRS studies so far. This work helps to fill the gap in the SERS field of tissue localization and optical coefficient studies in highly heterogeneous tissues, and demonstrates the potential of the SETRS technique to achieve precise clinical localization of deep lesions.",
        "DOI": "10.1021/acsnano.4c12469",
        "paper_author": "Zhou Y.",
        "affiliation_name": "Shanghai Jiao Tong University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025084"
    },
    {
        "paper_title": "Development of a β-Arbutin Hyperproducer in Escherichia coli by Rational Modular and Transcription Factor Engineering",
        "publication": "ACS Sustainable Chemistry and Engineering",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "β-Arbutin is a valuable aromatic compound with multiple biological activities. The exploitation of efficient engineering microbial platforms for β-arbutin production has been an appealing research avenue in recent years due to l-tyrosine auxotrophy and the limited distribution of metabolic flux. Herein, an inducer-free and nonauxotrophic cell factory is successfully constructed in Escherichia coli toward high-titer β-arbutin production by combining metabolic engineering strategies. First, the β-arbutin de novo synthesis pathway was constructed, and the expression level of the heterologous enzyme was optimized by promoter engineering. Next, the biosynthetic pathway was modified by rational modular engineering strategies to further enhance β-arbutin production. Subsequently, the transcription factor TorI was identified to negatively regulate β-arbutin biosynthesis based on transcriptomic data. Finally, a dynamic toggle switch controlling the expression of the tyrA gene was designed to reconstruct a nonauxotrophic pathway for β-arbutin production. Without additional supplements of l-tyrosine, the final engineering strain AT25 generated the highest production level ever reported among inducer-free, nonauxotrophic strains, producing 30.52 g/L β-arbutin with a productivity of 0.51 g/L/h. The systematic strategies demonstrated in this study can provide a reference for establishing efficient microbial cell factories for the production of β-arbutin together with other aromatic compounds.",
        "DOI": "10.1021/acssuschemeng.4c06838",
        "paper_author": "Jiang S.",
        "affiliation_name": "Jiangnan University",
        "affiliation_city": "Wuxi",
        "affiliation_country": "China",
        "affiliation_id": "60007029"
    },
    {
        "paper_title": "Engineering terpene synthases and their substrates for the biocatalytic production of terpene natural products and analogues",
        "publication": "Chemical Communications",
        "citied_by": "0",
        "cover_date": "2024-12-28",
        "Abstract": "Terpene synthases produce a wide number of hydrocarbon skeletons by controlling intramolecular rearrangements of allylic pyrophosphate subtrates via reactive carbocation intermediates. Here we review recent research focused on engineering terpene synthases and modifying their substrates to rationally manipulate terpene catalyisis. Molecular dynamic simulations and solid state X-ray crystallography are powerful techniques to identify substrate binding modes, key active site residues for substrate folding, and the location of active site water. Variants in specific 'hotspots' of terpene synthases including the G1/2, K/H and Ha-1 helices have been targeted to modify active site water management and yield new products. We discuss the potential of exploiting substrate analogues to synthesise novel compounds and briefly outline biphasic flow systems for biocatalysis of terpenes. We forsee greater applications for terpenes as the field converges on effective methods for engineering of terpene synthases by new computational and high throughput experimental methods and for high-yield production. It is crucial when engineering terpene synthases that both product distribution and enzyme activity are simultaneously optimised.",
        "DOI": "10.1039/d4cc05785f",
        "paper_author": "Johnson L.A.",
        "affiliation_name": "Cardiff University",
        "affiliation_city": "Cardiff",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60023998"
    },
    {
        "paper_title": "Decellularized Matrix Scaffolds for Vascular Transplantation: Addressing Immunogenicity, Sterilization, and Current Strategies for Long-Term Storage",
        "publication": "Ukrainskyi Zhurnal Sertsevo-sudynnoi Khirurhii",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Cardiovascular diseases are the leading cause of death globally, with their incidence rising rapidly. For obstructive cardiovascular diseases, definitive treatment options include surgical interventions such as vascular stenting, replacement surgery, or vascular bypass. Decellularized extracellular matrix scaffolds, designed through tissue engineering, hold great potential in addressing the donor shortage issue. The aim. To conduct a comparative analysis of sterilization methods for decellularized matrix scaffolds used in vascular transplantation, based on information from open sources. Materials and methods. Publications were selected from the databases PubMed, Clinical Key Elsevier, Cochrane Library, eBook Business Collection, and Google Scholar, focusing on sterilization methods for decellularized matrix scaffolds. The literature search used keywords such as tissue engineering, decellularization, extracellular matrix, sterilization, gamma sterilization, and acellular transplant. Results. The transplantation of synthetic scaffolds into the human body triggers an immune response to foreign materials. Ideal sterilization or disinfection for decellularized extracellular matrix should effectively eliminate microorganisms while ensuring the sterilized material is non-toxic and preserves physical and chemical properties, as well as biological activity of the biomaterial. Radiation sterilization primarily involves gamma irradiation from Cobalt-60 isotopes and electron beams generated by electron accelerators. In addition to sterilization, decellularized tissue constructs require long-term preservation methods, including cryopreservation, lyophilization, and the use of antibiotics and antifungals stored at –20 °C to –80 °C. Conclusions. Decellularized tissue is receiving significant attention as a potential biological scaffold, as it retains the structure and functions of the extracellular matrix. The application of sterilization methods, such as gamma irradiation from Cobalt-60, ensures deep penetration and preservation of physical properties of the materials.",
        "DOI": "10.30702/ujcvs/24.32(04)/ShL061-7890",
        "paper_author": "Shevchenko Y.V.",
        "affiliation_name": "V. N. Karazin Kharkiv National University",
        "affiliation_city": "Kharkiv",
        "affiliation_country": "Ukraine",
        "affiliation_id": "60027251"
    },
    {
        "paper_title": "3D printed magnetoactive nanocomposite scaffolds for bone regeneration",
        "publication": "Biomedical materials (Bristol, England)",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Simulating the natural cellular environment using magnetic stimuli could be a potential strategy to promote bone tissue regeneration. This study unveiled a novel 3D printed composite scaffold containing polycaprolactone (PCL) and cobalt ferrite/forsterite core-shell nanoparticles (CFF-NPs) to investigate physical, mechanical and biological properties of magnetoactive scaffold under static magnetic field. For this purpose, core-shell structure is synthesized through a two-step synthesis strategy in which cobalt ferrite nanoparticles are prepared via sol-gel combustion method and then are coated through sol-gel method with forsterite. The characterization regarding CFF-NPs reveals that Mg2SiO4-coated CoFe2O4nanoparticles is successfully synthesized with a core-shell structure. Afterwards, CFF-NPs are embedded within the PCL with different percentages, ultimately 3D printed scaffolds were fabricated. Thein vitroassessments demonstrated that the incorporated CFF-NPs are able to cause a decrease in contact angle which was responsible for modulating purposefully the degradation rate of PCL scaffold, resulting in providing the obligatory environment for bone growth. In addition, it was observed that scaffolds including PCL combined with CFF-NPs are susceptible to improve the mechanical performance of nanocomposite scaffolds, up to a certain concentration (50% CFF-NPs and 50% PCL) with compressive modulus of 42.5 MPa. Moreover, when being exposed to simulated body fluid (SBF) solution, hydroxyapatite deposition on the surface of scaffolds was observed. Thus, these compositions may be useful for improving the osteointegration between the implant and bone tissue after implantation. Finally, the simultaneous effect of magnetic nanoparticles and magnetic field of 125 mT evaluated on cellular behavior of scaffolds. The results showed that the cell viability of all groups under magnetic field were better than that for standard condition. Likewise, SEM images of cultured cells on scaffolds confirmed that the combined effect of these factors could be lead to promote better cell adhesion, dispersion, and bone regeneration.",
        "DOI": "10.1088/1748-605X/ad9f04",
        "paper_author": "Kaviani Y.",
        "affiliation_name": "Meybod University",
        "affiliation_city": "Meybod",
        "affiliation_country": "Iran",
        "affiliation_id": "60278291"
    },
    {
        "paper_title": "Nanoliposome functionalized colloidal GelMA inks for 3D printing of scaffolds with multiscale porosity",
        "publication": "Biofabrication",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Bioprinting has enabled the creation of intricate scaffolds that replicate the physical, chemical, and structural characteristics of natural tissues. Recently, hydrogels have been used to fabricate such scaffolds for several biomedical applications and tissue engineering. However, the small pore size of conventional hydrogels impedes cellular migration into and remodeling of scaffolds, diminishing their regenerative potential. Porous scaffolds have been utilized for their improved diffusion of nutrients, dissolved oxygen, and waste products. However, traditional methods of generating porous structures require multiple processing steps, making them incompatible with bioprinting. Recently, we developed a method to generate multi-scale porous structures by foaming hydrogel precursors prior to printing to form colloidal bioinks. Here, to further improve the biological, mechanical, and physical properties, we functionalize colloidal bioinks with nanoliposomes (NLs), one of the most promising methods for bioactive delivery. We assess the impact of the concentration of NL on the characteristics of bioinks made from gelatin methacryloyl (GelMA) and their resulting scaffolds. Anionic liposomes made from rapeseed lecithin of 110 nm were synthesized and found to be stable over several weeks. Increasing concentrations of NL decreased the zeta potential and increased the viscosity of foamed bioinks, improving their rheological properties for printing. Furthermore, the incorporation of NL allowed for precise adjustment of the macropore size and bulk mechanical properties without any chemical interaction or impact on photocrosslinking. The nanofunctionalized foam bioinks, composed exclusively of natural components, demonstrated significant antioxidant activity and were printed into multilayered scaffolds with high printability. The foam-embedded NL showed remarkable biocompatibility with myoblasts, and cell-laden bioinks were able to be successfully bioprinted. Due to their high biocompatibility, tunable mechanical properties, printability, and antioxidant behavior, the nanofunctionalized porous scaffolds have promise for a variety of biomedical applications, including those that require precise delivery of therapeutic substances and tissue engineering.",
        "DOI": "10.1088/1758-5090/ad9a01",
        "paper_author": "Omidvari E.",
        "affiliation_name": "Laboratoire d'Ingénierie des Biomolécules",
        "affiliation_city": "Vandoeouvre-les-Nancy",
        "affiliation_country": "France",
        "affiliation_id": "60138540"
    },
    {
        "paper_title": "Discovery of Cyclic Lipopeptides, Octaminomycins C and D, by Engineering LysR Transcriptional Regulator of Streptomyces sp.",
        "publication": "Journal of Natural Products",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "New lipodepsipeptides, octaminomycins C and D (1 and 2), were discovered in an engineered Streptomyces sp. strain overexpressing the LysR transcriptional regulator family. The structures of 1 and 2 were elucidated by comprehensive analysis of their UV, HRMS, and NMR data. The absolute configurations were determined using spectroscopic analysis, the advanced Marfey’s method, and genomic analysis. Genomic analysis enabled the identification of the nonribosomal peptide synthetase (NRPS) biosynthetic pathway of the octaminomycins.",
        "DOI": "10.1021/acs.jnatprod.4c01047",
        "paper_author": "An J.S.",
        "affiliation_name": "Natural Products Research Institute",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60120244"
    },
    {
        "paper_title": "A Visible/NIR-II Ratiometric Fluorescent Nanoprobe for Tissue Depth Analysis",
        "publication": "ACS Applied Nano Materials",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Fluorescence imaging is a promising approach for in vivo real-time two-dimensional (2D) visualization of biological structures. However, it is still a challenging problem to acquire depth information conveniently from 2D images. Herein, we developed a visible/second near-infrared (NIR-II) ratiometric fluorescence strategy to acquire tissue depth from 2D fluorescence imaging. A ratiometric fluorescent probe TAC NSs that emitted red and NIR-II fluorescence was prepared through electrostatic interactions between poly(ethylene-imine)-modified Ti3C2 MXene nanosheets and CdTe and Ag2S quantum dots (QDs). The visible/NIR-II fluorescence ratio decreased exponentially with increasing tissue depth, and its natural logarithm (ln) values shows good linear relationship with tissue depth in the range of 0-1.0 mm and 1-2.5 mm, respectively. Notably, the ratiometric fluorescence at a fixed tissue depth is not affected by the concentration of TAC NSs, indicating that the tissue depth analysis is not interfered by the nonuniform tissue distribution of TAC NSs. Moreover, the TAC NSs exhibited efficient photothermal conversion ability for tumor ablation. This work can provide a strategy for acquiring three-dimensional information from in vivo fluorescence imaging.",
        "DOI": "10.1021/acsanm.4c05792",
        "paper_author": "Li H.",
        "affiliation_name": "Zhongnan Hospital of Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60122389"
    },
    {
        "paper_title": "Discovery of Ureido-Containing Alteropeptilides and Intramolecular Cyclized Alteramides in Pseudoalteromonas flavipulchra S16 by Promoter Engineering of Cryptic Biosynthetic Gene Clusters",
        "publication": "Journal of Natural Products",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Pseudoalteromonas are abundant in the oceans and possess great potential in the synthesis of bioactive natural products. Although many secondary metabolite biosynthetic gene clusters have been identified from Pseudoalteromonas genomes, most of their products have not been characterized. In this study, endogenous constitutive promoters with high transcriptional activity were obtained from Pseudoalteromonas flavipulchra S16 through RNA-seq and a fluorescence assay of luciferase gene expression. Through in situ promoter replacement two silent biosynthetic gene clusters (BGCs) were successfully activated, leading to production of intramolecular cyclized alteramides and two novel ureido-containing linear peptides, alteropeptilides. This study provides a feasible approach for the activation of silent BGCs and the mining of novel compounds from marine bacteria.",
        "DOI": "10.1021/acs.jnatprod.4c00965",
        "paper_author": "Feng R.",
        "affiliation_name": "Shandong University",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60031031"
    },
    {
        "paper_title": "Rational Fabrication of Functionally-Graded Surfaces for Biological and Biomedical Applications",
        "publication": "Accounts of Materials Research",
        "citied_by": "1",
        "cover_date": "2024-12-27",
        "Abstract": "Conspectus As a ubiquitous feature of the biological world, gradation, in either composition or structure, is essential to many functions and processes. Taking protein gradation as an example, it plays a pivotal role in the development and evolution of human bodies, including stimulation and direction of the outgrowth of peripheral nerves in a developing fetus. It is also critically involved in wound healing by attracting and guiding immune cells to the site of injury or infection. Another good example can be found in the tendon-to-bone enthesis that relies on gradations in composition, structure, and cell phenotype to create a gradual change in mechanical stiffness. It is these unique gradations that eliminate the high level of stress at the interface, enabling the effective transfer of mechanical load from tendon to bone. How to fabricate and utilize graded surfaces and materials has been a constant theme of research in the context of materials science, chemistry, cell biology, and biomedical engineering. In cell biology, for example, graded surfaces are employed to investigate the fundamental mechanisms related to embryo development and to elucidate cell behaviors under chemo-, hapto-, or mechano-taxis. Scaffolds based upon graded materials have also been widely explored to enhance tissue repair or regeneration by accelerating cell migration and/or controlling stem cell differentiation. In this Account, we review our efforts in the fabrication and utilization of functionally graded surfaces. The gradation typically occurs as gradual changes in terms of composition, structure (e.g., pore size or fiber alignment), and/or coverage density of molecular species or larger objects such as particles and cells. Specifically, we focus on two strategies for generating various types of gradations along the surface of a substrate. In the first strategy, the substrate is vertically placed in a container, followed by the addition of a solution containing the functional component at a constant rate. Owing to the variations in contact time, the amount of the component deposited on the substrate naturally takes a gradual change along the vertical direction. In the second strategy, a moving collector or mask is used to control the amount of the component deposited on a substrate during jet printing or electrospray. As for applications, we highlight the following examples: (i) promotion of neurite outgrowth for peripheral nerve repair; (ii) acceleration of cell migration for wound closure; and (iii) mimicking of the structure and/or force transition at the tendon-to-bone enthesis for interfacial tissue engineering. The surface gradation can be presented in a uniaxial or radial fashion, and further integrated with the structural features on the underlying substrate to suit a specific application. In addition to general issues such as diversity of the surface gradation and reproducibility of the fabrication method, we also offer perspectives on new directions for future development. The systems and strategies discussed in this Account are expected to open the door to a range of fundamental inquires while enabling various biological and biomedical applications.",
        "DOI": "10.1021/accountsmr.4c00186",
        "paper_author": "Wu T.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434"
    },
    {
        "paper_title": "Automated Microfluidics-Assisted Hydrogel-Based Wet-Spinning for the Biofabrication of Biomimetic Engineered Myotendinous Junction",
        "publication": "Advanced Healthcare Materials",
        "citied_by": "2",
        "cover_date": "2024-12-27",
        "Abstract": "The muscle-tendon junction (MTJ) plays a pivotal role in efficiently converting the muscular contraction into a controlled skeletal movement through the tendon. Given its complex biomechanical intricacy, the biofabrication of such tissue interface represents a significant challenge in the field of musculoskeletal tissue engineering. Herein, a novel method to produce MTJ-like hydrogel yarns using a microfluidics-assisted 3D rotary wet-spinning strategy is developed. Optimization of flow rates, rotational speed, and delivery time of bioinks enables the production of highly compartmentalized scaffolds that recapitulate the muscle, tendon, and the transient MTJ-like region. Additionally, such biofabrication parameters are validated in terms of cellular response by promoting an optimal uniaxial alignment for both muscle and tendon precursor cells. By sequentially wet-spinning C2C12 myoblasts and NIH 3T3 fibroblasts, a gradient-patterned cellular arrangement mirroring the intrinsic biological heterogeneity of the MTJ is successfully obtained. The immunofluorescence assessment further reveals the localized expression of tissue-specific markers, including myosin heavy chain and collagen type I/III, which demonstrate muscle and tenogenic tissue maturation, respectively. Remarkably, the muscle-tendon transition zone exhibits finger-like projection of the multinucleated myotubes in the tenogenic compartment, epitomizing the MTJ signature architecture.",
        "DOI": "10.1002/adhm.202402075",
        "paper_author": "Volpi M.",
        "affiliation_name": "Politechnika Warszawska",
        "affiliation_city": "Warsaw",
        "affiliation_country": "Poland",
        "affiliation_id": "60003675"
    },
    {
        "paper_title": "Tough Cortical Bone-Inspired Tubular Architected Cement-Based Material with Disorder",
        "publication": "Advanced Materials",
        "citied_by": "1",
        "cover_date": "2024-12-27",
        "Abstract": "Cortical bone is a tough biological material composed of tube-like osteons embedded in the organic matrix surrounded by weak interfaces known as cement lines. The cement lines provide a microstructurally preferable crack path, hence triggering in-plane crack deflection around osteons due to cement line-crack interaction. Inspired by this toughening mechanism and facilitated by a hybrid (3D-printing/casting) process, the study engineers architected tubular cement-based materials with the stepwise cracking toughening mechanism, that enables a non-brittle fracture. Using experimental and theoretical approaches, the study demonstrates the competition between tube size and shape on stress intensity factor from which engineering stepwise cracking can emerge. Two competing mechanisms, both positively and negatively affected by the growing tube size, arise to significantly enhance the overall fracture toughness by up to 5.6-fold compared to the monolithic brittle counterpart without sacrificing the specific strength. This is enabled by crack-tube interaction and engineering the tube size, shape, and orientation, which promotes rising resistance-curves (R-curve). “Disorder” curves and statistical mechanics parameters are proposed for the first time to quantitatively characterize the degree of disorder for describing the representation of the architected arrangement of materials in lieu of otherwise inadequate “periodicity” classification and misperceived disorder parameters (perturbation and Voronoi tessellation methods).",
        "DOI": "10.1002/adma.202313904",
        "paper_author": "Gupta S.",
        "affiliation_name": "School of Engineering and Applied Science",
        "affiliation_city": "Princeton",
        "affiliation_country": "United States",
        "affiliation_id": "60141284"
    },
    {
        "paper_title": "Engineering a Mesoporous Silicon Nanoparticle Cage to Enhance Performance of a Phosphotriesterase Enzyme for Degradation of VX Nerve Agent",
        "publication": "Advanced Science",
        "citied_by": "1",
        "cover_date": "2024-12-26",
        "Abstract": "The organophosphate (OP)-hydrolyzing enzyme phosphotriesterase (PTE, variant L7ep-3a) immobilized within a partially oxidized mesoporous silicon nanoparticle cage is synthesized and the catalytic performance of the enzyme@nanoparticle construct for hydrolysis of a simulant, dimethyl p-nitrophenyl phosphate (DMNP), and the live nerve agent VX is benchmarked against the free enzyme. In a neutral aqueous buffer, the optimized construct shows a ≈2-fold increase in the rate of DMNP turnover relative to the free enzyme. Enzyme@nanoparticles with more hydrophobic surface chemistry in the interior of the pores show lower catalytic activity, suggesting the importance of hydration of the pore interior on performance. The enzyme@nanoparticle construct is readily separated from the neutralized agent; the nanoparticle is found to retain DMNP hydrolysis activity through seven decontamination/recovery cycles. The nanoparticle cage stabilizes the enzyme against thermal denaturing and enzymatic (trypsin) degradation conditions relative to free enzyme. When incorporated into a topical gel formulation, the PTE-loaded nanoparticles show high activity toward the nerve agent VX in an ex vivo rabbit skin model. In vitro acetylcholinesterase (AChE) assays in human blood show that the enzyme@nanoparticle construct decontaminates VX, preserving the biological function of AChE when exposed to an otherwise incapacitating dose.",
        "DOI": "10.1002/advs.202409535",
        "paper_author": "Lu Y.S.",
        "affiliation_name": "University of California, San Diego",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60030612"
    },
    {
        "paper_title": "Research Progress of Bacteria and Their Derivatives in the Combination Therapy of Tumors",
        "publication": "China Biotechnology",
        "citied_by": "0",
        "cover_date": "2024-12-25",
        "Abstract": "Cancer remains one of the leading causes of human mortality. Despite significant advances in cancer treatment by modem medicine, traditional therapeutic approaches still face limitations, including inadequate targeting and significant toxic side effects. Nevertheless, the emergence of technological advancements has brought a ray of hope in tumor treatment through the utilization of bacteria and their derivatives, which have unique biological properties. Bacteria, due to their inherent survival characteristics, exhibit highly effective tumor-targeting colonization and direct tumor cell killing capabilities while being amenable to genetic engineering. Consequently, through genetic modification, bacteria and their derivatives can be used as efficient drug delivery vehicles, seamlessly integrating various treatment modalities, including radiotherapy, chemotherapy, and immunotherapy. The combination aims to overcome therapeutic deficiencies, increase the efficacy of tumor treatment, and minimize toxic side effects. This review comprehensively summarizes the latest research progress in optimizing combination therapy strategies using bacteria and their derivatives for tumor treatment. Specifically, it explores the advantages of utilizing bacteria and their derivatives as drug carriers in tumor treatment and outlines methods for engineering bacteria for drug delivery, and elucidates strategies for optimizing combination therapy. The primary objective is to provide a theoretical basis for optimizing anti-tumor treatment strategies, ultimately unlocking the therapeutic potential of bacteria, enhancing the effectiveness of anti-tumor treatment, and providing safer and more effective treatment options for people fighting cancer.",
        "DOI": "10.13523/j.cb.2404030",
        "paper_author": "Pan W.",
        "affiliation_name": "Heilongjiang University",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "60033495"
    },
    {
        "paper_title": "Engineering Escherichia coli for Efficient De Novo Synthesis of Salidroside",
        "publication": "Journal of Agricultural and Food Chemistry",
        "citied_by": "0",
        "cover_date": "2024-12-25",
        "Abstract": "Salidroside is a high-value plant-derived glycoside with diverse biological activities, but the main industrial salidroside production method, extraction from Rhodiola plants, is insufficient to meet the growing market demand. The biosynthetic route via microbial fermentation is a sustainable and eco-friendly alternative method. De novo synthesis of the precursor tyrosol was established by introducing the ARO10 and ADH6 genes. Systematic metabolic engineering resulted in 3.0 g/L tyrosol, but accumulated tyrosol inhibited cell growth. Adaptive evolution produced an evolved strain with a 10.0% higher OD600 and a 3.3 g/L tyrosol titer. Introducing glucosyltransferase AtUGT85A1, and overexpressing phosphoglucose mutase pgm and UDP-glucose pyrophosphorylase galU, achieved de novo synthesis of salidroside. Furthermore, AtUGT85A1 was semirationally engineered, resulting in the A21G mutation, which enhanced salidroside production by 31.2%. The optimally engineered strain produced 16.8 g/L salidroside with 0.4 g/(L h) productivity in a 5 L bioreactor. This study laid a foundation for future industrial production of salidroside and provided important guidance for efficient biosynthesis of other tyrosol derivatives.",
        "DOI": "10.1021/acs.jafc.4c10247",
        "paper_author": "Zeng W.",
        "affiliation_name": "Jiangnan University",
        "affiliation_city": "Wuxi",
        "affiliation_country": "China",
        "affiliation_id": "60007029"
    },
    {
        "paper_title": "Intron RPS25Ai, a Novel DNA Element, Has Global Effects on Synthetic Pathway Engineering by Empowering Protein Synthesis",
        "publication": "Journal of Agricultural and Food Chemistry",
        "citied_by": "0",
        "cover_date": "2024-12-25",
        "Abstract": "Classical genetic components in synthetic biology encompass essential elements of promoters, transcription factors, protein-coding genes, and terminators while both academic and industrial needs require novel engineering tools. Our study explores the potential of introns as versatile, novel biological DNA elements. Using intron RPS25Ai from Saccharomyces cerevisiae, the expression of mCherry was enhanced by 18.4-fold, demonstrating spatiotemporal regulatory patterns at both transcriptional and translational levels. A molecular mechanism study shows that this distinctive fine-tuning control relies on correct splicing events and extends to post-transcriptional processes. Intron RPS25Ai was applied to a heterologous metabolic pathway in engineered yeast, increasing β-carotene production by 4.29-fold. RPS25Ai functioned as a multilevel regulatory genetic element, enabling the increase in the expression of crtYB both at the pre-mRNA (99%) and mature RNA level (64%), with a splicing efficiency of 82%. Furthermore, the intron-engineered strain achieved a genome-scale regulation, upregulating 67% of “intron-containing” genes, with an average expression increase of 27%, compared with the upregulation of only 37% of “no-intron” genes. In addition, RPS25Ai induced a comprehensive rearrangement of ribosomal components, with the expression of 89% of ribosomal genes being upregulated, further empowering protein synthesis in the β-carotene-producing yeast cell factory.",
        "DOI": "10.1021/acs.jafc.4c11278",
        "paper_author": "Lv M.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835"
    },
    {
        "paper_title": "High-Performance Chemigenetic Potassium Ion Indicator",
        "publication": "Journal of the American Chemical Society",
        "citied_by": "0",
        "cover_date": "2024-12-25",
        "Abstract": "Potassium ion (K+) is the most abundant metal ion in cells and plays an indispensable role in practically all biological systems. Although there have been reports of both synthetic and genetically encoded fluorescent K+ indicators, there remains a need for an indicator that is genetically targetable, has high specificity for K+ versus Na+, and has a high fluorescent response in the red to far-red wavelength range. Here, we introduce a series of chemigenetic K+ indicators, designated as the HaloKbp1 series, based on the bacterial K+-binding protein (Kbp) inserted into HaloTag7 self-labeled with environmentally sensitive rhodamine derivatives. This series of high-performance indicators features high brightness in the red to far-red region, large intensiometric fluorescence changes, and a range of Kd values. We demonstrate that they are suitable for the detection of physiologically relevant K+ concentration changes such as those that result from the Ca2+-dependent activation of the BK potassium channel.",
        "DOI": "10.1021/jacs.4c10917",
        "paper_author": "Cheng D.",
        "affiliation_name": "The University of Tokyo",
        "affiliation_city": "Tokyo",
        "affiliation_country": "Japan",
        "affiliation_id": "60025272"
    },
    {
        "paper_title": "Research advances in bio-inspired superhydrophobic surface: Bridging nature to practical applications",
        "publication": "Journal of Industrial and Engineering Chemistry",
        "citied_by": "4",
        "cover_date": "2024-12-25",
        "Abstract": "Evolved through millennia of natural selection, biological systems have perfected the integration of structure and function. With modern advances in characterization techniques and materials engineering, there has been a surge of interest in biomimetic superhydrophobic surfaces, combining unique structural properties and surface properties to engineer materials with exceptional performance. Through meticulous examination and mimetic replication of distinctive structures found in various natural organisms, engineers have achieved the development of superhydrophobic materials that reflect their specific functionalities, thereby presenting novel solutions to challenges across a spectrum of energy and industrial application domains. The succinct overview of wetting theory pertinent to superhydrophobic surface is briefly introduced in this paper. Besides, selected typical natural organisms are summarized, an in-depth analysis of their multiscale structures and components is offered, especially elucidating the key mechanisms underpinning their distinctive characteristics. Additionally, recent advancements in bio-inspired superhydrophobic surfaces are explored at length, with a focus on self-cleaning, drag reduction, oil–water separation, anti-reflection, and water collection. Lastly, insights into current challenges and future prospects for biomimetic superhydrophobic surfaces are provided.",
        "DOI": "10.1016/j.jiec.2024.05.051",
        "paper_author": "Zhang D.",
        "affiliation_name": "Lanzhou University of Technology",
        "affiliation_city": "Lanzhou",
        "affiliation_country": "China",
        "affiliation_id": "60025945"
    },
    {
        "paper_title": "Unveiling the Molecular Secrets: A Comprehensive Review of Raman Spectroscopy in Biological Research",
        "publication": "ACS Omega",
        "citied_by": "0",
        "cover_date": "2024-12-24",
        "Abstract": "Raman spectroscopy has been proven to be a fast, convenient, and nondestructive technique for advancing our understanding of biological systems. The Raman effect originates from the inelastic scattering of light which directly probe vibration/rotational states in biological molecules and materials. Despite numerous advantages over infrared spectroscopy and continuous technical as well as operational improvement in Raman spectroscopy, an advanced development of the device and more applications have become possible. In this review, we explore the principles, techniques, and myriad applications of Raman spectroscopy in the realm of biology. We begin by providing an overview of Raman spectroscopy, highlighting its significance in unraveling the complexities of biological research. The focus of this review is on Raman spectroscopy concepts and methods, clarifying the fundamentals of Raman scattering and spectral interpretation. The review also highlights the key experimental considerations for productive biological applications. We explore the broad range of Raman applications including molecular structure, biomolecular composition, disease detection, and medication discovery. The Raman imaging and mapping can also be used to visualize biological samples at the molecular level. Raman spectroscopy is still developing, giving fresh insights and remedies, from biosensing to its use in tissue engineering and regenerative medicine. This review sheds light on the past, present, and future of Raman spectroscopy; it also highlights promising directions of future research developments and serves as a thorough resource for all researchers.",
        "DOI": "10.1021/acsomega.4c00591",
        "paper_author": "Chandra A.",
        "affiliation_name": "Jawaharlal Nehru University",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60030622"
    },
    {
        "paper_title": "Chemistries on the inner leaflet of the cell membrane",
        "publication": "Chemical Communications",
        "citied_by": "0",
        "cover_date": "2024-12-23",
        "Abstract": "The cell membrane, characterized by its inherent asymmetry, functions as a dynamic barrier that regulates numerous cellular activities. This Highlight aims to provide the chemistry community with a comprehensive overview of the intriguing and underexplored inner leaflet, encompassing both fundamental biology and emerging synthetic modification strategies. We begin by describing the asymmetric nature of the plasma membrane, with a focus on the distinct roles of lipids, proteins, and glycan chains, highlighting the composition and biofunctions of the inner leaflet and the biological mechanisms that sustain membrane asymmetry. Next, we explore chemical biological strategies for engineering the inner leaflet, including genetic engineering, transmembrane peptides, and liposome fusion-based transport. In the perspective section, we discuss the challenges in developing chemistries for the inner leaflet of the cell membrane, aiming to inspire researchers and collaborators to explore this field and address its unanswered biological questions.",
        "DOI": "10.1039/d4cc05186f",
        "paper_author": "Xie W.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356"
    },
    {
        "paper_title": "Feasibility study of YSO/SiPM based detectors for virtual monochromatic image synthesis",
        "publication": "Journal of X-Ray Science and Technology",
        "citied_by": "0",
        "cover_date": "2024-12-23",
        "Abstract": "BACKGROUND: The development of photon-counting CT systems has focused on semiconductor detectors like cadmium zinc telluride (CZT) and cadmium telluride (CdTe). However, these detectors face high costs and charge-sharing issues, distorting the energy spectrum. Indirect detection using Yttrium Orthosilicate (YSO) scintillators with silicon photomultiplier (SiPM) offers a cost-effective alternative with high detection efficiency, low dark count rate, and high sensor gain. OBJECTIVE: This work aims to demonstrate the feasibility of the YSO/SiPM detector (DexScanner L103) based on the Multi-Voltage Threshold (MVT) sampling method as a photon-counting CT detector by evaluating the synthesis error of virtual monochromatic images. METHODS: In this study, we developed a proof-of-concept benchtop photon-counting CT system, and employed a direct method for empirical virtual monochromatic image synthesis (EVMIS) by polynomial fitting under the principle of least square deviation without X-ray spectral information. The accuracy of the empirical energy calibration techniques was evaluated by comparing the reconstructed and actual attenuation coefficients of calibration and test materials using mean relative error (MRE) and mean square error (MSE). RESULTS: In dual-material imaging experiments, the overall average synthesis error for three monoenergetic images of distinct materials is 2.53% ±2.43%. Similarly, in K-edge imaging experiments encompassing four materials, the overall average synthesis error for three monoenergetic images is 4.04% ±2.63%. In rat biological soft-tissue imaging experiments, we further predicted the densities of various rat tissues as follows: bone density is 1.41±0.07g/cm3, adipose tissue density is 0.91±0.06g/cm3, heart tissue density is 1.09±0.04g/cm3, and lung tissue density is 0.32±0.07g/cm3. Those results showed that the reconstructed virtual monochromatic images had good conformance for each material. CONCLUSION: This study indicates the SiPM-based photon-counting detector could be used for monochromatic image synthesis and is a promising method for developing spectral computed tomography systems.",
        "DOI": "10.3233/XST-240039",
        "paper_author": "Zhang D.",
        "affiliation_name": "University of Science and Technology of China",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60019118"
    },
    {
        "paper_title": "Chemically Induced Dimerization via Nanobody Binding Facilitates in Situ Ligand Assembly and On-Demand GPCR Activation",
        "publication": "JACS Au",
        "citied_by": "0",
        "cover_date": "2024-12-23",
        "Abstract": "Methods that enable the on-demand synthesis of biologically active molecules offer the potential for a high degree of control over the timing and context of target activation; however, such approaches often require extensive engineering to implement. Tools to restrict the localization of assembly also remain limited. Here we present a new approach for stimulus-induced ligand assembly that helps to address these challenges. This methodology relies on the high affinity and specificity recognition exhibited by antibody fragments (nanobodies, Nbs). By using Nbs that recognize short peptide epitopes to create semisynthetic conjugates, we develop a bioengineering platform termed peptide epitope dimerization (PED) in which the addition of heterodimeric peptide composed of two Nb epitopes stimulates the proximity-induced synthesis of a functional ligand for the parathyroid hormone receptor-1, a G protein-coupled receptor. We further demonstrate that high efficiency assembly can be achieved on the cell surface via Nb-based delivery of template. This approach opens the door for the on-demand generation of bioactive receptor ligands preferentially at a desired biological niche.",
        "DOI": "10.1021/jacsau.4c00711",
        "paper_author": "Saha S.J.",
        "affiliation_name": "National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK)",
        "affiliation_city": "Bethesda",
        "affiliation_country": "United States",
        "affiliation_id": "60008438"
    },
    {
        "paper_title": "Translational paradigm of MXene nanocomposites: biophysical advancements to modern applications",
        "publication": "Materials Advances",
        "citied_by": "1",
        "cover_date": "2024-12-20",
        "Abstract": "The expanding potential of 2D MXenes opens up promising avenues for flexible biomedical applications. MXenes, a new family of two-dimensional materials with exceptional mechanical, electrical, and chemical properties, have garnered attention for their potential to revolutionize healthcare. These properties enable MXenes to interface seamlessly with biological systems, offering innovative diagnostics, therapeutics, and regenerative medicine solutions. In the biomedical domain, MXenes have shown promise in antibacterial applications, drug delivery, biosensing, photothermal therapy, and tissue engineering, and their biocompatibility and ease of functionalization enhance their utility in real-world healthcare settings. Their large surface areas make them ideal for drug delivery systems, enabling precise encapsulation and release of therapeutic molecules. High electrical conductivity of MXenes has opened new possibilities for neuroprosthetics and brain–machine interfaces, potentially restoring lost functions. Their excellent mechanical properties, biocompatibility, and corrosion resistance make MXenes promising for durable orthodontic devices. Furthermore, their surface-modification capabilities allow for innovative biosensing and diagnostic platforms for sensitive disease detection. MXenes are compatible with imaging techniques, making them suitable contrast agents that can enhance the resolution of medical imaging. MXenes also hold potential in wearable health monitoring devices, advanced bioelectronics, and smart implants, bridging the gap between laboratory research and clinical deployment. However, there are certain challenges regarding their biocompatibility, long-term effects, and large-scale production, which need further research to ensure their safe integration into biomedical applications. This review presents the advancements in the biophysical fabrication of 2D MXenes and their antimicrobial properties and biocompatibility, along with their applications in diagnostics, imaging, biosensing, and therapeutics.",
        "DOI": "10.1039/d4ma00894d",
        "paper_author": "De S.",
        "affiliation_name": "Brainware University",
        "affiliation_city": "Kolkata",
        "affiliation_country": "India",
        "affiliation_id": "60268237"
    },
    {
        "paper_title": "A wearable triboelectric impedance tomography system for noninvasive and dynamic imaging of biological tissues",
        "publication": "Science Advances",
        "citied_by": "1",
        "cover_date": "2024-12-20",
        "Abstract": "Tissue imaging is usually captured by hospital-based nuclear magnetic resonance. Here, we present a wearable triboelectric impedance tomography (TIT) system for noninvasive imaging of various biological tissues. The imaging mechanism relies on the obtained impedance information from the different soft human tissues. A high-precision signal source is designed on the basis of a composite triboelectric nanogenerator, which exhibits a minimal total harmonic distortion of 0.03% and a peak output signal-to-noise ratio up to 120 decibels. The current density injected into human skin is around 79.58 milliamperes per square meter, far below the safety threshold for medical devices. The TIT system achieves time-resolved tomography of human limbs’ soft tissues, and many appealing functions can be realized by using this wearable system, including the observation of muscle movement, the motion intention recognition, and the identification of pathological changes of soft tissue. Hence, this TIT system with excellent biocompatibility can be integrated with various devices, such as medical-assistive exoskeletons and smart protective suit.",
        "DOI": "10.1126/sciadv.adr9139",
        "paper_author": "Yang P.",
        "affiliation_name": "Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60019499"
    },
    {
        "paper_title": "Effects of gamma radiation on lung and colon cancer cell viability",
        "publication": "International Journal of Mathematics and Physics",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "In Mongolia, cancer treatment is carried out through radiation, chemotherapy and surgery, and there is only one state hospital that specializes in this field, the National Cancer Center of Mongolia. As our country’s population has grown in recent years, data for 2023 from the Central Statistical Office show that the incidence of cancer, on the one hand, and the number of cases of the disease, on the other, are increasing as patients get younger. This study concerns an important part of the triad of cancer treatment, namely the evaluation of the efficacy of radiotherapy in an “in vitro” situation. Ionizing radiation has been shown to have a number of biological effects, including damage to DNA. This damage can manifest as double-strand breaks (DSB), base damage and single-strand breaks (SSB). The60Co radiation source “Bhabhatron”, which is installed at the National Cancer Center of Mongolia, is used as a gamma source for the cell viability experiment. In this experiment, we use two different cancer cell samples (A549, HCT116) and all used samples prepared in the Gene Engineering Laboratory of the National University of Mongolia in a quantity of 1 ml, and the cell samples were irradiated with doses of 2 Gy, 4 Gy, 6 Gy and 8 Gy. The cell viability of A549 and HCT116 cancer cells after gamma irradiation was determined using the WST assay and calculated using an analytical formula. The calculated and measured results are comparable for two different cancer cells. Key words.",
        "DOI": "10.26577/ijmph.2024v15i2b5",
        "paper_author": "Batmyagmar J.",
        "affiliation_name": "National University of Mongolia",
        "affiliation_city": "Ulaanbaatar",
        "affiliation_country": "Mongolia",
        "affiliation_id": "60072643"
    },
    {
        "paper_title": "Advancements in Biological Conversion of C1 Feedstocks: Sustainable Bioproduction and Environmental Solutions",
        "publication": "ACS Synthetic Biology",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "The use of one-carbon (C1) feedstocks, including carbon dioxide (CO2), carbon monoxide (CO), formate (HCO2H), methanol (CH3OH), and methane (CH4), presents a significant opportunity for sustainable bioproduction and environmental conservation. This Perspective explores the development of biological methods for converting C1 feedstocks into valuable products, emphasizing major progress from engineering native C1 assimilation pathways to the creation of synthetic autotrophs and methylotrophs that utilize these carbon sources. Additionally, we discuss hybrid approaches that merge biological and electrochemical systems, particularly for the conversion of CO2. This Perspective underscores the importance of C1 bioconversion in promoting sustainable biotechnological strategies for a low-carbon future.",
        "DOI": "10.1021/acssynbio.4c00519",
        "paper_author": "Park W.",
        "affiliation_name": "Seoul National University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60013682"
    },
    {
        "paper_title": "Medical applications and prospects of polylactic acid materials",
        "publication": "iScience",
        "citied_by": "2",
        "cover_date": "2024-12-20",
        "Abstract": "Polylactic acid (PLA) is a biodegradable and bio-based polymer that has gained significant attention as an environmentally friendly alternative to traditional petroleum-based plastics. In clinical treatment, biocompatible and non-toxic PLA materials enhance safety and reduce tissue reactions, while the biodegradability allows it to breakdown over time naturally, avoiding a second surgery. With the emergence of nanotechnology and three-dimensional (3D) printing, medical utilized-PLA has been produced with more structural and biological properties at both micro and macro scales for clinical therapy. This review summarizes current applications of the PLA-based biomaterials in drug delivery systems, orthopedic treatment, tissue regenerative engineering, and surgery and medical devices, providing viewpoints regarding the prospective medical utilization.",
        "DOI": "10.1016/j.isci.2024.111512",
        "paper_author": "Yang Z.",
        "affiliation_name": "State Key Laboratory of Microbial Metabolism",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60123531"
    },
    {
        "paper_title": "Dioxygen reductase heterogeneity is crucial for robust aerobic growth physiology of Escherichia coli",
        "publication": "iScience",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "The development of a system to leverage molecular oxygen for energy-efficient pathways required several molecular adaptations. The enzymatic reduction of dioxygen to water is one such prominent evolutionary molecular trait. Microbes evolved several enzymes capable of reducing dioxygen and, interestingly, retained multiples of them in their genomes. While their structure and biochemical functions are well-studied, understanding their degeneracy and co-operativity in the system remains elusive. We used genetic engineering and evolutionary repair approaches to examine the impact of the high oxygen affinity cytochrome bd oxidase deficiency in Escherichia coli aerobic growth. We found a crucial role of cytochrome bd oxidases in the robustness of aerobic physiology. Evolutionary repair experiments alleviated growth defects in bd oxidase-deficient strains by ArcAB system dysregulation at the cost of impaired stress response pathways. Energy generation pathways are potential antimicrobial targets, and understanding collateral phenotypes is crucial in designing therapeutic approaches that reduce antimicrobial resistance development.",
        "DOI": "10.1016/j.isci.2024.111498",
        "paper_author": "Patil A.V.",
        "affiliation_name": "Tata Institute of Fundamental Research, Mumbai",
        "affiliation_city": "Mumbai",
        "affiliation_country": "India",
        "affiliation_id": "60031855"
    },
    {
        "paper_title": "Comparison of activated sludge and virus interactions in aerobic and anaerobic membrane bioreactors",
        "publication": "iScience",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Membrane bioreactors (MBRs) are effective sewage treatment technologies, yet the differences in virus removal efficiency between aerobic (AeMBR) and anaerobic membrane bioreactors (AnMBR), remain inadequately understood. This study compared the virus removal efficiency of AeMBR and AnMBR, focusing on the interactions between aerobic (AeS) and anaerobic (AnS) activated sludge and viruses in the sewage treatment process. Results showed average log removal values (LRVs) for MS2 of 2.53 ± 0.54 in AeMBR and 1.64 ± 0.90 in AnMBR due to the higher virus inactivation in the aerobic mixed liquor. The virus concentration in AnS was greater than in AeS, consistent with the predictions from the pseudo-second-order kinetic model. Soluble extracellular polymeric substances (S-EPS) were key to virus adsorption in AeS, while tightly bound EPS (TB-EPS) were significant in AnS. Additionally, more fluorescent substances in AnS contributed to virus adsorption, while more functional groups in AeS offered adsorption sites.",
        "DOI": "10.1016/j.isci.2024.111450",
        "paper_author": "Zhang J.",
        "affiliation_name": "Xi'an University of Architecture and Technology",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60031454"
    },
    {
        "paper_title": "Engineering high-frequency apomixis with normal seed production in hybrid rice",
        "publication": "iScience",
        "citied_by": "1",
        "cover_date": "2024-12-20",
        "Abstract": "Clonal reproduction through seeds, also termed apomixis, has the potential to revolutionize agriculture by allowing hybrid crops to be clonally propagated. Although apomixis has been introduced into rice through de novo engineering in recent years, the poor fertility and low-frequency clonal reproduction of synthetic apomicts hinder the application of apomixis in crop breeding. Here, in elite hybrid rice, we generated many apomicts, which produced clonal progeny with frequencies of > 95.0% and had high even normal fertility through combining enhanced rice BABYBOOM1 (BBM1)-induced parthenogenesis with the simultaneous inactivation of PAIR1, REC8, and OSD1. These synthetic apomicts maintained the agronomic traits of the elite hybrid rice. Our results indicate that fertility-normal hybrids with high penetrance of apomixis can be generated in rice, thereby laying an important foundation for the application of synthetic apomixis in crop breeding.",
        "DOI": "10.1016/j.isci.2024.111479",
        "paper_author": "Song M.",
        "affiliation_name": "Henan Agricultural University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60002833"
    },
    {
        "paper_title": "Antibiotics-Free Steady Bioproduction of Valuable Chemicals from Organic Wastes by Engineered Vibrio natriegens through Targeted Gene Integration",
        "publication": "ACS Synthetic Biology",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Bioproduction of chemicals by using engineered bacteria is promising for a circular economy but challenged the instability of the introduced plasmid by conventional methods. Here, we developed a two-plasmid INTEGRET system to reliably integrate the targeted gene into the Vibrio natriegens genome, making it a powerful strain for efficient and steady bioproduction without requiring antibiotic addition. The INTEGRET system allows for gene insertion at over 75% inserting efficiency and flexibly controllable gene dosages. Additionally, simultaneous gene insertion at four genomic sites was achieved at 54.3% success rate while maintaining stable inheritance of exogenous sequences across multiple generations. The engineered strain could efficiently synthesize PHB from the fermentation of diverse organic wastes, with an efficiency comparable to those with overexpressed plasmid. When the mixture of seawater and molasses was used as the feedstock, it achieved a high PHB yield of 39.41 wt %. An extended application of the INTEGRET system for imparting the riboflavin production ability to the bacterium was also demonstrated. Our work presents a reliable and efficient genomic editing tool to facilitate the development of sustainable and environmentally benign biological platforms for converting biomass wastes into valuable chemicals.",
        "DOI": "10.1021/acssynbio.4c00669",
        "paper_author": "Sun D.",
        "affiliation_name": "University of Science and Technology of China",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60019118"
    },
    {
        "paper_title": "A Biomolecular Circuit for Automatic Gene Regulation in Mammalian Cells with CRISPR Technology",
        "publication": "ACS Synthetic Biology",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "We introduce a biomolecular circuit for precise control of gene expression in mammalian cells. The circuit leverages the stochiometric interaction between the artificial transcription factor VPR-dCas9 and the anti-CRISPR protein AcrIIA4, enhanced with synthetic coiled-coil domains to boost their interaction, to maintain the expression of a reporter protein constant across diverse experimental conditions, including fluctuations in protein degradation rates and plasmid concentrations, by automatically adjusting its mRNA level. This capability, known as robust perfect adaptation (RPA), is crucial for the stable functioning of biological systems and has wide-ranging implications for biotechnological applications. This system belongs to a class of biomolecular circuits named antithetic integral controllers, and it can be easily adapted to regulate any endogenous transcription factor thanks to the versatility of the CRISPR-Cas system. Finally, we show that RPA also holds in cells genomically integrated with the circuit, thus paving the way for practical applications in biotechnology that require stable cell lines.",
        "DOI": "10.1021/acssynbio.4c00225",
        "paper_author": "Mallozzi A.",
        "affiliation_name": "TIGEM Telethon Institute of Genetics and Medicine",
        "affiliation_city": "Naples",
        "affiliation_country": "Italy",
        "affiliation_id": "60083943"
    },
    {
        "paper_title": "Bacteria Engineered to Produce Serotonin Modulate Host Intestinal Physiology",
        "publication": "ACS Synthetic Biology",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Bacteria in the gastrointestinal tract play a crucial role in intestinal motility, homeostasis, and dysfunction. Unraveling the mechanisms by which microbes impact the host poses many challenges due to the extensive array of metabolites produced or metabolized by bacteria in the gut. Here, we describe the engineering of a gut commensal bacterium, Escherichia coli Nissle 1917, to biosynthesize the human metabolite serotonin for examining the effects of microbially produced biogenic amines on host physiology. Upon oral administration to mice, our engineered bacteria reach the large intestine, where they produce serotonin. Mice treated with serotonin-producing bacteria exhibited biological changes in the gut at transcriptional and physiological levels. This work establishes a novel framework employing engineered bacteria to modulate luminal serotonin levels and suggests potential clinical applications of modified microbial therapeutics to address gut disorders in humans.",
        "DOI": "10.1021/acssynbio.4c00453",
        "paper_author": "Mavros C.F.",
        "affiliation_name": "Columbia University Irving Medical Center",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60027565"
    },
    {
        "paper_title": "Effects of river infrastructure, dredged material placement, and altered hydrogeomorphic processes: The stress ecology of floodplain wetlands and associated fish communities",
        "publication": "Science of the Total Environment",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Recognition of the habitat values of coastal and floodplain wetlands has inspired research and engineering to restore biological functions after widespread species declines. However, the restoration and management of tidal river floodplains requires a more complete understanding of anthropogenic stressors on hydrogeomorphology and ecological processes. River floodplains near the ocean are affected by localized diking and dredging as well as basin-wide stressors such as dams. We evaluated the effects of stressors versus spatial position, both longitudinal and lateral to the mainstem, using physical and biological response variables in river floodplain wetlands. We categorized historical and modern stressors on the hydrogeomorphic regime of the lower Columbia River and estuary, northeast Pacific coast, including basin-scale management and local impacts. Using this categorization, we analyzed 44 attributes using field-collected data from 50 floodplain wetlands. Attributes represent channels, floods, plant communities, and fish communities. Here we show that plant and fish communities are stratified by position along the estuarine–riverine gradient, in contrast to physical habitat characteristics, which are stratified by stressors on hydrogeomorphic regimes and in some cases the lateral distance from the mainstem river on tributaries. Spatial position relative to water-level dynamics and salinity more strongly affect the biota than does stressor history. Stressor effects were greatest on the geomorphology observed in formerly diked, now reconnected wetlands and in wetlands with a history of dredged material placement; historically diked sites had anomalously deep channels with larger cross-sectional areas while sites with dredged material had shallow channels and lower levels of organic carbon in sediment. In wetlands subject only to landscape-scale stressors such as flow alterations by dams, organic carbon levels were higher. These findings provide natural resource managers with opportunities to enhance similarity to natural conditions and better understand future wetland evolution from different baselines of stressor history and river position.",
        "DOI": "10.1016/j.scitotenv.2024.176799",
        "paper_author": "Diefenderfer H.L.",
        "affiliation_name": "Pacific Northwest National Laboratory",
        "affiliation_city": "Richland",
        "affiliation_country": "United States",
        "affiliation_id": "60023471"
    },
    {
        "paper_title": "Synthetic Ecosystems: From the Test Tube to the Biosphere",
        "publication": "ACS Synthetic Biology",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "The study of ecosystems, both natural and artificial, has historically been mediated by population dynamics theories. In this framework, quantifying population numbers and related variables (associated with metabolism or biological-environmental interactions) plays a central role in measuring and predicting system-level properties. As we move toward advanced technological engineering of cells and organisms, the possibility of bioengineering ecosystems (from the gut microbiome to wildlands) opens several questions that will require quantitative models to find answers. Here, we present a comprehensive survey of quantitative modeling approaches for managing three kinds of synthetic ecosystems, sharing the presence of engineered strains. These include test tube examples of ecosystems hosting a relatively low number of interacting species, mesoscale closed ecosystems (or ecospheres), and macro-scale, engineered ecosystems. The potential outcomes of synthetic ecosystem designs and their limits will be relevant to different disciplines, including biomedical engineering, astrobiology, space exploration and fighting climate change impacts on endangered ecosystems. We propose a space of possible ecosystems that captures this broad range of scenarios and a tentative roadmap for open problems and further exploration.",
        "DOI": "10.1021/acssynbio.4c00384",
        "paper_author": "Solé R.",
        "affiliation_name": "Universitat Pompeu Fabra Barcelona",
        "affiliation_city": "Barcelona",
        "affiliation_country": "Spain",
        "affiliation_id": "60032942"
    },
    {
        "paper_title": "Carbon Negative Synthesis of Amino Acids Using a Cell-Free-Based Biocatalyst",
        "publication": "ACS Synthetic Biology",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Biological systems can directly upgrade carbon dioxide (CO2) into chemicals. The CO2 fixation rate of autotrophic organisms, however, is too slow for industrial utility, and the breadth of engineered metabolic pathways for the synthesis of value-added chemicals is too limited. Biotechnology workhorse organisms with extensively engineered metabolic pathways have recently been engineered for CO2 fixation. Yet, their low carbon fixation rate, compounded by the fact that living organisms split their carbon between cell growth and chemical synthesis, has led to only cell growth with no chemical synthesis achieved to date. Here, we engineer a lysate-based cell-free expression (CFE)-based multienzyme biocatalyst for the carbon negative synthesis of the industrially relevant amino acids glycine and serine from CO2 equivalents─formate and bicarbonate─and ammonia. The formate-to-serine biocatalyst leverages tetrahydrofolate (THF)-dependent formate fixation, reductive glycine synthesis, serine synthesis, and phosphite dehydrogenase-dependent NAD(P)H regeneration to convert 30% of formate into serine and glycine, surpassing the previous 22% conversion using a purified enzyme system. We find that (1) the CFE-based biocatalyst is active even after 200-fold dilution, enabling higher substrate loading and product synthesis without incurring additional cell lysate cost, (2) NAD(P)H regeneration is pivotal to driving forward reactions close to thermodynamic equilibrium, (3) balancing the ratio of the formate-to-serine pathway genes added to the CFE is key to improving amino acid synthesis, and (4) efficient THF recycling enables lowering the loading of this cofactor, reducing the cost of the CFE-based biocatalyst. To our knowledge, this is the first synthesis of amino acids that can capture CO2 equivalents for the carbon negative synthesis of amino acids using a CFE-based biocatalyst. Looking ahead, the CFE-based biocatalyst process could be extended beyond serine to pyruvate, a key intermediate, to access a variety of chemicals from aromatics and terpenes to alcohols and polymers.",
        "DOI": "10.1021/acssynbio.4c00359",
        "paper_author": "Chowdhury S.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60136858"
    },
    {
        "paper_title": "Bio-inspiration unveiled: Dissecting nature's designs through the lens of the female locust's oviposition mechanism",
        "publication": "iScience",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Investigating nature's ingenious designs and systems has become a cornerstone of innovation, influencing fields from robotics, biomechanics, and physics to material sciences. Two key questions, however, regarding bio-inspired innovation are those of how and where does one find bio-inspiration? The perspective presented here is aimed at providing insights into the evolving landscape of bio-inspiration discovery. We present the unique case of the female locust's oviposition as a valuable example for researchers and engineers seeking to pursue multifaceted research, encompassing diverse aspects of biological and bio-inspired systems. The female locust lays her eggs underground to protect them and provide them with optimal conditions for survival and hatching. To this end, she uses a dedicated apparatus comprising two pairs of special digging valves to propagate underground, while remarkably extending her abdomen by 2- to 3-fold its original length. The unique digging mechanism, the subterranean steering ability, and the extreme elongation of the abdomen, including the reversible extension of the abdominal central nervous system, all spark a variety of questions regarding materials, morphology, mechanisms, and their interactions in this complex biological system. We present the cross-discipline efforts to elucidate these fascinating questions, and provide future directions for developing bio-inspired technological innovations based on this remarkable biological system.",
        "DOI": "10.1016/j.isci.2024.111378",
        "paper_author": "Ayali A.",
        "affiliation_name": "Tel Aviv University",
        "affiliation_city": "Tel Aviv-Yafo",
        "affiliation_country": "Israel",
        "affiliation_id": "60005681"
    },
    {
        "paper_title": "De Novo Biosynthesis of a Polyene-Type Ginsenoside Precursor Dammaradienol in Saccharomyces cerevisiae",
        "publication": "ACS Synthetic Biology",
        "citied_by": "1",
        "cover_date": "2024-12-20",
        "Abstract": "Typical dammarane-type ginsenosides are well-known tetracyclic triterpenoids with significant pharmacological effects including antitumor, cardiovascular protection, and neuroprotection. Polyene-type ginsenosides exhibit stronger biological activities than common ginsenosides; however, their contents are low, and most are converted from ginsenosides through a series of processing steps, resulting in higher preparation costs. In this study, a dammaradienol synthase, AarOSC20433, was identified for the first time from Artemisia argyi H. Lév. & Vaniot (A. argyi). The high-yielding squalene strain constructed in this study was used as the chassis strain. Yeast heterologous biosynthesis of the polyene-type ginsenoside precursor dammaradienol was achieved via metabolic engineering strategies, including optimization of the terpene supply, increase in copy number of AarOSC20433, and rational enzyme design. Eventually, through replenishment and batch fermentation, the titer of dammaradienol reached 1.037 g/L (4.3 mg/L/OD), laying a solid foundation for the construction of a polyene-type ginsenoside cell factory.",
        "DOI": "10.1021/acssynbio.4c00396",
        "paper_author": "Gan Y.",
        "affiliation_name": "Guangzhou University of Chinese Medicine",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60138461"
    },
    {
        "paper_title": "Agarose hydrogel-mediated electroporation method for retinal tissue cultured at the air-liquid interface",
        "publication": "iScience",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "It is advantageous to culture the ex vivo retina and other tissues at the air-liquid interface to allow for more efficient gas exchange. However, gene delivery to these cultures can be challenging. Electroporation is a fast and robust method of gene delivery, but typically requires submergence in liquid buffer for electrical current flow. We have developed a submergence-free electroporation technique that incorporates an agarose hydrogel disk between the positive electrode and retina. Inner retinal neurons and Müller glia are transfected with increased propensity toward Müller glia transfection after extended time in culture. We also observed an increase in BrdU incorporation in Müller glia following electrical stimulation, and variation in detection of transfected cells from expression vectors with different promoters. This method advances our ability to use ex vivo retinal tissue for genetic studies and should be adaptable for other tissues cultured at an air-liquid interface.",
        "DOI": "10.1016/j.isci.2024.111299",
        "paper_author": "Stone M.L.",
        "affiliation_name": "Vanderbilt University School of Medicine",
        "affiliation_city": "Nashville",
        "affiliation_country": "United States",
        "affiliation_id": "60006475"
    },
    {
        "paper_title": "Modulating Microbial Materials - Engineering Bacterial Cellulose with Synthetic Biology",
        "publication": "ACS Synthetic Biology",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "The fusion of synthetic biology and materials science offers exciting opportunities to produce sustainable materials that can perform programmed biological functions such as sensing and responding or enhance material properties through biological means. Bacterial cellulose (BC) is a unique material for this challenge due to its high-performance material properties and ease of production from culturable microbes. Research in the past decade has focused on expanding the benefits and applications of BC through many approaches. Here, we explore how the current landscape of BC-based biomaterials is being shaped by progress in synthetic biology. As well as discussing how it can aid production of more BC and BC with tailored material properties, we place special emphasis on the potential of using BC for engineered living materials (ELMs); materials of a biological nature designed to carry out specific tasks. We also explore the role of 3D bioprinting being used for BC-based ELMs and highlight specific opportunities that this can bring. As synthetic biology continues to advance, it will drive further innovation in BC-based materials and ELMs, enabling many new applications that can help address problems in the modern world, in both biomedicine and many other application fields.",
        "DOI": "10.1021/acssynbio.4c00615",
        "paper_author": "Malcı K.",
        "affiliation_name": "Imperial College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60015150"
    },
    {
        "paper_title": "Mice carrying the full-length human immunoglobulin loci produce antigen-specific human antibodies with the lambda light chain",
        "publication": "iScience",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "The development of antibody drugs through animal immunization typically requires the humanization of host antibodies to address concerns about immunogenicity in humans. However, employing an animal model capable of producing human antibodies presents the opportunity to develop antibody drugs without the need for humanization. Despite the ratio of human immunoglobulin (Ig) κ to Igλ usage being approximately 60%:40%, the majority of approved antibody therapeutics are kappa antibodies, and the development of lambda antibodies as therapeutic agents has lagged behind. Therefore, in this study, we developed mice carrying the IGH and IGL loci (IGHL), which can produce human lambda antibodies, using mouse artificial chromosome (MAC) vectors. We demonstrated that IGHL mice consistently retain the human lambda antibody locus integrated on the MAC across generations and can be induced to produce specific antibodies upon antigen stimulation. These findings provide a promising platform for advancing lambda antibody drugs, which have historically been neglected.",
        "DOI": "10.1016/j.isci.2024.111258",
        "paper_author": "Shimoya K.",
        "affiliation_name": "Graduate School of Medical Sciences",
        "affiliation_city": "Yonago",
        "affiliation_country": "Japan",
        "affiliation_id": "60170297"
    },
    {
        "paper_title": "Advanced structural and multi-functional sandwich composites with prismatic and foam cores: A review",
        "publication": "Polymer Composites",
        "citied_by": "7",
        "cover_date": "2024-12-20",
        "Abstract": "Advanced sandwich structures have emerged as new multifunctional structures with low density and good mechanical performance. Sandwich composites have high strength to weight and high stiffness to weight ratio. Good thermal and sound insulation can be provided using sandwich composite materials. Sandwich composites have high energy absorbing capacity. Multifunctional sandwich composites exhibit mechanical performance and other functional properties such as energy storage, electrical conductivity, etc. Further, the core can be used for routing wires, foam filling, fluid storage, embedding bars, etc. Thus, the multifunctionality can be introduced to the resuting composite materials. This article reviews current research on innovative sandwich structures with integrally woven corrugated core, honeycomb, foam, and 3D printed core architectures, emphasizing their multifunctionality. Aspects of sandwich structure with types of face and core structure design, material design, mechanical properties, and panel performance and damage, including multifunctional benefits, are reviewed. Examples of engineering and modern uses of sandwich structures are presented, covering hypersonic vehicles, civil and marine engineering, electronics, and biological fields. A list of areas for future study initiatives is also included. This review will serve as a baseline for future studies to do more research in the same direction. Highlights: A detailed review of various types of core materials and sandwich structures is presented. Sandwich structures have high energy absorbing capacity. 3D woven sandwich structures, their manufacturing and failure mechanics is discussed. Modern applications of sandwich structures are detailed.",
        "DOI": "10.1002/pc.27849",
        "paper_author": "Kamble Z.",
        "affiliation_name": "Dr. B.R. Ambedkar National Institute of Technology",
        "affiliation_city": "Jalandhar",
        "affiliation_country": "India",
        "affiliation_id": "60007102"
    },
    {
        "paper_title": "Ordinary differential equations and applications II: With Maple illustrations",
        "publication": "Ordinary Differential Equations and Applications II: With Maple Illustrations",
        "citied_by": "0",
        "cover_date": "2024-12-19",
        "Abstract": "Ordinary Differential Equations and Applications II: With Maple Illustrations integrates fundamental theories of Ordinary Differential Equations (ODEs) with practical applications and Maple-based solutions. This comprehensive textbook covers vector-valued differential equations, matrix solutions, stability methods, and periodic systems. Using Maple and MapleSim software, readers learn symbolic solutions, plotting techniques, 2D/3D animation for ODE problems, and simulations for engineering systems. This book is ideal for undergraduate and postgraduate students in mathematics, physics, economics, and engineering, as well as researchers and professionals needing advanced applications of ODEs. Key Features: - Comprehensive introduction to ODE concepts and real-life applications - Solutions for initial value problems using Maple and MapleSim software - Analysis of stability using Routh-Hurwitz and Lyapunov methods - Models of neural firing, avian influenza, and biological populations - Practical guidance on MapleSim for multi-domain simulations, code generation, and Monte Carlo simulation.",
        "DOI": "10.2174/97898153138641240101",
        "paper_author": "Oyelami B.O.",
        "affiliation_name": "Plateau State University",
        "affiliation_city": "Bokkos",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60105047"
    },
    {
        "paper_title": "A review on hydroxyapatite fabrication: from powders to additive manufactured scaffolds",
        "publication": "Biomaterials Science",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "Hydroxyapatite (HA), the main inorganic bone component, is the most widely researched bioceramic for bone repair. This paper presents a comprehensive review of recent advancements in HA synthesis methods and their integration into additive manufacturing (AM) processes. Synthesis methodologies discussed include wet, dry, and biomimetic routes, emphasizing their impact on tailoring the physicochemical properties of HA for biomedical applications. The incorporation of dopants and additives during synthesis is explored for optimizing the mechanical, biological, and osteogenic characteristics of HA-based materials. Moreover, the evolution of AM technologies from conventional 3D printing to advanced 4D and 5D printing is detailed, covering material selection, process parameters, and post-processing strategies vital for fabricating intricate, patient-specific scaffolds, implants, and drug delivery systems utilizing HA. The review underscores the importance of achieving precise control over microstructure and porosity to mimic native tissue architectures accurately. Furthermore, emerging applications of HA-based constructs in tissue engineering, regenerative medicine, drug delivery, and orthopedic implants are discussed, highlighting their potential to address critical clinical needs. Despite the glimmer of hope provided by the advent and progress of such AM capabilities, several aspects need to be addressed to develop efficient HA-based bone substitutes, which are explored in detail in this review.",
        "DOI": "10.1039/d4bm00972j",
        "paper_author": "Vijayan A.",
        "affiliation_name": "Amrita University, Amritapuri Campus",
        "affiliation_city": "Kollam",
        "affiliation_country": "India",
        "affiliation_id": "60109532"
    },
    {
        "paper_title": "Drosophila melanogaster: A promising system for space biology research",
        "publication": "International Journal of Astrobiology",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "Drosophila melanogaster has given enormous contributions to Space Biology Research. This organism is an important tool to be manipulated in genetic engineering and molecular experiments in order to understand different biological processes homologous to other multicellular systems, including humans. Their milestone contribution in microgravity conditions and radiation, the two most important variables in space, have allowed new knowledge and perspectives on the positive and negative effects on cellular, molecular and genetic levels. In this review, we expose the historical contribution of Drosophila melanogaster in Astrobiology.",
        "DOI": "10.1017/S1473550424000223",
        "paper_author": "Valdivia-Silva J.E.",
        "affiliation_name": "Universidad de Ingenieria y Tecnologia - UTEC",
        "affiliation_city": "Lima",
        "affiliation_country": "Peru",
        "affiliation_id": "60104777"
    },
    {
        "paper_title": "Selective Biofilm Inhibition through Mucin-Inspired Engineering of Silk Glycopolymers",
        "publication": "Journal of the American Chemical Society",
        "citied_by": "1",
        "cover_date": "2024-12-18",
        "Abstract": "Mucins are key components of innate immune defense and possess remarkable abilities to manage pathogenic microbes while supporting beneficial ones and maintaining microbial homeostasis at mucosal surfaces. Their unique properties have garnered significant interest in developing mucin-inspired materials as novel therapeutic strategies for selectively controlling pathogens without disrupting the overall microbial ecology. However, natural mucin production is challenging to scale, driving the need for simpler materials that reproduce mucin’s bioactivity. In this work, we generated silk-based glycopolymers with different monosaccharides (GalNAc, GlcNAc, NeuNAc, GlcN, and GalN) and different grafting densities. Using the oral cavity as a model system, we treated in vitro cultures of pathogenic Streptococcus mutans and commensal Streptococcus sanguinis with our glycopolymers, finding that silk-tethered GalNAc uniquely prevented biofilm formation without affecting overall bacterial growth of either species. This relatively simple material reproduced mucin’s virulence-neutralizing effects while maintaining biocompatibility. These mucin-inspired materials represent a valuable tool for preventing infection-related harm and offer a strategy for the domestication of pathogens in other environments.",
        "DOI": "10.1021/jacs.4c12945",
        "paper_author": "Werlang C.A.",
        "affiliation_name": "MIT School of Engineering",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60140949"
    },
    {
        "paper_title": "Dynamic Diselenide Hydrogels for Controlled Tumor Organoid Culture and Dendritic Cell Vaccination",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "Dynamic hydrogels are emerging as advanced materials for engineering tissue-like environments that mimic cellular microenvironments. We introduce a diselenide-cross-linked hydrogel system with light-responsive properties, designed for precise control of tumor organoid growth and light-initiated radical inactivation, particularly for dendritic cell (DC) vaccines. Diselenide exchange enables stress relaxation and hydrogel remodeling, while recombination and quenching of seleno radicals (Se•) reduce cross-linking density, leading to controlled degradation. We demonstrate a 2D to 3D growth strategy, where tumor cells inoculate on the hydrogel surface, expand, and gradually form spherical organoids within the 3D hydrogel. These tumor organoids show significantly higher drug resistance compared to 2D-cultured cells. High-density light irradiation enhances diselenide exchange, inducing hydrogel degradation, tumor cell death, and release of functional antigens. This system serves as a dynamic platform for tumor organoid culture and antigen release, offering significantly advanced approaches for in vitro tumor modeling and immunological research. Our findings position diselenide-cross-linked hydrogels as versatile materials for precision cellular engineering, with broad applications in cancer research and beyond.",
        "DOI": "10.1021/acsami.4c18728",
        "paper_author": "Han Y.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100"
    },
    {
        "paper_title": "Angstrom Scale Ionic Memristors’ Engineering with van der Waals Materials: A Route to Highly Tunable Memory States",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "Memristors that mimic brain functions are crucial for energy-efficient neuromorphic devices. Ion channels that emulate biological synapses are still in the early stages of development, especially the tunability of memory states. Here, we demonstrate that cations such as K+, Na+, Ca2+, and Al3+ intercalated in the interlayer spaces of vermiculite result in highly confined channels of size 3-5 Å. They host exotic memristor properties through ion exchange dynamics, even at high salt concentrations of 1 M. The bipolar memristor characteristics observed are tunable with frequency, geometric asymmetry, ion concentration, and intercalants. Notably, we observe polarization-flipping memristor behavior in two cases: one with Al3+ ions and another with devices having a geometric asymmetry ratio greater than 15. This inversion is attributed to the overscreening of counterions due to their accumulation at the channel entrance. Our results suggest that ion exchange dynamics, ion-ion interactions, and ion accumulation/depletion mechanisms, particularly with multivalent ions, can be harnessed to develop advanced memristor devices.",
        "DOI": "10.1021/acsami.4c14521",
        "paper_author": "Biswabhusan D.",
        "affiliation_name": "Indian Institute of Technology Gandhinagar",
        "affiliation_city": "Gandhinagar",
        "affiliation_country": "India",
        "affiliation_id": "60104341"
    },
    {
        "paper_title": "Engineering the Hydrophilic-Hydrophobic Interface of Polymeric Micelles by Cationic Blocks for Enhanced Chemotherapy",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "0",
        "cover_date": "2024-12-18",
        "Abstract": "The cationic surface charge critically influences the biological functions and therapeutic outcomes of the cancer nanomedicines. However, the basic correlation between the cationic group categories and their therapeutic efficacy has not been elucidated. In this study, cationic polymeric nanoparticles with amino groups (primary, tertiary, and quaternary amines) as the single variable were leveraged to investigate the various effects of amino species for enhanced antitumor chemotherapy. The nanoparticles were constructed from a series of triblock polymers with varying cationic repeating units at the hydrophilic-hydrophobic interface. Our results suggested that quaternary ammonium outperforms its primary and tertiary counterparts in destroying mitochondrial membranes to induce apoptosis, penetrating deep inside the tumor tissue, and damaging tumor vasculatures. As a result, we were able to effectively inhibit tumor growth in mice by a quaternary ammonium conjugate without causing significant toxicity. Our work demonstrated that the chemical structures played vital roles in regulating their biological functions and provided valuable information for designing cationic drug delivery systems.",
        "DOI": "10.1021/acsami.4c17024",
        "paper_author": "Tang H.",
        "affiliation_name": "Southern University of Science and Technology",
        "affiliation_city": "Shenzhen",
        "affiliation_country": "China",
        "affiliation_id": "60105683"
    },
    {
        "paper_title": "When biochar meets iron mineral: An opportunity to achieve enhanced performance in treating toxic metal(loid)s and refractory organics",
        "publication": "Separation and Purification Technology",
        "citied_by": "6",
        "cover_date": "2024-12-18",
        "Abstract": "The application of biochar and iron mineral composites (BIMCs) in environmental remediation has demonstrated significant potential and value in recent years. These composites effectively integrate biochar and iron minerals through various processes, achieving synergistic effects between the two components and substantially enhancing the performance in environmental remediation. This review aims to give a comprehensive overview of the synthesis methods, applications, synergetic mechanisms, and research progress of BIMCs in treating toxic metal(loid)s and refractory organics. The effective combination of biochar and iron minerals (rather than simple physical mixing) is a prerequisite for harnessing their synergistic effects. The primary methods employed in the production of BIMCs include mixing-pyrolysis, precipitation, ball-milling, and biological reduction, and the selection of preparation method mainly depends on the iron mineral component and the research purpose. The utilization of BIMCs in environmental remediation is extensively discussed, encompassing their applications as adsorbents, soil amendments, Fenton oxidation catalysts, and persulfate oxidation catalysts. In addition, the prospects of BIMCs in practical engineering applications are discussed, and the challenges of current research are analyzed. The future research can be further in-depth in the aspects of efficient preparation methods, practical engineering applications, performance regulation rules, and synergistic mechanism of BIMCs. The BIMCs have broad application prospects in the field of environmental remediation, and are expected to provide more efficient, economical, and environmentally friendly solutions to treating toxic metal(loid)s and refractory organics.",
        "DOI": "10.1016/j.seppur.2024.128022",
        "paper_author": "Zhong H.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356"
    },
    {
        "paper_title": "THE NEW ENGINEERING AND TECHNOLOGICAL DECISIONS FOR MINE TECHNICAL RECLAMATION OF DEEP OPEN PITS TO REGENERATE MESORELIEF",
        "publication": "Mineral Resources of Ukraine",
        "citied_by": "0",
        "cover_date": "2024-12-17",
        "Abstract": "The proposes new engineering and technological decisions concerning mine technical reclamation of land disturbed as a result of open pit mining. The authors paid attention to solving environmental problems of mining after-effects through formation of mesorelief. The problem is solved by means of the landscape regeneration: artificial development of objects based on the hypsometric features (hills and ravines), and structure (stratigraphic column of sedimentary rocks; aquifer) which were in nature before technogenic human intervention. Both engineering and technological decisions have been analyzed concerning trends, facilities, and implementation of the mine technical reclamation. Study of scientific sources, concerning land reclamation after activities by mining industry, has helped understand that the problem of terrain reclamation is almost ignored in Ukraine; however, significant negative impact is mentioned. Mining enterprises of Kryvyi Rih, where mine technical reclamation takes place, are exemplified. The current trends of artificial intelligence and robotic facilities use for open pit mining has been represented which prompted the development of a new generation of quarry equipment. A new design of a spreader launch ММD-2 on the basis of rotary caterpillar excavator for the ordered rock storing. Use of the spreader launch ММD-2 has been proposed for reclamation activities. Rock distribution schemes as well as throwing parameters during the launcher operation have been demonstrated. Optimum parameters to apply the launcher while rock throwing have been identified depending upon the rock fraction. Technological concepts have been developed concerning mine technical reclamation of deep open pits. Sequence of the deposit development has been proposed as well as the approach to regenerate the mesorelief. The engineering procedure of mine technical reclamation is divided into six main implementation stages. At the last stage, it is proposed to combine the mine technical reclamation technology with an approach of layer-by-layer mine technical and biological land reclamation using the spreader launch ММD-2.",
        "DOI": "10.31996/mru.2024.4.82-87",
        "paper_author": "Babii K.",
        "affiliation_name": "National Academy of Sciences of Ukraine",
        "affiliation_city": "Kyiv",
        "affiliation_country": "Ukraine",
        "affiliation_id": "60011313"
    },
    {
        "paper_title": "Current Advances in Viral Nanoparticles for Biomedicine",
        "publication": "ACS Nano",
        "citied_by": "0",
        "cover_date": "2024-12-17",
        "Abstract": "Viral nanoparticles (VNPs) have emerged as crucial tools in the field of biomedicine. Leveraging their biological and physicochemical properties, VNPs exhibit significant advantages in the prevention, diagnosis, and treatment of human diseases. Through techniques such as chemical bioconjugation, infusion, genetic engineering, and encapsulation, these VNPs have been endowed with multifunctional capabilities, including the display of functional peptides or proteins, encapsulation of therapeutic drugs or inorganic particles, integration with imaging agents, and conjugation with bioactive molecules. This review provides an in-depth analysis of VNPs in biomedicine, elucidating their diverse types, distinctive features, production methods, and complex design principles behind multifunctional VNPs. It highlights recent innovative research and various applications, covering their roles in imaging, drug delivery, therapeutics, gene delivery, vaccines, immunotherapy, and tissue regeneration. Additionally, the review provides an assessment of their safety and biocompatibility and discusses challenges and future opportunities in the field, underscoring the vast potential and evolving nature of VNP research.",
        "DOI": "10.1021/acsnano.4c13146",
        "paper_author": "Sun X.",
        "affiliation_name": "Jianghan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60002790"
    },
    {
        "paper_title": "The structural Basis of NMN synthesis catalyzed by NadV from Haemophilus ducreyi",
        "publication": "Biochemical and Biophysical Research Communications",
        "citied_by": "1",
        "cover_date": "2024-12-17",
        "Abstract": "NMN is a precursor in the biosynthesis of NAD+, a molecule that plays a crucial role within cells. Supplementation with NMN can elevate NAD+ levels in the blood, improving symptoms of diabetes, neurodegenerative diseases, and cancer, as well as providing anti-aging benefits. Escherichia coli was engineered to heterologously express nicotinamide phosphoribosyltransferase (Nampt), enabling the recombinant E. coli to synthesize NAD derivatives from nicotinamide. The 3D structure of Nadv complexed with NAM and NMN was determined to explore the molecular mechanism by which Nadv catalyzes NMN synthesis. NAM binds at two sites: one at the catalytic site and one at the allosteric binding site, while NMN binds exclusively at the catalytic site. In both structural models, a loop between β15 and β16 is missing, likely due to its high flexibility, leading to diffuse electron density. Compared with other resolved Nampt structures, an additional 12-amino-acid loop was identified after α-helix 12 near the catalytic site. This study lays the groundwork for the engineering of Nadv, facilitating its efficient application in biological synthesis of NMN.",
        "DOI": "10.1016/j.bbrc.2024.150889",
        "paper_author": "Wang Z.J.",
        "affiliation_name": "West China School of Medicine/West China Hospital of Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60073509"
    },
    {
        "paper_title": "Impact of different 2D materials on the efficacy of photothermal and photodynamic therapy in 3Dbioprinted breast cancer",
        "publication": "Nanoscale",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "The convergence of nanotechnology and tissue engineering has paved the way for innovative cancer treatments that leverage the unique light absorption properties of nanomaterials. Indeed, photothermal therapy (PTT) and photodynamic therapy (PDT) utilize nanomaterials to convert near-infrared light into therapeutic energy for cancer treatment. This study focuses on the application of poly(lactic-co-glycolic acid) (PLGA) scaffolds, enhanced by graphene oxide, Ti3C2Tx MXene, and TiS2 transition metal dichalcogenides for PDT and PTT treatments evaluated within 3D-bioprinted breast cancers. Our scaffolds were designed to exploit the photothermal conversion efficiency and capability to generate reactive oxygen species (ROS) to compare the specific features of each 2D material. We demonstrated a reduction in tumor viability under scaffold irradiation, along with the exploration of biological responses to damage such as autophagy and pyroptosis, verifying that these scaffolds can differentially induce these processes depending on the light responsiveness of each material. The integration of these materials within 3D-printed scaffolds does not only enhance the therapeutic efficacy of PTT and PDT, but also offers a precise method to control the cellular environment after therapy, i.e. tissue regeneration and antibacterial effects, providing insights into the potential for these technologies to be adapted for personalized medicine for breast cancer treatment and reconstruction.",
        "DOI": "10.1039/d4nr05026f",
        "paper_author": "Perini G.",
        "affiliation_name": "Università Cattolica del Sacro Cuore, Campus di Roma",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60031984"
    },
    {
        "paper_title": "Ultrasmall metal nanoclusters as efficient luminescent probes for bioimaging",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Ultrasmall metal nanoclusters (NCs, o2 nm) have emerged as a novel class of luminescent probes due to their atomically precise size and tailored physicochemical properties. The rapid advancements in the design and utilization of metal NC-based luminescent probes are facilitated by the atomic-level manipulation of metal NCs. This review article explores (i) the engineering of metal NCs’ functions for bioimaging applications, and (ii) the diverse uses of metal NCs in bioimaging. We begin by presenting an overview of the engineering functions of metal NCs as luminescent probes for bioimaging applications, highlighting key strategies for enhancing NCs’ luminescence, biocompatibility and targeting capabilities towards biological specimens. Our discussion then centers on the bioimaging applications of metal NCs in subcellular organelles, individual cells, tissues, and entire organs. Finally, we offer a perspective on the challenges and potential developments in the future use of metal NCs for bioimaging applications.",
        "DOI": "10.1039/d4tb02207f",
        "paper_author": "Dou X.",
        "affiliation_name": "Universiti Malaysia Sabah",
        "affiliation_city": "Kota Kinabalu",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60017880"
    },
    {
        "paper_title": "GFP Farnesylation as a Suitable Strategy for Selectively Tagging Exosomes",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Exosomes are small extracellular vesicles (EVs) constituting fully biological, cell-derived nanovesicles with great potential in cell-to-cell communication and drug delivery applications. The current gold standard for EV labeling and tracking is represented by fluorescent lipophilic dyes which, however, importantly lack selectivity, due to their unconditional affinity for lipids. Herein, an alternative EV fluorescent labeling approach is in-depth evaluated, by taking advantage of green fluorescent protein (GFP) farnesylation (GFP-f), a post-translational modification to directly anchor GFP to the EV membrane. The performance of GFP-f is analyzed, in terms of selectivity and efficiency, in several typical EV experimental setups such as delivery in recipient cells, surface engineering, and cargo loading. First, the capability of GFP and GFP-f to label exosomes was compared, showing significantly higher GFP protein levels and fluorescence intensity in GFP-f- than in GFP-labeled exosomes, highlighting the advantage of directly anchoring the GFP to the EV cell membrane. Then, the GFP-f tag was further compared to Vybrant DiD lipophilic dye labeling in exosome uptake studies, by capturing EV intracellular fluorescence in a time- and concentration-dependent manner. The internalization assay revealed a particular ability of GFP-f to monitor the uptake of tagged exosomes into recipient cells, with a significant peak of intensity reached 12 h after administration by GFP-f but not Vybrant-labeled EVs. Finally, the GFP-f labeling capability was challenged in the presence of a surface modification of exosomes and after transfection for siRNA loading. Results showed that both procedures can influence GFP-f performance compared to naïve GFP-f exosomes, although fluorescence is importantly maintained in both cases. Overall, these data provide direct insight into the advantages and limitations of GFP-f as a tagging protein for selectively and accurately tracking the exosome route from isolation to uptake in recipient cells, also in the context of EV bioengineering applications.",
        "DOI": "10.1021/acsabm.4c01112",
        "paper_author": "Piccarducci R.",
        "affiliation_name": "Università di Pisa",
        "affiliation_city": "Pisa",
        "affiliation_country": "Italy",
        "affiliation_id": "60028868"
    },
    {
        "paper_title": "Thermoplastic Molding of Silk-Curcumin Sustainable Composite Materials with Antibacterial Properties",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Silk fibroin (SF) is a natural protein generated from the Bombyx mori silkworm cocoons. It is useful for many different material applications. Versatile aqueous process engineering options can be used to support the morphological and structural modifications of silk materials related to tailored physical, chemical, and biological properties. Conventional solution-based processing methods, while effective, present process control limitations, thus, thermoplastic molding of regenerated SF-based composites was pursued to fabricate dense, functionalized plastics consisting of silk and curcumin. Curcumin, the active compound in turmeric (Curcuma longa) was incorporated into SF during the high-temperature processing, with the objective to investigate composite thermoplastics with enhanced biological properties from the curcumin due to the protective role of silk during processing. The results showed that a significantly higher amount of curcumin (∼25-fold) could be added into thermoplastic molded silk materials compared with the solution route, attributed to the hydrophobicity and low solubility of curcumin in solution-based routes. The curcumin-incorporated silk thermoplastics provided stability in acidic environments like the human gut, and slow curcumin (∼2% over 8 days) release from the materials. The protective silk-curcumin materials supported improved cytocompatibility with immortalized human colorectal adenocarcinoma (Caco-2) cells at high doses. The intestinal epithelial barrier integrity based on zonula occluden 1 (ZO-1) testing showed that the higher amount of curcumin in the thermoplastic molded silk had no negative effects on the intestinal barrier. The functionalized silk-based plastics also displayed microwave stability and antibacterial efficacy against both Gram-positive S. aureus and Gram-negative E. coli. These silk-based sustainable plastics, functionalized with curcumin, offer potential utility for a range of consumer and medical devices.",
        "DOI": "10.1021/acsabm.4c00950",
        "paper_author": "Bhattacharjee A.",
        "affiliation_name": "Tufts School of Engineering",
        "affiliation_city": "Medford",
        "affiliation_country": "United States",
        "affiliation_id": "60137601"
    },
    {
        "paper_title": "Mimicking Scaffolds for Osteogenesis Based on Poly(vinyl alcohol) Hydrogel with Hard Calcium Phosphate and Soft Silk Fibroin Particle for Bone Regeneration: Molecular Organization, Morphology, Properties, and In Vitro Evaluation",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "In this study, poly(vinyl alcohol) (PVA)/silk fibroin particle (SFP) hydrogel scaffolds are prepared by mixing compound calcium phosphate (CCP) in different weight ratios (0, 4, 8, and 16%) via the repeated freeze-thawing method. The physicochemical characteristics and biological behavior of the hydrogel are evaluated, and the results show a decreased porous structure of the hydrogel composite with a swelling ability upon CCP addition; however, the mechanical strength and degradation rate increase. Cell attachment and growth analyses demonstrate PVA/SFP/CCP as nontoxic to cells. Furthermore, osteogenesis evaluation shows that the group with 8% CCP in PVA/SFP hydrogel exhibits higher cell adhesion and proliferation than other groups. Additionally, the group exhibits better osteogenic performance than the other groups when alkaline phosphatase activity, total protein content, and calcium deposition are compared. Considered as a mixture, the PVA/SFP/CCP hydrogel is promising for bone tissue engineering applications; particularly, PVA/SFP/8% CCP serves as an optimal choice.",
        "DOI": "10.1021/acsabm.4c00897",
        "paper_author": "Zhao D.",
        "affiliation_name": "Guangdong Pharmaceutical University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60073525"
    },
    {
        "paper_title": "Photothermally Active Quantum Dots in Cancer Imaging and Therapeutics: Nanotheranostics Perspective",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "1",
        "cover_date": "2024-12-16",
        "Abstract": "Cancer is becoming a global threat, as the cancerous cells manipulate themselves frequently, resulting in mutants and more abnormalities. Early-stage and real-time detection of cancer biomarkers can provide insight into designing cost-effective diagnostic and therapeutic modalities. Nanoparticle and quantum dot (QD)-based approaches have been recognized as clinically relevant methods to detect disease biomarkers at the molecular level. Over decades, as an emergent noninvasive approach, photothermal therapy has evolved to eradicate cancer. Moreover, various structures, viz., nanoparticles, clusters, quantum dots, etc., have been tested as bioimaging and photothermal agents to identify tumor cells selectively. Among them, QDs have been recognized as versatile probes. They have attracted enormous attention for imaging and therapeutic applications due to their unique colloidal stability, optical and physicochemical properties, biocompatibility, easy surface conjugation, scalable production, etc. However, a few critical concerns of QDs, viz., precise engineering for molecular imaging and sensing, selective interaction with the biological system, and their associated toxicity, restrict their potential intervention in curing cancer and are yet to be explored. According to the U.S. Food and Drug Administration (FDA), there is no specific regulation for the approval of nanomedicines. Therefore, these nanomedicines undergo the traditional drug, biological, and device approval process. However, the market survey of QDs is increasing, and their prospects in translational nanomedicine are very promising. From this perspective, we discuss the importance of QDs for imaging, sensing, and therapeutic usage pertinent to cancer, especially in its early stages. Moreover, we also discuss the rapidly growing translational view of QDs. The long-term safety studies and cellular interaction of these QDs could enhance their visibility and bring photothermally active QDs to the clinical stage and concurrently to FDA approval.",
        "DOI": "10.1021/acsabm.4c01190",
        "paper_author": "Debnath M.",
        "affiliation_name": "Indian Institute of Technology Bombay",
        "affiliation_city": "Mumbai",
        "affiliation_country": "India",
        "affiliation_id": "60014153"
    },
    {
        "paper_title": "Sequence Context in DNA i-Motifs Can Nurture Very Stable and Persistent Kinetic Traps",
        "publication": "ChemBioChem",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "I-motifs are non-canonical DNA structures with recognized biological significance and a proven utility in material engineering. Consequently, understanding and control of i-motif properties is essential to sustain progress across both disciplines. In this work, we systematically investigate how proximity to the most common form of DNA, a double-stranded duplex, influences the thermodynamic and kinetic properties of adjacent i-motifs. We demonstrate that double-stranded stems in i-motif loops promote kinetic trapping of very stable and persistent partially folded conformations. Further, we investigate pathways toward rational control over a folding topology makeup.",
        "DOI": "10.1002/cbic.202400647",
        "paper_author": "Minasyan A.S.",
        "affiliation_name": "Northern Illinois University",
        "affiliation_city": "DeKalb",
        "affiliation_country": "United States",
        "affiliation_id": "60009550"
    },
    {
        "paper_title": "Biohybrid Micro/Nanorobots: Pioneering the Next Generation of Medical Technology",
        "publication": "Advanced Healthcare Materials",
        "citied_by": "4",
        "cover_date": "2024-12-16",
        "Abstract": "Biohybrid micro/nanorobots hold a great potential for advancing biomedical research. These tiny structures, designed to mimic biological organisms, offer a promising method for targeted drug delivery, tissue engineering, biosensing/imaging, and cancer therapy, among other applications. The integration of biology and robotics opens new possibilities for minimally invasive surgeries and personalized healthcare solutions. The key challenges in the development of biohybrid micro/nanorobots include ensuring biocompatibility, addressing manufacturing scalability, enhancing navigation and localization capabilities, maintaining stability in dynamic biological environments, navigating regulatory hurdles, and successfully translating these innovative technologies into clinical applications. Herein, the recent advancements, challenges, and future perspectives related to the biomedical applications of biohybrid micro/nanorobots are described. Indeed, this review sheds light on the cutting-edge developments in this field, providing researchers with an updated overview of the current potential of biohybrid micro/nanorobots in the realm of biomedical applications, and offering insights into their practical applications. Furthermore, it delves into recent advancements in the field of biohybrid micro/nanorobotics, providing a comprehensive analysis of the current state-of-the-art technologies and their future applications in the biomedical field.",
        "DOI": "10.1002/adhm.202402102",
        "paper_author": "Zarepour A.",
        "affiliation_name": "Saveetha Dental College And Hospitals",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60109334"
    },
    {
        "paper_title": "Hierarchically Structured Biodegradable Microspheres Promote Therapeutic Angiogenesis",
        "publication": "Advanced Healthcare Materials",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Promoting neovascularization is a prerequisite for many tissue engineering applications and the treatment of cardiovascular disease. Delivery of a pro-angiogenic stimulus via acellular materials offers several benefits over biological therapies but has been hampered by interaction of the implanted material with the innate immune response. However, macrophages, a key component of the innate immune response, release a plurality of soluble factors that can be harnessed to stimulate neovascularization and restore blood flow to damaged tissue. This study investigates the ability of biodegradable poly(D,L-lactic-co-glycolic acid) (PLGA) microspheres to restore tissue perfusion in a hind limb model of ischaemia. Microspheres exhibiting a hierarchical porous structure are associated with an increase in blood flow at day 21 post-implantation compared with solid microspheres composed of the same polymer. This corresponds with an increase in blood vessel density in the surrounding tissue. In vitro simulation of the foreign body response observed demonstrates M2-like macrophages incubated with the porous microspheres secreted increased amounts of vascular endothelial growth factor (VEGF) compared with M1-like macrophages providing a potential mechanism for the increased neovascularization. The results from this study demonstrate implantable biodegradable porous microspheres provide a novel approach for increasing neovascularization that could be exploited for therapeutic applications.",
        "DOI": "10.1002/adhm.202401832",
        "paper_author": "Hendow E.K.",
        "affiliation_name": "UCL Division of Medicine",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60182839"
    },
    {
        "paper_title": "Benefits of In Situ Foamed and Printed Porous Scaffolds in Wound Healing",
        "publication": "Advanced Healthcare Materials",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Macroporous hydrogels have shown significant promise in biomedical applications, particularly regenerative medicine, due to their enhanced nutrient and waste permeability, improved cell permissibility, and minimal immunogenicity. However, traditional methods of generating porous hydrogels require secondary post-processing steps or harmful reagents making simultaneous fabrication with bioactive factors and cells impossible. Therefore, a handheld printer is engineered for facile and continuous generation and deposition of hydrogel foams directly within the skin defect to form defect-specific macroporous scaffolds. Within the handheld system, a temperature-controlled microfluidic homogenizer is coupled with miniaturized liquid and air pumps to mix sterile air with gelatin methacryloyl (GelMA) at the desired ratio. An integrated photocrosslinking unit is then utilized to crosslink the printed foam in situ to form scaffolds with controlled porosity. The system is optimized to form reliable and uniform GelMA foams. The resulting foam scaffolds demonstrate mechanical properties with excellent flexibility making them suitable for wound healing applications. The results of in vitro cell culture on the scaffolds demonstrate significantly increased cellular activity compared to the solid hydrogel. The in vivo printed foam scaffolds enhanced the rate and quality of wound healing in mice with full-thickness wound without the use of biological materials.",
        "DOI": "10.1002/adhm.202401944",
        "paper_author": "Seyedsalehi A.",
        "affiliation_name": "Biomedical Engineering Department",
        "affiliation_city": "Storrs",
        "affiliation_country": "United States",
        "affiliation_id": "60151093"
    },
    {
        "paper_title": "Biomimetic Surface Nanoengineering of Biodegradable Zn-Based Orthopedic Implants for Enhanced Biocompatibility and Immunomodulation",
        "publication": "Advanced Functional Materials",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Zinc (Zn) is gaining increased recognition as a biodegradable metal in biomedical applications but clinical translation is limited due to its poor biocompatibility. This study addresses these issues through an innovative biomimetic strategy, introducing an efficient surface nanoengineering approach that creates nano-geometric features and chemical compositions by modulating the exposure time to a biological medium – Dulbecco's Modified Eagle Medium(DMEM). These nanoengineered Zn implants exhibited tunable degradation rates. The nanostructures enhanced human osteoblast attachment, proliferation, and differentiation following direct contact, and improved macrophage function by promoting pseudopod formation and transitioning from a pro-inflammatory M1 to a pro-reparative M2 phenotype. In vivo studies show that the surface-engineered implants effectively promoted tissue integration via M2 macrophage polarization, resulting in a favorable immunomodulatory environment, and increased collagen deposition. Proteomic analyses show that the tissues in the vicinity of the surface-engineered Zn implants are enriched with proteins related to key wound healing biological mechanisms such as cell adhesion, cytoskeletal structural arrangement, and immune response. This study highlights the improved biocompatibility and anti-inflammatory effects of surface-engineered Zn, with important implications for the clinical translation of biodegradable Zn-based orthopedic implants.",
        "DOI": "10.1002/adfm.202410033",
        "paper_author": "Xiang E.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004"
    },
    {
        "paper_title": "Recent Advances and Developments in Injectable Conductive Polymer Gels for Bioelectronics",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "17",
        "cover_date": "2024-12-16",
        "Abstract": "Soft matter bioelectronics represents an emerging and interdisciplinary research frontier aiming to harness the synergy between biology and electronics for advanced diagnostic and healthcare applications. In this context, a whole family of soft gels have been recently developed with self-healing ability and tunable biological mimetic features to act as a tissue-like space bridging the interface between the electronic device and dynamic biological fluids and body tissues. This review article provides a comprehensive overview of electroactive polymer gels, formed by noncovalent intermolecular interactions and dynamic covalent bonds, as injectable electroactive gels, covering their synthesis, characterization, and applications. First, hydrogels crafted from conducting polymers (poly(3,4-ethylene-dioxythiophene) (PEDOT), polyaniline (PANi), and polypyrrole (PPy))-based networks which are connected through physical interactions (e.g., hydrogen bonding, π-π stacking, hydrophobic interactions) or dynamic covalent bonds (e.g., imine bonds, Schiff-base, borate ester bonds) are addressed. Injectable hydrogels involving hybrid networks of polymers with conductive nanomaterials (i.e., graphene oxide, carbon nanotubes, metallic nanoparticles, etc.) are also discussed. Besides, it also delves into recent advancements in injectable ionic liquid-integrated gels (iongels) and deep eutectic solvent-integrated gels (eutectogels), which present promising avenues for future research. Finally, the current applications and future prospects of injectable electroactive polymer gels in cutting-edge bioelectronic applications ranging from tissue engineering to biosensing are outlined.",
        "DOI": "10.1021/acsabm.3c01224",
        "paper_author": "Peñas-Núñez S.J.",
        "affiliation_name": "Universidad del Pais Vasco",
        "affiliation_city": "Leioa",
        "affiliation_country": "Spain",
        "affiliation_id": "60027856"
    },
    {
        "paper_title": "Research progress on application of dye-decolorizing peroxidases in lignin degradation",
        "publication": "Food and Fermentation Industries",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "In the development and utilization of plant biomass resources, such as corn straw and wheat bran, it is found that lignin is difficult to degrade because of its complex structure, which greatly hinders the release of internal active substances and affects the processing characteristics of raw materials. Therefore, degradation of lignin is one of the important steps to improve the utilization value of plant biomass resources. The pretreatment methods commonly used for lignin degradation are physical methods, chemical methods, and biological methods. The biological method mainly uses microorganisms or their enzymes to degrade lignin, among which the dye-decolorizing peroxidases (EC. 1. 11. 1. 19 DyPs) play a positive effect on lignin treatment and can degrade different dyes, oxidize carotenoids, and methoxylated aromatics, etc. DyPs are very different from other fungal peroxidases such as lignin peroxidase (LiP) and manganese peroxidase (MnP) in terms of amino acid sequence, protein structure, catalytic residues, physical and chemical properties. Therefore, this paper reviewed the structures and catalytic properties of DyPs in terms of amino acid sequence and enzymatic properties and summarized the efficient degradation ability of the typical DyPs on lignin. Meanwhile, the research strategies to improve the stability and catalytic activity of DyPs based on genetic engineering as well as the important industrial applications and challenges of DyPs were reviewed in this paper.",
        "DOI": "10.13995/j.cnki.11-1802/ts.038504",
        "paper_author": "Xu Y.",
        "affiliation_name": "Henan University of Technology",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60017970"
    },
    {
        "paper_title": "Research advances on lysosomal storage diseases and the therapeutic replacement enzymes",
        "publication": "Chinese Journal of New Drugs",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Lysosomal storage disorder (LSD) is a multi-organ dysfunction oaused by the functional deficit of lysosomal hydrolases, resulting in their Substrate storage in organs. More than 70 LSDs have been reported up to now, involving the deficiency of multiple lysosomal hydrolases. Several kind of LSDs can be treated with approved, disease-specific therapies based on enzyme replacement therapy (ERT), small molecules (Substrate reduction therapies and chaperones) therapy and gene therapy, among which the most widely applied therapy is the enzyme replacement therapy, characterized by supplying deficient enzymes through intravenous injection. Now there have been 19 ERT agents for LSD approved by United States FDA. This review aims to give a brief introduction on some common lysosomal storage disorders with the corresponding ERT drugs, and the drugs under development in clinical trials.",
        "DOI": "NA",
        "paper_author": "Yang K.Q.",
        "affiliation_name": "Institute of Materia Medica, Chinese Academy of Medical Sciences &amp; Peking Union Medical College",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60073468"
    },
    {
        "paper_title": "Balance equations for physics-informed machine learning",
        "publication": "Heliyon",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Using traditional machine learning (ML) methods may produce results that are inconsistent with the laws of physics. In contrast, physics-based models of complex physical, biological, or engineering systems incorporate the laws of physics as constraints on ML methods by introducing loss terms, ensuring that the results are consistent with these laws. However, accurately deriving the nonlinear and high order differential equations to enforce various complex physical laws is non-trivial. There is a lack of comprehensive guidance on the formulation of residual loss terms. To address this challenge, this paper proposes a new framework based on the balance equations, which aims to advance the development of PIML across multiple domains by providing a systematic approach to constructing residual loss terms that maintain the physical integrity of PDE solutions. The proposed balance equation method offers a unified treatment of all the fundamental equations of classical physics used in models of mechanical, electrical, and chemical systems and guides the derivation of differential equations for embedding physical laws in ML models. We show that all of these equations can be derived from a single equation known as the generic balance equation, in conjunction with specific constitutive relations that bind the balance equation to a particular domain. We also provide a few simple worked examples how to use our balance equation method in practice for PIML. Our approach suggests that a single framework can be followed to incorporate physics into ML models. This level of generalization may provide the basis for more efficient methods of developing physics-based ML for complex systems.",
        "DOI": "10.1016/j.heliyon.2024.e38799",
        "paper_author": "Molnar S.M.",
        "affiliation_name": "Academia Sinica, Institute of Astronomy and Astrophysics",
        "affiliation_city": "Taipei",
        "affiliation_country": "Taiwan",
        "affiliation_id": "60091990"
    },
    {
        "paper_title": "The maximum size of cell-aggregates is determined by the competition between the strain energy and the binding energy of cells",
        "publication": "Heliyon",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "The development of tissues and organs is affected by how cells interact with each other to form aggregates. Such an interaction is in turn determined by several different factors, such as inter-cellular attractive forces, cell motility, and the strain energy of cells. Here, we have used mathematical modelling and numerical simulations to explore how the interplay between these factors can influence the formation and stability of 2D cell aggregates. Cell aggregates were created by incrementally accumulating cells over an initial seed. The binding energy density of these aggregates was determined using the harmonic approximation and was integrated into a probabilistic model to estimate the maximum cluster size, beyond which the aggregate becomes unstable and breaks into smaller fragments. Our simulations reveal that the ratio of strain energy to internal adhesive energy (Us/Ub) critically impacts cell aggregation; smaller ratios allow for larger cluster sizes. These findings have significant implications for tissue engineering, in-vitro modeling, the study of neurodegenerative diseases, and tissue regeneration, providing insights into how physical and biological characteristics of cells influence their aggregation and stability.",
        "DOI": "10.1016/j.heliyon.2024.e40560",
        "paper_author": "Gentile F.",
        "affiliation_name": "Università degli studi Magna Graecia di Catanzaro",
        "affiliation_city": "Catanzaro",
        "affiliation_country": "Italy",
        "affiliation_id": "60069616"
    },
    {
        "paper_title": "Alloyed geometric structure strategy enables high-quality water-soluble quantum dots for ultrasensitive fluorescence immunoassay",
        "publication": "Chemical Engineering Journal",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "The rapid advance and growth of the point-of-care diagnosis industry has provided an impetus for the development of novel signal labels for highly sensitive bio-molecule detections. Colloidal quantum dots (QDs) exhibit superior brightness, facile surface functionalization and exceptional photostability, making them the preferred option for these biological applications. However, the significantly reduced fluorescence intensity and limited photochemical stability in complex biological environments have greatly hampered their further use. Herein, with an innovative alloying engineering strategy, the high-quality water-soluble CdSe/CdxZn1−xS QDs with near-unity PL quantum yield and monoexponential PL decay dynamics are obtained. Notably, for the first time, a record-breaking stability at the single QD level in water with nonblinking behavior persisting for an hour is achieved, which approaching those of state-of-the-art hydrophobic QDs. Furthermore, the nanocomposites formulated with these novel alloyed QDs demonstrate a remarkable PL QY of 96 % and provide an ultrasensitive detection for prostate specific antigen on lateral flow immunoassays. These findings presented here shed new light on the design of high-brightness water-soluble QDs in single-molecule level and QDs-based nanocomposites, significantly pushing ahead toward high-sensitivity biomedical detections and diagnosis.",
        "DOI": "10.1016/j.cej.2024.157799",
        "paper_author": "Ou W.",
        "affiliation_name": "University of Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027363"
    },
    {
        "paper_title": "Corrigendum to “Functionalized interfacial cover design toward pure silicon anode for high power density lithium–ion capacitor” [Chem. Eng. J. 490 (2024) 151635] (Chemical Engineering Journal (2024) 490, (S1385894724031188), (10.1016/j.cej.2024.151631))",
        "publication": "Chemical Engineering Journal",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "The authors regret that the original publication of our article contained a minor error in the affiliation of one of the corresponding authors. The institute name of the corresponding author, Junghyun Choi, was omitted. We would like to modify the affiliation of Prof. Junghyun Choi to the following: “School of Chemical, Biological and Battery Engineering, Gachon University, Seongnam-si, Gyeonggi-do, 13120, Republic of Korea.” This modification does not affect the scientific aspect of the publication in any way. The authors would like to apologise for any inconvenience caused.",
        "DOI": "10.1016/j.cej.2024.157713",
        "paper_author": "Ju O M.",
        "affiliation_name": "Korea Institute of Ceramic Engineering And Technology",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60081223"
    },
    {
        "paper_title": "Advances in engineered microbes for sustainable biofuel production: Current research and future outlook on lignocellulose utilization",
        "publication": "Industrial Crops and Products",
        "citied_by": "3",
        "cover_date": "2024-12-15",
        "Abstract": "The upsurge in global warming, combined with the depletion of fossil fuels, has led researchers interested in other fuel sources. The search for alternative fossils moved towards the biological; degradation of waste biomass for the production of biofuels such as biohydrogen, biodiesel and bioethanol. The capability of biofuel production can be enhanced by the utilization of a model strain that holds the ability to operate at high substrate, transport sugar through deregulated pathways, and increase metabolic fluxes for improved production. Biofuel production by microorganisms shares similar properties with petroleum-based fuels. Achieving a sufficiently high yield of fuel necessitates the practical use of engineered microbes. The purpose of this review is to provide a comprehensive overview of the sources, pretreatment strategies, and production technologies involving metabolic engineering for biofuel generation. The lignocellulosic biomass has been identified as the major sources of biomass with physical treatment reported to be the most followed pre-treatment strategy. Metabolic engineering of microbes is preferred over other production techniques due to its higher efficiency, optimization of metabolic pathways, increased enzyme production and reduced by-product formation. The recent advances in engineered microbes focus on the optimization of metabolic pathways, CRISPR/Cas9, Gene Editing and modular engineering. This review also focuses on the economic and environmental concerns of biofuel production on feedstock utilization, management practices, and production scale. Finally, this paper highlights the future endeavours of the implantation of effective low-cost technologies for biofuel production in advancing culture conditions and genetic modification of biofuel-generating microbial species.",
        "DOI": "10.1016/j.indcrop.2024.119988",
        "paper_author": "Kamalesh R.",
        "affiliation_name": "Saveetha School of Engineering",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60109336"
    },
    {
        "paper_title": "Global techno-economic analysis of MBR for hospital wastewater treatment",
        "publication": "Science of the Total Environment",
        "citied_by": "1",
        "cover_date": "2024-12-15",
        "Abstract": "This study comprehensively examines and characterizes global membrane bioreactor (MBR) practices for hospital wastewater treatment, focusing on development trends, technical performance (pollutant removal and carbon emissions), and economic costs, including both capital expenditures (CAPEX) for civil engineering and equipment procurement, and operational expenditures (OPEX) for electricity, membrane replacement, labor, and chemical costs, as well as system footprint. The results show that MBR has been widely used for hospital wastewater treatment for over two decades, with global applications and scales significantly increasing, especially after the COVID-19 pandemic. A notable shift in membrane types has occurred, with hollow fiber membranes dominating before 2010 and flat inorganic membranes gaining prominence after 2020. MBR not only effectively removes conventional pollutants but also greatly reduces pathogens, ARBs and ARGs before disinfection, thus alleviating the subsequent disinfection burden. In addition, MBR is a crucial step in the process of completely removing emerging contaminants (ECs) that pose significant environmental and health risks. The CAPEX of MBR has decreased at the technical level in recent years. MBR requires only 62 % and 21 % of footprint for conventional activated sludge (CAS) and biofilm-based processes, respectively. MBR's land-saving advantage offsets the CAPEX gap with CAS in high land-cost areas. From before 2010 to after 2020, membrane costs saw the largest reduction in OPEX, dropping by 71 %, while electricity consumption saw a 10.71 % reduction, now comparable to biofilm-based processes. Currently, MBR's OPEX (0.158 USD/m3) is only slightly higher than that of biological contact oxidation (0.138 USD/m3). MBR also minimizes sludge production, reducing both treatment costs and associated disposal risks. MBR exhibit minimal concerns of excessive carbon emissions, with a carbon emission intensity (1.11 kg CO2eq·m−3), only slightly higher than biofilm-based processes (0.92 kg CO2eq·m−3). This study demonstrates that MBR is the valuable and practical solution for hospital wastewater treatment, as well as a preferred choice for upgrading existing facilities.",
        "DOI": "10.1016/j.scitotenv.2024.177172",
        "paper_author": "He J.",
        "affiliation_name": "Renmin University of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014402"
    },
    {
        "paper_title": "Enrichment of strontium and magnesium improves the physical, mechanical and biological properties of bioactive glasses undergoing thermal treatments: New cues for biomedical applications",
        "publication": "Ceramics International",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Bioactive glasses (BGs) have emerged as invaluable resources for bone tissue engineering due to their remarkable properties such as bioactivity, resorbability, cell compatibility, and osteoconductivity. However, these materials exhibit certain limitations when subjected to high temperatures, for their tendency to crystallize, thus leading to diminished bioactivity, reduced mechanical strength, and altered dissolution kinetics. One promising approach to counteract this problem is to reduce the alkaline element content in BGs while simultaneously adding strontium and magnesium. Building on previous studies of Bio_MS, a recently developed experimental formulation, we investigated the contributions of strontium and magnesium to the thermal, mechanical, and biological properties of various bioactive glasses, including commercially available options. Differential thermal analysis, heating microscopy, X-ray diffractometry, environmental scanning electron microscopy, measurement of the Young's modulus, simulated body fluid testing, cytotoxicity tests, cell viability, growth, adhesion and morphology were assessed through an integrated approach and compared for a complete evaluation of BGs, and of doped BGs, also undergoing thermal treatments. The results demonstrated improved thermal, mechanical and biological behaviors of the magnesium-strontium-doped BGs, thus paving the way for the development of BGs with enhanced biomedical perspectives.",
        "DOI": "10.1016/j.ceramint.2024.10.135",
        "paper_author": "Bellucci D.",
        "affiliation_name": "Università degli Studi di Modena e Reggio Emilia",
        "affiliation_city": "Modena",
        "affiliation_country": "Italy",
        "affiliation_id": "60004591"
    },
    {
        "paper_title": "Physico-mechanical properties, hydroxyapatite conversion, biodegradability and antibacterial activity studies of melt-derived BGs based on SiO<inf>2</inf>-CaO-Na<inf>2</inf>O-P<inf>2</inf>O<inf>5</inf> quaternary system",
        "publication": "Ceramics International",
        "citied_by": "1",
        "cover_date": "2024-12-15",
        "Abstract": "The slow biodegradation and low hydroxyapatite (HA) conversion of silicate-based bioactive glasses (BGs) have severely limited their compatibility with biological tissues. To address these challenges, four samples in the form of (52-x)SiO2-24Na2O-24CaO-xP2O5, where x is 2, 4, 6, and 8 mol%, were prepared by a unified melt-quenching method, and the feasibility of P2O5 content fine-tuning in improving glass structure, biodegradability, bioactivity, and antibacterial efficiency was evaluated. The results indicated that as the degree of P2O5 substitution increased, the network structure of the glass became looser, which provided favourable conditions for its degradation. The variation in activation energy for Si4+ ion release from 0.39 eV to 0.25 eV also supported this observation. After 7 days of immersion in simulated body fluid (SBF), analyses by energy dispersive spectroscopy (EDS), X-ray diffraction (XRD) and Fourier transform infrared (FTIR) confirmed that the Ca-P compounds deposited on the glass surfaces were essentially hydroxycarbonated apatite (HCA), and scanning electron microscopy (SEM) images revealed that the generation rate of the HCA were positively correlated with the P2O5 content in the glass system. Meanwhile, antibacterial studies showed that after 24 h of incubation, the antibacterial activity of the four glass samples against Escherichia coli (E. coli) successively increased, with the highest percentage reaching 87.13 ± 2.51 %. In conclusion, this study demonstrates that controllable degradation and high-level bioactivity can be achieved by modulating the P2O5 content in silicate-based BGs, which proves to be an effective and practicable strategy.",
        "DOI": "10.1016/j.ceramint.2024.10.162",
        "paper_author": "Li F.",
        "affiliation_name": "University of Shanghai for Science and Technology",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60008691"
    },
    {
        "paper_title": "Serum per- and polyfluoroalkyl substance (PFAS) levels and health-related biomarkers in a pilot study of skiers in New England",
        "publication": "Environmental Research",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Background: Per- and polyfluoroalkyl substances (PFAS), synthetic chemicals with adverse health effects, are used extensively in consumer products. Ski waxes, applied to the base of skis, contain up to 100% PFAS by mass, but exposure and health effects are poorly characterized. Objectives: Our objectives were to quantify serum PFAS concentrations among skiers and explore associations with reported ski wax use and biomarkers of cardiometabolic, thyroid, and immune health. Methods: We recruited 30 active adult skiers to provide non-fasting blood samples and complete questionnaires. We quantified 18 PFAS using mass spectrometry, and measured serum lipids, thyroid hormones, and immunoglobulins. We explored associations of individual and aggregate measures of serum PFAS with wax use indicators and health biomarkers using multivariable regression models, adjusted for age and gender identity. Results: Nine PFAS (PFBS, PFHpS, PFHxS, Sm-PFOS, n-PFOS, PFDA, PFNA, PFUnDA, n-PFOA) were detected in 100% of participants, and MeFOSAA in 93%. Compared to NHANES, median serum concentrations (ng/ml) were similar, but higher in coaches (e.g., PFOAall: 1.1, PFOAcoaches: 2.7, PFOANHANES: 1.2; PFNAall: 0.5, PFNAcoaches: 1.7, PFNANHANES: 0.4). Factors reflecting wax exposure were positively associated with PFAS: e.g., >10 years as a snow sport athlete, compared to ≤10 years, was associated with 3.2 (95% CI: 0.7, 5.6) ng/ml higher aggregate PFAS, as defined by National Academies of Science, Engineering, and Medicine (NASEM). An IQR (6.3 ng/ml) increase in NASEM PFAS was associated with 32.1 (95% CI: 7.0, 57.2), 35.5 (13.5, 57.5), and 12.8 (0.6, 25.1) mg/dl higher total cholesterol, LDL-C, and sdLDL-C, respectively. Discussion: Our study provides early evidence that recreational skiers, particularly coaches, are exposed to PFAS through ski wax. Several PFAS were associated with higher serum lipids among these physically active adults. Interventions to remove PFAS from fluorinated wax could decrease direct exposure to skiers and reduce PFAS release into the environment.",
        "DOI": "10.1016/j.envres.2024.120122",
        "paper_author": "Claus Henn B.",
        "affiliation_name": "School of Public Health",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60018701"
    },
    {
        "paper_title": "Characteristics of a heavy metal resistant heterotrophic nitrification–aerobic denitrification bacterium isolated from municipal activated sludge",
        "publication": "Environmental Research",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "The heterotrophic nitrification-aerobic denitrification (HNAD) is a new biological denitrification technology, the present study isolated a new HNAD strain named Cupriavidus metallidurans TX6 with heavy metal resistance. The gene expression, electron transport, enzyme activity and nitrogen removal property of strain TX6 were studied with different influencing factors. Strain TX6 has five nitrogen metabolism pathways (NH4+ → NH2OH → NO → NO2− → NH4+ → GOGAT/GDH; NH4+-N → NH2OH → NO → N2O → N2; NH4+ → NH2OH → NO → NO2− → NO3−; NO3− → NO2− → NH4+ → GOGAT/GDH; NO3−→ NO2− → NH4+ → GOGAT/GDH). Nitrogen balance analysis shows that 29 ± 4 mg/L of N was converted to intracellular nitrogen by assimilation and 50 ± 3 mg/L N loss may be attributed to aerobic denitrification. The results provide a theoretical basis for the HAND bacteria application in nitrogen removal from wastewaters containing heavy metals.",
        "DOI": "10.1016/j.envres.2024.120111",
        "paper_author": "Liu Z.",
        "affiliation_name": "Huazhong University of Science and Technology",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60025761"
    },
    {
        "paper_title": "Application of machine learning in ultrasonic pretreatment of sewage sludge: Prediction and optimization",
        "publication": "Environmental Research",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "In this research, typical industrial scenarios were analyzed optimized by machine learning algorithms, which fills the gap of massive data and industrial requirements in ultrasonic sludge treatment. Principal component analysis showed that the ultrasonic density and ultrasonic time were positively correlated with soluble chemical oxygen demand (SCOD), total nitrogen (TN), and total phosphorus (TP). Within five machine learning models, the best model for SCOD prediction was XG-boost (R2 = 0.855), while RF was the best for TN and TP (R2 = 0.974 and 0.957, respectively). In addition, SHAP indicated that the importance feature for SCOD, TN, and TP was ultrasonic time, and sludge concentration, respectively. Finally, the typical industrial scenario of ultrasonic pretreatment of sludge was analyzed. In the secondary sludge, treatment volume at 0.6 L, the pH at 7.0, and the ultrasonic time at 20 min was best to improve the SCOD. In the ultrasonic pretreatment primary sludge, treatment volume of 0.3 L, pH of 7.0, and ultrasonic time of 15 min was best to improve the SCOD. Furthermore, the ultrasonic power at 700 W and ultrasonic time at 20 min were best to improve the C/N and C/P in the secondary sludge. In the primary sludge, the ultrasonic power at 600 W, and the ultrasonic time at 15 min were best to improve C/N and C/P. This study lays a foundation for the practical application of ultrasonic pretreatment of sludge and provides basic information for typical industrial scenarios.",
        "DOI": "10.1016/j.envres.2024.120108",
        "paper_author": "Zhang J.",
        "affiliation_name": "Hebei University of Technology",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60032389"
    },
    {
        "paper_title": "Establishment of clary sage (Salvia sclarea L.) regeneration system and development of glyphosate-tolerant clary sage plants through Agrobacterium-mediated genetic transformation",
        "publication": "Industrial Crops and Products",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Clary sage (Salvia sclarea L.) is well known as a highly aromatic herbaceous plant and is commonly used in aromatic products and medicine. The biggest problem in the cultivation of clary sage is weeds, which not only entails a great cost of labor for weeding, but also leads to a great fluctuation in the yield and quality of its products. Therefore, there is a need to breed herbicide-resistant clary sage using genetic engineering. However, the lack of suitable regeneration and genetic transformation systems for clary sage has limited the process of molecular breeding. In this study, we firstly reported the regeneration system of clary sage, where explants from hypocotyls of sage induced adventitious shoots at a rate of 22.22 % when cultured on MS medium supplemented with 2.5 mg·L−1 6-BA, 0.15 mg·L−1 IAA, and 0.25 mg·L−1 VC. Rooting of adventitious shoots was achieved at a rate of 94.44 % on 1/2 MS medium containing 0.125 mg·L−1 NAA, 0.5 mg·L−1 IAA, and 0.1 mg·L−1 IBA. Secondly, based on the regeneration system, an efficient and stable Agrobacterium-mediated genetic transformation system was established in this paper, and the rate of genetic transformation was determined to be in the range of 3 %-5 % by transforming the hypocotyls of clary sage with pCAMBIA1301 vector and pCAMBIA1301-GR79-GAT vector. Finally, glyphosate tolerance was obtained from GR79 and GAT co-expressed clary sage plants in this study. This study not only lays the foundation of genetic transformation for the functional gene research and in-depth investigation of various biological problems of clary sage, but also provides a feasible genetic engineering solution for its industry to solve the weed problem, as well as a promotional role for precise molecular breeding of clary sage.",
        "DOI": "10.1016/j.indcrop.2024.119745",
        "paper_author": "Hou M.",
        "affiliation_name": "Shihezi University",
        "affiliation_city": "Shihezi",
        "affiliation_country": "China",
        "affiliation_id": "60030922"
    },
    {
        "paper_title": "Engineering arabinose-to-arabitol conversion in industrial Saccharomyces cerevisiae for sugar beet pulp valorization",
        "publication": "Industrial Crops and Products",
        "citied_by": "1",
        "cover_date": "2024-12-15",
        "Abstract": "Arabitol, a promising low-calorie sweetener for the food industry, faces production challenges due to the high costs and the environmental impact of conventional chemical methods, as well as the inefficiency of biological approaches using native arabitol-producing yeasts. The Saccharomyces cerevisiae GRE3 gene encodes an NADPH-dependent aldose reductase, capable of converting various aldoses to their respective sugar alcohols. By leveraging the enzyme's broad substrate specificity, the simultaneous conversion of xylose and arabinose into xylitol and arabitol, respectively, was achieved. This study showcases the feasibility of using engineered industrial yeast strains, overexpressing the native GRE3 gene, for the one-step conversion of arabinose to arabitol. Engineered strains (PE2–2-pGRE3, PE2–2-pGRE3-XII5, CA11-pGRE3, CA11-pGRE3-XII5, CAT1- pGRE3 and CAT1- pGRE3-XII5) exhibited successful arabinose-to-arabitol conversion, with a 3.5-fold variation in arabitol concentrations across strains. Further enhancement of the best-performing strain through overexpression of the GAL2 gene significantly improved arabinose transport, resulting in a 1.95-fold increase in arabitol productivity. This engineered strain, free of heterologous genes, also demonstrated its potential by converting arabinose-rich sugar-beet pulp hydrolysate into arabitol, reaching a titer of 15 g/L with a yield of 1 g/g. This study represents the first example of arabitol production from agro-food waste using genome-edited S. cerevisiae strains, which contain no foreign genes, as a versatile and efficient host.",
        "DOI": "10.1016/j.indcrop.2024.119718",
        "paper_author": "Baptista S.L.",
        "affiliation_name": "Universidade do Minho",
        "affiliation_city": "Braga",
        "affiliation_country": "Portugal",
        "affiliation_id": "60020475"
    },
    {
        "paper_title": "Numerical simulation of a non-linear sublimation process with temperature-dependent permeability and volumetric heat source: A phase change problem",
        "publication": "Computers and Mathematics with Applications",
        "citied_by": "1",
        "cover_date": "2024-12-15",
        "Abstract": "Conventional freeze-drying takes a long drying time and makes the process expensive. High-quality biological materials, medicine, and vaccines may not find easy acceptance with this technology. To overcome the operative time, several engineering innovations are carried out. A long drying time during freeze-drying can be minimized by accelerating the sublimation rate. Obtaining a fast drying rate without harming the material properties is the prime focus of the accelerated freeze-drying (AFD) like-techniques. In connection with this, the study of temperature-dependent thermal-physical properties of the medium during sublimation is considered in this study. For example, a temperature-dependent volumetric heat source is assumed within the vapor region. An increase in the temperature field results in higher pressure. Therefore, a temperature-dependent specific heat of vapor pressure is also accounted for. Furthermore, the permeability of the medium and the specific heat of the water vapor are also assumed to be temperature-dependent. Exploring realistic theoretical models with variable-dependent characteristics and convection is essential since the experimental investigation of sublimation in a porous media may be challenging. Despite the previous available studies on sublimation heat and mass transfer, there is still a lack of mathematical modeling of this particular problem. To solve this non-linear sublimation problem, the Genocchi operational matrix of differentiation method (GOMOD) method is employed to obtain the numerical results. In case of full non-linear model, results obtained via current numerical technique are verified with finite-difference method (FDM). Furthermore, in a particular case, the accuracy test of the GOMOD method against FDM is presented, and it is found that the current numerical technique is more accurate than FDM. In the current study, it is found that a temperature-dependent heat source offers a faster sublimation rate than a constant one. Similarly, temperature-dependent specific heat of vapor pressure accelerates the pressure distribution within the sublimated region. With temperature-dependent permeability, the concentration distribution within the medium decreases. Moreover, the temperature-dependent specific heat of water vapor delayed the sublimation rate. Results found from this study are expected to aid in AFD techniques, food industry and pharmaceuticals.",
        "DOI": "10.1016/j.camwa.2024.09.005",
        "paper_author": "Chaurasiya V.",
        "affiliation_name": "DIT University",
        "affiliation_city": "Dehradun",
        "affiliation_country": "India",
        "affiliation_id": "60113890"
    },
    {
        "paper_title": "Metabolic engineering of a 1,8-cineole synthase from Nicotiana suaveolens, confers enhanced resistance to Meloidogyne incognita by synergistic blend of root volatiles",
        "publication": "Industrial Crops and Products",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Root-knot nematodes (RKNs) pose a significant threat to global crop production. Given the detrimental effects of fumigants and conventional chemical nematicides, there is a growing interest in exploring biological nematicides as a promising alternative for pest control. In this study, we present data demonstrating the role of root volatiles in enhancing resistance against Meloidogyne incognita (M. incognita) in tobacco plants overexpressing NsCINS (NsCINS-OE). The NsCINS gene, derived from Nicotiana suaveolens, encodes a 1,8-cineole synthase induced by M. incognita infection and predominantly localized to the chloroplast. The roots of NsCINS-OE plants exhibited deterrent properties to infective second-stage juveniles (J2s) of M. incognita. Moreover, NsCINS-OE plants showed enhanced resistance against M. incognita, as evidenced by reduced gall numbers and egg mass counts compared to wild type (WT) plants. Notably, the emission of root volatiles from NsCINS-OE plants, including 1,8-cineole, α-terpineol, terpinene-4-ol, and furfural, was significantly higher than that of WT. In vitro assays confirmed that a mixture of commercially available volatile organic compounds (VOCs) had a deterrent effect on infective J2s. Furthermore, the natural root volatiles emitted by NsCINS-OE plants effectively enhanced tobacco's resistance against M. incognita. Our findings provide valuable insights into the role of NsCINS in volatile-based defense and highlight the potential of metabolic engineering of monoterpene synthase genes to control M. incognita by enhancing root volatile emissions.",
        "DOI": "10.1016/j.indcrop.2024.119656",
        "paper_author": "Xu G.",
        "affiliation_name": "Zhengzhou Tobacco Research Institute of CNTC",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60084557"
    },
    {
        "paper_title": "Sustainable solutions: Bio-drying for organic solid waste management",
        "publication": "Industrial Crops and Products",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "The surge in organic solid waste has become a global environmental issue, necessitating the adoption of eco-friendly methods to rapidly and stably stabilize organic waste to promote sustainable development. Bio-drying is a promising solution that utilizes microorganisms to decompose organic matter, generate bioheat, and expel moisture. This review explored the fundamental advancements, key influencing factors, and current research status of bio-drying. Additionally, it investigated the use of bio-drying to convert biological organic solid waste into agricultural fertilizers. The motivation behind this research was to find more efficient waste treatment methods to reduce environmental burdens and enhance waste utilization value. The conclusion indicated that microbial gene modification, synthetic biology engineering, intelligent monitoring and control systems, and numerical simulation technologies could significantly improve the efficiency of bio-drying. This paper systematically reviewed the development of bio-drying technology, proposed innovative technical methods, advanced the circular economy, and provided valuable references for future research.",
        "DOI": "10.1016/j.indcrop.2024.119606",
        "paper_author": "Xu M.",
        "affiliation_name": "University of Science and Technology Beijing",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60018273"
    },
    {
        "paper_title": "Binding-induced activation of CRISPR-Cas12a using PAM-engineered toehold switch and DNA tile architectures for enhanced detection of thrombin",
        "publication": "Sensors and Actuators B: Chemical",
        "citied_by": "1",
        "cover_date": "2024-12-15",
        "Abstract": "This study presents a novel biosensor that integrates CRISPR-Cas12a technology with DNA tile-based architectures to enhance thrombin detection. Utilizing PAM-engineered toehold switches, the biosensor dynamically activates the CRISPR-Cas12a system upon thrombin recognition, significantly improving both sensitivity and specificity. The label-free electrochemical detection method offers rapid, cost-effective analysis, making it ideal for real-time clinical applications. The biosensor achieved an impressive detection limit of 103 aM, surpassing traditional methods and setting a new standard for thrombin assays. The biosensor's robust performance in complex biological samples, such as diluted human serum, demonstrates its reliability for clinical diagnostics. This is particularly important for the early diagnosis and management of thrombotic and coagulation-related disorders. By combining advanced genetic engineering with traditional electrochemical techniques, the biosensor not only optimizes detection but also expands its potential applications across various biomedical fields. Overall, this biosensor provides a powerful and innovative tool for thrombin detection, offering enhanced diagnostic accuracy, faster patient management, and potential cost savings in healthcare. Its superior performance and adaptability highlight its promise for broader adoption in clinical diagnostics and other biosensing applications.",
        "DOI": "10.1016/j.snb.2024.136547",
        "paper_author": "Zhang K.",
        "affiliation_name": "Nanjing University of Information Science &amp; Technology",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60064143"
    },
    {
        "paper_title": "Electric-field assisted cascade reactions to create alginate/carboxymethyl chitosan composite hydrogels with gradient architecture and reconfigurable mechanical properties",
        "publication": "Carbohydrate Polymers",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Rational designs of polysaccharide-based hydrogels with organ-like three-dimensional architecture provide a great possibility for addressing the shortages of allograft tissues and organs. However, spatial-temporal control over structure in bulk hydrogel and acquire satisfied mechanical properties remain an intrinsic challenge to achieve. Here, we show how electric-field assisted molecular self-assembly can be coupled to a directional reaction-diffusion (RD) process to produce macroscopic hydrogel in a controllable manner. The electrical energy input was not only to generate complex molecule gradients and initiate the molecular self-assembly, but also to guide/facilitate the RD processes for the gel rapid growth via a cascade construction interaction. The hydrogel mechanical properties can be tuned and enhanced by using an interpenetrating biopolymer network and multiple ionic crosslinkers, leading to a wide-range of mechanical modulus to match with biological organs or tissues. We demonstrate diverse 3D macroscopic hydrogels can be easily prepared via field-assisted directional reaction-diffusion and specific joint interactions. The humility-triggered dissipation of functional gradients and antibacterial performance confirm that the hydrogels can serve as an optically variable soft device for wound management. Therefore, this work provides a general approach toward the rational fabrication of soft hydrogels with controlled architectures and functionality for advanced biomedical systems.",
        "DOI": "10.1016/j.carbpol.2024.122609",
        "paper_author": "Yan K.",
        "affiliation_name": "Wuhan Textile University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60104662"
    },
    {
        "paper_title": "Development and evaluation of a recombinant monoclonal human antibody with virus-neutralizing activity against the F glycoprotein of respiratory syncytial virus",
        "publication": "Zhurnal Mikrobiologii Epidemiologii i Immunobiologii",
        "citied_by": "0",
        "cover_date": "2024-12-14",
        "Abstract": "Introduction. Respiratory syncytial virus (RSV) is the most common pathogen causing lower respiratory tract infections in children. RSV also poses a serious threat to the elderly and immunocompromised patients. Developing a therapy based on recombinant human antibodies to block the RSV fusion (F) glycoprotein is urgent to reduce the incidence of RSV infections and prevent associated complications. Aim. To design plasmid vectors for efficient production of the recombinant monoclonal antibody FM1 in a eukaryotic expression system targeting the RSV fusion (F) glycoprotein and to evaluate its activity against RSV subtypes A and B in vitro. Materials and methods. Constructs encoding the recombinant antibody FM1 were designed using genetic engineering. Recombinant antibodies were produced in the CHO-K1 cell line through transient expression. Antibody specimens were purified from the culture supernatant using affinity chromatography, with a modified protein A as the ligand. The virus-neutralizing activity of the antibody was evaluated in a microneutralization assay using several RSV strains on a Vero cell monolayer culture. Results. We developed a two-plasmid vector system to produce the recombinant FM1 antibody targeting the RSV F glycoprotein, using CHO cells as transient producers. The antibody was successfully produced, purified, and characterized, with its biological activity confirmed. The FM1 antibody demonstrated enhanced virus-neutralizing activity against reference and seasonal RSV strains of subtypes A and B compared to the control drug palivizumab. Conclusion. A recombinant FM1 antibody-based drug could address the import substitution challenge for protective measures against RSV infection. The authors are currently developing a stable FM1 producer clone with high productivity and viability and investigating the therapeutic efficacy of this antibody in a sublethal RSV infection mouse model.",
        "DOI": "10.36233/0372-9311-611",
        "paper_author": "Klotchenko S.A.",
        "affiliation_name": "Smorodintsev Research Institute of Influenza",
        "affiliation_city": "Saint Petersburg",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "127124260"
    },
    {
        "paper_title": "Development of immunocompetent full thickness skin tissue constructs to model skin fibrosis for high-throughput drug screening",
        "publication": "Biofabrication",
        "citied_by": "0",
        "cover_date": "2024-12-13",
        "Abstract": "The lack of the immune component in most of the engineered skin models remains a challenge to study the interplay between different immune and non-immune cell types of the skin. Immunocompetent humanin vitroskin models offer potential advantages in recapitulatingin vivolike behavior which can serve to accelerate translational research and therapeutics development for skin diseases. Here we describe a three-dimensional human full-thickness skin (FTS) equivalent incorporating polarized M1 and M2 macrophages from human peripheral CD14+monocytes. This macrophage-incorporated FTS model demonstrates discernible immune responses with physiologically relevant cytokine production and macrophage plasticity under homeostatic and lipopolysaccharide stimulation conditions. M2-incorporated FTS recapitulates skin fibrosis phenotypes with transforming growth factor-β1 treatment as reflected by significant collagen deposition and myofibroblast expression, demonstrating a M2 potentiation effect. In conclusion, we successfully biofabricated an immunocompetent FTS with functional macrophages in a high-throughput (HT) amenable format. This model is the first step towards a HT-assay platform to develop new therapeutics for skin diseases.",
        "DOI": "10.1088/1758-5090/ad998c",
        "paper_author": "Lim Y.W.",
        "affiliation_name": "National Institutes of Health (NIH)",
        "affiliation_city": "Bethesda",
        "affiliation_country": "United States",
        "affiliation_id": "60006577"
    },
    {
        "paper_title": "Multibody system dynamics for bio-robotic design and simulation based on inching-locomotion caterpillar's gait: MBD-ILAR method",
        "publication": "Bioinspiration &amp; biomimetics",
        "citied_by": "0",
        "cover_date": "2024-12-13",
        "Abstract": "Inching-locomotion caterpillars (ILAR) inspire the design of 'inch-worm' robots with biomimicry features, that can be adapted to different environments, such as natural, man-made, or other planets. Therefore, this work defines a novel mathematical method called Multi-Body Dynamics for Inching-Locomotion Caterpillar Robots (MBD-ILAR) to standardize the gait simulation of this type of machines, including a payload over the head to carry an object. The method is composed of 3 steps: (i) setting the model, where the input data is defined by: the phases of walk-stride (PHAWS) based on the bioinspired robotic design (BIROD) method, linkage dimensions of insect's morphology based on the geometrical kinematic analysis (GEKINS) algorithm, the joint types, the link's mass and center of mass, and the gravity constant. Then, (ii) kinematic analysis: to solve the orientation, velocity, and acceleration; and (iii) dynamic analysis: to obtain the joint forces, attachment forces to the ground, motor's torque, and mechanical power. The method was applied in a case study adapting the dimensions of a real specimen-Geometridae sp.(35 000 species), for that purpose, a graphical user interface (GUI) was developed in order to get the biomechanical results that guarantee the robot's actuator selection: (a) attachment mechanisms: vacuum pumps with suction cups (SC) or electromagnets (EM), and (b) joints: electromechanical rotary servomotors. Finally, to validate the numerical approach of MBD-ILAR, we performed an influence study of model parameters: link's length, link's mass, and gravity on the behavior of the attachment forces to the ground, torque, and mechanical power. The future method's application is expected to be useful to complete the phase of the computational robotic design before the physically mechatronic implementation; in addition, it could be adapted to other arthropods.",
        "DOI": "10.1088/1748-3190/ad98d4",
        "paper_author": "Cornejo J.",
        "affiliation_name": "Universidad de Burgos",
        "affiliation_city": "Burgos",
        "affiliation_country": "Spain",
        "affiliation_id": "60022866"
    },
    {
        "paper_title": "Emerging Feammox Technology: Mechanisms, Biotechnological Applications, and Future Prospects",
        "publication": "ACS ES and T Engineering",
        "citied_by": "1",
        "cover_date": "2024-12-13",
        "Abstract": "Feammox, an innovative and energy-efficient biological ammonium removal technology, has attracted significant attention in recent years. Defined as the anaerobic ammonium oxidation coupled with Fe(III) reduction, Feammox involves Fe(III)-reducing microbes that oxidize ammonium to nitrite using ferric ions. Identified in diverse ecosystems, such as freshwater, marine, natural wetlands, and wastewater ecosystems, Feammox plays a vital role in the global nitrogen cycle. Numerous studies have investigated its performance, influencing factors, reaction mechanisms, and engineering applications. However, our understanding of the functional microorganisms and key genes involved in Feammox remains limited and controversial. Clearly identifying and characterizing the functional microorganisms responsible for the Feammox process are essential for its practical application in wastewater treatment. Therefore, this review critically analyzes and summarizes recent advances in Feammox research, with a focus on functional microorganisms, key genes, and regulation strategies. Initially, the review discusses the functional microorganisms of Feammox from the perspective of microbial cooperation. It then delves into the enzymatic and genetic mechanisms involved as well as the critical factors affecting Feammox microbial activity. Finally, regulation strategies to enhance the Feammox efficiency are systematically outlined. This comprehensive analysis of current Feammox research provides a clearer and more complete understanding of microbial Feammox, deepens the knowledge of its mechanisms, and establishes a solid foundation for its engineering application.",
        "DOI": "10.1021/acsestengg.4c00525",
        "paper_author": "Shi K.",
        "affiliation_name": "Nantong University",
        "affiliation_city": "Nantong",
        "affiliation_country": "China",
        "affiliation_id": "60021783"
    },
    {
        "paper_title": "Past, Present, and Future of RNA Modifications in Infectious Disease Research",
        "publication": "ACS Infectious Diseases",
        "citied_by": "0",
        "cover_date": "2024-12-13",
        "Abstract": "In early 2024, the National Academies of Sciences, Engineering, and Medicine (NASEM) released a roadmap for the future of research into mapping ribonucleic acid (RNA) modifications, which underscored the importance of better defining these diverse chemical changes to the RNA macromolecule. As nearly all mature RNA molecules harbor some form of modification, we must understand RNA modifications to fully appreciate the functionality of RNA. The NASEM report calls for massive mobilization of resources and investment akin to the transformative Human Genome Project of the early 1990s. Like the Human Genome Project, a concerted effort in improving our ability to assess every single modification on every single RNA molecule in an organism will change the way we approach biological questions, accelerate technological advance, and improve our understanding of the molecular world. Consequently, we are also at the start of a revolution in defining the impact of RNA modifications in the context of host-microbe and even microbe-microbe interactions. In this perspective, we briefly introduce RNA modifications to the infection biologist, highlight key aspects of the NASEM report and exciting examples of RNA modifications contributing to host and pathogen biology, and finally postulate where infectious disease research may benefit from this exciting new endeavor in globally mapping RNA modifications.",
        "DOI": "10.1021/acsinfecdis.4c00598",
        "paper_author": "Pan X.",
        "affiliation_name": "Leibniz-Institut für Naturstoff-Forschung und Infektionsbiologie e. V. – Hans-Knöll-Institut",
        "affiliation_city": "Jena",
        "affiliation_country": "Germany",
        "affiliation_id": "60072518"
    },
    {
        "paper_title": "Sacrificial capillary pumps to engineer multiscalar biological forms",
        "publication": "Nature",
        "citied_by": "2",
        "cover_date": "2024-12-12",
        "Abstract": "Natural tissues are composed of diverse cells and extracellular materials whose arrangements across several length scales—from subcellular lengths1 (micrometre) to the organ scale2 (centimetre)—regulate biological functions. Tissue-fabrication methods have progressed to large constructs, for example, through stereolithography3 and nozzle-based bioprinting4,5, and subcellular resolution through subtractive photoablation6, 7–8. However, additive bioprinting struggles with sub-nozzle/voxel features9 and photoablation is restricted to small volumes by prohibitive heat generation and time10. Building across several length scales with temperature-sensitive, water-based soft biological matter has emerged as a critical challenge, leaving large classes of biological motifs—such as multiscalar vascular trees with varying calibres—inaccessible with present technologies11,12. Here we use gallium-based engineered sacrificial capillary pumps for evacuation (ESCAPE) during moulding to generate multiscalar structures in soft natural hydrogels, achieving both cellular-scale (<10 µm) and millimetre-scale features. Decoupling the biomaterial of interest from the process of constructing the geometry allows non-biocompatible tools to create the initial geometry. As an exemplar, we fabricated branched, cell-laden vascular trees in collagen, spanning approximately 300-µm arterioles down to the microvasculature (roughly ten times smaller). The same approach can micropattern the inner surface of vascular walls with topographical cues to orient cells in 3D and engineer fine structures such as vascular malformations. ESCAPE moulding enables the fabrication of multiscalar forms in soft biomaterials, paving the way for a wide range of tissue architectures that were previously inaccessible in vitro.",
        "DOI": "10.1038/s41586-024-08175-5",
        "paper_author": "Sundaram S.",
        "affiliation_name": "Boston University",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60019674"
    },
    {
        "paper_title": "Interface Charge Engineering in Ferroelectric Neuristors for a Complete Machine Vision System",
        "publication": "Journal of Physical Chemistry Letters",
        "citied_by": "0",
        "cover_date": "2024-12-12",
        "Abstract": "The rapid advancement of artificial intelligence has driven the demand for hardware solutions of neuromorphic pathways to effectively mimic biological functions of the human visual system. However, current machine vision systems (MVSs) fail to fully replicate retinal functions and lack the ability to update weights through all-optical pulses. Here, by employing rational interface charge engineering via varying the charge trapping layer thickness of PMMA, we determine that the ferroelectric polarization of our ferroelectric neuristors can be flexibly manipulated through light or electrical pulses. This capability enables dynamic modulation of the device’s optoelectronic characteristics, facilitating a complete MVS. As front-end sensors, devices with the thickest PMMA (∼32 nm) demonstrate autonomous light adaptation while those with the thinnest PMMA (∼2 nm) exhibit bidirectional photoresponse characteristics akin to those of bipolar cells. Furthermore, as components of a back-end processor, the conductances of these devices with a moderate thickness (∼12 nm) can be updated linearly through all-optical pulses. Our MVS, constructed with these neuristors, achieved an impressive recognition accuracy of 93% in handwritten digit recognition tasks under extreme lighting conditions. This work offers an effective strategy for the development of energy-efficient and highly integrated intelligent MVSs.",
        "DOI": "10.1021/acs.jpclett.4c03217",
        "paper_author": "Dai Q.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100"
    },
    {
        "paper_title": "Bionic design and optimization of cutting tools: Applications and processability",
        "publication": "Journal of Manufacturing Processes",
        "citied_by": "1",
        "cover_date": "2024-12-12",
        "Abstract": "Cutting is a fundamental machining method extensively utilized across various fields, including mechanical engineering, agriculture, forestry, biomedical instrumentation, mineral exploration, and extraterrestrial missions. However, during cutting operations, tools are exposed to high temperatures and friction, which result in diminished cutting efficiency, reduced tool life, and compromised workpiece quality. Advances in bionics are gradually mitigating these challenges. Bionic design provides rich, reliable, and efficient prototypes that enhance tool performance while promoting environmentally friendly, harmonious, and sustainable tool development. In the bionic optimization of cutting tools, the selection of appropriate bionic prototypes and models is crucial. However, the complexity and ambiguity inherent in bionic prototype functions impede the development and widespread adoption of bionic tools. This paper initially focuses on the classification of bionic tools, subsequently proposing five categories of bio-inspired design elements and topological models from the perspective of bio-inspired cutting tools. The second section discusses the applications, advantages, and cutting performance of five types of bionic tools, with an emphasis on both the biomimetic optimization of the tool body and non-tool bodies. These tools are designed by emulating the diverse biological characteristics exhibited by various organisms. Additionally, the underlying mechanisms of the five categories of bionic tools, as well as the corresponding optimization strategies, are explored. Finally, this paper summarizes research on bionic tools and analyzes the current opportunities and challenges they face. In summary, compared to traditional tools, bionic tools demonstrate superior performance in energy efficiency, friction reduction, wear resistance, lubrication, extended service life, and multifunctionality. This offers valuable insights for researchers involved in the design and development of cutting tools.",
        "DOI": "10.1016/j.jmapro.2024.09.058",
        "paper_author": "Huang S.",
        "affiliation_name": "Shanghai University of Engineering Science",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60032504"
    },
    {
        "paper_title": "Fractional calculus operators applied on m-parameter Mittag-Leffler function and Bessel-Maitland function with applications",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2024-12-11",
        "Abstract": "Fractional calculus is of immense importance with applications in diverse and widespread field of inequality theory and applied mathematics. It is useful in science and engineering in the field of electromagnetics, electro-chemistry, biological population models, optical analysis, and signals processing. In our research, our aim is to establish various image formulas associ-Ated with Erdélyi-Kober and Caputo-Type fractional operators involving Bessel-Maitland function and m-parameter Mittag-Leffler function. We have represented our main results in terms of the generalized Wright hypergeometric function. The results obtained can be further reduced to special cases involving Gosta Mittag-Leffler, Wiman, Prabhakar function among other generalizations of Mittag-Leffler function.",
        "DOI": "10.1063/5.0210377",
        "paper_author": "Pandey R.M.",
        "affiliation_name": "Amity University",
        "affiliation_city": "Noida",
        "affiliation_country": "India",
        "affiliation_id": "60076774"
    },
    {
        "paper_title": "Semirational Design of a UDP-Glycosyltransferase from Nicotiana tomentosiformis for Efficient Biosynthesis of Rebaudioside M2",
        "publication": "Journal of Agricultural and Food Chemistry",
        "citied_by": "0",
        "cover_date": "2024-12-11",
        "Abstract": "Rebaudioside M2 (RebM2) is characterized as 13-[(2-O-β-d-glucopyranosyl-3-O-β-d-glucopyranosyl-β-d-glucopyranosyl)oxy] ent-kaur-16-en-19-oic acid-[(2-O-β-d-glucopyranosyl-6-O-β-d-glucopyranosyl-β-d-glucopyranosyl) ester], an isomer of rebaudioside M with a 1 → 6 sugar linkage. The product was found in the biotransformation of rebaudioside D (RebD) catalyzed by a glycosyltransferase from Nicotiana tomentosiformis (NtUGT). Herein, guided by consensus engineering and molecular dynamics simulations, a variant NtUGTF72L/L123P/L157P with enhanced activity and thermostability was obtained. It exhibits a strikingly reduced Km (22.47 mM to 0.15 mM) toward RebD, and the catalytic efficiency was over 5000-fold higher than that of the wildtype. When an Arabidopsis sucrose synthase AtSuSy was used for UDP-glucose recycling, NtUGTF72L/L123P/L157P effectively converted 80 g/L RebD to 90.14 g/L RebM2. In a one-pot three-enzyme reaction involving an engineered glycosyltransferase UGTSL2N358F, which catalyzed the conversion of RebA into RebD, 78.8 g/L of RebM2 (with a yield of 84.56%) was produced from 70 g/L of RebA, avoiding the use of the naturally rare and poorly soluble RebD as the starting material. This work will provide a promising biocatalyst for RebM2 biosynthesis on a large scale and create an opportunity to accelerate the exploration of the biological activity of RebM2 and its potential as a candidate for superior SG sweeteners.",
        "DOI": "10.1021/acs.jafc.4c09051",
        "paper_author": "Chen J.",
        "affiliation_name": "Nanjing Tech University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60025441"
    },
    {
        "paper_title": "Click Chemistry for Biofunctional Polymers: From Observing to Steering Cell Behavior",
        "publication": "Chemical Reviews",
        "citied_by": "5",
        "cover_date": "2024-12-11",
        "Abstract": "Click chemistry has become one of the most powerful construction tools in the field of organic chemistry, materials science, and polymer science, as it offers hassle-free platforms for the high-yielding synthesis of novel materials and easy functionalization strategies. The absence of harsh reaction conditions or complicated workup procedures allowed the rapid development of novel biofunctional polymeric materials, such as biopolymers, tailor-made polymer surfaces, stimulus-responsive polymers, etc. In this review, we discuss various types of click reactions─including azide-alkyne cycloadditions, nucleophilic and radical thiol click reactions, a range of cycloadditions (Diels-Alder, tetrazole, nitrile oxide, etc.), sulfur fluoride exchange (SuFEx) click reaction, and oxime-hydrazone click reactions─and their use for the formation and study of biofunctional polymers. Following that, we discuss state-of-the-art biological applications of “click”-biofunctionalized polymers, including both passive applications (e.g., biosensing and bioimaging) and “active” ones that aim to direct changes in biosystems, e.g., for drug delivery, antiviral action, and tissue engineering. In conclusion, we have outlined future directions and existing challenges of click-based polymers for medicinal chemistry and clinical applications.",
        "DOI": "10.1021/acs.chemrev.4c00251",
        "paper_author": "Ghosal K.",
        "affiliation_name": "Shalimar Paints Limited",
        "affiliation_city": "Nashik",
        "affiliation_country": "India",
        "affiliation_id": "127797168"
    },
    {
        "paper_title": "Precisely Constructing Superlattices of Soft Giant Molecules via Regulating Volume Asymmetry",
        "publication": "Journal of the American Chemical Society",
        "citied_by": "1",
        "cover_date": "2024-12-11",
        "Abstract": "Soft matters, particularly giant molecular self-assembly, have successfully replicated complex structures previously exclusive to metal alloys. These superlattices are constructed from mesoatoms─supramolecular spherical motifs of aggregated molecules, and the formation of superlattices critically depends on the volume distributions of these mesoatoms. Herein, we introduce two general methods to control volume asymmetry (i.e., the volumes’ ratio of the largest to smallest mesoatoms, VL/VS) within giant molecular self-assembly. Leveraging the spontaneous increase in the mesoatomic volume ratio in unary systems and self-sorted binary blends, we systematically adjust the volume asymmetry from 1.0 to 9.0 across 24 unary systems and 56 binary blends of giant molecules, uncovering the formation of various superlattices, including BCC, Frank-Kasper A15, σ, Laves C14, C15, NaZn13, AlB2, and notably, the first NaCl like superlattice in homogeneous soft matter self-assembly. A geometric-based analysis, combined with experimental results, further establishes a quantitative relationship between volume asymmetry and the corresponding superlattice formations, thus laying a solid foundation for superlattice engineering within giant molecular systems to mimic and even beyond metal alloys. The lattice parameters of various unit cells range from approximately 5 to 20 nm. Our investigation in giant molecules could guide the advancement of mesoscopic, periodic soft matter materials.",
        "DOI": "10.1021/jacs.4c09089",
        "paper_author": "Lei H.",
        "affiliation_name": "South China University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60024542"
    }
]