[
    {
        "paper_title": "The recent advances in cell delivery approaches, biochemical and engineering procedures of cell therapy applied to coronary heart disease",
        "publication": "Biomedicine and Pharmacotherapy",
        "citied_by": "1",
        "cover_date": "2023-12-31",
        "Abstract": "Cell therapy is an important topic in the field of regeneration medicine that is gaining attention within the scientific community. However, its potential for treatment in coronary heart disease (CHD) has yet to be established. Several various strategies, types of cells, routes of distribution, and supporting procedures have been tried and refined to trigger heart rejuvenation in CHD. However, only a few of them result in a real considerable promise for clinical usage. In this review, we give an update on techniques and clinical studies of cell treatment as used to cure CHD that are now ongoing or have been completed in the previous five years. We also highlight the emerging efficacy of stem cell treatment for CHD. We specifically examine and comment on current breakthroughs in cell treatment applied to CHD, including the most effective types of cells, transport modalities, engineering, and biochemical approaches used in this context. We believe the current review will be helpful for the researcher to distill this information and design future studies to overcome the challenges faced by this revolutionary approach for CHD.",
        "DOI": "10.1016/j.biopha.2023.115870",
        "paper_author": "Ma J.",
        "affiliation_name": "The Second Hospital of Jilin University",
        "affiliation_city": "Changchun",
        "affiliation_country": "China",
        "affiliation_id": "60122382"
    },
    {
        "paper_title": "Corrigendum to “Development of gallic acid-loaded ethylcellulose fibers as a potential wound dressing material” [Int. J. Biol. Macromol., 253 (2023), 1–11/126996] (International Journal of Biological Macromolecules (2023) 253(P5), (S014181302303893X), (10.1016/j.ijbiomac.2023.126996))",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "2",
        "cover_date": "2023-12-31",
        "Abstract": "The authors regret the mistake they made regarding the affiliation of two of the coauthors, Songul Ulag and Oguzhan Gunduz in the paper, and they wish to make the following corrections to this paper: -the correct affiliation for the two authors mentioned above is: Songul Ulage Oguzhan Gunduze,⁎ eFaculty of Technology, Marmara University, Center for Nanotechnology & Biomaterials Application and Research (NBUAM), Department of Metallurgical and Materials Engineering, Istanbul, Turkey. This change has no material impact on the conclusions of the paper. The authors would like to apologise for any inconvenience caused.",
        "DOI": "10.1016/j.ijbiomac.2023.127526",
        "paper_author": "Croitoru A.M.",
        "affiliation_name": "University Politehnica of Bucharest",
        "affiliation_city": "Bucharest",
        "affiliation_country": "Romania",
        "affiliation_id": "60003161"
    },
    {
        "paper_title": "A focused review on hyaluronic acid contained nanofiber formulations for diabetic wound healing",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "18",
        "cover_date": "2023-12-31",
        "Abstract": "The significant clinical challenge presented by diabetic wounds is due to their impaired healing process and increased risk of complications. It is estimated that a foot ulcer will develop at some point in the lives of 15–25 % of diabetic patients. Serious complications, including infection and amputation, are often led to by these wounds. In the field of tissue engineering and regenerative medicine, nanofiber-based wound dressings have emerged in recent years as promising therapeutic strategies for diabetic wound healing. Hyaluronic acid (HA), among various nanofiber materials, has gained considerable attention due to its unique properties, including biocompatibility, biodegradability, and excellent moisture retention capacity. By promoting skin hydration and controlling inflammation, a crucial role in wound healing is played by HA. Wounds are also helped to heal faster by HA through the regulation of inflammation levels and signaling the body to build more blood vessels in the damaged area. Great potential in various applications, including wound healing, has been shown by the development and use of nanofiber formulations in medicine. However, challenges and limitations associated with nanofibers in medicine exist, such as reproducibility, proper characterization, and biological evaluation. By providing a biomimetic environment that enhances re-epithelialization and facilitates the delivery of active substances, nanofibers promote wound healing. In accelerating wound healing, promising results have been shown by HA-contained nanofiber formulations in diabetic wounds. Key strategies employed by these formulations include revascularization, modulation of the inflammation microenvironment, delivery of active substances, photothermal nanofibers, and nanoparticle-loaded fabrics. Particularly crucial is revascularization as it restores blood flow to the wound area, promoting healing. Wound healing can also be enhanced by modulating the inflammation microenvironment through controlling inflammation levels. Future perspectives in this field involve addressing the current challenges and limitations of nanofiber technology and further optimizing HA-contained nanofiber formulations for improved efficacy in diabetic wound healing. This includes exploring new fabrication techniques, enhancing the biocompatibility and biodegradability of nanofibers, and developing multifunctional nanofibers for targeted drug delivery. Not only does writing a review in the field of nanofiber-based wound dressings, particularly those containing hyaluronic acid, allow us to consolidate our current knowledge and understanding but also broadens our horizons. An opportunity is provided to delve deeper into the intricacies of this innovative therapeutic strategy, explore its potential and limitations, and envision future directions. By doing so, a contribution can be made to the ongoing advancements in tissue engineering and regenerative medicine, ultimately improving the quality of life for patients with diabetic wounds.",
        "DOI": "10.1016/j.ijbiomac.2023.127607",
        "paper_author": "Astaneh M.E.",
        "affiliation_name": "Fasa University of Medical Sciences",
        "affiliation_city": "Fasa",
        "affiliation_country": "Iran",
        "affiliation_id": "60022657"
    },
    {
        "paper_title": "Self-healing hydrogels based on biological macromolecules in wound healing: A review",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "30",
        "cover_date": "2023-12-31",
        "Abstract": "The complete healing of skin wounds has been a challenge in clinical treatment. Self-healing hydrogels are special hydrogels formed by distinctive physicochemically reversible bonds, and they are considered promising biomaterials in the biomedical field owing to their inherently good drug-carrying capacity as well as self-healing and repair abilities. Moreover, natural polymeric materials have received considerable attention in skin tissue engineering owing to their low cytotoxicity, low immunogenicity, and excellent biodegradation rates. In this paper, we review recent advances in the design of self-healing hydrogels based on natural polymers for skin-wound healing applications. First, we outline a variety of natural polymers that can be used to construct self-healing hydrogel systems and highlight the advantages and disadvantages of different natural polymers. We then describe the principle of self-healing hydrogels in terms of two different crosslinking mechanisms—physical and chemical—and dissect their performance characteristics based on the practical needs of skin-trauma applications. Next, we outline the biological mechanisms involved in the healing of skin wounds and describe the current application strategies for self-healing hydrogels based on these mechanisms. Finally, we analyze and summarize the challenges and prospects of natural-material-based self-healing hydrogels for skin applications.",
        "DOI": "10.1016/j.ijbiomac.2023.127612",
        "paper_author": "Yang P.",
        "affiliation_name": "Central South University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60017060"
    },
    {
        "paper_title": "A biomimetic multi-layer scaffold with collagen and zinc doped bioglass as a skin-regeneration agent in full-thickness injuries and its effects in vitro and in vivo",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "4",
        "cover_date": "2023-12-31",
        "Abstract": "Due to the multilayer structure of skin tissue, the fabrication of a 3-layer scaffold could result in planned dermal regeneration. Herein, polyurethane (PU) and polycaprolactone (PCL), as a function of their mechanical stability and collagen due to its arginine-glycine-aspartic acid sequences, zinc ions because of overcoming the common problems of biological factors were employed. The scaffolds' physical, mechanical, and biological properties were examined by SEM, FTIR, contact angle, mechanical tensile, bacteriocidal efficacy, and hemolysis. Also, after L-929 fibroblast seeding, their biological activity was determined by SEM, DAPI, and MTT assays. Then, the cell-seeded scaffolds were implanted in full-thickness wounds of rats and evaluated by wound closure, histological, and molecular techniques. The in vivo studies showed better wound closure with the composite scaffold containing zinc ions. While its dermal re-organization was retarded in the presence of zinc ions compared to the composite scaffold containing non-doped bioglass. Despite this, the doped composite scaffold indicated better observations with the histological evaluations than the nontreated and bare scaffold groups. Real-time PCR confirmed the higher expression of FGF2 and FGFR genes in rats treated with the zinc-doped composite scaffold. In conclusion, PU/PCL-collagen/PCL-collagen containing the doped or non-doped nanoparticles showed better potential to heal dermal injuries.",
        "DOI": "10.1016/j.ijbiomac.2023.127163",
        "paper_author": "Kamrani A.",
        "affiliation_name": "Islamic Azad University, Parand Branch",
        "affiliation_city": "Parand",
        "affiliation_country": "Iran",
        "affiliation_id": "60017675"
    },
    {
        "paper_title": "Fabrication and optimization of multilayered composite scaffold made of sulfated alginate-based nanofiber/decellularized Wharton's jelly ECM for tympanic membrane tissue engineering",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "11",
        "cover_date": "2023-12-31",
        "Abstract": "In this study, we fabricated a novel multilayer polyvinyl alcohol (PVA)/alginate sulfate (ALG-S) nanofiber/decellularized Wharton's Jelly ECM (d-ECM) composite for tympanic membrane perforations (TMPs) tissue engineering (TE). Initially, electrospun PVA/ALG-S scaffolds with different blend ratios were fabricated. The influence of ALG-S ratio on surface morphology, mechanical, physical and biological properties of the nanofibers was studied. Secondly, 3-layer composites were developed as a combination of PVA/ALG-S nanofibers and d-ECM to take synergic advantages of electrospun mats and d-ECM. As part of the evaluation of the effects of d-ECM incorporation, the composite's mechanical properties, in vitro degradation, swelling ratio, and biological activities were assessed. The MTT assay showed that PVA/ALG-S nanofibers with 50:50 ratio provided a more desirable environment to support cell growth. A composite containing 25 mg/cm2 d-ECM was determined as the optimal composite through MTT assay, and this composite was used for animal studies inducing TMP regeneration. According to the in vivo studies, the optimal composite not only stimulated the healing of TMPs but also shortened the healing period. These results suggest that a multilayer nanofiber/hydrogel composite could be a potential platform for regenerating TMPs.",
        "DOI": "10.1016/j.ijbiomac.2023.127128",
        "paper_author": "Najafi R.",
        "affiliation_name": "University of Tehran",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60022927"
    },
    {
        "paper_title": "Biomolecules based hydrogels and their potential biomedical applications: A comprehensive review",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "13",
        "cover_date": "2023-12-31",
        "Abstract": "The need for biocompatible drug carriers has been significantly increased from the past few years. Researchers show great interest in the development of more versatile and sophisticated biomaterials based drug carriers. Hydrogels are beneficial drug carriers and easily release the controlled amount of drug at target site due to its tunable structure. The hydrogels made-up of potent biological macromolecules including collagen, gelatin, fibrin, elastin, fibroin, chitosan, starch, alginate, agarose and carrageenan have been proven as versatile biomaterials. These are three-dimensional polymeric networks, synthesized by crosslinking of hydrophilic polymers. The biological macromolecules based hydrogels containing therapeutic substances are used in a wide range of biomedical applications including wound healing, tissue engineering, cosmetics and contact lenses. However, many aspects related to hydrogels such as the mechanism of cross-linking and molecular entanglement are not clear. So, there is a need to do more research and exploration toward the extensive and cost-effective use of hydrogels. The present review article elaborately discusses the biomolecules based hydrogels and their possible biomedical applications in different fields.",
        "DOI": "10.1016/j.ijbiomac.2023.127362",
        "paper_author": "Ijaz F.",
        "affiliation_name": "Government College University Lahore",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60037950"
    },
    {
        "paper_title": "Green synthesis of iron nanoparticles: Sources and multifarious biotechnological applications",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "38",
        "cover_date": "2023-12-31",
        "Abstract": "Green synthesis of iron nanoparticles is a highly fascinating research area and has gained importance due to reliable, sustainable and ecofriendly protocol for synthesizing nanoparticles, along with the easy availability of plant materials and their pharmacological significance. As an alternate to physical and chemical synthesis, the biological materials, like microorganisms and plants are considered to be less costly and environment-friendly. Iron nanoparticles with diverse morphology and size have been synthesized using biological extracts. Microbial (bacteria, fungi, algae etc.) and plant extracts have been employed in green synthesis of iron nanoparticles due to the presence of various metabolites and biomolecules. Physical and biochemical properties of biologically synthesized iron nanoparticles are superior to that are synthesized using physical and chemical agents. Iron nanoparticles have magnetic property with thermal and electrical conductivity. Iron nanoparticles below a certain size (generally 10–20 nm), can exhibit a unique form of magnetism called superparamagnetism. They are non-toxic and highly dispersible with targeted delivery, which are suitable for efficient drug delivery to the target. Green synthesized iron nanoparticles have been explored for multifarious biotechnological applications. These iron nanoparticles exhibited antimicrobial and anticancerous properties. Iron nanoparticles adversely affect the cell viability, division and metabolic activity. Iron nanoparticles have been used in the purification and immobilization of various enzymes/proteins. Iron nanoparticles have shown potential in bioremediation of various organic and inorganic pollutants. This review describes various biological sources used in the green synthesis of iron nanoparticles and their potential applications in biotechnology, diagnostics and mitigation of environmental pollutants.",
        "DOI": "10.1016/j.ijbiomac.2023.127017",
        "paper_author": "Kumar V.",
        "affiliation_name": "Central University of Haryana",
        "affiliation_city": "Mahendergarh",
        "affiliation_country": "India",
        "affiliation_id": "60107367"
    },
    {
        "paper_title": "Vitamin D3-incorporated chitosan/collagen/fibrinogen scaffolds promote angiogenesis and endothelial transition via HIF-1/IGF-1/VEGF pathways in dental pulp stem cells",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "5",
        "cover_date": "2023-12-31",
        "Abstract": "Effective vascularization during wound healing remains a critical challenge in the regeneration of skin tissue. On the other hand, mesenchymal stem cell (MSC) to endothelial phenotype transition (MEnDoT) is a potential phenomenon grossly underexplored in vascularized skin tissue engineering. Vitamin D3 has a proven role in promoting MEnDoT. Hence, a D3-incorporated scaffold made with biocompatible materials such as chitosan, collagen and fibrinogen should be able to promote endothelial lineage transition in vitro for tissue engineering purposes. In this study, we developed vitamin D3 incorporated chitosan-collagen-fibrinogen (CCF-D3) scaffolds physically crosslinked under UV and conducted thorough physicochemical and biological assays on it compared to a control scaffold without vitamin D3. Our study for the first time reports the potential vascularization property of the CCF-D3 scaffold by inducing the transitions of dental pulp MSC to endothelial lineage via the HIF-1/IGF-1/VEGF pathways. MSC seeded on UV-exposed CCF-D3 scaffolds had higher cell viability and transitioned towards endothelial lineage was observed by elevated proliferative and endothelial-specific gene expressions and flow cytometric analysis of SCA-1+ antibody. The difference in VEGF-A and α-SMA expressions was also observed in the D3-CCF scaffold compared to the scaffolds without D3.",
        "DOI": "10.1016/j.ijbiomac.2023.127325",
        "paper_author": "Dasgupta S.",
        "affiliation_name": "Indian Institute of Engineering Science and Technology, Shibpur",
        "affiliation_city": "Howrah",
        "affiliation_country": "India",
        "affiliation_id": "60000912"
    },
    {
        "paper_title": "Fabrication and characterization of microwave-assisted synthesis of carbon dots crosslinked sodium alginate hydrogel films",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "6",
        "cover_date": "2023-12-31",
        "Abstract": "In this study, potassium-incorporated carbon dots (K-CDs) and nitrogen-incorporated carbon dots (N-CDs) were composted using the microwave-assisted method, in which the carbon source is citric acid. Subsequently, the prepared CDs were added into sodium alginate (NaAlg)/CaCO3 to form a hydrogel film. The Ca2+ in the system is tend to be released in the presence of acidic CDs to promote the cross-linking of NaAlg. This study presents a NaAlg hydrogel film preparation process that requires no additional acid and is natural and environmentally friendly. Moreover, it gives the NaAlg hydrogel film excellent antioxidant and antimicrobial properties and also improves its mechanical properties and gel strength. The release behaviors of the CDs in the hydrogel films were also explored. The prepared CD-incorporated NaAlg hydrogel films have potential applications in medical, biological engineering, food preservation, and other fields owing to their functional properties.",
        "DOI": "10.1016/j.ijbiomac.2023.127130",
        "paper_author": "Sun P.",
        "affiliation_name": "Northeast Agricultural University",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "60026617"
    },
    {
        "paper_title": "Current advances and emerging trends in sustainable polyhydroxyalkanoate modification from organic waste streams for material applications",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "16",
        "cover_date": "2023-12-31",
        "Abstract": "The current processes for producing polyhydroxyalkanoates (PHAs) are costly, owing to the high cost of cultivation feedstocks, and the need to sterilise the growth medium, which is energy-intensive. PHA has been identified as a promising biomaterial with a wide range of potential applications and its functionalization from waste streams has made significant advances recently, which can help foster the growth of a circular economy and waste reduction. Recent developments and novel approaches in the functionalization of PHAs derived from various waste streams offer opportunities for addressing these issues. This study focuses on the development of sustainable, efficient, and cutting-edge methods, such as advanced bioprocess engineering, novel catalysts, and advances in materials science. Chemical techniques, such as epoxidation, oxidation, and esterification, have been employed for PHA functionalization, while enzymatic and microbial methods have indicated promise. PHB/polylactic acid blends with cellulose fibers showed improved tensile strength by 24.45-32.08 % and decreased water vapor and oxygen transmission rates while PHB/Polycaprolactone blends with a 1:1 ratio demonstrated an elongation at break four to six times higher than pure PHB, without altering tensile strength or elastic modulus. Moreover, PHB films blended with both polyethylene glycol and esterified sodium alginate showed improvements in crystallinity and decreased hydrophobicity.",
        "DOI": "10.1016/j.ijbiomac.2023.126781",
        "paper_author": "Jaffur B.N.",
        "affiliation_name": "University of Mauritius",
        "affiliation_city": "Reduit",
        "affiliation_country": "Mauritius",
        "affiliation_id": "60072656"
    },
    {
        "paper_title": "Current issues and potential solutions for the electrospinning of major polysaccharides and proteins: A review",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "15",
        "cover_date": "2023-12-31",
        "Abstract": "Biopolymers, especially polysaccharides and proteins, are the promising green replacement for petroleum based polymers. Due to their innate properties, they are effectively used in biomedical applications, especially tissue engineering, wound healing, and drug delivery. The fibrous morphology of biopolymers is essentially required for the effectiveness in these biomedical applications. Electrospinning (ES) is the most advanced and robust method to fabricate nanofibers (NFs) and provides a complete solution to the conventional methods issues. However, the major issues regarding fabricating polysaccharides and protein nanofibers using ES include poor electrospinnability, lack of desired fundamental properties for a specific application by a single biopolymer, and insolubility among common solvents. The current review provides the main strategies for effective electrospinning of the major biopolymers. The key strategies include blending major biopolymers with suitable biopolymers and optimizing the solvent system. A systematic literature review was done to provide the optimized solvent system of the major biopolymers along with their best possible biopolymeric blend for ES. The review also highlights the fundamental issues with the commercialization of ES based biomedical products and provides future directions to improve the fabrication of biopolymeric nanofibers.",
        "DOI": "10.1016/j.ijbiomac.2023.126735",
        "paper_author": "Syed M.H.",
        "affiliation_name": "Universiti Malaysia Pahang Al-Sultan Abdullah",
        "affiliation_city": "Pekan",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60090654"
    },
    {
        "paper_title": "Multifunctional hydrogel/platelet-rich fibrin/nanofibers scaffolds with cell barrier and osteogenesis for guided tissue regeneration/guided bone regeneration applications",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "13",
        "cover_date": "2023-12-31",
        "Abstract": "Periodontal defect seriously affects people's life health and quality. Guided tissue regeneration (GTR) and guided bone regeneration (GBR) have made great progress in periodontal disease treatment, but some deficiencies existed in commercial materials of GTR and GBR. For obtaining better therapeutic effects, multifunctional composite scaffolds containing different biological macromolecules were developed in this study. Chitosan/poly (γ-glutamic acid)/nano-hydroxyapatite hydrogels (CP/nHA) made by electrostatic interactions and lyophilization were filled in the bone defects to achieve osteogenesis. Platelet-rich fibrin (PRF) extracted from blood could accelerate bone formation by releasing various bioactive substances as middle layer of composite scaffolds. Polycaprolactone/gelatin nanofibers (PG) prepared by electrospinning were attached to the junction of soft and hard tissue, which could prevent fibrous tissue from infiltrating into bone defects. The composite scaffolds showed good morphology, biocompatibility, cell barriers and osteogenic differentiation in vitro. The excellent ability of bone formation was verified by implantation of triple-layered composite scaffolds into alveolar bone defects in rabbit in vivo. The hierarchical structure was conducive to personalized customization to meet the needs of different defects. All in all, the multifunctional scaffolds could play important roles of GTR and GBR in alveolar bone regeneration and provide good application prospect for bone repair in clinic.",
        "DOI": "10.1016/j.ijbiomac.2023.126960",
        "paper_author": "Zhang L.",
        "affiliation_name": "Nankai University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60018038"
    },
    {
        "paper_title": "Evaluation of the effects of zein incorporation on physical, mechanical, and biological properties of polyhydroxybutyrate electrospun scaffold for bone tissue engineering applications",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "23",
        "cover_date": "2023-12-31",
        "Abstract": "Materials and fabrication methods significantly influence the scaffold's final features in tissue engineering. This study aimed to blend zein with polyhydroxybutyrate (PHB) at 5, 10, and 15 wt%, fabricate scaffolds using electrospinning, and then characterize them. SEM and mechanical analyses identified the scaffold with 10 wt% zein (PHB-10Z) as the optimal sample. Incorporating 10 wt% zein reduced fiber diameter from 894 ± 122 to 531 ± 42 nm while increasing ultimate tensile strength and elongation at break by approximately 53 % and 70 %, respectively. FTIR proved zein's presence in the scaffolds and possible hydrogen bonding with PHB. TGA confirmed the miscibility of polymers. DSC and XRD analyses indicated lower crystallinity for the PHB-10Z than for PHB. AFM evaluation indicated a rougher surface for the PHB-10Z in comparison to PHB. The PHB-10Z demonstrated a more hydrophobic surface and less weight loss after 100 days of degradation in PBS than PHB. The free radical scavenging assay exhibited antioxidant activity for the zein-containing scaffold. Eventually, enhanced cell attachment, viability, and differentiation in the PHB-10Z scaffold drawn from SEM, MTT, ALP activity, and Alizarin red staining of MG-63 cells confirmed that PHB-zein electrospun scaffold is a potent candidate for bone tissue engineering applications.",
        "DOI": "10.1016/j.ijbiomac.2023.126843",
        "paper_author": "Ghasemi S.",
        "affiliation_name": "Isfahan University of Medical Sciences",
        "affiliation_city": "Isfahan",
        "affiliation_country": "Iran",
        "affiliation_id": "60020609"
    },
    {
        "paper_title": "Nacre-inspired, strong, tough silk fibroin hydrogels based on biomineralization and the layer-by-layer assembly of ordered silk fabric",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "3",
        "cover_date": "2023-12-31",
        "Abstract": "Hydrogels are attractive materials with structures and functional properties similar to biological tissues and widely used in biomedical engineering. However, traditional synthetic hydrogels possess poor mechanical strength, and their applications are limited. Herein, a multidimensional material design method is developed; it includes the in situ gelation of silk fabric and nacre-inspired layer-by-layer assembly, which is used to prepare silk fibroin (SF) hydrogels. The in situ gelation method of silk fabric introduces a directionally ordered fabric network in a silk substrate, considerably enhancing the strength of hydrogels. Based on the nacre structure, the layer-by-layer assembly method enables silk hydrogels to break through the size limit and increase the thickness, realizing the longitudinal extension of the hydrogels. The application of the combined biomineralization and hot pressing method can effectively reduce interface defects and improve the interaction between organic and inorganic interfaces. The multidimensional material design method helps increase the strength (287.78 MPa), toughness (18.43 MJ m−3), and fracture energy (50.58 kJ m−2) of SF hydrogels; these hydrogels can weigh 2000 times their own weight. Therefore, SF hydrogels designed using the aforementioned combined method can realize the combination of strength and toughness and be used in biological tissue engineering and structural materials.",
        "DOI": "10.1016/j.ijbiomac.2023.126730",
        "paper_author": "Zong C.M.",
        "affiliation_name": "Jiangsu University of Science and Technology",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60069706"
    },
    {
        "paper_title": "Incorporation of graphene oxide as a coupling agent in a 3D printed polylactic acid/hardystonite nanocomposite scaffold for bone tissue regeneration applications",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "21",
        "cover_date": "2023-12-31",
        "Abstract": "3D printing fabrication has become a dominant approach for the creation of tissue engineering constructs as it is accurate, fast, reproducible and can produce patient-specific templates. In this study, 3D printing is applied to create nanocomposite scaffold of polylactic acid (PLA)/hardystonite (HT)-graphene oxide (GO). GO is utilized as a coupling agent of alkaline treated HT nanoparticles within PLA matrix. The addition of HT-GO nanoparticles of up to 30 wt% to PLA matrix was found to increase the degradability from 7.33 ± 0.66 to 16.03 ± 1.47 % during 28 days. Also, the addition of 20 wt% of HT-GO nanoparticles to PLA scaffold (PLA/20HTGO sample) significantly increased the compressive strength (from 7.65 ± 0.86 to 14.66 ± 1.01 MPa) and elastic modulus (from 94.46 ± 18.03 to 189.15 ± 10.87 MPa). The apatite formation on the surface of nanocomposite scaffolds in simulated body fluid within 28 days confirmed the excellent bioactivity of nanocomposite scaffolds. The MG63 cell adhesion and proliferation and, also, the rat bone marrow mesenchymal stem cells osteogenic differentiation were highly stimulated on the PLA/20HTGO scaffold. According to the sum of results obtained in the current study, the optimized PLA/20HTGO nanocomposite scaffold is highly promising for hard tissue engineering applications.",
        "DOI": "10.1016/j.ijbiomac.2023.126510",
        "paper_author": "Tavakoli M.",
        "affiliation_name": "Isfahan University of Technology",
        "affiliation_city": "Isfahan",
        "affiliation_country": "Iran",
        "affiliation_id": "60028174"
    },
    {
        "paper_title": "Impact of Arrhenius activation energy on MHD nanofluid flow past a stretching sheet with exponential heat source: A modified Buongiorno's model approach",
        "publication": "International Journal of Modern Physics B",
        "citied_by": "21",
        "cover_date": "2023-12-30",
        "Abstract": "Nanofluids have a wide range of applications in biological research. They are employed in targeted medication administration, hyperthermia (for cancer treatment) and differential diagnostics like magnetic resonance image (MRI). In light of these medical applications, the impact of an external magnetic field and an exponential heat source on the dynamics of TiO2-H2O over a nonlinearly stretched surface has been investigated. A realistic modified Buongiorno model has been used which includes the effects of reaction rate, Biot number and activation energy. The boundary value problem governing the model is solved on MATLAB R2022a using the solver, BVP5C. Further, the consequences of different parameters on rate of heat transfer coefficient (Nusselt number), rate of mass transfer coefficient (Sherwood number), drag coefficient, velocity, temperature and volume fraction profile are observed graphically. It is noted that volume fraction and uniform heat source intensity have a positive effect on the Nusselt number and negative effect on Sherwood number. The effects of thermal radiation and magnetic field on volume fraction profile are, respectively, positive and negative. The current physics of flow across a vertical stretching surface is expected to serve as the foundation for various medical science, engineering and technology applications.",
        "DOI": "10.1142/S0217979223502843",
        "paper_author": "Sharma P.K.",
        "affiliation_name": "Amity University",
        "affiliation_city": "Noida",
        "affiliation_country": "India",
        "affiliation_id": "60076774"
    },
    {
        "paper_title": "Revolutionizing biomedical engineering with quantum computing and AI",
        "publication": "Quantum Innovations at the Nexus of Biomedical Intelligence",
        "citied_by": "0",
        "cover_date": "2023-12-29",
        "Abstract": "Quantum computing and AI could change biomedical engineering by enabling smart biomedical appli¬cations. Quantum computing and artificial intelligence for smart biological applications are thoroughly explained in this chapter. Combining quantum computing with AI promotes personalised healthcare, disease diagnosis, and medication discovery. The authors begin with a hardware and software review of both systems before discussing AI and quantum computing. Quantum computing and AI in personalised healthcare are then considered. The authors discuss quantum computing and AI-powered telemedicine, precision medicine, and smart wearable and medical devices. They also note that reliable qubit technologies, effective error-correction methods, and scalable quantum computing and AI architectures are needed to fully exploit quantum computing and AI for smart biomedical applications. In conclusion, quantum computing and AI could revolutionise biomedical engineering and enable intelligent biomedi¬cal applications that improve patient outcomes.",
        "DOI": "10.4018/979-8-3693-1479-1.ch012",
        "paper_author": "Mamta B.",
        "affiliation_name": "Chandigarh University",
        "affiliation_city": "Mohali",
        "affiliation_country": "India",
        "affiliation_id": "60111704"
    },
    {
        "paper_title": "Universal DNA-Based Sensing Toolbox for Programming Cell Functions",
        "publication": "Journal of the American Chemical Society",
        "citied_by": "2",
        "cover_date": "2023-12-27",
        "Abstract": "By recombining natural cell signaling systems and further reprogramming cell functions, use of genetically engineered cells and bacteria as therapies is an innovative emerging concept. However, the inherent properties and structures of the natural signal sensing and response pathways constrain further development. We present a universal DNA-based sensing toolbox on the cell surface to endow new signal sensing abilities for cells, control cell states, and reprogram multiple cell functions. The sensing toolbox contains a triangular-prismatic-shaped DNA origami framework and a sensing core anchored inside the internal confined space to enhance the specificity and efficacy of the toolbox. As a proof of principle, the sensing toolbox uses the customizable sensing core with signal sensing switches and converters to recognize unconventional signal inputs, deliver functional components to cells, and then control cell responses, including specific tumor cell death, immune cell disinhibition and adhesion, and bacterial expression. This work expands the diversity of cell sensing signals and reprograms biological functions by constructing nanomechanical-natural hybrid cells, providing new strategies for engineering cells and bacteria in diagnosis and treatment applications.",
        "DOI": "10.1021/jacs.3c11232",
        "paper_author": "Ma P.Q.",
        "affiliation_name": "The State Key Laboratory of Bioreactor Engineering",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60073651"
    },
    {
        "paper_title": "Molecularly Engineered Room-Temperature Phosphorescence for Biomedical Application: From the Visible toward Second Near-Infrared Window",
        "publication": "Chemical Reviews",
        "citied_by": "37",
        "cover_date": "2023-12-27",
        "Abstract": "Phosphorescence, characterized by luminescent lifetimes significantly longer than that of biological autofluorescence under ambient environment, is of great value for biomedical applications. Academic evidence of fluorescence imaging indicates that virtually all imaging metrics (sensitivity, resolution, and penetration depths) are improved when progressing into longer wavelength regions, especially the recently reported second near-infrared (NIR-II, 1000-1700 nm) window. Although the emission wavelength of probes does matter, it is not clear whether the guideline of “the longer the wavelength, the better the imaging effect” is still suitable for developing phosphorescent probes. For tissue-specific bioimaging, long-lived probes, even if they emit visible phosphorescence, enable accurate visualization of large deep tissues. For studies dealing with bioimaging of tiny biological architectures or dynamic physiopathological activities, the prerequisite is rigorous planning of long-wavelength phosphorescence, being aware of the cooperative contribution of long wavelengths and long lifetimes for improving the spatiotemporal resolution, penetration depth, and sensitivity of bioimaging. In this Review, emerging molecular engineering methods of room-temperature phosphorescence are discussed through the lens of photophysical mechanisms. We highlight the roles of phosphorescence with emission from visible to NIR-II windows toward bioapplications. To appreciate such advances, challenges and prospects in rapidly growing studies of room-temperature phosphorescence are described.",
        "DOI": "10.1021/acs.chemrev.3c00401",
        "paper_author": "Chang B.",
        "affiliation_name": "State Key Laboratory of Advanced Technology for Materials Synthesis and Processing",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60129467"
    },
    {
        "paper_title": "Biofluid-Activated Biofuel Cells, Batteries, and Supercapacitors: A Comprehensive Review",
        "publication": "Advanced Materials",
        "citied_by": "51",
        "cover_date": "2023-12-27",
        "Abstract": "Recent developments in wearable and implanted devices have resulted in numerous, unprecedented capabilities that generate increasingly detailed information about a user's health or provide targeted therapy. However, options for powering such systems remain limited to conventional batteries which are large and have toxic components and as such are not suitable for close integration with the human body. This work provides an in-depth overview of biofluid-activated electrochemical energy devices, an emerging class of energy sources judiciously designed for biomedical applications. These unconventional energy devices are composed of biocompatible materials that harness the inherent chemistries of various biofluids to produce useable electrical energy. This work covers examples of such biofluid-activated energy devices in the form of biofuel cells, batteries, and supercapacitors. Advances in materials, design engineering, and biotechnology that form the basis for high-performance, biofluid-activated energy devices are discussed. Innovations in hybrid manufacturing and heterogeneous integration of device components to maximize power output are also included. Finally, key challenges and future scopes of this nascent field are provided.",
        "DOI": "10.1002/adma.202303197",
        "paper_author": "Garland N.T.",
        "affiliation_name": "NC State College of Engineering",
        "affiliation_city": "Raleigh",
        "affiliation_country": "United States",
        "affiliation_id": "60279548"
    },
    {
        "paper_title": "Extending the In Vivo Residence Time of Macrophage Membrane-Coated Nanoparticles through Genetic Modification",
        "publication": "Small",
        "citied_by": "13",
        "cover_date": "2023-12-27",
        "Abstract": "Nanoparticles coated with natural cell membranes have emerged as a promising class of biomimetic nanomedicine with significant clinical potential. Among them, macrophage membrane-coated nanoparticles hold particular appeal due to their versatility in drug delivery and biological neutralization applications. This study employs a genetic engineering approach to enhance their in vivo residence times, aiming to further improve their performance. Specifically, macrophages are engineered to express proline-alanine-serine (PAS) peptide chains, which provide additional protection against opsonization and phagocytosis. The resulting modified nanoparticles demonstrate prolonged residence times when administered intravenously or introduced intratracheally, surpassing those coated with the wild-type membrane. The longer residence times also contribute to enhanced nanoparticle efficacy in inhibiting inflammatory cytokines in mouse models of lipopolysaccharide-induced lung injury and sublethal endotoxemia, respectively. This study underscores the effectiveness of genetic modification in extending the in vivo residence times of macrophage membrane-coated nanoparticles. This approach can be readily extended to modify other cell membrane-coated nanoparticles toward more favorable biomedical applications.",
        "DOI": "10.1002/smll.202305551",
        "paper_author": "Duan Y.",
        "affiliation_name": "Moores Cancer Center",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60086300"
    },
    {
        "paper_title": "Hydrogels and Bioprinting in Bone Tissue Engineering: Creating Artificial Stem-Cell Niches for In Vitro Models",
        "publication": "Advanced Materials",
        "citied_by": "38",
        "cover_date": "2023-12-27",
        "Abstract": "Advances in bioprinting have enabled the fabrication of complex tissue constructs with high speed and resolution. However, there remains significant structural and biological complexity within tissues that bioprinting is unable to recapitulate. Bone, for example, has a hierarchical organization ranging from the molecular to whole organ level. Current bioprinting techniques and the materials employed have imposed limits on the scale, speed, and resolution that can be achieved, rendering the technique unable to reproduce the structural hierarchies and cell–matrix interactions that are observed in bone. The shift toward biomimetic approaches in bone tissue engineering, where hydrogels provide biophysical and biochemical cues to encapsulated cells, is a promising approach to enhancing the biological function and development of tissues for in vitro modeling. A major focus in bioprinting of bone tissue for in vitro modeling is creating dynamic microenvironmental niches to support, stimulate, and direct the cellular processes for bone formation and remodeling. Hydrogels are ideal materials for imitating the extracellular matrix since they can be engineered to present various cues whilst allowing bioprinting. Here, recent advances in hydrogels and 3D bioprinting toward creating a microenvironmental niche that is conducive to tissue engineering of in vitro models of bone are reviewed.",
        "DOI": "10.1002/adma.202301670",
        "paper_author": "Lewns F.K.",
        "affiliation_name": "University of Birmingham, College of Medical and Dental Sciences",
        "affiliation_city": "Birmingham",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60033481"
    },
    {
        "paper_title": "Research Progress in Immune Receptor Functions of PatternRecognition Receptor in Plants",
        "publication": "Biotechnology Bulletin",
        "citied_by": "0",
        "cover_date": "2023-12-26",
        "Abstract": "In the process of long-term adaptation to environment, plants have evolved a large number of cell surface and intracellular immune receptors to sense various biological and abiotic stimuli, and then trigger receptor-dependent immune responses. Cell surface Pattern-Recognition Receptor(PRR)is able to recognize pathogenic microbial model molecules and activate basic immunity, thereby enabling plants to acquire corresponding tolerance. At present, with the help of efficient research methods, researchers have made some progress in PRR-mediated plant disease resistance and environmental stress tolerance. Here, we reviewed the recent achievements of plant PRR on types and structures, ligand recognition and binding mechanisms, characteristics and mechanism of innate immunity mediated by PRRs, and identification of novel PRRs. Meanwhile, this review also focused on PRR-mediated salt resistance. The results will help us further understand the immune basis of plant-environment interaction, and will provide theoretical basis and guidance for the use of genetic engineering to cultivate excellent disease resistant and stress resistant plant varieties.",
        "DOI": "10.13560/j.cnki.biotech.bull.1985.2023-0765",
        "paper_author": "Ye H.",
        "affiliation_name": "Shaoguan University",
        "affiliation_city": "Shaoguan",
        "affiliation_country": "China",
        "affiliation_id": "60030182"
    },
    {
        "paper_title": "Cutting-Edge Research in Nanoscience and Nanotechnology: Celebrating the 130th Anniversary of Wuhan University",
        "publication": "ACS Nano",
        "citied_by": "2",
        "cover_date": "2023-12-26",
        "Abstract": "Thanks to the fast-paced progress of microscopic theories and nanotechnologies, a tremendous world of fundamental science and applications has opened up at the nanoscale. Ranging from quantum physics to chemical and biological mechanisms and from device functionality to materials engineering, nanoresearch has become an essential part of various fields. As one of the top universities in China, Wuhan University (WHU) aims to promote cutting-edge nanoresearch in multiple disciplines by leveraging comprehensive academic programs established throughout 130 years of history. As visible in prestigious scientific journals such as ACS Nano, WHU has made impactful advancements in various frontiers, including nanophotonics, functional nanomaterials and devices, biomedical nanomaterials, nanochemistry, and environmental science. In light of these contributions, WHU will be committed to serving talents and scientists wholeheartedly, fully supporting international collaborations and continuously driving innovative research.",
        "DOI": "10.1021/acsnano.3c11892",
        "paper_author": "Yu T.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306"
    },
    {
        "paper_title": "Platelet-Derived Apoptotic Vesicles Promote Bone Regeneration via Golgi Phosphoprotein 2 (GOLPH2)-AKT Signaling Axis",
        "publication": "ACS Nano",
        "citied_by": "3",
        "cover_date": "2023-12-26",
        "Abstract": "Apoptotic vesicles (apoVs) are apoptotic-cell-derived nanosized vesicles that take on dominant roles in regulating bone homeostasis. We have demonstrated that mesenchymal stem cell (MSC)-derived apoVs are promising therapeutic agents for bone regeneration. However, clinical translation of MSC-derived apoVs has been hindered due to cell expansion and nuclear substance. As another appealing source for apoV therapy, blood cells could potentially eliminate these limitations. However, whether blood cells can release apoVs during apoptosis is uncertain, and the detailed characteristics and biological properties of respective apoVs are not elucidated. In this study, we showed that platelets (PLTs) could rapidly release abundant apoVs during apoptosis in a short time. To recognize the different protein expressions between PLT-derived apoVs and PLTs, we established their precise protein landscape. Furthermore, we identified six proteins specifically enriched in PLT-derived apoVs, which could be considered as specific biomarkers. More importantly, PLT-derived apoVs promoted osteogenesis of MSCs and rescued bone loss via Golgi phosphoprotein 2 (GOLPH2)-induced AKT phosphorylation, therefore, leading to the emergence of their potential in bone regeneration. In summary, we comprehensively determined characteristics of PLT-derived apoVs and confirmed their roles in bone metabolism through previously unrecognized GOPLH2-dependent AKT signaling, providing more understanding for exploring apoV-based therapy in bone tissue engineering.",
        "DOI": "10.1021/acsnano.3c07717",
        "paper_author": "Jiang Y.",
        "affiliation_name": "Peking University Hospital of Stomatology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60121982"
    },
    {
        "paper_title": "Recent Progress in Bioinspired Design Strategies for Freeze Resistant Hydrogel Platforms toward Flexible Electronics",
        "publication": "Chemistry of Materials",
        "citied_by": "13",
        "cover_date": "2023-12-26",
        "Abstract": "Hydrogel-based flexible electronics have attracted great attention due to their excellent mechanical properties, high conductivity, sensitivity to electric signals, etc. Yet it is extremely challenging to create a freeze-resistant hydrogel for desired signal stability due to inevitable water crystallization at low temperature. Inspired by the inherent freezing tolerance of many biological organisms, researchers have devoted extensive efforts to developing advanced hydrogel materials with freeze-tolerant attributes and have made considerable progress. Herein, we present a comprehensive analysis of the cutting-edge developments in freeze-resistant hydrogels, underpinned by insights from nature and the frontiers of material engineering. We commence by delineating the intrinsic freeze-tolerance mechanisms inherent in organisms adapted to frigid environments. Following this, we collate the engineering methodologies tailored to develop antifreeze hydrogels. Subsequent sections illuminate the pioneering strides in applying these materials to diverse technological arenas, including flexible sensors, smart actuators and robotics, energy storage devices, and energy harvesters. Finally, the perspectives on future challenges and the avenues steering the accelerated evolution of such bioinspired materials are discussed. This review sheds light on the strides made in material innovation and structural design of freeze resistant hydrogels, anticipating the facilitation of the operation adaptation of soft electronic devices in extreme environments.",
        "DOI": "10.1021/acs.chemmater.3c02234",
        "paper_author": "Zhang H.",
        "affiliation_name": "Dalian Polytechnic University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60069704"
    },
    {
        "paper_title": "Systemic Administration with Bacteria-Inspired Nanosystems for Targeted Oncolytic Therapy and Antitumor Immunomodulation",
        "publication": "ACS Nano",
        "citied_by": "7",
        "cover_date": "2023-12-26",
        "Abstract": "Malignant tumors represent a formidable global health challenge, compelling the pursuit of innovative treatment modalities. Oncolytic therapy has emerged as a promising frontier in antitumor strategies. However, both natural agents (such as oncolytic bacteria or viruses) and synthetic oncolytic peptides confront formidable obstacles in clinical trials, which include the delicate equilibrium between safety and efficacy, the imperative for systemic administration with targeted therapy, and the need to counteract oncolysis-induced immunosuppression. To overcome these dilemmas, we have developed biomimetic nanoengineering to create oncolytic bacteria-inspired nanosystems (OBNs), spanning from hierarchical structural biomimicry to advanced bioactive biomimicry. Our OBNs harbor inherent oncolytic potential, including functionalized oligosaccharides mimicking bacterial cell walls for optimal blood circulation and tumor targeting, tumor acidity-switchable decoration for tumor-specific oncolysis, stereospecific tryptophan-rich peptides for robust oncolytic activity, encapsulated tumor immunomodulators for enhanced immunotherapy, and innate multimodal imaging potential for biological tracing. This work elucidates the efficacy and mechanisms of OBNs, encompassing primary tumor suppression, metastasis prevention, and recurrence inhibition. Systemic administration of d-chiral OBNs has demonstrated superior oncolytic efficacy, surpassing intratumoral injections of clinical-grade oncolytic peptides. This work heralds an era in biomimetic engineering on oncolytic agents, promising the revolutionization of contemporary oncolytic therapy paradigms for clinical translation.",
        "DOI": "10.1021/acsnano.3c10302",
        "paper_author": "Shen C.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356"
    },
    {
        "paper_title": "Earthworm Coelomocyte Internalization of MoS<inf>2</inf> Nanosheets: Multiplexed Imaging, Molecular Profiling, and Computational Modeling",
        "publication": "Environmental Science and Technology",
        "citied_by": "2",
        "cover_date": "2023-12-26",
        "Abstract": "Fully understanding the cellular uptake and intracellular localization of MoS2 nanosheets (NSMoS2) is a prerequisite for their safe applications. Here, we characterized the uptake profile of NSMoS2 by functional coelomocytes of the earthworm Eisenia fetida. Considering that vacancy engineering is widely applied to enhance the NSMoS2 performance, we assessed the potential role of such atomic vacancies in regulating cellular uptake processes. Coelomocyte internalization and lysosomal accumulation of NSMoS2 were tracked by fluorescent labeling imaging. Cellular uptake inhibitors, proteomics, and transcriptomics helped to mechanistically distinguish vacancy-mediated endocytosis pathways. Specifically, Mo ions activated transmembrane transporter and ion-binding pathways, entering the coelomocyte through assisted diffusion. Unlike molybdate, pristine NSMoS2 (P-NSMoS2) induced protein polymerization and upregulated gene expression related to actin filament binding, which phenotypically initiated actin-mediated endocytosis. Conversely, vacancy-rich NSMoS2 (V-NSMoS2) were internalized by coelomocytes through a vesicle-mediated and energy-dependent pathway. Mechanistically, atomic vacancies inhibited mitochondrial transport gene expression and likely induced membrane stress, significantly enhancing endocytosis (20.3%, p < 0.001). Molecular dynamics modeling revealed structural and conformational damage of cytoskeletal protein caused by P-NSMoS2, as well as the rapid response of transport protein to V-NSMoS2. These findings demonstrate that earthworm functional coelomocytes can accumulate NSMoS2 and directly mediate cytotoxicity and that atomic vacancies can alter the endocytic pathway and enhance cellular uptake by reprogramming protein response and gene expression patterns. This study provides an important mechanistic understanding of the ecological risks of NSMoS2",
        "DOI": "10.1021/acs.est.3c06665",
        "paper_author": "Sun K.",
        "affiliation_name": "Shanghai Jiao Tong University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025084"
    },
    {
        "paper_title": "Machine Learning-Assisted Engineering of Light, Oxygen, Voltage Photoreceptor Adduct Lifetime",
        "publication": "JACS Au",
        "citied_by": "0",
        "cover_date": "2023-12-25",
        "Abstract": "Naturally occurring and engineered flavin-binding, blue-light-sensing, light, oxygen, voltage (LOV) photoreceptor domains have been used widely to design fluorescent reporters, optogenetic tools, and photosensitizers for the visualization and control of biological processes. In addition, natural LOV photoreceptors with engineered properties were recently employed for optimizing plant biomass production in the framework of a plant-based bioeconomy. Here, the understanding and fine-tuning of LOV photoreceptor (kinetic) properties is instrumental for application. In response to blue-light illumination, LOV domains undergo a cascade of photophysical and photochemical events that yield a transient covalent FMN-cysteine adduct, allowing for signaling. The rate-limiting step of the LOV photocycle is the dark-recovery process, which involves adduct scission and can take between seconds and days. Rational engineering of LOV domains with fine-tuned dark recovery has been challenging due to the lack of a mechanistic model, the long time scale of the process, which hampers atomistic simulations, and a gigantic protein sequence space covering known mutations (combinatorial challenge). To address these issues, we used machine learning (ML) trained on scarce literature data and iteratively generated and implemented experimental data to design LOV variants with faster and slower dark recovery. Over the three prediction-validation cycles, LOV domain variants were successfully predicted, whose adduct-state lifetimes spanned 7 orders of magnitude, yielding optimized tools for synthetic (opto)biology. In summary, our results demonstrate ML as a viable method to guide the design of proteins even with limited experimental data and when no mechanistic model of the underlying physical principles is available.",
        "DOI": "10.1021/jacsau.3c00440",
        "paper_author": "Hemmer S.",
        "affiliation_name": "Heinrich-Heine-Universität Düsseldorf",
        "affiliation_city": "Dusseldorf",
        "affiliation_country": "Germany",
        "affiliation_id": "60025310"
    },
    {
        "paper_title": "Promising applications of phyto-fabricated silver nanoparticles: Recent trends in biomedicine",
        "publication": "Biochemical and Biophysical Research Communications",
        "citied_by": "9",
        "cover_date": "2023-12-25",
        "Abstract": "The prospective contribution of phyto-nanotechnology to the synthesis of silver nanomaterials for biomedical purposes is attracting increasing interest across the world. Green synthesis of silver nanoparticles (Ag-NPs) through plants has been extensively examined recently, and it is now seen to be a green and efficient path for future exploitation and development of practical nano-factories. Fabrication of Ag-NPs is the process involves use of plant extracts/phyto-compounds (e.g.alkaloids, terpenoids, flavonoids, and phenolic compounds) to synthesise nanoparticles in more economical and feasible. Several findings concluded that in the field of medicine, Ag-NPs play a major role in pharmacotherapy (infection and cancer). Indeed, they exhibits novel properties but the reason is unclear (except some theoretical interpretation e.g. size, shape and morphology). But recent technological advancements help to address these questions by predicting the unique properties (composition and origin) by characterizing physical, chemical and biological properties. Due to increased list of publications and their application in the field of agriculture, industries and pharmaceuticals, issues relating to toxicity are unavoidable and question of debate. The present reviews aim to find out the role of plant extracts to synthesise Ag-NPs. It provides an overview of various phytocompounds and their role in the field of biomedicine (antibacterial, antioxidant, anticancer, anti-inflammatory etc.). In addition, this review also especially focused on various applications such as role in infection, oxidative stress, application in medical engineering, diagnosis and therapy, medical devices, orthopedics, wound healing and dressings. Additionally, the toxic effects of Ag-NPs in cell culture, tissue of different model organism, type of toxic reactions and regulation implemented to reduce associated risk are discussed critically. Addressing all above explanations, this review focus on the detailed properties of plant mediated Ag-NPs, its impact on biology, medicine and their commercial properties as well as toxicity.",
        "DOI": "10.1016/j.bbrc.2023.149126",
        "paper_author": "Mohanta Y.K.",
        "affiliation_name": "University of Science and Technology Meghalaya",
        "affiliation_city": "Baridua 9th Mile",
        "affiliation_country": "India",
        "affiliation_id": "60283559"
    },
    {
        "paper_title": "Microalgae harvesting for wastewater treatment and resources recovery: A review",
        "publication": "New Biotechnology",
        "citied_by": "37",
        "cover_date": "2023-12-25",
        "Abstract": "Microalgae-based wastewater treatment has been conceived to obtain reclaimed water and produce microalgal biomass for bio-based products and biofuels generation. However, microalgal biomass harvesting is challenging and expensive, hence one of the main bottlenecks for full-scale implementation. Finding an integrated approach that covers concepts of engineering, green chemistry and the application of microbial anabolism driven towards the harvesting processes, is mandatory for the widespread establishment of full-scale microalgae wastewater treatment plants. By using nature-based substances and applying concepts of chemical functionalization in already established harvesting methods, the costs of harvesting processes could be reduced while preventing microalgae biomass contamination. Moreover, microalgae produced during wastewater treatment have unique culture characteristics, such as the consortia, which are primarily composed of microalgae and bacteria, that should be accounted for prior to downstream processing. The aim of this review is to examine recent advances in microalgal biomass harvesting and recovery in wastewater treatment systems, considering the impact of consortia variability. The costs of available harvesting technologies, such as coagulation/flocculation, coupled to sedimentation and differential air flotation, are provided. Additionally, promising technologies are discussed, including autoflocculation, bioflocculation, new filtration materials, nanotechnology, microfluidic and magnetic methods.",
        "DOI": "10.1016/j.nbt.2023.10.002",
        "paper_author": "de Morais E.G.",
        "affiliation_name": "Universitat Politècnica de Catalunya",
        "affiliation_city": "Barcelona",
        "affiliation_country": "Spain",
        "affiliation_id": "60007592"
    },
    {
        "paper_title": "Technological trends in medical robotic sensing with soft electronic skin",
        "publication": "Sensors and Diagnostics",
        "citied_by": "2",
        "cover_date": "2023-12-22",
        "Abstract": "Medical robotic sensing is a developing field that combines mechanical technology with medical engineering. Medical robots can play important roles in healthcare monitoring, prosthetic assistance, early diagnosis, and surgical operations. However, the increasing demand for medical robots comes with the need for greater sensing abilities, accurate control, and low-cost manufacture. Accordingly, this review highlights the recent progress in sensing technologies for medical robotic applications, including physical sensing, chemical sensing, and biological sensing. Subsequently, printing technology and human-machine interfaces are described. Our aim is to highlight the potential of medical sensing robotics and inspire further innovation.",
        "DOI": "10.1039/d3sd00284e",
        "paper_author": "Zhou Y.",
        "affiliation_name": "ShanghaiTech University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60105232"
    },
    {
        "paper_title": "Effects of mechanical properties of carbon-based nanocomposites on scaffolds for tissue engineering applications: a comprehensive review",
        "publication": "Nanoscale Advances",
        "citied_by": "15",
        "cover_date": "2023-12-22",
        "Abstract": "Mechanical properties, such as elasticity modulus, tensile strength, elongation, hardness, density, creep, toughness, brittleness, durability, stiffness, creep rupture, corrosion and wear, a low coefficient of thermal expansion, and fatigue limit, are some of the most important features of a biomaterial in tissue engineering applications. Furthermore, the scaffolds used in tissue engineering must exhibit mechanical and biological behaviour close to the target tissue. Thus, a variety of materials has been studied for enhancing the mechanical performance of composites. Carbon-based nanostructures, such as graphene oxide (GO), reduced graphene oxide (rGO), carbon nanotubes (CNTs), fibrous carbon nanostructures, and nanodiamonds (NDs), have shown great potential for this purpose. This is owing to their biocompatibility, high chemical and physical stability, ease of functionalization, and numerous surface functional groups with the capability to form covalent bonds and electrostatic interactions with other components in the composite, thus significantly enhancing their mechanical properties. Considering the outstanding capabilities of carbon nanostructures in enhancing the mechanical properties of biocomposites and increasing their applicability in tissue engineering and the lack of comprehensive studies on their biosafety and role in increasing the mechanical behaviour of scaffolds, a comprehensive review on carbon nanostructures is provided in this study.",
        "DOI": "10.1039/d3na00554b",
        "paper_author": "Eivazzadeh-Keihan R.",
        "affiliation_name": "Iran University of Science and Technology",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60012835"
    },
    {
        "paper_title": "Materials-Functionalized Point-of-Care Testing Devices for Pathogen Detection",
        "publication": "Accounts of Materials Research",
        "citied_by": "12",
        "cover_date": "2023-12-22",
        "Abstract": "Pathogen infection can lead to deterioration of physical fitness, organ function decline, and even death, and the continuous interhuman transmissions contribute to the epidemic outbreak. The rapid and sensitive detection of pathogens in clinical samples at scale thus becomes critical to infectious disease screening and containing outbreaks. Traditional detection methods, including microbial culture and polymerase chain reaction (PCR) technologies, involve bulky instrumentation in centralized laboratories, professional technicians, and a lengthy assay time, hence severely hampering the suppression of infection chains and disease treatment. Advanced diagnostic technologies capable of rapidly identifying pathogens are therefore ideal for prompting infection diagnosis and precision medicine. Point-of-care testing (POCT) devices, usually consisting of recognition elements and signal transduction units, offer a promising alternative as they can detect pathogens specifically and give qualitative results within a short time. By overcoming the issues of time-consuming growth culture and complex sample treatment, POCT devices can remarkably expedite the sample-to-result time of infection diagnosis with high sensitivity, thus allowing clinicians to quickly make decisions. Recent years have seen major progress in the development of functional materials that show unique physical and chemical properties to facilitate the performance enhancement of POCT devices, including inorganic nanomaterials, organic polymers, biomaterials, and the like. By contributing to the biorecognition and transduction of biological binding events into electrical and optical readout, functional materials at the interfaces between POCT sensors and the biological samples enable measurements with higher sensitivity and selectivity and faster responses. Hence, the development of high-performance functional materials is expected to increase the microbial detection efficiency of POCT devices by simplifying sample handling and improving the accuracy, thereby aiding in the on-site and real-time detection of pathogens and the large-scale screening of infectious diseases. In this Account, to clarify the potential of POCT devices coupled with functional materials in the rapid diagnosis of infectious diseases, we summarized the applications of materials-engineering-based POCT devices for human pathogen detection in terms of the types of functional materials, such as magnetic materials, metallic materials, luminescent materials, functional nucleic acids, and so forth. Based on our previous studies, we highlighted the abilities of functional materials-assisted POCT devices to detect pathogens in multiple actual biological samples, including urine, saliva, blood, stool, and so on. These applications provide substantial benefits for pathogen diagnostics with regard to fast response, high sensitivity, ease of use, portability, and low cost. Finally, the challenges and future directions of functional materials for POCT devices aimed at clinical pathogen detection are also briefly summarized.",
        "DOI": "10.1021/accountsmr.3c00151",
        "paper_author": "Wang H.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356"
    },
    {
        "paper_title": "Laser additive manufactured NiTi-based bioinspired helicoidal structure with excellent pseudoelasticity and energy absorption capacity",
        "publication": "Journal of Manufacturing Processes",
        "citied_by": "6",
        "cover_date": "2023-12-22",
        "Abstract": "Functionality-driven biomimetic additive manufacturing (AM), as a research hotspot of 3D printing field, is providing unprecedented opportunities for developing next-generation functional materials in mechanical, electrical, optical and biomedical engineering. In this work, we developed a laser AM-ed NiTi-based helicoidal structure with excellent pseudoelasticity and energy absorption capacity, inspired by the biological architecture in the exoskeleton of the crab's claw. The rotation angle θ corresponding to the misorientation of rods in adjacent layers, as the key structure parameter, was involved into the investigations on the forming quality, pseudoelastic response and fracture behavior of the laser AM-ed helicoidal structures. The results showed that an increase in θ could improve the forming accuracy of rods but decrease the porosity due to the formation of more closed pores filled with unmelted powder particles. These pores formed by the helically stacked rods had sharp edges that could trigger earlier stress concentration and phase transformation or even strain hardening during the loading process. In views of more uniform stress distribution, the helicoidal structure with θ = 36° exhibited the largest recoverable strain of 4.32 %. Regarding the deformation and fracture behavior, it was found that the helicoidal structures with small θ were inclined to exhibit an auxetic deformation behavior and a sluggish fracture process, while the ones with larger θ were prone to a buckling deformation mode and a sudden failure. Furthermore, all helicoidal structures presented excellent energy absorption properties in terms of both unit volume and unit mass values, which could be attributed to the cross-scale hierarchical structures.",
        "DOI": "10.1016/j.jmapro.2023.11.010",
        "paper_author": "Ma C.",
        "affiliation_name": "Jiangnan University",
        "affiliation_city": "Wuxi",
        "affiliation_country": "China",
        "affiliation_id": "60007029"
    },
    {
        "paper_title": "MODERN APPROACHES AND POSSIBILITIES OF APPLICATION OF 3D MODELING FOR TISSUE ENGINEERING AND BONE REGENERATION. LITERATURE REVIEW",
        "publication": "Eastern Ukrainian Medical Journal",
        "citied_by": "3",
        "cover_date": "2023-12-21",
        "Abstract": "In recent decades, polymers and biomaterials (polylactic acid (PLA), polycaprolactone (PCL) and hydroxyapatite (HA)) have created a real alternative in orthopedics, surgery, and cardiac surgery to traditional metals, thanks to the possibility of elimination after the implementation of their function. Progress in 3D design and the possibility of involving 3D printing technologies to create three-dimensional structures makes it possible to bring modern science to a higher quality level. Also, the presence of disadvantages inherent in metal scaffolds, such as discrepancy in mechanical properties, uncontrolled resorption, and lack of biological neutrality of foreign material about bone tissue, due to the possible development of several clinical complications, is the main problem of using degradable alloys in clinical conditions. To eliminate these problems, the following methods are used: the formation of a protective coating, post-cast processing or the development of new alloys, the use of hydroxyapatite instead of metal bases, and the use of 3D printing technologies. Materials and methods. The author selected more than 50 scientific works from the world literature on the problems on techniques for tissue engineering: fused deposition modeling, 3D printing, 3D bio circuitry, stereolithography, and selective laser sintering. Results. The development of individual materials that are capable of biodegrading polymers and are biocompatible, alone or in combination with mineral components, makes it possible to obtain materials for 3D printing with mechanical properties and chemical stability suitable for use in bone tissue regeneration. The mechanical properties of the combined scaffolds can be used in the trabecular bone because they correspond to the mechanical characteristics of the latter. The ability to control degradation depends on the composition of the copolymer while demonstrating improvement as a result of the inclusion of mineral phases-hydroxyapatite. After all, HA enhances the degradation of copolymers based on PCl and PLA. The use of these materials during the production of three-dimensional structures by the method of direct 3D printing makes it possible to significantly reduce the consumption of resources and time. The possibility of correcting the framework architecture and porosity leads to the appearance of additional levers of balance and control in the direction of resorption of the nanomaterial, namely the possibility of creating artificial bone. Conclusions. The data from processed literary sources and the results of a large number of studies allow us to state that the method of direct 3D printing is a priority in the production of three-dimensional porous structures, the basis of which can be natural (collagen, alginates, gelatin and chitosan) and synthetic polymers (aliphatic polyesters, polylactic acid (PLA), polyglycolic acid (PGA), poly-ε-caprolactone (PCL), polydioxanone (PDO)). At the same time, the latter, due to their properties, are more prioritized.",
        "DOI": "10.21272/eumj.2023;11(4):337-351",
        "paper_author": "Hlushchenko V.",
        "affiliation_name": "Sumy State University",
        "affiliation_city": "Sumy",
        "affiliation_country": "Ukraine",
        "affiliation_id": "60016511"
    },
    {
        "paper_title": "Electrokinetic Torque Generation by DNA Nanorobotic Arms Studied via Single-Molecule Fluctuation Analysis",
        "publication": "Journal of Physical Chemistry B",
        "citied_by": "1",
        "cover_date": "2023-12-21",
        "Abstract": "DNA nanotechnology has enabled the creation of supramolecular machines, whose shape and function are inspired from traditional mechanical engineering as well as from biological examples. As DNA inherently is a highly charged biopolymer, the external application of electric fields provides a versatile, computer-programmable way to control the movement of DNA-based machines. However, the details of the electrohydrodynamic interactions underlying the electrical manipulation of these machines are complex, as the influence of their intrinsic charge, the surrounding cloud of counterions, and the effect of electrokinetic fluid flow have to be taken into account. In this work, we identify the relevant effects involved in this actuation mechanism by determining the electric response of an established DNA-based nanorobotic arm to varying design and operation parameters. Borrowing an approach from single-molecule biophysics, we determined the electrical torque exerted on the nanorobotic arms by analyzing their thermal fluctuations when oriented in an electric field. We analyze the influence of various experimental and design parameters on the “actuatability” of the nanostructures and optimize the generated torque according to these parameters. Our findings give insight into the physical processes involved in the actuation mechanism and provide general guidelines that aid in designing and efficiently operating electrically driven nanorobotic devices made from DNA.",
        "DOI": "10.1021/acs.jpcb.3c05959",
        "paper_author": "Vogt M.",
        "affiliation_name": "Technische Universität München",
        "affiliation_city": "Munich",
        "affiliation_country": "Germany",
        "affiliation_id": "60019722"
    },
    {
        "paper_title": "Modeling the Osteogenic Potential of Decellularized Human Bone Particles by Tuning their Size Distribution Through a Sonic Microfragmentation Approach",
        "publication": "Advanced Materials Technologies",
        "citied_by": "1",
        "cover_date": "2023-12-21",
        "Abstract": "Human decellularized bone fragments are commonly used in clinics to perform allograft surgeries. To reduce the immunological response in the recipient and ensure their safety, these fragments underwent decellularization, a procedure that greatly reduces their osteogenicity (the ability to induce differentiation into osteoblast). In this work, by the introduction of an ultrasonication step to fragment the human bone, the size distribution of the resulting demineralize bone particles can be controlled, tuning their osteogenic potential. The sonication protocol is optimized by a response surface method, using 12 different sonication protocols, allowing to model the relationship between the sonication parameters and the outcoming particles properties in terms of dimensions, physical/chemical properties, and biological activity. The size distribution is extrapolated by a deep learning image segmentation while the structure is characterized by infrared and thermal analysis. The particles are combined with methacrylated silk gel to test in vitro their biological response on adipose-derived stromal cells. The ultrasonication fragmented the bone particles, revealing their internal organic matrix as proved by secondary electron microscopy and confocal microscopy. An inverse linear correlation is found between the particles’ sizes and their osteogenic activity, thus proving the efficacy of the proposed ultrasonication treatment in tuning the biological response.",
        "DOI": "10.1002/admt.202300635",
        "paper_author": "Bucciarelli A.",
        "affiliation_name": "IRCCS Rizzoli Orthopaedic Institute, Bologna",
        "affiliation_city": "Bologna",
        "affiliation_country": "Italy",
        "affiliation_id": "60029091"
    },
    {
        "paper_title": "Microelectronic Morphogenesis: Smart Materials with Electronics Assembling into Artificial Organisms",
        "publication": "Advanced Materials",
        "citied_by": "6",
        "cover_date": "2023-12-21",
        "Abstract": "Microelectronic morphogenesis is the creation and maintenance of complex functional structures by microelectronic information within shape-changing materials. Only recently has in-built information technology begun to be used to reshape materials and their functions in three dimensions to form smart microdevices and microrobots. Electronic information that controls morphology is inheritable like its biological counterpart, genetic information, and is set to open new vistas of technology leading to artificial organisms when coupled with modular design and self-assembly that can make reversible microscopic electrical connections. Three core capabilities of cells in organisms, self-maintenance (homeostatic metabolism utilizing free energy), self-containment (distinguishing self from nonself), and self-reproduction (cell division with inherited properties), once well out of reach for technology, are now within the grasp of information-directed materials. Construction-aware electronics can be used to proof-read and initiate game-changing error correction in microelectronic self-assembly. Furthermore, noncontact communication and electronically supported learning enable one to implement guided self-assembly and enhance functionality. Here, the fundamental breakthroughs that have opened the pathway to this prospective path are reviewed, the extent and way in which the core properties of life can be addressed are analyzed, and the potential and indeed necessity of such technology for sustainable high technology in society is discussed.",
        "DOI": "10.1002/adma.202306344",
        "paper_author": "McCaskill J.S.",
        "affiliation_name": "Technische Universität Chemnitz",
        "affiliation_city": "Chemnitz",
        "affiliation_country": "Germany",
        "affiliation_id": "60008069"
    },
    {
        "paper_title": "Design and testing of a metering system for fodder seed treatment",
        "publication": "Environment Conservation Journal",
        "citied_by": "0",
        "cover_date": "2023-12-20",
        "Abstract": "Quality of fodder seeds can be maintained by seed treatment for better production and productivity. It refers to the application of specific physical, chemical, or biological agents to the seed prior to sowing in order to suppress, control, or repel pathogens, insects, and other pests that attack seeds, seedlings, or plants. In this study, the efficient seed and chemical metering system for fodder seed treatment was designed which can be used in different seed coating/treatment machine. Seed metering mechanism was calibrated mechanically and manually at four positions (Full, 3/4th, Half, and 1/4th openings). For manual calibration, it was observed between 0.19 kg/s to 1.08 kg/s for Berseem seeds and 0.15 kg/s to 1.00 kg/s for Cowpea seeds. For mechanical calibration, it was observed between 0.24 kg/s to 1.17 kg/s for Berseem seeds and 0.11 kg/s to 1.04 kg/s for Cowpea seeds. Designed system is useful in developing high capacity, efficient and cost effective seed treaters for treatment/coating of fodder seeds as well as other crop seeds.",
        "DOI": "10.36953/ECJ.23122596",
        "paper_author": "Patil A.K.",
        "affiliation_name": "ICAR- Indian Grassland and Fodder Research Institute, Jhansi",
        "affiliation_city": "Jhansi",
        "affiliation_country": "India",
        "affiliation_id": "60043305"
    },
    {
        "paper_title": "The application of the analytical hierarchy process (AHP) in determining organic waste process technology-oriented-reducing greenhouse gas",
        "publication": "E3S Web of Conferences",
        "citied_by": "0",
        "cover_date": "2023-12-20",
        "Abstract": "The existence of waste in the environment, which is not managed well, could contribute to global warming and cause climate change on the earth. This research aimed to determine the suitable management preference for organic waste treatment produced in small cities. The methods used are based on pair comparison in hierarchy decisions developed through the analytical hierarchy process. The hierarchy consisted of goals, criteria, sub-criteria and alternatives applied to waste treatment engineering. The expert suggestion was used in a pair comparison matrix to determine the level of technology. The comparison was used to get the significance level of decision criteria and the relative performance of the options. The city's waste managed by the Buleleng government was used to demonstrate the application of the analytical hierarchy process in that region. The result showed that the important factor in deciding on waste treatment for the small city is environment and engineering, with each eigenvector priority (0.28), sociocultural (0.24) and economy (0.20). According to the recruitment preference for Singaraja waste treatment, the analytical hierarchy process showed that controlled landfill and composting are the most suitable treatment, followed by incineration, anaerobic digestion, and mechanical and biological treatment.",
        "DOI": "10.1051/e3sconf/202346704006",
        "paper_author": "Gunamantha M.",
        "affiliation_name": "Universitas Pendidikan Ganesha",
        "affiliation_city": "Bali",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60105231"
    },
    {
        "paper_title": "Engineering extracellular electron transfer pathways of electroactive microorganisms by synthetic biology for energy and chemicals production",
        "publication": "Chemical Society Reviews",
        "citied_by": "35",
        "cover_date": "2023-12-20",
        "Abstract": "The excessive consumption of fossil fuels causes massive emission of CO2, leading to climate deterioration and environmental pollution. The development of substitutes and sustainable energy sources to replace fossil fuels has become a worldwide priority. Bio-electrochemical systems (BESs), employing redox reactions of electroactive microorganisms (EAMs) on electrodes to achieve a meritorious combination of biocatalysis and electrocatalysis, provide a green and sustainable alternative approach for bioremediation, CO2 fixation, and energy and chemicals production. EAMs, including exoelectrogens and electrotrophs, perform extracellular electron transfer (EET) (i.e., outward and inward EET), respectively, to exchange energy with the environment, whose rate determines the efficiency and performance of BESs. Therefore, we review the synthetic biology strategies developed in the last decade for engineering EAMs to enhance the EET rate in cell-electrode interfaces for facilitating the production of electricity energy and value-added chemicals, which include (1) progress in genetic manipulation and editing tools to achieve the efficient regulation of gene expression, knockout, and knockdown of EAMs; (2) synthetic biological engineering strategies to enhance the outward EET of exoelectrogens to anodes for electricity power production and anodic electro-fermentation (AEF) for chemicals production, including (i) broadening and strengthening substrate utilization, (ii) increasing the intracellular releasable reducing equivalents, (iii) optimizing c-type cytochrome (c-Cyts) expression and maturation, (iv) enhancing conductive nanowire biosynthesis and modification, (v) promoting electron shuttle biosynthesis, secretion, and immobilization, (vi) engineering global regulators to promote EET rate, (vii) facilitating biofilm formation, and (viii) constructing cell-material hybrids; (3) the mechanisms of inward EET, CO2 fixation pathway, and engineering strategies for improving the inward EET of electrotrophic cells for CO2 reduction and chemical production, including (i) programming metabolic pathways of electrotrophs, (ii) rewiring bioelectrical circuits for enhancing inward EET, and (iii) constructing microbial (photo)electrosynthesis by cell-material hybridization; (4) perspectives on future challenges and opportunities for engineering EET to develop highly efficient BESs for sustainable energy and chemical production. We expect that this review will provide a theoretical basis for the future development of BESs in energy harvesting, CO2 fixation, and chemical synthesis.",
        "DOI": "10.1039/d3cs00537b",
        "paper_author": "Zhang J.",
        "affiliation_name": "Tianjin University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60019533"
    },
    {
        "paper_title": "Deep learning and CRISPR-Cas13d ortholog discovery for optimized RNA targeting",
        "publication": "Cell Systems",
        "citied_by": "16",
        "cover_date": "2023-12-20",
        "Abstract": "Effective and precise mammalian transcriptome engineering technologies are needed to accelerate biological discovery and RNA therapeutics. Despite the promise of programmable CRISPR-Cas13 ribonucleases, their utility has been hampered by an incomplete understanding of guide RNA design rules and cellular toxicity resulting from off-target or collateral RNA cleavage. Here, we quantified the performance of over 127,000 RfxCas13d (CasRx) guide RNAs and systematically evaluated seven machine learning models to build a guide efficiency prediction algorithm orthogonally validated across multiple human cell types. Deep learning model interpretation revealed preferred sequence motifs and secondary features for highly efficient guides. We next identified and screened 46 novel Cas13d orthologs, finding that DjCas13d achieves low cellular toxicity and high specificity—even when targeting abundant transcripts in sensitive cell types, including stem cells and neurons. Our Cas13d guide efficiency model was successfully generalized to DjCas13d, illustrating the power of combining machine learning with ortholog discovery to advance RNA targeting in human cells.",
        "DOI": "10.1016/j.cels.2023.11.006",
        "paper_author": "Wei J.",
        "affiliation_name": "Department of Bioengineering",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60141509"
    },
    {
        "paper_title": "Robustness and complexity",
        "publication": "Cell Systems",
        "citied_by": "2",
        "cover_date": "2023-12-20",
        "Abstract": "When a system robustly corrects component-level errors, the direct pressure on component performance declines. Components become less reliable, maintain more genetic variability, or drift neutrally, creating new forms of complexity. Examples include the hourglass pattern of biological development and the hourglass architecture for robustly complex systems in engineering.",
        "DOI": "10.1016/j.cels.2023.11.003",
        "paper_author": "Frank S.A.",
        "affiliation_name": "University of California, Irvine",
        "affiliation_city": "Irvine",
        "affiliation_country": "United States",
        "affiliation_id": "60007278"
    },
    {
        "paper_title": "Enantioselective Antiviral Activities of Chiral Zinc Oxide Nanoparticles",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "5",
        "cover_date": "2023-12-20",
        "Abstract": "Chiral nanoparticles (C-NPs) play a crucial role in biomedical applications, especially in their biological effects on cytotoxicity and metabolism. However, there are rare reports about the antivirus property of C-NPs and their working mechanism. Here, three different types of chiral ZnO NPs (l-ZnO, d-ZnO, and dl-ZnO) were prepared as enantioselective antivirals. Biocompatibility test results showed that the three different chiral ZnO NPs varied significantly in cytotoxicity. Evaluation of their effects against porcine reproductive and respiratory syndrome virus (PRRSV) indicated that compared with d-ZnO and dl-ZnO NPs, l-ZnO NPs exhibited stronger anti-PRRSV activity due to their higher cognate cell adhesion and uptake. Furthermore, the high concentration of l-ZnO NPs can obviously reduce cellular reactive oxygen species (ROS) in MARC-145 cells, thus effectively preventing PRRSV-induced oxidative damage. This study demonstrated the outstanding antiviral properties of l-ZnO NPs, which may facilitate the development and application of C-NPs in antiviral drugs and tissue engineering.",
        "DOI": "10.1021/acsami.3c15463",
        "paper_author": "Fan X.",
        "affiliation_name": "Huazhong Agricultural University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60032955"
    },
    {
        "paper_title": "Advances in ligand-specific biosensing for structurally similar molecules",
        "publication": "Cell Systems",
        "citied_by": "3",
        "cover_date": "2023-12-20",
        "Abstract": "The specificity of biological systems makes it possible to develop biosensors targeting specific metabolites, toxins, and pollutants in complex medical or environmental samples without interference from structurally similar compounds. For the last two decades, great efforts have been devoted to creating proteins or nucleic acids with novel properties through synthetic biology strategies. Beyond augmenting biocatalytic activity, expanding target substrate scopes, and enhancing enzymes' enantioselectivity and stability, an increasing research area is the enhancement of molecular specificity for genetically encoded biosensors. Here, we summarize recent advances in the development of highly specific biosensor systems and their essential applications. First, we describe the rational design principles required to create libraries containing potential mutants with less promiscuity or better specificity. Next, we review the emerging high-throughput screening techniques to engineer biosensing specificity for the desired target. Finally, we examine the computer-aided evaluation and prediction methods to facilitate the construction of ligand-specific biosensors.",
        "DOI": "10.1016/j.cels.2023.10.009",
        "paper_author": "Xi C.",
        "affiliation_name": "McKelvey School of Engineering",
        "affiliation_city": "St. Louis",
        "affiliation_country": "United States",
        "affiliation_id": "60105336"
    },
    {
        "paper_title": "Luciferase Calibrants Enable Absolute Quantitation of Bioluminescence Power",
        "publication": "ACS Measurement Science Au",
        "citied_by": "4",
        "cover_date": "2023-12-20",
        "Abstract": "Bioluminescence emitted from a luciferase-catalyzed oxidation of luciferin has been broadly utilized to report on biological events, predominantly through relative changes in the light output. Recent advances in protein engineering and synthetic chemistry have yielded bioluminescent systems with markedly improved brightness and bioavailability. These developments have enabled not only the detection of biological events at far lower expression levels but also new opportunities utilizing bioluminescence to power photochemistry in cells. Regardless of the application, bioluminescence analyses have leaned heavily on the use of luminometers to measure the light output of a system. Current luminometers report the light output of a sample in relative units, limiting the ability to compare data between instruments and preventing the absolute power of a bioluminescent system from being quantified. Luminescent solution calibrants comprising luciferases and their cognate luciferins that have been characterized for absolute light output would enable calibration of any given luminometer for absolute photon counting. To this end, we have built a custom light detection apparatus and used it alongside wavelength-matched LED light sources emitting at 450 and 561 nm to characterize the absolute power of a series of NanoLuc and firefly luciferase solutions, respectively. This approach revealed that these two common luciferases produce 3.72 × 10-18 and 7.25 × 10-20 watts/molecule, respectively. Components of these luminescent solution calibrants are commercially available and produce stable bioluminescent signals over 2-5 min, enabling any luminometer to be calibrated for power measurements of bioluminescence emitted by these two luciferases in units of watts or photons per second.",
        "DOI": "10.1021/acsmeasuresciau.3c00036",
        "paper_author": "Klein M.A.",
        "affiliation_name": "Promega Corporation",
        "affiliation_city": "Madison",
        "affiliation_country": "United States",
        "affiliation_id": "60001745"
    },
    {
        "paper_title": "Disruption of the FMN-A524 interaction cascade and Glu513-induced collapse of the hydrophobic barrier promotes light-induced Jα-helix unfolding in AsLOV2",
        "publication": "Biophysical Journal",
        "citied_by": "1",
        "cover_date": "2023-12-19",
        "Abstract": "The C-terminal Jα-helix of the Avena sativa's Light Oxygen and Voltage (AsLOV2) protein, unfolds on exposure to blue light. This characteristic seeks relevance in applications related to engineering novel biological photoswitches. Using molecular dynamics simulations and the Markov state modeling (MSM) approach we provide the mechanism that explains the stepwise unfolding of the Jα-helix. The unfolding was resolved into seven steps represented by the structurally distinguishable states distributed over the initiation and the post initiation phases. Whereas, the initiation phase occurs due to the collapse of the interaction cascade FMN-Q513-N492-L480-W491-Q479-V520-A524, the onset of the post initiation phase is marked by breaking of the hydrophobic interactions between the Jα-helix and the Iβ-strand. This study indicates that the displacement of N492 out of the FMN binding pocket, not necessarily requiring Q513, is essential for the initiation of the Jα-helix unfolding. Rather, the structural reorientation of Q513 activates the protein to cross the hydrophobic barrier and enter the post initiation phase. Similarly, the structural deviations in N482, rather than its integral role in unfolding, could enhance the unfolding rates. Furthermore, the MSM studies on the wild-type and the Q513 mutant, provide the spatiotemporal roadmap that lay out the possible pathways of structural transition between the dark and the light states of the protein. Overall, the study provides insights useful to enhance the performance of AsLOV2-based photoswitches.",
        "DOI": "10.1016/j.bpj.2023.11.011",
        "paper_author": "Arshi S.A.",
        "affiliation_name": "Jamia Millia Islamia",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60020458"
    },
    {
        "paper_title": "Human-machine interface improving quality of patient care",
        "publication": "Human Machine Interface: Making Healthcare Digital",
        "citied_by": "0",
        "cover_date": "2023-12-19",
        "Abstract": "Care for patients needs doctors and nurses to communicate well with one other. There is a growing need for a two-way communication not just within the team but also with the medical equipment used to track and manage patients' conditions. Most HCIs include some kind of visual or aural display, and they have been the source of well-documented worries despite much testing. Remarkably few interfaces look at the benefits of multimodal communication despite abundant research that proves the brain's sensitivity to multimodal inputs. One of the most promising cutting-edge technical disciplines nowadays is medicine, thanks to the explosion of recent scientific knowledge and technological innovation in the field. As allowing users to automate their lives (by controlling everyday chores with just their minds) and even enjoy themselves, brain-computer interface (BCI) technology has broadened the definition of rehabilitation beyond its traditional medical context (hands-free gaming). This chapter examines the current state of the art in HMI design as it pertains to the field of biomedical engineering, with a focus on its potential for facilitating direct brain-computer interface. This strategy relies on the creation of a revolutionary miniaturized system for the covert detection of a biological signal via the use of sensors incorporated into an advanced HMI. This chapter explains current research that may have future relevance in human-computer interface design (HMI). The development of a low-cost mechanism for improving medical communication would have far-reaching effects on patient care and the expanding medical technology industry.",
        "DOI": "10.1002/9781394200344.ch4",
        "paper_author": "Sharma R.",
        "affiliation_name": "Galgotias University",
        "affiliation_city": "Greater Noida",
        "affiliation_country": "India",
        "affiliation_id": "60120915"
    },
    {
        "paper_title": "Progress in non-viral delivery of nucleic acid: Advancement in biomedical technology",
        "publication": "Integration of Biomaterials for Gene Therapy",
        "citied_by": "2",
        "cover_date": "2023-12-19",
        "Abstract": "Biomedical technology is a multidisciplinary field which involves application of technology and engineering principles in better understanding of biological systems at molecular level, and advances innovative methods to advance medical and bio-technological applications with an emphasis on human diseases and health. Biomedical technology targets for improvement of malfunctioning genes accountable for disease via gene-therapy. Gene-therapy employs nucleic acids as functional therapeutic agents for biological treatment of a wide variety of diseases. Delivery of nucleic acids is a highly studied approach for the cure of various ailments, and its accomplishment entirely relies on delivery. Although, there is growing need for a safe, effective, non-pathogenic means for nucleic acid delivery. Several types of delivery system exist, such as viral, non-viral, and combined-hybrid deliver system. Non-viral nucleic acid delivery system is two categories, physical and chemical non-viral delivery system. Physical methods refer to the introduction of nucleic acid by application of the physical force. Chemical methods utilize natural or synthetic carriers for delivery of nucleic acid into cells. The current chapter will put an emphasis on an in-depth insight on ways of non-viral nucleic acid delivery systems, its advantages and disadvantages, how it exhibits low immunogenicity, and its use in current biomedical technology.",
        "DOI": "10.1002/9781394175635.ch10",
        "paper_author": "Mavi A.K.",
        "affiliation_name": "Vallabhbhai Patel Chest Institute",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60061305"
    },
    {
        "paper_title": "Hydrogel-based gene therapy",
        "publication": "Integration of Biomaterials for Gene Therapy",
        "citied_by": "0",
        "cover_date": "2023-12-19",
        "Abstract": "Gene therapy (GT) relies heavily on the adoption of safe delivery vehicles that do not cause any adverse side effects or immunological reactions. Biodegradable and biocompatible polymeric nanocarriers are being used for gene delivery due to their unique properties such as excellent bio- incompatibility, prolonged gene circulation time, prevention of gene degradation, passive targeting, and the ability to modify polymer structure. Biomaterials are playing a pivotal role in medical technologies that aim to transport medicinal chemicals to patients in hospitals and other clinical settings. Recent advances in our understanding of the role biomateri-als play in gene therapy have stoked excitement in the generation of several nucleic acid agents for the treatment of numerous diseases. This investigation focuses on the importance of interdisciplinary teams in the development of contemporary hydrogels for performing complex biological activities like cancer immunother-apy, tissue engineering, and immunization. Hydrogels are biocompatible hydrogels that can be used for integrated sensing and therapeutics. They have potential applications in gene transfer, regenerative medicine, genetic diseases, and medication delivery. Hydrogels have high water content and mild gelation conditions, making them useful for gene transfer. They can also be used to promote transplanted or endogenously infiltrating cells, heal or restore the function of damaged or injured tissues, and act as vectors for therapeutic genes. New developments in hydrogel manufacture for distribution have resulted from a greater knowledge of the design aspects, which include physical and biological components, transgene expression, cell engraftment, and cell function.",
        "DOI": "10.1002/9781394175635.ch4",
        "paper_author": "Kumari S.",
        "affiliation_name": "T. John College",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "60114486"
    },
    {
        "paper_title": "Use of polysaccharides: Novel delivery system for genetic material",
        "publication": "Integration of Biomaterials for Gene Therapy",
        "citied_by": "0",
        "cover_date": "2023-12-19",
        "Abstract": "Due to their biocompatibility, biodegradability, and distinctive bioactive features, polysaccharides have been identified as attractive candidates for a variety of biological applications in gene therapy and tissue engineering. Gene delivery is a method to relocate external DNA into the presenter cells for genetic research or gene remedy of human hereditary disorders. Gene therapy is one of the promising therapies for the management of various diseases like cancers; Alzheimer's viral infection as well as inherited diseases polysaccharides (carbohydrates) is usually isolated from plants and animal sources abundant in nature. For the delivery of genes, many polysaccharide-based biomaterials are being researched, including starch, cellulose, chitosan, dextran, and alginates. Further, these polymers are widely accepted by the body due to their biochemical similarity with human extracellular matrix components regulating cell signaling and tissue growth. Further, polysaccharides-based biomaterials are designed as graphene, metal oxide, and carbon nanotubes utilized in diverse fields of research. Recently, the major focus of research has been concentrating on the identification of the efficient and safe substitutes for the viral vehicles required in gene delivery. Future research can be expected to face significant hurdles related to understanding the molecular interactions of interacting compounds, the destiny of polysaccharide nanoparticles in vivo, and the molecular interactions between polysaccharides and loaded drugs/genes. The current chapter is primarily concerned with an overview of polysaccharide-based biomaterials for a variety of biomedical applications, including gene transfer. Additionally, the focus will be on structure, cross-linking mechanisms, biosynthesis, chemical characteristics, biological properties, current problems, clinical usage, recent advancements, and methods to build polysaccha-ride-derived biomaterials. Finally, numerous future prospects for the design and fabrication of polysaccharides-based materials to accomplish their extensive commercial usage are discussed.",
        "DOI": "10.1002/9781394175635.ch2",
        "paper_author": "Kumar P.",
        "affiliation_name": "Teerthanker Mahaveer University, Moradabad",
        "affiliation_city": "Moradabad",
        "affiliation_country": "India",
        "affiliation_id": "60113718"
    },
    {
        "paper_title": "Polysaccharide-based biomaterials for gene delivery",
        "publication": "Integration of Biomaterials for Gene Therapy",
        "citied_by": "0",
        "cover_date": "2023-12-19",
        "Abstract": "There are various physical and chemical cross-linking strategies for designing biomaterials derived from polysaccharides is presented. There has been a significant need in the field of biological research for innovative composite materials based on polysaccharides. In order to accomplish a challenging job in a complicated biological context, polysaccharides-based biomaterials are being intensively researched due to their inherent biocompatible, cheap, naturally accessible, and biodegradable qualities. Accordingly, this article details the most up-to-date methods for using polysaccharides produced functional biomaterials, with a focus on their use in drug administration, gene therapy, and tissue engineering. Polysaccharides are a possible alternative to nonbiodegradable chemical polymers owing to their biodegradability and sustainability in the environment. They consist of a long chain of monosaccharides that are joined together by glycosidic linkages. Composite nanomaterials based on natural polysaccharides, metal oxides, and carbon-based nanomaterials have been created. To comprehend the structural property of polysaccharide-based nanocomposite, the surface area/volume ratio is essential. Polysaccharides-based formulations have recently been investigated for their use in the creation of innovative drug delivery systems that may release numerous medicines concurrently or sequentially, hence improving the efficacy of targeted gene therapy. The research discussed here inspires the development of new biomaterials based on polysaccharides that exhibit superior characteristics and functionalities. Finally, future prospects for expanding their commercial application are discussed. In this article, we focus on biomaterials based on poly-saccharides, which have recently emerged as a flexible platform for a wide range of biomedical applications, such as drug delivery, gene therapy, and tissue regeneration. Different polysaccharides' structures and characteristics are discussed, as are methods for functionalizing them. The development and use of polysaccharide-based nanocomposites in modeling are topics covered in this book, making it a valuable resource for those studying these topics. This is a much-needed volume on a promising new area of research; polysaccharide-based nanocomposites have promising future uses in areas such as gene delivery and tissue engineering, putting them at the forefront of contemporary medicine.",
        "DOI": "10.1002/9781394175635.ch3",
        "paper_author": "Moharana A.",
        "affiliation_name": "Arka Jain University",
        "affiliation_city": "Jamshedpur",
        "affiliation_country": "India",
        "affiliation_id": "60282790"
    },
    {
        "paper_title": "Class II terpene cyclases: structures, mechanisms, and engineering",
        "publication": "Natural Product Reports",
        "citied_by": "18",
        "cover_date": "2023-12-18",
        "Abstract": "Covering: up to July 2023 Terpene cyclases (TCs) catalyze some of the most complicated reactions in nature and are responsible for creating the skeletons of more than 95 000 terpenoid natural products. The canonical TCs are divided into two classes according to their structures, functions, and mechanisms. The class II TCs mediate acid-base-initiated cyclization reactions of isoprenoid diphosphates, terpenes without diphosphates (e.g., squalene or oxidosqualene), and prenyl moieties on meroterpenes. The past twenty years witnessed the emergence of many class II TCs, their reactions and their roles in biosynthesis. Class II TCs often act as one of the first steps in the biosynthesis of biologically active natural products including the gibberellin family of phytohormones and fungal meroterpenoids. Due to their mechanisms and biocatalytic potential, TCs elicit fervent attention in the biosynthetic and organic communities and provide great enthusiasm for enzyme engineering to construct novel and bioactive molecules. To engineer and expand the structural diversities of terpenoids, it is imperative to fully understand how these enzymes generate, precisely control, and quench the reactive carbocation intermediates. In this review, we summarize class II TCs from nature, including sesquiterpene, diterpene, triterpene, and meroterpenoid cyclases as well as noncanonical class II TCs and inspect their sequences, structures, mechanisms, and structure-guided engineering studies.",
        "DOI": "10.1039/d3np00033h",
        "paper_author": "Pan X.",
        "affiliation_name": "State Key Laboratory of Natural Medicines",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60124157"
    },
    {
        "paper_title": "Effect of Mechanical Stimuli on the Phenotypic Plasticity of Induced Pluripotent Stem-Cell-Derived Vascular Smooth Muscle Cells in a 3D Hydrogel",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "3",
        "cover_date": "2023-12-18",
        "Abstract": "Introduction: Vascular smooth muscle cells (VSMCs) play a pivotal role in vascular homeostasis, with dysregulation leading to vascular complications. Human-induced pluripotent stem-cell (hiPSC)-derived VSMCs offer prospects for personalized disease modeling and regenerative strategies. Current research lacks comparative studies on the impact of three-dimensional (3D) substrate properties under cyclic strain on phenotypic adaptation in hiPSC-derived VSMCs. Here, we aim to investigate the impact of intrinsic substrate properties, such as the hydrogel’s elastic modulus and cross-linking density in a 3D static and dynamic environment, on the phenotypical adaptation of human mural cells derived from hiPSC-derived organoids (ODMCs), compared to aortic VSMCs. Methods and results: ODMCs were cultured in two-dimensional (2D) conditions with synthetic or contractile differentiation medium or in 3D Gelatin Methacryloyl (GelMa) substrates with varying degrees of functionalization and percentages to modulate Young’s modulus and cross-linking density. Cells in 3D substrates were exposed to cyclic, unidirectional strain. Phenotype characterization was conducted using specific markers through immunofluorescence and gene expression analysis. Under static 2D culture, ODMCs derived from hiPSCs exhibited a VSMC phenotype, expressing key mural markers, and demonstrated a level of phenotypic plasticity similar to primary human VSMCs. In static 3D culture, a substrate with a higher Young’s modulus and cross-linking density promoted a contractile phenotype in ODMCs and VSMCs. Dynamic stimulation in the 3D substrate promoted a switch toward a contractile phenotype in both cell types. Conclusion: Our study demonstrates phenotypic plasticity of human ODMCs in response to 2D biological and 3D mechanical stimuli that equals that of primary human VSMCs. These findings may contribute to the advancement of tailored approaches for vascular disease modeling and regenerative strategies.",
        "DOI": "10.1021/acsabm.3c00840",
        "paper_author": "Meijer E.M.",
        "affiliation_name": "University Medical Center Utrecht",
        "affiliation_city": "Utrecht",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60032724"
    },
    {
        "paper_title": "Poly(ethylene glycol) Hydrogels with the Sustained Release of Hepatocyte Growth Factor for Enhancing Vascular Regeneration",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "1",
        "cover_date": "2023-12-18",
        "Abstract": "The surface modification of biologically active factors on tissue-engineering vascular scaffold fails to fulfill the mechanical property and bioactive compounds' sustained release in vivo and results in the inhibition of tissue regeneration of small-diameter vascular grafts in vascular replacement therapies. In this study, biodegradable poly(ϵ-caprolactone) (PCL) was applied for scaffold preparation, and poly(ethylene glycol) (PG) hydrogel was used to load heparin and hepatocyte growth factor (HGF). In vitro analysis demonstrated that the PCL scaffold could inhibit the heparin release from the PG hydrogel, and the PG hydrogel could inhibit heparin release during the process of PCL degradation. Finally, it results in sustained release of HGF and heparin from the PCL-PG-HGF scaffold. The mechanical property of this hybrid scaffold improved after being coated with the PG hydrogel. In addition, the PCL-PG-HGF scaffold illustrated no inflammatory lesions, organ damage, or biological toxicity in all primary organs, with rapid organization of the endothelial cell layer, smooth muscle regeneration, and extracellular matrix formation. These results indicated that the PCL-PG-HGF scaffold is biocompatible and provides a microenvironment in which a tissue-engineered vascular graft with anticoagulant properties allows regeneration of vascular tissue (Scheme 1). Such findings confirm the feasibility of creating hydrogel scaffolds coated with bioactive factors to prepare novel vascular grafts.",
        "DOI": "10.1021/acsabm.3c00516",
        "paper_author": "Xu Z.",
        "affiliation_name": "Xuanwu Hospital, Capital Medical University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60080985"
    },
    {
        "paper_title": "Isolation and Characterization of Monomeric Human RAD51: A Novel Tool for Investigating Homologous Recombination in Cancer",
        "publication": "Angewandte Chemie - International Edition",
        "citied_by": "3",
        "cover_date": "2023-12-18",
        "Abstract": "DNA repair protein RAD51 is a key player in the homologous recombination pathway. Upon DNA damage, RAD51 is transported into the nucleus by BRCA2, where it can repair DNA double-strand breaks. Due to the structural complexity and dynamics, researchers have not yet clarified the mechanistic details of every step of RAD51 recruitment and DNA repair. RAD51 possesses an intrinsic tendency to form oligomeric structures, which make it challenging to conduct biochemical and biophysical investigations. Here, for the first time, we report on the isolation and characterization of a human monomeric RAD51 recombinant form, obtained through a double mutation, which preserves the protein's integrity and functionality. We investigated different buffers to identify the most suitable condition needed to definitively stabilize the monomer. The monomer of human RAD51 provides the community with a unique biological tool for investigating RAD51-mediated homologous recombination, and paves the way for more reliable structural, mechanistic, and drug discovery studies.",
        "DOI": "10.1002/anie.202312517",
        "paper_author": "Rinaldi F.",
        "affiliation_name": "Istituto Italiano di Tecnologia",
        "affiliation_city": "Genoa",
        "affiliation_country": "Italy",
        "affiliation_id": "60102151"
    },
    {
        "paper_title": "One-Pot Approach to Synthesize Tough and Cell Adhesive Double-Network Hydrogels Consisting of Fully Synthetic Materials of Self-Assembling Peptide and Poly(ethylene glycol)",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "1",
        "cover_date": "2023-12-18",
        "Abstract": "Hydrogels with a double network (DN) structure are compelling biomaterials, holding potential for use as artificial extracellular matrices. Generally, the DN approach imparts hydrogels with high mechanical strength and cell-adhesive properties. However, achieving this often demands a complex multistep process involving potentially hazardous free-radical polymerization, which can result in toxicity. This limits their broad biological applications. In this work, we introduce a straightforward yet biocompatible method to fabricate tough and cell-adhesive DN hydrogels using entirely synthetic materials: the self-assembling peptide (RADA16) and poly(ethylene glycol) (PEG). An in situ mixing of these components leads to the sequential formation of DN hydrogels─first through the self-assembly of the RADA16 peptide and then via chemical cross-linking between PEG molecules. Hydrogels produced this way exhibited up to a 10-fold increase in fracture energy, and cells seeded on their surfaces showcased good attachment. Our design underscores the efficacy of the DN approach and the promising applications of peptides in tissue engineering.",
        "DOI": "10.1021/acsabm.3c00562",
        "paper_author": "Ishikawa S.",
        "affiliation_name": "The University of Tokyo",
        "affiliation_city": "Tokyo",
        "affiliation_country": "Japan",
        "affiliation_id": "60025272"
    },
    {
        "paper_title": "Impacts of artificial light at night on the early life history of two ecosystem engineers",
        "publication": "Philosophical Transactions of the Royal Society B: Biological Sciences",
        "citied_by": "4",
        "cover_date": "2023-12-18",
        "Abstract": "Sessile marine invertebrates play a vital role as ecosystem engineers and in benthic-pelagic coupling. Most benthic fauna develop through larval stages and the importance of natural light cycles for larval biology and ecology is long-established. Natural light-dark cycles regulate two of the largest ocean-scale processes that are fundamental to larvae's life cycle: the timing of broadcast spawning for successful fertilization and diel vertical migration for foraging and predator avoidance. Given the reliance on light and the ecological role of larvae, surprisingly little is known about the impacts of artificial light at night (ALAN) on the early life history of habitat-forming species. We quantified ALAN impacts on larval performance (survival, growth, development) of two cosmopolitan ecosystem engineers in temperate marine ecosystems, the mussel Mytilus edulis and the barnacle Austrominius modestus. Higher ALAN irradiance reduced survival in both species (57% and 13%, respectively). ALAN effects on development and growth were small overall, and different between species, time-points and parentage. Our results show that ALAN adversely affects larval survival and reiterates the importance of paternal influence on offspring performance. ALAN impacts on the early life stages of ecosystem engineering species have implications not only for population viability but also the ecological communities that these species support. This article is part of the theme issue 'Light pollution in complex ecological systems'.",
        "DOI": "10.1098/rstb.2022.0363",
        "paper_author": "Tidau S.",
        "affiliation_name": "University of Plymouth",
        "affiliation_city": "Plymouth",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60024779"
    },
    {
        "paper_title": "Value of a critical bone defect animal model in evaluating osteogenic efficacy of bone tissue engineering scaffold",
        "publication": "Chinese Journal of Tissue Engineering Research",
        "citied_by": "2",
        "cover_date": "2023-12-18",
        "Abstract": "BACKGROUND: The repair of critical size bone defects has always been a challenge clinical problem for trauma orthopedic surgeons. With the development of clinical techniques and biomaterials, Ilizarov, Masquelet and bone tissue engineering techniques are gradually replacing the traditional autologous and allogeneic bone transplantation to become the research hotspots in the field of bone repair. Among them, bone tissue engineering scaffolds have the greatest potential for development. But a lot of basic research is necessary before the formal clinical application of bone tissue engineering scaffolds, and animal experiments are the most important. Therefore, it is very important to select an appropriate animal model of critical bone defects for testing the osteogenic efficacy of bone tissue engineering scaffolds. OBJECTIVE: To systematically summarize the advantages and disadvantages of different types of animal models of critical bone defects and to evaluate the osteogenic efficacy of various types of bone tissue engineering scaffolds in the animal models of critical bone defects. METHODS: CNKI, WanFang, Web of Science, Cochrane Library, and PubMed were searched for relevant literature. Search terms included “bone defects, animal models, bone tissue engineering, scaffolds, bone repair, bone regeneration” in Chinese and English. A total of 62 articles addressing the animal models of critical bone defects and their application to evaluate the osteogenic efficacy of bone tissue engineering scaffolds were included for further review. RESULTS AND CONCLUSION: The specific definition of critical bone defects is still unclear and there is no consensus on how to establish critical defects in various animal models of bone defects. By searching the published articles about the establishment of critical bone defect animal models in mice, rats, rabbits, pigs, dogs and sheep, we found that domestic and foreign scholars basically followed the principle that the size of the bone defect that could be not self-healing during the experimental period is selected when establishing the critical bone defect model, but there were differences in the specific values. In general, rat skull, femur and rabbit femoral condyles are the more suitable sites for critical bone defect models, which are suitable for large-scale modeling because of their wide sources, low requirement of experimental environment, easy breeding, low modeling cost, and high operability. However, compared with large animals such as sheep and pigs, they have the disadvantages of small bones and the composition of bone tissue is different from that of human, which makes it difficult to fully simulate the human bone healing process. After the biocompatibility and osteogenic activity of the bone tissue engineering scaffolds are evaluated by cytological experiments, its osteogenic efficiency and biological safety in vivo can be confirmed with the help of the stable animal model of critical bone defects. The critical bone defect models of rat skull and femur and rabbit femoral condyle are respectively suitable for the preliminary evaluation of intramembranous osteogenesis and endochondral osteogenesis, while the critical bone defect models of sheep and pig tibia are ideal animal models that are recommended for preclinical evaluation. Further research on the molecular mechanism of bone tissue engineering scaffold osteogenesis is expected to help develop artificial scaffold materials that can match the osteogenesis efficiency of autogenous bone, which is of great significance for overcoming the difficult clinical problem of segmental bone defects.",
        "DOI": "10.12307/2023.852",
        "paper_author": "Xiong W.",
        "affiliation_name": "Jiangxi University of Chinese Medicine",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60073596"
    },
    {
        "paper_title": "Construction of GDF15 fusion protein and its application in non-alcoholic steatohepatitis",
        "publication": "Chinese Journal of Hospital Pharmacy",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "OBJECTIVE To construct a GDF15 fusion protein and study its therapeutic effect on nonalcoholic steatohepatitis.METHODS The recombinant GDF15 protein was fused to an anti-HSA VHH by a (AP) 12 or (G4S) 5 linker through genetic engineering. The long-acting GDF15 fusion proteins were expressed in CHO cells with highly efficient secretion and purified by Ni-NTA agarose. After purification and characterization of the expression product using SDS-PAGE as well as HPLC methods, the biological activity of the fusion protein was examined by ELISA, Gator and luciferase reporter gene assay. The in vivo activity of the fusion protein was examined by establishing a mouse model of hepatitis. The body mass and liver mass of mice were weighed and recorded, the degree of liver steatosis and liver fibrosis was observed by HE and SR staining, and the serum AST, ALT and TG levels and liver TG level were measured by biochemical kits.RESULTS With the existence of the VHH binding to HSA, the GDF15 fusion protein retained the dimeric structure of GDF15 and the VHH-AP-GDF15 fusion protein was more efficiently expressed than the VHH-G4S-GDF15 fusion protein. Both fusion proteins were found to bind specifically to GFRAL and HSA, and then activate the downstream pathway by binding to the receptor GFRAL and the co-protein RET. The results of in vivo experiments showed that VHH-AP-GDF15 fusion protein significantly reduced the elevation of ALT, AST and TG in NASH and significantly improved the pathology of NASH and its fibrosis.CONCLUSION GDF15 fusion protein can retain the biological activity of GDF15 and reduce liver injury in NASH mice by reducing serum ALT and TG levels and liver TG level, suggesting a good application prospect.",
        "DOI": "10.13286/j.1001-5213.2023.23.10",
        "paper_author": "Wang Y.",
        "affiliation_name": "Ocean University of China",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60022422"
    },
    {
        "paper_title": "Wastewater treatment by microalgae-based processes",
        "publication": "Algal Systems for Resource Recovery from Waste and Wastewater",
        "citied_by": "3",
        "cover_date": "2023-12-15",
        "Abstract": "This chapter summarizes the status, major challenges and potential contribution of microalgae-related wastewater treatment processes. Although the use of microalgae for wastewater treatment was proposed in the last century, technology was not sufficiently efficient and robust to be applied at a commercial scale. Only recent advances in the knowledge of biological systems, the engineering of reactors and the harvesting and processing of the produced biomass allow the development of the first industrial demonstrations. Facilities of several hectares are already in operation demonstrating the feasibility of this technology. However, challenges remain for the further improvement and enlargement of these systems. They are related to (1) the improvement of knowledge and management of biological systems, (2) the development of adequate strategies for the allocation and implementation of largescale facilities, (3) the definition of optimal operation conditions including the development of non-assisted systems capable of operating under variable environmental conditions and (4) the development of adequate routes for the valorization of biomass. Much effort is being devoted to solving these challenges and thus making this technology reliable for industrial applications. Once it is achieved, the use of microalgae will be incorporated into the portfolio of available technologies for wastewater treatment. In this respect, no single technology is capable of solving all the scenarios related to wastewater treatment, but microalgae-related processes represent a semiintensive technology capable of contributing to efficiently treating wastewater while recovering nutrient-energywater scenarios related to temperate climates with no severe land restrictions. Moreover, the use of microalgae represents a change of paradigm in the field of wastewater treatment because by using this type of microorganisms it is possible to produce valuable biomass at a higher price than the wastewater treatment cost. The potential of microalgae-related wastewater treatment processes is thus highly relevant, and valuable to achieve the sustainable development goals defined by the United Nations.",
        "DOI": "10.2166/9781789063547_0077",
        "paper_author": "Acien F.G.",
        "affiliation_name": "Universidad de Almería",
        "affiliation_city": "Almeria",
        "affiliation_country": "Spain",
        "affiliation_id": "60016818"
    },
    {
        "paper_title": "Nanobiohybrids for pollution control and resource recovery",
        "publication": "Nanobiohybrids for Advanced Wastewater Treatment and Energy Recovery",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "The rapid growth of human population, industrialization, and urbanization has led to an increase in pollution and resource depletion. This has created a need for highly efficient pollution abatement technologies and resource recovery methods. While there are already pre-existing techniques for both pollution abatement and resource recovery, they are often costly, involving the use of harmful chemicals, generating unsafe by-products, and are slow. On the other hand, nanobiohybrids (NBHs) have emerged as promising approaches with substantial benefits over traditional approaches and have gained global recognition in recent decades. The integration of functional nanomaterials with living systems has given rise to this fascinating area of study, which lies at the intersection of materials engineering and biological science. These NBHs have the ability to remove pollutants and recover resources from different sources. This chapter provides an overview of the potential application of NBHs in different types of pollution control and resource recovery techniques from various sources. Different NBHs have so far been extensively studied and successfully applied in the removal of pollutants from water and wastewater but their application in soil and air as well as in resource recovery is still incipient. Thus, the limitations and challenges of using NBHs have been identified and discussed in this chapter as well. The findings in this chapter provide new insights and future prospects for further research and development for the wider applicability of NBHs.",
        "DOI": "10.2166/9781789063592_0193",
        "paper_author": "Kumari P.",
        "affiliation_name": "Indian Institute of Technology (Indian School of Mines), Dhanbad",
        "affiliation_city": "Dhanbad",
        "affiliation_country": "India",
        "affiliation_id": "60008898"
    },
    {
        "paper_title": "Nanobiohybrids: A promising approach for sensing diverse environmental water pollutants",
        "publication": "Nanobiohybrids for Advanced Wastewater Treatment and Energy Recovery",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "Water resource management has become the need of the hour with continuous depletion of good quality water. Sensors are important tools for monitoring the environmental water quality and quantifying the presence of various harmful pollutants (pesticides, heavy metals, and micro-organisms). Biosensors designed with functional biological molecules as recognition elements use a transducer, which converts a biological response into electrochemical, optical, gravimetric, magnetic, or thermal signals that can be easily quantified. The advent of nanotechnology has revolutionized material design and properties of sensing platforms. Materials in the nanoscale dimension possess interesting characteristic features such as high surface-area-to-volume ratio, high conductivity, functionalizability, shock-bearing ability, color tunability, photo-reactivity, and magnetization. Nanomaterial-integrated biomolecules with enhanced functional properties are termed as nanobiohybrids. The amalgamation of the tuneable characteristics of nanomaterials with functional biological molecules by means of functionalization and/or immobilization creates sophisticated transducers for enhancing the analytical performance of sensors. The resultant nanobiohybrid sensor systems are robust, exhibit relatively short response time with improved specificity and have higher sensitivity enabling detection of even trace volumes of analyte molecules. Recent advancements in research and engineering also promote the possibilities of device miniaturization, portability, and incessant monitoring of water quality. This chapter intends to discuss the impact of various toxic pollutants in water, the importance of nanomaterials in design of novel nanobiohybrids, the different nanomaterials relevant for use in design of sensors for environmental analysis, and finally the different transduction mechanisms that enable the detection and quantification of toxins in water.",
        "DOI": "10.2166/9781789063592_0147",
        "paper_author": "Angelene Hannah Jebarani D.",
        "affiliation_name": "National Institute of Technology (NIT) Andhra Pradesh",
        "affiliation_city": "Tadepalliduedem, Andhra Pradesh",
        "affiliation_country": "India",
        "affiliation_id": "131105346"
    },
    {
        "paper_title": "Bioinspired transistors",
        "publication": "Organic and Inorganic Materials Based Sensors",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "Increasing public interests in health and sustainability are now transforming into tremendous inputs to the worldwide activities on materials research, nanotechnologies, and biomedical engineering. This has even significantly diversified possible ways to fundamentally link the electronic systems with the biological world at large. This chapter is intended to capture such an emerging and important trend to build novel bioinspired transistors, which are still being investigated under several subcategories but are poised to become a truly universal platform providing wholly wearable digital healthcare as well as smart bidirectional human-machine interfaces.",
        "DOI": "10.1002/9783527834266.ch18",
        "paper_author": "Kim C.H.",
        "affiliation_name": "Gachon University",
        "affiliation_city": "Seongnam",
        "affiliation_country": "South Korea",
        "affiliation_id": "60199632"
    },
    {
        "paper_title": "Multiple Rounds of In Vivo Random Mutagenesis and Selection in Vibrio natriegens Result in Substantial Increases in REE Binding Capacity",
        "publication": "ACS Synthetic Biology",
        "citied_by": "3",
        "cover_date": "2023-12-15",
        "Abstract": "Rare earth elements (REE) are essential ingredients in many modern technologies, yet their purification remains either environmentally harmful or economically unviable. Adsorption, or biosorption, of REE onto bacterial cell membranes offers a sustainable alternative to traditional solvent extraction methods. But in order for biosorption-based REE purification to compete economically, the capacity and specificity of biosorption sites must be enhanced. Although there have been some recent advances in characterizing the genetics of REE-biosorption, the variety and complexity of bacterial membrane surface sites make targeted genetic engineering difficult. Here, we propose using multiple rounds of in vivo random mutagenesis induced by the MP6 plasmid combined with plate-throughput REE-biosorption screening to improve a microbe’s capacity and selectivity for biosorbing REE. We engineered a strain of Vibrio natriegens capable of biosorbing 210% more dysprosium compared to the wild-type and produced selectivity improvements of up to 50% between the lightest (lanthanum) and heaviest (lutetium) REE. We believe that mutations we observed in ABC transporters as well as a nonessential protein in the BAM outer membrane β-barrel protein insertion complex likely contribute to some─but almost certainly not all─of the biosorption changes we observed. Given the ease of finding significant biosorption mutants, these results highlight just how many genes likely contribute to biosorption as well as the power of random mutagenesis in identifying genes of interest and optimizing a biological system for a task.",
        "DOI": "10.1021/acssynbio.3c00484",
        "paper_author": "Medin S.",
        "affiliation_name": "Department of Biological and Environmental Engineering",
        "affiliation_city": "Ithaca",
        "affiliation_country": "United States",
        "affiliation_id": "60144812"
    },
    {
        "paper_title": "Protocol for biomodel engineering of unilevel to multilevel biological models using colored Petri nets",
        "publication": "STAR Protocols",
        "citied_by": "4",
        "cover_date": "2023-12-15",
        "Abstract": "Biological systems inherently span multiple levels, which can pose challenges in spatial representation for modelers. We present a protocol that utilizes colored Petri nets to construct and analyze biological models of systems, encompassing both unilevel and multilevel scenarios. We detail a modeling workflow exploiting the PetriNuts platform comprising a set of tools linked together via common file formats. We describe steps for modeling preparation, component-level modeling and analysis, followed by system-level modeling and analysis, and model use.",
        "DOI": "10.1016/j.xpro.2023.102651",
        "paper_author": "Liu F.",
        "affiliation_name": "South China University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60024542"
    },
    {
        "paper_title": "Synthetic Biology Toolbox for Nitrogen-Fixing Soil Microbes",
        "publication": "ACS Synthetic Biology",
        "citied_by": "10",
        "cover_date": "2023-12-15",
        "Abstract": "The soil environment adjacent to plant roots, termed the rhizosphere, is home to a wide variety of microorganisms that can significantly affect the physiology of nearby plants. Microbes in the rhizosphere can provide nutrients, secrete signaling compounds, and inhibit pathogens. These processes could be manipulated with synthetic biology to enhance the agricultural performance of crops grown for food, energy, or environmental remediation, if methods can be implemented in these nonmodel microbes. A common first step for domesticating nonmodel organisms is the development of a set of genetic engineering tools, termed a synthetic biology toolbox. A toolbox comprises transformation protocols, replicating vectors, genome engineering (e.g., CRISPR/Cas9), constitutive and inducible promoter systems, and other gene expression control elements. This work validated synthetic biology toolboxes in three nitrogen-fixing soil bacteria: Azotobacter vinelandii, Stutzerimonas stutzeri (Pseudomonas stutzeri), and a new isolate of Klebsiella variicola. All three organisms were amenable to transformation and reporter protein expression, with several functional inducible systems available for each organism. S. stutzeri and K. variicola showed more reliable plasmid-based expression, resulting in successful Cas9 recombineering to create scarless deletions and insertions. Using these tools, we generated mutants with inducible nitrogenase activity and introduced heterologous genes to produce resorcinol products with relevant biological activity in the rhizosphere.",
        "DOI": "10.1021/acssynbio.3c00414",
        "paper_author": "Venkataraman M.",
        "affiliation_name": "UW-Madison College of Engineering",
        "affiliation_city": "Madison",
        "affiliation_country": "United States",
        "affiliation_id": "60153131"
    },
    {
        "paper_title": "Integrating mechanical cues with engineered platforms to explore cardiopulmonary development and disease",
        "publication": "iScience",
        "citied_by": "4",
        "cover_date": "2023-12-15",
        "Abstract": "Mechanical forces provide critical biological signals to cells during healthy and aberrant organ development as well as during disease processes in adults. Within the cardiopulmonary system, mechanical forces, such as shear, compressive, and tensile forces, act across various length scales, and dysregulated forces are often a leading cause of disease initiation and progression such as in bronchopulmonary dysplasia and cardiomyopathies. Engineered in vitro models have supported studies of mechanical forces in a number of tissue and disease-specific contexts, thus enabling new mechanistic insights into cardiopulmonary development and disease. This review first provides fundamental examples where mechanical forces operate at multiple length scales to ensure precise lung and heart function. Next, we survey recent engineering platforms and tools that have provided new means to probe and modulate mechanical forces across in vitro and in vivo settings. Finally, the potential for interdisciplinary collaborations to inform novel therapeutic approaches for a number of cardiopulmonary diseases are discussed.",
        "DOI": "10.1016/j.isci.2023.108472",
        "paper_author": "Ahmed D.W.",
        "affiliation_name": "University of Michigan, Ann Arbor",
        "affiliation_city": "Ann Arbor",
        "affiliation_country": "United States",
        "affiliation_id": "60025778"
    },
    {
        "paper_title": "Incorporation of Aliphatic Proline Residues into Recombinantly Produced Insulin",
        "publication": "ACS Chemical Biology",
        "citied_by": "6",
        "cover_date": "2023-12-15",
        "Abstract": "Analogs of proline can be used to expand the chemical space about the residue while maintaining its uniquely restricted conformational space. Here, we demonstrate the incorporation of 4R-methylproline, 4S-methylproline, and 4-methyleneproline into recombinant insulin expressed in Escherichia coli. These modified proline residues, introduced at position B28, change the biophysical properties of insulin: Incorporation of 4-methyleneproline at B28 accelerates fibril formation, while 4-methylation speeds dissociation from the pharmaceutically formulated hexamer. This work expands the scope of proline analogs amenable to incorporation into recombinant proteins and demonstrates how noncanonical amino acid mutagenesis can be used to engineer the therapeutically relevant properties of protein drugs.",
        "DOI": "10.1021/acschembio.3c00561",
        "paper_author": "Breunig S.L.",
        "affiliation_name": "Division of Chemistry and Chemical Engineering",
        "affiliation_city": "Pasadena",
        "affiliation_country": "United States",
        "affiliation_id": "60143896"
    },
    {
        "paper_title": "Near-infrared electrochemiluminescence of defect-rich molybdenum disulfide quantum dots for sensitive bioanalysis",
        "publication": "Chemical Engineering Journal",
        "citied_by": "13",
        "cover_date": "2023-12-15",
        "Abstract": "Developing high-efficiency near-infrared (NIR) electrochemiluminescence (ECL) active transition metal dichalcogenides quantum dots (TMDs QDs) for spectroscopic multiplex analysis and biological imaging poses a significant challenge in versatile bioanalysis. In this work, we report a facile one-step hydrothermal method for the synthesis of defect-rich molybdenum disulfide quantum dots (MoS2 QDs). Because of the defect effect on the nanocrystalline surface, the MoS2 QDs exhibit enhanced fluorescence (quantum yield is 7.7%) in comparison with those from top-down physical approaches. Moreover, the defect-rich MoS2 QDs exhibit remarkable ECL performance using K2S2O8 as a coreactant, with a maximum emission at ∼810 nm. The ECL mechanisms of potential-dependent emission from MoS2 QDs were elucidated based on electrochemistry, photoluminescence, and spooling ECL spectroscopy. Leveraging the good biocompatibility and defect-induced ECL enhancement of MoS2 QDs, a sandwich ECL immunosensor was developed for carcinoembryonic antigen (CEA) detection. Without any signal amplification techniques, the proposed biosensor demonstrated a detection limit of 0.005 ng/mL CEA with a linear range from 0.005 ng/mL to 400 ng/mL, and a good selectivity and potential for real human serum analysis. The defect engineering of MoS2 QDs in this study provides guidance for regulating their optical properties and exploring new bioanalysis applications.",
        "DOI": "10.1016/j.cej.2023.147397",
        "paper_author": "Chen M.",
        "affiliation_name": "Tianjin University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60019533"
    },
    {
        "paper_title": "Benefits of Combining Molecular Biology and Controlled Human Infection Model Methodologies in Advancing Vaccine Development",
        "publication": "Journal of Molecular Biology",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "Infectious diseases continue to account for a significant portion of global deaths despite the use of vaccines for several centuries. Immunization programs around the world are a testament to the great success of multiple vaccines, yet there are still diseases without vaccines and others that require safer more effective ones. Addressing uncontrolled and emerging disease threats is restrained by the limitations and bottlenecks encountered with traditional vaccine development paradigms. Recent advances in modern molecular biology technologies have enhanced the interrogation of host pathogen interaction and deciphered complex pathways, thereby uncovering the myriad interplay of biological events that generate immune protection against foreign agents. Consequent to insights into the immune system, modern biology has been instrumental in the development and production of next generation 21st century vaccines. As these biological tools, commonly and collectively referred to as ‘omics, became readily available, there has been a renewed consideration of Controlled Human Infection Models (CHIMs). Successful and reproducible CHIMs can complement modern molecular biology for the study of infectious diseases and development of effective vaccines in a regulated process that mitigates risk, cost, and time, with capacity to discern immune correlates of protection.",
        "DOI": "10.1016/j.jmb.2023.168322",
        "paper_author": "ElSherif M.",
        "affiliation_name": "Dalhousie University",
        "affiliation_city": "Halifax",
        "affiliation_country": "Canada",
        "affiliation_id": "60015913"
    },
    {
        "paper_title": "Research progress on anti-corrosion technology of steel in seawater immersion zone",
        "publication": "Kang T'ieh/Iron and Steel",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "The seawater immersion area is a perennial seawater cover area below the low tide line above the seabed soil. The average NaCl mass percent of seawater is about 3.5%, which is a natural and highly corrosive medium. Many Marine engineering and equipment are damaged due to the corrosion of seawater, which seriously affects the service life of Marine engineering and equipment. Corrosion prevention technology of Marine engineering steel has been widely concerned by corrosion workers. The corrosion mechanism and influencing factors of steel corrosion in seawater immersion area is analyzed, and five technologies, including coating protection technology, Marine biological antifouling technology, sacrificial anode cathodic protection technology, impressed current cathodic protection technology and selection of seawater corrosion-resistant steel is summarized, which are commonly used in seawater immersion area. The innovative research results of various anti-corrosion technologies are described, including the use of synthetic materials, nanofillers and new coating protection technology of super-hydrophobic surface, the realization of bionic function and ultra-smooth surface Marine biological anti-fouling technology, sacrificial anode materials with high corrosion resistance, the selection of surface oxidation treatment and surface laser etching of seawater corrosion resistant steel. The advantages and disadvantages of 5 anti-corrosion technologies used in seawater immersion area are analyzed. It is pointed out that a single anti-corrosion technology is difficult to achieve long-term protection for steel materials in seawater immersion area. Finally, based on the current research status of various anticorrosion technologies, the future research direction of anti-corrosion technologies for steel in seawater immersion area is prospected. By integrating various anti-corrosion technologies, complementary advantages and implementing joint protection, the long-term anti-corrosion of steel in seawater immersion area is realized, and new anti-corrosion materials and new anti-corrosion technologies are developed. In order to provide ideas for the research and design of steel anti-corrosion technology in Marine environment.",
        "DOI": "10.13228/j.boyuan.issn0449-749x.20230426",
        "paper_author": "Hu J.",
        "affiliation_name": "Guangdong Ocean University",
        "affiliation_city": "Zhanjiang",
        "affiliation_country": "China",
        "affiliation_id": "60073738"
    },
    {
        "paper_title": "The effect of interface on the strength characteristics and fracture mechanism of the coral reef limestone-concrete combination specimen",
        "publication": "Construction and Building Materials",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "Biological and biochemical geneses bring complex structures to coral reef limestone (CRL), leading to pronounced anisotropy and heterogeneity. The stress field concentration induced by pore structure introduces a considerable dispersion in mechanical parameters and reduce the strength of CRL significantly. The CRL-C specimens were made using coral reef limestone to conduct uniaxial compression tests with loading rate of 0.002 mm/s, revealing the controlling mechanism of interface inclination angle for the strength of CRL-C specimens. The experiment results shows that the peak strength, peak strain, and modulus of elasticity of the combination all tend to lessen and then grow with increasing the interfacial inclination angle. The achieved results indicate that the tensile damage occurs in specimens with 0°, 15°, and 90° inclination angles, whereas the tension-shear stress damage takes place for specimens with 30° inclination angle. In turn, the shear damage occurs along the interface for specimens with 45°, 60°, and 75° inclination angles. The strength of combination specimens underwent the shear failure is noticeably smaller than that of the combination specimens damaged across the interface. Additionally, the cement mortar at the interface has a remarkable reinforcing effect on the interface strength, and the CRL-C interface possesses the highest cohesion and a lower internal friction angle compared to terrestrial rocks. Simultaneously, the parameters of the CRL-C specimens in the single-interface model are appropriately determined based on the interface strength. The inclination range of the combination specimen damaged along the interface is 35.58°<α < 85.83°. The predicted strength parameters based on the Coulomb model and the single-interface model provide a solid reference for the engineering design of CRL-C.",
        "DOI": "10.1016/j.conbuildmat.2023.133749",
        "paper_author": "Wu K.",
        "affiliation_name": "Wuhan Institute of Rock and Soil Mechanics Chinese Academy of Sciences",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60001666"
    },
    {
        "paper_title": "Hypoxic Preconditional Engineering Small Extracellular Vesicles Promoted Intervertebral Disc Regeneration by Activating Mir-7-5p/NF-Κb/Cxcl2 Axis",
        "publication": "Advanced Science",
        "citied_by": "8",
        "cover_date": "2023-12-15",
        "Abstract": "Chronic low back pain (LBP) caused by intervertebral disc (IVD) degradation is a serious socioeconomic burden that can cause severe disabilities. Addressing the underlying pathogenic mechanisms of IVD degeneration may inspire novel therapeutic strategy for LBP. Herein, hypoxic preconditioning improves both the biological function of MSCs in hostile microenvironments and enhances the production of small extracellular vesicles (sEVs) with desirable therapeutic functions. In vitro results reveal that hypoxic preconditional engineering sEVs (HP-sEVs) alleviate the inflammatory microenvironments of IVD degradation, enhance the proliferation of nucleus pulposus (NP) cells, and promote proteoglycan synthesis and collagen formation. Transcriptomic sequencing reveales the excellent therapeutic effects of HP-sEVs in promoting extracellular matrix regeneration through the delivery of microRNA(miR)-7-5p, which further suppresses p65 production and thus the inhibition of Cxcl2 production. Moreover, in vivo results further confirm the robust therapeutic role of HP-sEVs in promoting IVD regeneration through the same mechanism mediated by miR-7-5p delivery. In conclusion, this study provides a novel therapeutic strategy for treating IVD degradation and is thus valuable for understanding the mechanism-of-action of HP-sEVs in IVD regeneration associated with chronic lower back pain.",
        "DOI": "10.1002/advs.202304722",
        "paper_author": "Hu H.",
        "affiliation_name": "Tongji Hospital Affiliated To Tongji University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60121919"
    },
    {
        "paper_title": "Integration of biotechnological approaches for the production of phenylethanoids and phenylpropanoids in in vitro cultures of Rhodiola sp. a comprehensive review",
        "publication": "Industrial Crops and Products",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "Rhodiola L. is an herbaceous medicinal plant in the Crassulaceae family. Its raw extract, leaves, and roots have been used widely in traditional folk medicine in Asia and Europe. Salidroside, rosin, rosavin, and rosarin are commercially important specialized metabolites with a variety of biological potential such as adaptogenic, neuroprotection, immunomodulation, anti-inflammatory, antidepressant activity, and so on. Previous research has shown that Rhodiola sp. is extremely beneficial in asthenic conditions such as poor work performance, sleep complications, irritability, headaches, poor appetite, hypertension, and fatigue. Rhodiola sp. preparations have traditionally been used to treat conditions such as cerebral ischemia, neurodegenerative diseases, hypoxia, diabetes, and cancer. The key compounds responsible for these activities are thought to be phenylethanoids (salidroside, tyrosol) which are associated with other important metabolites such as phenylpropanoids (rosin, rosavin, and rosarin). Salidroside, rosin, rosarin, and rosavin is the most studied and potential metabolite in Rhodiola sp. The purpose of this review is to emphasize recent developments in phenylethanoids and phenylpropanoids accumulation by utilizing numerous biotechnological interventions. Various methods for enhancing salidroside and rosavins (rosin, rosavin, and rosarin) levels in plant cells are discussed, including cell line selection, culture condition optimization, precursor feeding, elicitation, biotransformation, and metabolic engineering. Additionally, in order to accomplish the commercial demand, the requirements for consistent and sustainable production systems, together with future prospects, are also discussed.",
        "DOI": "10.1016/j.indcrop.2023.117625",
        "paper_author": "Rattan S.",
        "affiliation_name": "Institute of Himalayan Bioresource Technology India",
        "affiliation_city": "Palampur",
        "affiliation_country": "India",
        "affiliation_id": "60005412"
    },
    {
        "paper_title": "Biological treatment processes for saline organic wastewater and related inhibition mechanisms and facilitation techniques: A comprehensive review",
        "publication": "Environmental Research",
        "citied_by": "30",
        "cover_date": "2023-12-15",
        "Abstract": "Owing to its profound pollution-inducing properties and resistance to biodegradation, saline organic wastewater (SOW) has unavoidably emerged as a predominant focal point within the wastewater treatment domain. Substantial quantities of SOW are discharged by diverse industries encompassing food processing, pharmaceuticals, leather manufacturing, petrochemicals, and textiles. Within this review, the inhibitory repercussions of elevated salinity upon biological water treatment systems are subject to methodical scrutiny spanning from sludge characteristics, microbial consortia to the physiological functionality of microorganisms have been investigated. This exposition elucidates the application of both anaerobic and aerobic biological technologies for SOW treatment, which noting that conventional bioreactors can effectually treat SOW through microbial adaptation, and elaborating that cultivation of salt-tolerant bacteria and the design of advanced bioreactors represents a promising avenue for SOW treatment. Furthermore, the mechanisms underpinning microbial acclimatization to hypersaline milieus and the methodologies aimed at amplifying the efficacy of biological SOW treatment are delved into, which point out that microorganism exhibit salt tolerance via extracellular polymeric substance accumulation or by facilitating the influx of osmolarity-regulating agents into the bacterial matrix. Finally, the projections for future inquiry are proffered, encompassing the proliferation and deployment of high salt-tolerant strains, as well as the development of techniques enhancing the salt tolerance of microflora engaged in wastewater treatment.",
        "DOI": "10.1016/j.envres.2023.117404",
        "paper_author": "Song Q.",
        "affiliation_name": "National Engineering Research Center for Urban Pollution Control",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60129235"
    },
    {
        "paper_title": "A comprehensive investigation of the effect of Ag on the structure and antibacterial efficacy of Li-substituted 58S and 68S bioactive glasses",
        "publication": "Journal of Non-Crystalline Solids",
        "citied_by": "3",
        "cover_date": "2023-12-15",
        "Abstract": "In this study, Ag ions in the systems of 60SiO2-(31-x)CaO-4P2O5–5Li2O-(x)Ag2O and 70SiO2-(21-x)CaO-4P2O5–5Li2O-(x)Ag2O (where x = 0, 5, 10 mol %) were substituted for Ca to improve their biological properties. The process of in vitro formation of hydroxyapatite (HA) was investigated through Fourier Transform Infrared Spectroscopy (FTIR), X-ray Diffraction (XRD), Inductively Coupled Plasma Atomic Emission Spectroscopy (ICP-AES), and its morphology was observed by scanning electron microscope (SEM) and transmission electron microscopy (TEM). According to the results, doping 5 mol % Ag in the both 58S and 68S systems increased the bioactivity. Based on ICP-AES results, the dissolution rates of specimens were inversely proportional to their oxygen density. Furthermore, the viability, the production of ALP enzyme, and bactericidal activity against MRSA bacteria were improved and resulted in significant statistical differences, while bioactive glass with the chemical composition of 60SiO2–26CaO-4P2O5–5Li2O-5Ag2O (58LA05) had the best performance.",
        "DOI": "10.1016/j.jnoncrysol.2023.122622",
        "paper_author": "Rahmani M.",
        "affiliation_name": "University of Tehran",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60022927"
    },
    {
        "paper_title": "Computational Physics of Insect Flight - Aerial Locomotion and Navigation",
        "publication": "Journal of the Physical Society of Japan",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "The aerodynamics of insect flight is a subject of considerable scientific and engineering interest. Insects flap their wings and generate aerodynamic forces for flight via unsteady aerodynamics. Airflow and sounds produced by flapping wings simultaneously affect insect navigation through olfaction and audition, which are also of biological and engineering importance. Computational approaches have played a complementary but important role in understanding insect flight mechanisms, together with insect measurements and robotic approaches. This study highlights the contribution of computational physics to the study of insect flight and navigation using olfaction and audition, with the aim of familiarising the physics community, particularly students and young researchers, with the attractiveness of diverse insect flights and future challenges in the field.",
        "DOI": "10.7566/JPSJ.92.121003",
        "paper_author": "Nakata T.",
        "affiliation_name": "Chiba University",
        "affiliation_city": "Chiba",
        "affiliation_country": "Japan",
        "affiliation_id": "60002787"
    },
    {
        "paper_title": "Magnetic iron-based nanoparticles biogeochemical behavior in soil-plant system: A critical review",
        "publication": "Science of the Total Environment",
        "citied_by": "8",
        "cover_date": "2023-12-15",
        "Abstract": "Increasing attention is being given to magnetic iron-based nanoparticles (MINPs) because of their potential environmental benefits. Owing to the earth abundance and high utilization of MINPs, as well as the significant functions of Fe in sustainable agriculture and environmental remediation, an understanding of the environmental fate of MINPs is indispensable. However, there are still knowledge gaps regarding the largely unknown environmental behaviors and fate of MINPs in soil–plant system. Thus, this review summarizes recent literature on the biogeochemical behavior (uptake, transportation, and transformation) of MINPs in soil and plants. The different possible uptake (e.g., foliar and root adsorption) and translocation (e.g., xylem, phloem, symplastic/apoplastic pathway, and endocytosis) pathways are discussed. Furthermore, drivers of MINPs uptake and transportation (e.g., soil characteristics, fertilizer treatments, copresence of inorganic and organic anions, meteorological conditions, and cell wall pores) in both soil and plant environments are summarized. This review also details the physical, chemical, and biological transformations of MINPs in soil–plant system. More importantly, a metadata analysis from the existing literature was employed to investigate the distinction between MINPs and other engineering nanoparticles biogeochemical behavior. In the future, more attention should be given to understanding the behavior of MINPs in soil–plant system and improving the capabilities of predictive models. This review thus highlights the main knowledge gaps regarding MINPs behavior and fate to provide guidance for their safe application in agrochemicals, crop production, and soil health.",
        "DOI": "10.1016/j.scitotenv.2023.166643",
        "paper_author": "Zheng T.",
        "affiliation_name": "Nankai University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60018038"
    },
    {
        "paper_title": "Elliptic perfect vortex beam generation with selective modes based on single layer metasurface in broadband near-infrared range",
        "publication": "Optics Communications",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "Asymmetric and multiple modes of perfect vortex beams (PVBs) are of great significance in the manipulation of nanoscale biological cells. As a powerful artificial subwavelength platform, miscellaneous metasurfaces have been reported to generate PVBs. However, these reported PVBs are always symmetric, that is, only one simple annular shape in the observation plane, which cannot provide multiple modes. Here, using multi-coordinate transformation techniques (MCTT), we established the phase profile of mode-selective elliptic perfect vortex beams (MS-EPVBs) in elliptical coordinate and generated multiple modes of EPVBs with arbitrary eccentricity and orientation in broadband near-infrared range based on all-dielectric metasurface, greatly enriching the modes of PVBs. Composed of optimized half-waveplate-like silicon cylinders, the designed metasurface can freely transform the incident light into EPVBs with arbitrary eccentricity and orientation with high efficiency. Furthermore, during the mode transformation, the properties of the “perfect” and broadband were preserved. This work will find potential applications in advanced fields like biophotonics and genetic engineering.",
        "DOI": "10.1016/j.optcom.2023.129929",
        "paper_author": "Tian S.",
        "affiliation_name": "Chang Zhou Institute of Technology",
        "affiliation_city": "Changzhou",
        "affiliation_country": "China",
        "affiliation_id": "60104075"
    },
    {
        "paper_title": "River connectivity determines microbial assembly processes and leads to alternative stable states in river networks",
        "publication": "Science of the Total Environment",
        "citied_by": "9",
        "cover_date": "2023-12-15",
        "Abstract": "River network is a common form of lotic ecosystems. Variances in river connection modes would form networks with significantly different structures, and further affect aquatic organisms. Microbial communities are vital organisms of river networks, they participate in numerous biogeochemical processes. Identifying associations between microbial community and structural features of river networks are essential for maintaining environmental quality. Thus, dendritic (DRN) and trellised river networks (TRN) were studied by combining molecular biological tools, ecological theory and hydrodynamic calculation. Results illustrated that river connectivity, a vital structural feature exhibiting mass transport ability of river network, increased relative importance of homogeneous selection processes in microbial assembly, which would further shape community with alternative stable states. Between the two researched river networks, DRN possessed higher connectivity, which made homogeneous selection as the driving force in community assembly. The microbial communities in DRN were consisted of species occupying similar ecological niche, and exhibited two alternative stable states, which can decrease influences of environmental disturbance on community composition. On the contrary, lower connectivity of TRN decreased proportions of homogeneous selection in community assembly, which further led to species occupying varied ecological niche. The microbial community exhibited only one stable state, and environmental disturbance would cause loss of ecological niche and significantly alter community composition. This study could provide useful information for the optimization of river connection engineering.",
        "DOI": "10.1016/j.scitotenv.2023.166797",
        "paper_author": "Hui C.",
        "affiliation_name": "Hohai University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60010851"
    },
    {
        "paper_title": "Macroscale Collagen-Actomyosin Hybrid Actuator Built from Bioderived Materials",
        "publication": "Advanced Functional Materials",
        "citied_by": "3",
        "cover_date": "2023-12-15",
        "Abstract": "Biological muscles mainly consist of motor proteins that play essential roles and have a hierarchical structure covered with collagen that can transmit the tension to bones via tendons. The artificial reconstruction of motor proteins is highly expected from the viewpoint of engineering and biology. Although artificial muscles have been developed via synthetic and biological molecular motors, there is a considerable gap between the components of artificial and biological muscles, resulting in a significant obstacle to further scale-up and force transfer through macroscale structures. To overcome these obstacles via bioderived biomolecules, this study proposes a collagen-actomyosin hybrid soft actuator inspired by the structure of biological muscles. Collagen gel entrapping actomyosin can play roles in maintaining the actuator's shape and transmitting the tensile force. The generated forces reach the micro-newton range, enabling the actuation of millimeter-scale mechanical components. These properties may be helpful for the fabrication of soft robotic systems with advanced functionalities.",
        "DOI": "10.1002/adfm.202307766",
        "paper_author": "Yoshida K.",
        "affiliation_name": "Keio University",
        "affiliation_city": "Tokyo",
        "affiliation_country": "Japan",
        "affiliation_id": "60025997"
    },
    {
        "paper_title": "Performance exploration of polyvinyl alcohol/modified glass fiber composites based on hydrogen bonding interactions",
        "publication": "Journal of Molecular Structure",
        "citied_by": "4",
        "cover_date": "2023-12-15",
        "Abstract": "Mechanically robust composites prepared via interfacial hydrogen bonding interactions are crucial in biological tissue engineering and protective materials. However, few reports have studied the effect of different hydrogen bonding interactions on the properties of composites. To remedy these limitations, polyvinyl alcohol/modified glass fiber composites were obtained based on different hydrogen bonding interactions. Glass fibers were modified via introducing with amino, carboxyl and hydroxyl groups. The modified glass fiber was chosen as the reinforcement, which introduced into polyvinyl alcohol (PVA) to achieve interface modification and different hydrogen bonding interactions. The results showed that PVA molecular chains, crystals and modified glass fibers arranged in a directional and orderly manner inside the composites. The strength and toughness of PVA/modified glass fiber composites were effectively improved due to the combination of the orientation and hydrogen bonding interactions. Especially, the carboxylated glass fiber possesses more active groups, which can provide rich interaction sites for hydrogen bonding interactions, indicating better comprehensive properties of the PVA/modified glass fiber composites. This work provides valuable research foundation for further investigating the mechanism of hydrogen bonding interactions on the mechanical properties of composites.",
        "DOI": "10.1016/j.molstruc.2023.136305",
        "paper_author": "Zuo X.",
        "affiliation_name": "Southeast University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60005244"
    },
    {
        "paper_title": "Synthetic-Cell-Based Multi-Compartmentalized Hierarchical Systems",
        "publication": "Small Methods",
        "citied_by": "16",
        "cover_date": "2023-12-15",
        "Abstract": "In the extant lifeforms, the self-sustaining behaviors refer to various well-organized biochemical reactions in spatial confinement, which rely on compartmentalization to integrate and coordinate the molecularly crowded intracellular environment and complicated reaction networks in living/synthetic cells. Therefore, the biological phenomenon of compartmentalization has become an essential theme in the field of synthetic cell engineering. Recent progress in the state-of-the-art of synthetic cells has indicated that multi-compartmentalized synthetic cells should be developed to obtain more advanced structures and functions. Herein, two ways of developing multi-compartmentalized hierarchical systems, namely interior compartmentalization of synthetic cells (organelles) and integration of synthetic cell communities (synthetic tissues), are summarized. Examples are provided for different construction strategies employed in the above-mentioned engineering ways, including spontaneous compartmentalization in vesicles, host–guest nesting, phase separation mediated multiphase, adhesion-mediated assembly, programmed arrays, and 3D printing. Apart from exhibiting advanced structures and functions, synthetic cells are also applied as biomimetic materials. Finally, key challenges and future directions regarding the development of multi-compartmentalized hierarchical systems are summarized; these are expected to lay the foundation for the creation of a “living” synthetic cell as well as provide a larger platform for developing new biomimetic materials in the future.",
        "DOI": "10.1002/smtd.202201712",
        "paper_author": "Wang X.",
        "affiliation_name": "Harbin Institute of Technology",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "60019616"
    },
    {
        "paper_title": "Earth Systems Science (ESS) and systems ecology",
        "publication": "Biogeochemistry and the Environment",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "Earth systems science (ESS) is a science that is strongly linked to biogeochemistry, through its study of the earth systems (lithosphere, hydrosphere, biosphere, and atmosphere) through which the chemical elements and compounds studied by biogeochemistry flow. The two disciplines developed largely separately, but this chapter explores common ground, in terms of origins, developments, and future possibilities. A basic definition of ESS is that it is the application of systems science to the earth's surface. Systems science and its subsets, systems ecology and earth systems science, provide methodologies that can document, describe, analyze, and understand spatial and networked ecological relations, within the larger, complex disciplines of the environmental sciences. ESS is a recent development, within physical geography and the earth and environmental sciences, with the objective of studying the integrated relations, physical, energy, and chemical, to link the contributions of the increasingly polarized and segmented earth and environmental sciences. This science is concerned with, but not limited to, the relations between the global to local contexts of the biosphere, hydrosphere, lithosphere, and atmosphere. The developmental trend of ESS is particularly relevant to the field of biogeochemistry, which itself is also a multidisciplinary field seeking to override the generally artificial disciplinary boundaries between biological, chemical, and physical sciences to derive answers for complex environmental questions. This chapter examines the basics of ESS and then looks at the approach and methodologies of systems ecology and the links to biogeochemistry, using recent literature sources on the definition, application, and status of ESS and related sciences. It is argued that ESS must battle on two fronts: the question for broader knowledge to solve the increasingly complex, multidisciplinary environmental issues, and the requirement for deep specialization to understand the issues in the first place, some at microscopic level. Institutional barriers also creep in, as the topics of ESS may be scattered across departments, sometimes different from those of biogeochemistry. The linking between ESS and biogeochemistry must also be measured against the changes in the environmental focus of the basic sciences (chemistry, physics, mathematics, biology) and the fortunes of the environmentally applied progeny of these disciplines (geochemistry, environmental chemistry, biochemical and chemical engineering, biochemistry, geophysics, environmental and atmospheric physics, civil, geological, and environmental engineering, oceanography, statistics, etc.). The understanding of these complex issues contributes to the development of biogeochemical studies.",
        "DOI": "10.1007/978-3-031-47017-2_3",
        "paper_author": "Campbell M.O.N.",
        "affiliation_name": "Simon Fraser University",
        "affiliation_city": "Burnaby",
        "affiliation_country": "Canada",
        "affiliation_id": "60018491"
    },
    {
        "paper_title": "Fibroin reinforced, strontium-doped calcium phosphate silicate cements for bone tissue engineering applications",
        "publication": "Journal of Materials Research",
        "citied_by": "1",
        "cover_date": "2023-12-14",
        "Abstract": "Calcium phosphate silicate cements (CPSCs) have been developed to overcome problems like high acidity due to presence of brushite and high temperatures evolving as polymethyl methacrylate (PMMA) cements cure at surgery site. However, CPSCs with good handling and injectability have not been successfully produced. Here, we aimed to develop a biocompatible and osteoconductive bone cement composed of strontium (Sr)-doped tri-calcium silicates (C3S), monocalcium monophosphate and silk fibroin (SF). C3S powders were mixed with monocalcium monophosphate, and SF to obtain injectable CPSC. Physical, mechanical and biological characterization studies revealed that SF presence minimized alkalinity, increased rate of weight loss, porosity and elasticity but decreased maximum yield strength. The in vitro cell culture studies showed that all CPSCs were biocompatible. CPSC-Sr2-2% SF group performed the best in terms of osteogenic differentiation. These results suggest that CPSCs hold promise as bone cement however, in vivo studies should be conducted. Graphical abstract: [Figure not available: see fulltext.]",
        "DOI": "10.1557/s43578-023-01211-6",
        "paper_author": "Işık G.",
        "affiliation_name": "Middle East Technical University (METU)",
        "affiliation_city": "Ankara",
        "affiliation_country": "Turkey",
        "affiliation_id": "60004305"
    },
    {
        "paper_title": "In vitro assessment of decellularized matrix for the cardiac tissue engineering application",
        "publication": "Journal of Materials Research",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "The study focuses on analyzing the biological interaction of the serous and fibrous sides of the decellularized caprine pericardium (DCP) and the valvular interstitial cells (VIC). The in vitro calcification potential of DCP was investigated by simulating the calcification process by incubating the VIC with a calcium and phosphate induction medium. Histological examination shows effective removal of cells with intact extracellular matrix histoarchitecture. The decellularizing chemicals, sodium dodecyl sulfate and Triton X-100, are toxic to VIC. Incorporating washing stages into the decellularization procedure makes DCP non-toxic and biocompatible. Both the serous and fibrous sides of DCP support cell adhesion with higher cell infiltration from the fibrous side. The atomic absorption spectroscopy and alizarin red staining confirm the combination of calcium and phosphate has a critical role in the accelerated calcification of DCP. Thus, xenogenic DCP scaffolds may improve the applicability of cardiac tissue engineering applications. Graphical abstract: [Figure not available: see fulltext.]",
        "DOI": "10.1557/s43578-023-01214-3",
        "paper_author": "Deepak T.",
        "affiliation_name": "National Institute of Technology Rourkela",
        "affiliation_city": "Rourkela",
        "affiliation_country": "India",
        "affiliation_id": "60000934"
    },
    {
        "paper_title": "Non-canonical amino acid incorporation into AAV5 capsid enhances lung transduction in mice",
        "publication": "Molecular Therapy Methods and Clinical Development",
        "citied_by": "6",
        "cover_date": "2023-12-14",
        "Abstract": "Gene therapy using recombinant adeno-associated virus (rAAV) relies on safe, efficient, and precise in vivo gene delivery that is largely dependent on the AAV capsid. The proteinaceous capsid is highly amenable to engineering using a variety of approaches, and most resulting capsids carry substitutions or insertions comprised of natural amino acids. Here, we incorporated a non-canonical amino acid (ncAA), Nε-2-azideoethyloxycarbonyl-L-lysine (also known as NAEK), into the AAV5 capsid using genetic code expansion, and serendipitously found that several NAEK-AAV5 vectors transduced various cell lines more efficiently than the parental rAAV5. Furthermore, one NAEK-AAV5 vector showed lung-specific transduction enhancement following systemic or intranasal delivery in mice. Structural modeling suggests that the long side chain of NAEK may impact on the 3-fold protrusion on the capsid surface that plays a key role in tropism, thereby modulating vector transduction. Recent advances in genetic code expansion have generated synthetic proteins carrying an increasing number of ncAAs that possess diverse biological properties. Our study suggests that ncAA incorporation into the AAV capsid may confer novel vector properties, opening a new and complementary avenue to gene therapy vector discovery.",
        "DOI": "10.1016/j.omtm.2023.101129",
        "paper_author": "Chang H.",
        "affiliation_name": "University of Massachusetts Chan Medical School",
        "affiliation_city": "Worcester",
        "affiliation_country": "United States",
        "affiliation_id": "60000986"
    },
    {
        "paper_title": "Metabolites of microalgae",
        "publication": "Algal Biotechnology",
        "citied_by": "1",
        "cover_date": "2023-12-13",
        "Abstract": "Microalgae are primitive creatures and one of the oldest biological forms on the Earth. They existed in oceans at the beginning of the Earth's formation about 3 billion years ago, and can synthesize large amounts of lipids, proteins and carbohydrates by utilizing sunlight, carbon sources, water and inorganic salts under natural conditions. They can also grow heterotrophically in the absence of light. They have advantages of fast growth, wide variety, sustainable use of solar energy to produce biomass, high efficiency and low energy consumption, can adapt to extreme environment and simple cultivations, and so on. These characteristics determine that microalgae have important development value in the fields of medicine, food, aquaculture, chemical industry, energy, environmental protection, agriculture and aerospace. This chapter briefly introduces microalgae as chassis to produce natural metabolites and their applications and discusses the prospect of using metabolic engineering to transform microalgae to produce valuable secondary metabolites.",
        "DOI": "10.1079/9781800621954.0007",
        "paper_author": "Chen G.",
        "affiliation_name": "Shandong Academy of Agricultural Sciences",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60073566"
    },
    {
        "paper_title": "Algal biotechnology",
        "publication": "Algal Biotechnology",
        "citied_by": "0",
        "cover_date": "2023-12-13",
        "Abstract": "Algae are sunlight-driven cell factories, and can efficiently absorb CO2 and convert light energy to chemical energy such as lipid, starch and other carbohydrates and release O2. Algal feedstock is a promising resource for bioproduct production, given its high photosynthetic efficiency for producing biomass compared to conventional crops. Microalgae can be used for flue-gas and wastewater bioremediation. This book highlights recent breakthroughs in the multidisciplinary areas of algal biotechnology and the chapters feature recent developments from cyanobacteria to eukaryotic algae, from theoretical biology to applied biology. It also includes the latest advancements in algal-based synthetic biology, including metabolic engineering, artificial biological system construction and green chemicals production. With contributions by leading authorities in algal biotechnology research, it is a valuable resource for graduate students and researchers in the field, and those involved in the study of photosynthesis and green-cell factories.",
        "DOI": "10.1079/9781800621954.0000",
        "paper_author": "Wang Q.",
        "affiliation_name": "Henan University",
        "affiliation_city": "Kaifeng",
        "affiliation_country": "China",
        "affiliation_id": "60003146"
    },
    {
        "paper_title": "Wirelessly Actuated Ciliary Airway Stent for Excessive Mucus Transportation",
        "publication": "Advanced Materials Technologies",
        "citied_by": "7",
        "cover_date": "2023-12-13",
        "Abstract": "Small-scale cilia-like devices that can manipulate fluids in narrow spaces have great potential in microfluidics, biomechanics, biomedical engineering, and other applications. However, prior studies mostly focus on artificial cilia for pumping fluids in lab-on-a-chip microfluidic applications. The design and control of artificial cilia for transporting viscous mucus in confined and tubular structures remain challenging and medical devices such as airway stents with ciliary function are still missing. Herein, a method is reported that enables integrating artificial cilia arrays on 3D curved surfaces and an airway ciliary stent is presented for excessive mucus transportation. The method allows encoding bioinspired non-reciprocal motion and metachronal waves for efficient fluid pumping in tubular structures. The method also introduces a lubricant hydrogel coating layer on artificial cilia inspired by the periciliary layer in airway cilia, which further enhances viscous fluid transportation. It is demonstrated that a novel ciliary airway stent can transport viscous porcine mucus in a lung phantom even faster than the respiratory cilia in a healthy human lung. The methods of designing, integrating, and controlling artificial cilia on 3D curved surfaces thus enable the unprecedented function of removing excessive mucus beyond traditional airway stents for treating various lung diseases in a minimally invasive manner.",
        "DOI": "10.1002/admt.202301003",
        "paper_author": "Wang Y.",
        "affiliation_name": "Vanderbilt University School of Engineering",
        "affiliation_city": "Nashville",
        "affiliation_country": "United States",
        "affiliation_id": "60010060"
    },
    {
        "paper_title": "3D Bioprinting of Diatom-Laden Living Materials for Water Quality Assessment",
        "publication": "Small",
        "citied_by": "8",
        "cover_date": "2023-12-13",
        "Abstract": "Diatoms have long been used as living biological indicators for the assessment of water quality in lakes and rivers worldwide. While this approach benefits from the great diversity of these unicellular algae, established protocols are time-consuming and require specialized equipment. Here, this work 3D prints diatom-laden hydrogels that can be used as a simple multiplex bio-indicator for water assessment. The hydrogel-based living materials are created with the help of a desktop extrusion-based printer using a suspension of diatoms, cellulose nanocrystals (CNC) and alginate as bio-ink constituents. Rheology and mechanical tests are employed to establish optimum bio-ink formulations, whereas cell culture experiments are utilized to evaluate the proliferation of the entrapped diatoms in the presence of selected water contaminants. Bioprinting of diatom-laden hydrogels is shown to be an enticing approach to generate living materials that can serve as low-cost bio-indicators for water quality assessment.",
        "DOI": "10.1002/smll.202300771",
        "paper_author": "Boons R.",
        "affiliation_name": "Empa - Swiss Federal Laboratories for Materials Science and Technology",
        "affiliation_city": "Dubendorf",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60020086"
    },
    {
        "paper_title": "Research Status of Dendrimer Micelles in Tumor Therapy for Drug Delivery",
        "publication": "Small",
        "citied_by": "31",
        "cover_date": "2023-12-13",
        "Abstract": "Dendrimers are a family of polymers with highly branched structure, well-defined composition, and extensive functional groups, which have attracted great attention in biomedical applications. Micelles formed by dendrimers are ideal nanocarriers for delivering anticancer agents due to the explicit study of their characteristics of particle size, charge, and biological properties such as toxicity, blood circulation time, biodistribution, and cellular internalization. Here, the classification, preparation, and structure of dendrimer micelles are reviewed, and the specific functional groups modified on the surface of dendrimers for tumor active targeting, stimuli-responsive drug release, reduced toxicity, and prolonged blood circulation time are discussed. In addition, their applications are summarized as various platforms for biomedical applications related to cancer therapy including drug delivery, gene transfection, nano-contrast for imaging, and combined therapy. Other applications such as tissue engineering and biosensor are also involved. Finally, the possible challenges and perspectives of dendrimer micelles for their further applications are discussed.",
        "DOI": "10.1002/smll.202304006",
        "paper_author": "Wang X.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434"
    },
    {
        "paper_title": "Fabrication of Thermoresponsive and Multimaterial Hydrogel Sheets by Spatially Controlled Aspiration and Interconnection of Microgel Building Blocks",
        "publication": "Advanced Materials Technologies",
        "citied_by": "0",
        "cover_date": "2023-12-13",
        "Abstract": "Polymer materials made from hierarchically assembled building blocks form a promising material class for engineering complex systems with integrated functionality for biological or electronic applications. Herein, this work utilizes an aspiration-based process involving a hole-bearing glass plate to align and interconnect acrylamide- and N-isopropylacrylamide-based microgels fabricated via emulsion formation in 3D-printed microfluidics. By tuning hole diameter and inter-hole distance as well as microgel deformability, mechanically stable, freestanding microgel constructs are obtained, which withstand shaking, ultrasonication, and swelling–shrinking cycles. By segmentally controlling aspiration at the hole-bearing glass plate, freestanding multimaterial sheets consisting of two different microgel species are obtained. The microgel assembly process is the first step toward fabricating hydrogel-based materials with spatially controlled functionality, which is an essential step toward system integration in polymer materials.",
        "DOI": "10.1002/admt.202300374",
        "paper_author": "Weigel N.",
        "affiliation_name": "Leibniz-Institut für Polymerforschung Dresden e.V.",
        "affiliation_city": "Dresden",
        "affiliation_country": "Germany",
        "affiliation_id": "60008583"
    },
    {
        "paper_title": "Isotopic (D/H) management of chemical and biological processes properties: applications in pharmaceutical engineering",
        "publication": "E3S Web of Conferences",
        "citied_by": "0",
        "cover_date": "2023-12-12",
        "Abstract": "The strategy of sustainable industrial development in accordance with \"green chemistry\" stimulates researchers to search for a \"lever\" that could provide control over the direction and speed of chemical and biological processes. Water, depleted in deuterium content, is a recognized safe (in contrast to D2O) dissolution medium according to the results of numerous clinical observations. Due to the lower strength of carbon-protium (C-H) chemical bonds compared to carbon-deuterium (C - D), the properties of deuterated compounds, such as the rate of reactions involving them, change. The aim of the work was to study the effect of varying the 12H content on controlling the chemical and biological properties of processes. The highest values of kinetic deuterium isotope effects (KEI), which demonstrated greater sensitivity to the difference in the nucleolar mass D/H in the dissolution medium, correspond to slightly soluble lipophilic molecules. We also found the dependence of the S.ambigua cell biosensor lifetime on the deuterium concentration in the dissolution medium according to the laws of Arrhenius kinetics. Thus, the developed approach based on the laser diffraction technique in controlling the rate of chemical and biological processes can be successfully applied at all stages of the production cycle in the chemical and pharmaceutical industry.",
        "DOI": "10.1051/e3sconf/202346201014",
        "paper_author": "Kazimova I.V.",
        "affiliation_name": "RUDN University",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60015024"
    },
    {
        "paper_title": "Silk Fibroin Improves the Biological Properties of Egg White-Based Bioink for the Bioprinting of Tissue Engineering Materials",
        "publication": "ACS Omega",
        "citied_by": "1",
        "cover_date": "2023-12-12",
        "Abstract": "Egg white (EW) is a common nutritious food with excellent heat gelation and biocompatibility, but its application in biomaterials is considerably limited. Silk fibroin (SF) is a protein-based fiber with both excellent mechanical properties and biocompatibility, and its application in biomaterials has attracted much attention. Here, the EW/SF composite scaffold was first synthesized with GMA-modified EW/SF composite bioink (G-EW/SF). When homogenized EW and SF were individually grafted with glycidyl methacrylate (GMA), the grafted EW (G-EW) and SF (G-SF) were mixed in different proportions and then added to I2959. The resulting G-EW/SF composite bioink could be bioprinted into various EW/SF composite scaffolds. Among them, the compressive modulus of EW/SF (50%) composite scaffolds incorporating 50% G-SF was significantly improved. It had a three-dimensional (3D) polypore structure with an average pore size of 61 μm and was mainly composed of β-sheet structures. Compared with the EW scaffold alone, the thermal decomposition temperature of the EW/SF scaffold was 10 °C higher, and the residual rate after 9 days of enzymatic hydrolysis had increased by about 18%. The scaffold prolonged the sustained release of insulin and promoted the adhesion, growth, and proliferation of the L-929 cells. Therefore, the EW/SF composite scaffolds with good cell proliferation ability and certain mechanical properties can be used in different applications including cells, drugs, and tissues. These results provide new prospects for the application of the EW protein to medical tissue engineering materials.",
        "DOI": "10.1021/acsomega.3c05810",
        "paper_author": "Wang H.Y.",
        "affiliation_name": "People's Hospital of Suzhou New District",
        "affiliation_city": "Suzhou",
        "affiliation_country": "China",
        "affiliation_id": "112923161"
    },
    {
        "paper_title": "Stimuli-Responsive Polymer-Based Nanosystems for Cancer Theranostics",
        "publication": "ACS Nano",
        "citied_by": "97",
        "cover_date": "2023-12-12",
        "Abstract": "Stimuli-responsive polymers can respond to internal stimuli, such as reactive oxygen species (ROS), glutathione (GSH), and pH, biological stimuli, such as enzymes, and external stimuli, such as lasers and ultrasound, etc., by changing their hydrophobicity/hydrophilicity, degradability, ionizability, etc., and thus have been widely used in biomedical applications. Due to the characteristics of the tumor microenvironment (TME), stimuli-responsive polymers that cater specifically to the TME have been extensively used to prepare smart nanovehicles for the targeted delivery of therapeutic and diagnostic agents to tumor tissues. Compared to conventional drug delivery nanosystems, TME-responsive nanosystems have many advantages, such as high sensitivity, broad applicability among different tumors, functional versatility, and improved biosafety. In recent years, a great deal of research has been devoted to engineering efficient stimuli-responsive polymeric nanosystems, and significant improvement has been made to both cancer diagnosis and therapy. In this review, we summarize some recent research advances involving the use of stimuli-responsive polymer nanocarriers in drug delivery, tumor imaging, therapy, and theranostics. Various chemical stimuli will be described in the context of stimuli-responsive nanosystems. Accordingly, the functional chemical groups responsible for the responsiveness and the strategies to incorporate these groups into the polymer will be discussed in detail. With the research on this topic expending at a fast pace, some innovative concepts, such as sequential and cascade drug release, NIR-II imaging, and multifunctional formulations, have emerged as popular strategies for enhanced performance, which will also be included here with up-to-date illustrations. We hope that this review will offer valuable insights for the selection and optimization of stimuli-responsive polymers to help accelerate their future applications in cancer diagnosis and treatment.",
        "DOI": "10.1021/acsnano.3c06019",
        "paper_author": "Wei D.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434"
    },
    {
        "paper_title": "Efficient shRNA-based knockdown of multiple target genes for cell therapy using a chimeric miRNA cluster platform",
        "publication": "Molecular Therapy Nucleic Acids",
        "citied_by": "9",
        "cover_date": "2023-12-12",
        "Abstract": "Genome engineering technologies are powerful tools in cell-based immunotherapy to optimize or fine-tune cell functionalities. However, their use for multiple gene edits poses relevant biological and technical challenges. Short hairpin RNA (shRNA)-based cell engineering bypasses these criticalities and represents a valid alternative to CRISPR-based gene editing. Here, we describe a microRNA (miRNA)-based multiplex shRNA platform obtained by combining highly efficient miRNA scaffolds into a chimeric cluster, to deliver up to four shRNA-like sequences. Thanks to its limited size, our cassette could be deployed in a one-step process along with all the CAR components, streamlining the generation of engineered CAR T cells. The plug-and-play design of the shRNA platform allowed us to swap each shRNA-derived guide sequence without affecting the system performance. Appropriately choosing the target sequences, we were able to either achieve a functional KO, or fine-tune the expression levels of the target genes, all without the need for gene editing. Through our strategy we achieved easy, safe, efficient, and tunable modulation of multiple target genes simultaneously. This approach allows for the effective introduction of multiple functionally relevant tweaks in the transcriptome of the engineered cells, which may lead to increased performance in challenging environments, e.g., solid tumors.",
        "DOI": "10.1016/j.omtn.2023.102038",
        "paper_author": "Rossi M.",
        "affiliation_name": "Celyad, Belgium",
        "affiliation_city": "Mont-Saint-Guibert",
        "affiliation_country": "Belgium",
        "affiliation_id": "60111972"
    }
]