[
    {
        "paper_title": "Bifurcations in a Time-Delayed Birhythmic Biological System with Fractional Derivative and Lévy Noise",
        "publication": "International Journal of Bifurcation and Chaos",
        "citied_by": "2",
        "cover_date": "2021-12-30",
        "Abstract": "The birhythmic oscillation is of great significance in biology and engineering, and this paper presents a bifurcation analysis in a time-delayed birhythmic oscillator containing fractional derivative and Lévy noise. The numerical method is used to explore the influence of various parameters on the bifurcation of the birhythmic system, and the role of fractional derivative and Lévy noise in inducing or inhibiting birhythmicity in a time-delayed birhythmic biological system is examined in this work. First, we use a numerical method to calculate the fractional derivative, which has a fast calculation speed. Then the McCulloch algorithm is employed to generate Lévy random numbers. Finally, the stationary probability density function graph of the amplitude is obtained by Monte Carlo simulation. The results show that the fractional damping and Lévy noise can effectively control the characteristics of the birhythmic oscillator, and the change of the parameters (except the skewness parameter) can cause the system bifurcation. In addition, this article further discusses the interaction of fractional derivative and time delay in a birhythmic system with Lévy noise, proving that adjusting parameters of time delay can lead to abundant bifurcations. Our research may help to further explore the bifurcation phenomenon of birhythmic biological system, and has a practical significance.",
        "DOI": "10.1142/S0218127421502448",
        "paper_author": "Zhang W.",
        "affiliation_name": "Northwestern Polytechnical University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60003977"
    },
    {
        "paper_title": "Enhancing the Upconversion Luminescence and Sensitivity of Nanothermometry through Advanced Design of Dumbbell-Shaped Structured Nanoparticles",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "42",
        "cover_date": "2021-12-29",
        "Abstract": "The core-shell engineering of lanthanide-doped nanoparticles has captured considerable attention because it can safeguard the luminescence intensity of the core by reducing surface defects. However, the limited surface area of the traditional spherical core-shell structure hinders the further breakthrough of the brightness. Herein, a unique NaYF4:Yb3+/RE3+@NaYF4:Yb3+/RE3+@NaNdF4:Yb3+ (RE3+ = Ho3+ or Er3+) dumbbell-shaped multilayer nanoparticle featuring a high surface area is reported. Its upconversion luminescence intensity is higher than that of the conventional spherical core-shell structure. A thorough investigation is performed on the luminescence and thermometric mechanisms of Ho3+/Er3+ distributed in the core and the first shell. Remarkably, when Ho3+/Er3+ ions are distributed in the first shell, the relative sensitivity of the biological luminescence nanothermometer composed of downshifting near-infrared emissions is increased to 2.543% K-1 (328 K), which considerably exceeds most reported values. The increased value is attributed to the more thermal-sensitive phonon-assisted energy transfer. For potential biological applications, dumbbell-shaped nanoparticles (DSNPs) with hydrophilic modification show excellent thermometric performance and high tissue penetration depth. Overall, the insights provided by this work will broaden the scope of novel DSNPs in the fields of luminescence and nanothermometry.",
        "DOI": "10.1021/acsami.1c17900",
        "paper_author": "Xu H.",
        "affiliation_name": "Jilin University",
        "affiliation_city": "Changchun",
        "affiliation_country": "China",
        "affiliation_id": "60007711"
    },
    {
        "paper_title": "Directed Evolution and Rational Design of Mechanosensitive Channel MscCG2 for Improved Glutamate Excretion Efficiency",
        "publication": "Journal of Agricultural and Food Chemistry",
        "citied_by": "5",
        "cover_date": "2021-12-29",
        "Abstract": "Mechanosensitive amino acid exporters have drawn increasing attention due to their important roles in extracellular accumulation of the target amino acids. Protein engineering is a powerful approach to tailor the properties of amino acid exporters and illustrate structure-function relationships. Here we report the first protein engineering effort on the mechanosensitive glutamate exporter MscCG2 from Corynebacterium glutamicum for improved excretion efficiency of glutamate and understanding of the structure-function relationship. MscCG2 was engineered through directed evolution and computer-assisted design with a coupled assay in microtiter plate format. Improved MscCG2 variants were identified with up to 2.5-fold increase in the level of glutamate excretion in the early stage of fermentation and 1.5-fold in the late stage of fermentation under experimental conditions. Furthermore, the identified variants exhibited enhanced efflux of 4-fluoroglutamate (4-FG), an analog of glutamate. Structure analysis employing homology modeling and molecular dynamics (MD) simulation reveal that identified amino acid substitutions enlarge the size of the seven portals on the equator of MscCG2 and expand the narrowest rim of its inner channel, respectively. This study demonstrates the great potential of protein engineering in improving the secretion efficiency of exporters for enhanced bioproduction.",
        "DOI": "10.1021/acs.jafc.1c07086",
        "paper_author": "Nie Z.",
        "affiliation_name": "Tianjin Institute of Industrial Biotechnology",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60273043"
    },
    {
        "paper_title": "Eggshell Microparticle Reinforced Scaffolds for Regeneration of Critical Sized Cranial Defects",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "15",
        "cover_date": "2021-12-29",
        "Abstract": "Scaffold-based approaches for bone regeneration have been studied using a wide range of biomaterials as reinforcing agents to improve the mechanical strength and bioactivity of the 3D constructs. Eggshells are sustainable and inexpensive materials with unique biological and chemical properties to support bone differentiation. The incorporation of eggshell particles within hydrogels yields highly osteoinductive and osteoconductive scaffolds. This study reveals the effects of microparticles of whole eggshells, eggshells without a membrane, and a pristine eggshell membrane on osteogenic differentiation in protein-derived hydrogels. The in vitro studies showed that gels reinforced with eggshells with and without a membrane demonstrated comparable cellular proliferation, osteogenic gene expression, and osteogenic differentiation. Subsequently, in vivo studies were performed to implant eggshell microparticle-reinforced composite hydrogel scaffolds into critical-sized cranial defects in Sprague Dawley (SD) rats for up to 12 weeks to study bone regeneration. The in vivo results showed that the eggshell microparticle-based scaffolds supported an average bone volume of 60 mm3 and a bone density of 2000 HU 12 weeks post implantation. Furthermore, histological analyses of the explanted scaffolds showed that the eggshell microparticle-reinforced scaffolds permitted tissue infiltration and induced bone tissue formation over 12 weeks. The histology staining also indicated that these scaffolds induced significantly higher bone regeneration at 6 and 12 weeks as compared to the blank (no scaffold) and pristine gel scaffolds. The eggshell microparticle-reinforced scaffolds also supported significantly higher bone formation, remodeling, and vascularization over 6 and 12 weeks as confirmed by immunohistochemistry analysis. Collectively, our results indicated that eggshell microparticle-reinforced scaffolds facilitated significant bone regeneration in critical-sized cranial defects.",
        "DOI": "10.1021/acsami.1c19884",
        "paper_author": "Wu X.",
        "affiliation_name": "University of Massachusetts Lowell",
        "affiliation_city": "Lowell",
        "affiliation_country": "United States",
        "affiliation_id": "60033461"
    },
    {
        "paper_title": "A Novel Bionic Extracellular Matrix Polymer Scaffold Enhanced by Calcium Silicate for Bone Tissue Engineering",
        "publication": "ACS Omega",
        "citied_by": "9",
        "cover_date": "2021-12-28",
        "Abstract": "A novel porous calcium silicate (CS)-enhanced small intestinal submucosa (SIS) scaffold was prepared by freeze-drying to mimic the natural extracellular matrix environment for bone tissue engineering. The micro-morphology, physicochemical properties, biological characteristics, and effects on osteogenic differentiation in vitro were explored; the effects on promoting bone formation in vivo were evaluated. The composite scaffold had an ideal three-dimensional porous structure. The amount of calcium silicate played a significant role in improving mechanical properties and promoting osteogenic differentiation. The SIS/2CS scaffold promoted proliferation and osteogenic differentiation in human bone marrow mesenchymal stem cells; it also significantly increased osteogenesis in vivo. This novel composite polymer scaffold has potential applications in bone tissue engineering.",
        "DOI": "10.1021/acsomega.1c05623",
        "paper_author": "Wang M.",
        "affiliation_name": "Peking University Hospital of Stomatology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60121982"
    },
    {
        "paper_title": "Cancer diagnosis and analysis devices based on multimolecular crowding",
        "publication": "Chemical Communications",
        "citied_by": "2",
        "cover_date": "2021-12-28",
        "Abstract": "The study of the multimolecular crowding around cancer cells has opened up the possibility of developing new devices for cancer diagnosis and analysis through the measurement of intercellular communication related to cell proliferation and invasive metastasis associated with cancer malignancy. In particular, cells and extracellular vesicles that flow into the bloodstream contain metabolites and secreted products of the cancer microenvironment. These are positioned as targets for the development of new devices for the understanding and application of multimolecular crowding around cancer cells. Examples include the separation analysis of cancer cells in blood for the next generation of less invasive testing techniques, and mapping analysis using Raman scattering to detect cancer cells without staining. Another example is the evaluation of the relationship between exosomes and cancer traits for the exploration of new anti-cancer drugs, and the commercialization of exosome separation devices for ultra-early cancer diagnosis. The development of nanobiodevice engineering, which applies multimolecular crowding to conventional nanobioscience, is expected to contribute to the diagnosis and analysis of various diseases in the future.",
        "DOI": "10.1039/d1cc05556a",
        "paper_author": "Onoshima D.",
        "affiliation_name": "Nagoya University",
        "affiliation_city": "Nagoya",
        "affiliation_country": "Japan",
        "affiliation_id": "60000264"
    },
    {
        "paper_title": "Facile engineering of ECM-mimetic injectable dual crosslinking hydrogels with excellent mechanical resilience, tissue adhesion, and biocompatibility",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "20",
        "cover_date": "2021-12-28",
        "Abstract": "Injectable hydrogels have aroused ever-increasing interest for their cell/biomaterial delivery ability through minimally invasive procedures. Nevertheless, it is still a challenge to simply fabricate natural biopolymer-based injectable hydrogels possessing satisfactory mechanical properties, bioadhesion, and cell delivery ability. Herein, we describe a facile dual crosslinking (DC) strategy for preparing extracellular matrix (ECM) mimetic hydrogels with desirable comprehensive performance. The chondroitin sulfate (CS)- and gelatin (Gel)-based single crosslinked (SC) hydrogels were first developedviareversible borate ester bonds, and further strengthened through the Michael-addition crosslinking reaction or visible-light initiated photopolymerization with thiol-containing polyethylene glycol (PEG) crosslinkers. The dynamic SC hydrogels showed good injectability, pH-sensitive gel-sol transformation, and self-adhesion ability to various biological tissues such as skin, liver, and intervertebral disc. The mechanically tough DC hydrogels displayed tunable stiffness, and resilience to compression load (up to 90% strain) owing to the effective energy dissipation mechanism. The formed DC hydrogels after subcutaneous injection well integrated with surrounding tissues and exhibited fast self-recovery properties. Moreover, the photoencapsulation of human mesenchymal stem cells (hMSCs) within the developed DC hydrogels was achieved and has been proved to be biocompatible, highlighting the great potential of the photopolymerized DC hydrogels in cell delivery and three-dimensional (3D) cell culture. This biomimetic, mechanically resilient, adhesive, and cytocompatible injectable DC hydrogel could serve as a promising candidate for tissue engineering.",
        "DOI": "10.1039/d1tb01914g",
        "paper_author": "Fu H.",
        "affiliation_name": "Suzhou Institute of Nano-tech and Nano-Bionics, Chinese Academy of Sciences",
        "affiliation_city": "Suzhou",
        "affiliation_country": "China",
        "affiliation_id": "60117396"
    },
    {
        "paper_title": "Triplet harvesting aryl carbonyl-based luminescent materials: progress and prospective",
        "publication": "Journal of Materials Chemistry C",
        "citied_by": "32",
        "cover_date": "2021-12-28",
        "Abstract": "Triplet harvesting of organic materials is of great significance in many applications, including organic optoelectronic devices, anti-counterfeiting, and biological and chemical sensors. Aryl carbonyl-based luminescent materials have been widely studied in the above-mentioned fields because they possess intrinsic n-π* transitions as a result of the lone electron pairs of the carbonyl oxygen. Consequently, efficient intersystem crossing and reverse intersystem crossing can be achieved and triplet energy can be utilized through the narrow singlet-triplet offsets arose from the orthogonal overlaps between n and π* orbitals. It has also been revealed that they exhibit versatility in molecular tailoring and supramolecular engineering for various functional materials. This review presents a systematic summary of the recent research on aryl carbonyl (including moieties derived from aryl carbonyl) derivatives, with particular focus on their applications as electron acceptors, discussing the various strategies for the construction of luminescent materials with thermally activated delayed fluorescence and room-temperature phosphorescence, respectively. Finally, the perspectives and challenges concerning aryl carbonyl for triplet harvesting luminescent applications are also discussed.",
        "DOI": "10.1039/d1tc04184c",
        "paper_author": "Chen L.",
        "affiliation_name": "Guangdong University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60007155"
    },
    {
        "paper_title": "3D-Printed PCL Scaffolds Coated with Nanobioceramics Enhance Osteogenic Differentiation of Stem Cells",
        "publication": "ACS Omega",
        "citied_by": "56",
        "cover_date": "2021-12-28",
        "Abstract": "With advances in bone tissue engineering, various materials and methods have been explored to find a better scaffold that can help in improving bone growth and regeneration. Three-dimensional (3D) printing by fused deposition modeling can produce customized scaffolds from biodegradable polyesters such as polycaprolactone (PCL). Although the fabricated PCL scaffolds exhibited a lack of bioactivity and poor cell attachment on their surfaces, herein, using a simple postfabrication modification method with hydroxyapatite (HA) and bioglasses (BGs), we obtained better cell proliferation and attachment. Biological behavior and osteosupportive capacity of the 3D-printed scaffolds including PCL, PCL/HA, PCL/BG, and PCL/HA/BG were evaluated in this study, while human adipose tissue-derived mesenchymal stem cells (hADSCs) were cultured on the scaffolds. The cell morphology, attachment, and proliferation were investigated using scanning electron microscopy (SEM), 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyl tetrazolium bromide (MTT) assay, and 4′,6-diamidino-2-phenylindole (DAPI) staining. In the next step, the ability of stem cells to differentiate into osteoblasts was evaluated by measuring alkaline phosphatase (ALP) activity, calcium deposition, and bone-related gene and protein expression. In the end, the expression levels of miR-20a, miR-125a, and their target genes were also investigated as positive and negative regulators in osteogenesis pathways. The results showed that the coated scaffolds with bioceramics present a more appropriate surface for cell adhesion and proliferation, as well as efficient potential in inducing osteoconduction and osteointegration compared to PCL alone and control. The PCL/HA/BG scaffold exhibited higher in vitro cell viability and bone formation compared to the other groups, which can be due to the synergistic effect of HA and BG. On the whole, this tricomponent 3D-printing scaffold has a promising prospect for bone tissue engineering applications.",
        "DOI": "10.1021/acsomega.1c04015",
        "paper_author": "Fazeli N.",
        "affiliation_name": "Islamic Azad University, Science and Research Branch",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60105242"
    },
    {
        "paper_title": "Multiscale-Engineered Muscle Constructs: PEG Hydrogel Micro-Patterning on an Electrospun PCL Mat Functionalized with Gold Nanoparticles",
        "publication": "International journal of molecular sciences",
        "citied_by": "4",
        "cover_date": "2021-12-27",
        "Abstract": "The development of new, viable, and functional engineered tissue is a complex and challenging task. Skeletal muscle constructs have specific requirements as cells are sensitive to the stiffness, geometry of the materials, and biological micro-environment. The aim of this study was thus to design and characterize a multi-scale scaffold and to evaluate it regarding the differentiation process of C2C12 skeletal myoblasts. The significance of the work lies in the microfabrication of lines of polyethylene glycol, on poly(ε-caprolactone) nanofiber sheets obtained using the electrospinning process, coated or not with gold nanoparticles to act as a potential substrate for electrical stimulation. The differentiation of C2C12 cells was studied over a period of seven days and quantified through both expression of specific genes, and analysis of the myotubes' alignment and length using confocal microscopy. We demonstrated that our multiscale bio-construct presented tunable mechanical properties and supported the different stages skeletal muscle, as well as improving the parallel orientation of the myotubes with a variation of less than 15°. These scaffolds showed the ability of sustained myogenic differentiation by enhancing the organization of reconstructed skeletal muscle. Moreover, they may be suitable for applications in mechanical and electrical stimulation to mimic the muscle's physiological functions.",
        "DOI": "10.3390/ijms23010260",
        "paper_author": "Beldjilali-Labro M.",
        "affiliation_name": "BMBI – Biomécanique et Bioingénierie",
        "affiliation_city": "Compiegne",
        "affiliation_country": "France",
        "affiliation_id": "60160769"
    },
    {
        "paper_title": "Influencing factors and improving ways of deformability of metallic glass",
        "publication": "Cailiao Rechuli Xuebao/Transactions of Materials and Heat Treatment",
        "citied_by": "0",
        "cover_date": "2021-12-25",
        "Abstract": "Metallic glass has excellent mechanical, physical, biological and chemical properties, good wear resistance and corrosion resistance, so it has broad application prospects in the field of engineering and functional materials. Based on the highly localized shear-band deformation mode, metallic glass presents brittleness and strain softening at room temperature, which limits its application potential. Improving the mechanical properties of metallic glass can be realized by changing the influencing factors of metallic glass deformability. Different preparation processes, test conditions and subsequent treatment processes can improve the deformability of metallic glass. Therefore, it is very important to systematically introduce the influencing factors of metal glass deformability and how to improve metal glass deformability by adjusting these influencing factors. This paper summarizes the internal and external factors affecting the deformability of metallic glass, and focuses on the main ways to improve the deformability of metallic glass. Finally, the modification ways of metallic glass are briefly summarized, and some problems that need to be further studied in this field are prospected.",
        "DOI": "10.13289/j.issn.1009-6264.2021-0275",
        "paper_author": "Yang S.",
        "affiliation_name": "Xi'an Aeronautical University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60108778"
    },
    {
        "paper_title": "Insights into stem cell therapy for premature ovarian insufficiency",
        "publication": "Reproductive and Developmental Medicine",
        "citied_by": "1",
        "cover_date": "2021-12-25",
        "Abstract": "Hormone therapy, assisted reproductive technology, and regenerative medicine have been used to treat infertility due to premature ovarian insufficiency (POI), with limited success. It is timely to survey the field by outlining the controversies and promising prospects of evolving stem cell (SC) therapy for patients with POI. We first discuss several strategies of tissue-derived SC therapy and induced/engineered SC therapy and then enumerate mechanisms, including cellular regenerability induced in reproductive tissues and paracrine effects induced by various chemokines. Next, we evaluate the potential benefits of SC-based tissue engineering in reversing ovarian aging. Finally, we discuss the clinical feasibility of SC therapy and generalized regenerative medicine for the treatment of POI. In summary, SCs and SC-derived exosomes, induced pluripotent SCs, engineered SCs, and tissue engineering could start a new chapter for fertility rehabilitation in patients with POI. Uncovering the underlying molecular mechanisms and biological efficacy could be facilitated not only by animal experiments but also by security screening and clinical trials to validate SC-based therapy for POI.",
        "DOI": "10.4103/2096-2924.334379",
        "paper_author": "Pei Z.L.",
        "affiliation_name": "Obstetrics &amp; Gynecology Hospital of Fudan University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60121945"
    },
    {
        "paper_title": "Implementation of a WeChat small program assisted process assessment system in \"Experiment of Inorganic Chemistry\" for Biological Engineering undergraduates",
        "publication": "Shengwu Gongcheng Xuebao/Chinese Journal of Biotechnology",
        "citied_by": "0",
        "cover_date": "2021-12-25",
        "Abstract": "The convenience of \"no installation, available at your fingertips\" of the WeChat small program makes it unique in the application of mobile terminal auxiliary experimental teaching. In order to optimize the assessment system and improve the quality and outcomes of experimental teaching, a self-designed WeChat small program was used to assist the development of the process assessment system. This system was applied to the teaching practice of \"Experiment of Inorganic Chemistry\" course for the first-year undergraduates majored in Biological Engineering, with the aim to promote teaching and learning by assessment. The results showed that course scores of the students who used this small program were superior to the control group and the correlation between the process assessment and final examination results was significant. These results indicated the WeChat small program assisted process assessment could effectively improve the learning outcomes of students, enable them to grasp the knowledge of Experiment of Inorganic Chemistry efficiently. The results of the questionnaire for the teachers and students also showed a high recognition of the WeChat small program assisted teaching.",
        "DOI": "10.13345/j.cjb.200780",
        "paper_author": "Xu J.",
        "affiliation_name": "Huaqiao University",
        "affiliation_city": "Quanzhou",
        "affiliation_country": "China",
        "affiliation_id": "60006106"
    },
    {
        "paper_title": "Development of a practical innovation course for biological engineering major under the background of Engineering Education Certification",
        "publication": "Shengwu Gongcheng Xuebao/Chinese Journal of Biotechnology",
        "citied_by": "1",
        "cover_date": "2021-12-25",
        "Abstract": "According to the teaching philosophy of the outcome-based education, this study elaborates the development of a practical innovation course for biological engineering major after five runs of teaching practice and continuous improvement. It mainly includes the methods for selection of teaching subjects, implementation of teaching process, process assessment, evaluation and improvement. Based on the performance and achievements of three grades of students majored in bioengineering, we found that the logic and methods of the practical innovation course could greatly stimulate the motivation of students for learning, as well as their scores. Therefore, the logic and methods described in this study may serve as a reference for the reforms of practical training courses of engineering major under the background of Engineering Education Certification.",
        "DOI": "10.13345/j.cjb.210087",
        "paper_author": "Wu L.",
        "affiliation_name": "Changshu Institute of Technology",
        "affiliation_city": "Changshu",
        "affiliation_country": "China",
        "affiliation_id": "60073496"
    },
    {
        "paper_title": "Recent advances in polysaccharides based biomaterials for drug delivery and tissue engineering applications",
        "publication": "Carbohydrate Polymer Technologies and Applications",
        "citied_by": "164",
        "cover_date": "2021-12-25",
        "Abstract": "In this paper, a spotlight is shown on polysaccharides based biomaterials which have surfaced as a versatile platform for different biomedical applications including drug delivery and tissue regeneration. Herein, structure and unique properties of different polysaccharides are described along with various functionalization strategies. Additionally, a brief overview of different physical and chemical crosslinking approaches to design polysaccharides derived biomaterials is provided. Due to their inherent biocompatible and biodegradable properties, polysaccharides based biomaterials are being extensively explored for performing a difficult task under complex biological environment. Hence, recent developments in using polysaccharides derived functional biomaterials especially for drug delivery and tissue engineering applications are described here. The studies reviewed here motivate to fabricate novel polysaccharides based biomaterials with outstanding properties and functionality. Finally, various future possibilities to achieve their widespread commercial use are discussed.",
        "DOI": "10.1016/j.carpta.2021.100067",
        "paper_author": "Sood A.",
        "affiliation_name": "Indian Institute of Technology Mandi",
        "affiliation_city": "Mandi",
        "affiliation_country": "India",
        "affiliation_id": "60104340"
    },
    {
        "paper_title": "Bioinspired Networks of Communicating Synthetic Protocells",
        "publication": "Frontiers in Molecular Biosciences",
        "citied_by": "10",
        "cover_date": "2021-12-24",
        "Abstract": "The bottom-up synthesis of cell-like entities or protocells from inanimate molecules and materials is one of the grand challenges of our time. In the past decade, researchers in the emerging field of bottom-up synthetic biology have developed different protocell models and engineered them to mimic one or more abilities of biological cells, such as information transcription and translation, adhesion, and enzyme-mediated metabolism. Whilst thus far efforts have focused on increasing the biochemical complexity of individual protocells, an emerging challenge in bottom-up synthetic biology is the development of networks of communicating synthetic protocells. The possibility of engineering multi-protocellular systems capable of sending and receiving chemical signals to trigger individual or collective programmed cell-like behaviours or for communicating with living cells and tissues would lead to major scientific breakthroughs with important applications in biotechnology, tissue engineering and regenerative medicine. This mini-review will discuss this new, emerging area of bottom-up synthetic biology and will introduce three types of bioinspired networks of communicating synthetic protocells that have recently emerged.",
        "DOI": "10.3389/fmolb.2021.804717",
        "paper_author": "Grimes P.J.",
        "affiliation_name": "University of Bristol",
        "affiliation_city": "Bristol",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020650"
    },
    {
        "paper_title": "Methanol Dehydrogenases as a Key Biocatalysts for Synthetic Methylotrophy",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "23",
        "cover_date": "2021-12-24",
        "Abstract": "One-carbon (C1) chemicals are potential building blocks for cheap and sustainable re-sources such as methane, methanol, formaldehyde, formate, carbon monoxide, and more. These resources have the potential to be made into raw materials for various products used in our daily life or precursors for pharmaceuticals through biological and chemical processes. Among the soluble C1 substrates, methanol is regarded as a biorenewable platform feedstock because nearly all bioresources can be converted into methanol through syngas. Synthetic methylotrophy can be exploited to produce fuels and chemicals using methanol as a feedstock that integrates natural or artificial methanol assimilation pathways in platform microorganisms. In the methanol utilization in methylotrophy, methanol dehydrogenase (Mdh) is a primary enzyme that converts methanol to formaldehyde. The discovery of new Mdhs and engineering of present Mdhs have been attempted to develop synthetic methylotrophic bacteria. In this review, we describe Mdhs, including in terms of their enzyme properties and engineering for desired activity. In addition, we specifically focus on the application of various Mdhs for synthetic methylotrophy.",
        "DOI": "10.3389/fbioe.2021.787791",
        "paper_author": "Le T.K.",
        "affiliation_name": "Chonnam National University",
        "affiliation_city": "Gwangju",
        "affiliation_country": "South Korea",
        "affiliation_id": "60007215"
    },
    {
        "paper_title": "Anisotropic 3D Nanofibrous Porous Material Fabrication by a Liquid Film-Assisted Gas Templating Strategy for Thermal Insulation",
        "publication": "ACS Applied Nano Materials",
        "citied_by": "2",
        "cover_date": "2021-12-24",
        "Abstract": "In the last decade, three-dimensional nanofibrous porous materials (3D NPMs) have been attracting widespread interest ranging from thermal insulation to biological engineering. However, their practical application is always limited by the complex and high-cost fabrication process. Here, inspired by the mechanism of fermentation to produce cooked wheaten food, a general scalable strategy, namely, liquid film-assisted gas templating, is designed to fabricate anisotropic 3D NPMs from two-dimensional nanofibrous membranes (2D NFMs) without the tedious and time-consuming fabrication process. The successive production of gas promotes the bending of nanofiber layers and the increase of the gap between the adjacent layers, thereby forming numerous new interconnections, leading to cellular pore structures. Attributing to the maintenance of the continuous nature of the fibers and their layers, as well as the formation of new joints, the as-prepared 3D NPM exhibits anisotropic and superior mechanical properties. The high porosity and low density of the 3D NPM endow it with an outstanding thermal insulation performance, and the thermal conductivity can reach up to 0.045 W m-1 K-1. Additionally, the 3D NPM also shows potential applications in terms of oil adsorption, waterproofing, and gas permeability. Finally, the criteria for this process are given based on theoretical simulation and analysis, and the universality of this strategy has been confirmed through fabricating various 3D NPMs of inorganic, organic, and composite materials.",
        "DOI": "10.1021/acsanm.1c03494",
        "paper_author": "Qiu F.",
        "affiliation_name": "Shandong University",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60031031"
    },
    {
        "paper_title": "ASPECTS OF LYOPHILIZATION OF CARDIAC BIOIMPLANT",
        "publication": "Innovative Biosystems and Bioengineering",
        "citied_by": "3",
        "cover_date": "2021-12-23",
        "Abstract": "The use of implants of biological origin in clinical practice has led to the search for methods of long-term storage of tissues without damaging their functional and structural characteristics. Xenografts (extracted from pericardium of pigs, horses, bulls) are drawing more and more interest. The bovine pericardium is exposed to chemical and physical factors providing complete purification of tissue from cells and their components. Such scaffolds are protein (collagen) complexes that fully replicate the microstructure of the pericardial tis-sue. Lyophilisation ensures long-term preservation of the extracellular matrix properties. The principle of the method is in drying pre-frozen tissue, in which water is sublimated. The method is intended for storage, transportation, and the subsequent use of the bioimplant in clinical practice. However, the lyophilization process may be accompanied by various undesirable factors that can lead to denaturation of the matrix protein or loss of its functionality and structure. To preserve the natural microstructure, stabilizers or various modifications (slow/fast freezing, reducing the degree of supercooling, etc.) of the lyophilization process are applied to biological prostheses. In this review, the main processes of lyophilization of biological tissue are described, which can affect the operation of a cardiac implant. A deep understanding of the parameters of the lyophilization process is crucial for creation of stable tissue grafts and their subsequent long-term storage.",
        "DOI": "10.20535/ibb.2021.5.4.239725",
        "paper_author": "Shchotkina N.V.",
        "affiliation_name": "Scientific-Practical Medical Center of Pediatric Cardiology and Cardiac Surgery",
        "affiliation_city": "Kyiv",
        "affiliation_country": "Ukraine",
        "affiliation_id": "129310101"
    },
    {
        "paper_title": "Tapping the Role of Microbial Biosurfactants in Pesticide Remediation: An Eco-Friendly Approach for Environmental Sustainability",
        "publication": "Frontiers in Microbiology",
        "citied_by": "51",
        "cover_date": "2021-12-23",
        "Abstract": "Pesticides are used indiscriminately all over the world to protect crops from pests and pathogens. If they are used in excess, they contaminate the soil and water bodies and negatively affect human health and the environment. However, bioremediation is the most viable option to deal with these pollutants, but it has certain limitations. Therefore, harnessing the role of microbial biosurfactants in pesticide remediation is a promising approach. Biosurfactants are the amphiphilic compounds that can help to increase the bioavailability of pesticides, and speeds up the bioremediation process. Biosurfactants lower the surface area and interfacial tension of immiscible fluids and boost the solubility and sorption of hydrophobic pesticide contaminants. They have the property of biodegradability, low toxicity, high selectivity, and broad action spectrum under extreme pH, temperature, and salinity conditions, as well as a low critical micelle concentration (CMC). All these factors can augment the process of pesticide remediation. Application of metagenomic and in-silico tools would help by rapidly characterizing pesticide degrading microorganisms at a taxonomic and functional level. A comprehensive review of the literature shows that the role of biosurfactants in the biological remediation of pesticides has received limited attention. Therefore, this article is intended to provide a detailed overview of the role of various biosurfactants in improving pesticide remediation as well as different methods used for the detection of microbial biosurfactants. Additionally, this article covers the role of advanced metagenomics tools in characterizing the biosurfactant producing pesticide degrading microbes from different environments.",
        "DOI": "10.3389/fmicb.2021.791723",
        "paper_author": "Raj A.",
        "affiliation_name": "Dr. H. S. Gour Vishwavidyalaya Sagar",
        "affiliation_city": "Sagar",
        "affiliation_country": "India",
        "affiliation_id": "60020716"
    },
    {
        "paper_title": "Genipin Cross-Linked Decellularized Nucleus Pulposus Hydrogel-Like Cell Delivery System Induces Differentiation of ADSCs and Retards Intervertebral Disc Degeneration",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "21",
        "cover_date": "2021-12-23",
        "Abstract": "Intervertebral disc degeneration (IDD) is the pathological basis of disc degenerative diseases (DDD). Reduction in the number of cells and degeneration of the extracellular matrix (ECM) in the nucleus pulposus (NP) are characteristics of IDD. Bio-hydrogel combined with stem cell transplantation is a promising treatment. Injectable ECM hydrogels have good biological activity and in-situ gelatinization. However, its biomechanics and stability are insufficient to provide adequate mechanical support for intervertebral discs and to maintain the long-term differential stimulus for seeded stem cells. In our study, we developed genipin cross-linked decellularized nucleus pulposus hydrogel (GDH) as delivery system. We evaluated the mechanical properties, stability, biocompatibility, and differentiation induction of GDH cross-linked with different concentrations of genipin in vitro. The GDH-loaded adipose-derived mesenchymal stem cells (ADSCs) (GDHA) were injected into the rat degenerated coccygeal intervertebral disc. The effect of intervertebral disc regeneration in vivo was evaluated. The results showed that GDH with 0.02% of genipin had similar elastic modulus to human nucleus pulposus, good biocompatibility, and inducibility of expressing NP-related genes. In vivo studies showed that GDHA improved the survival of ADSCs and improved the intervertebral height, MRI index, and histological grading score. In conclusion, GDH, as an outstanding bio-hydrogel cell delivery system, has the therapeutic potential for retarding IDD.",
        "DOI": "10.3389/fbioe.2021.807883",
        "paper_author": "Yu L.",
        "affiliation_name": "Naval Medical University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025234"
    },
    {
        "paper_title": "Reactive Oxygen Species-Based Biomaterials for Regenerative Medicine and Tissue Engineering Applications",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "50",
        "cover_date": "2021-12-23",
        "Abstract": "Reactive oxygen species (ROS), acting as essential mediators in biological system, play important roles in the physiologic and pathologic processes, including cellular signal transductions and cell homeostasis interference. Aberrant expression of ROS in tissue microenvironment can be caused by the internal/external stimuli and tissue injury, which may leads to an elevated level of oxidative stress, inflammatory response, and cellular damage as well as disruption in the tissue repair process. To prevent the formation of excess ROS around the injury site, advanced biomaterials can be remodeled or instructed to release their payloads in an injury microenvironment-responsive fashion to regulate the elevated levels of the ROS, which may also help downregulate the oxidative stress and promote tissue regeneration. A multitude of scaffolds and bioactive cues have been reported to promote the regeneration of damaged tissues based on the scavenging of free radicals and reactive species that confer high protection to the cellular activity and tissue function. In this review, we outline the underlying mechanism of ROS generation in the tissue microenvironment and present a comprehensive review of ROS-scavenging biomaterials for regenerative medicine and tissue engineering applications, including soft tissues regeneration, bone and cartilage repair as well as wound healing. Additionally, we highlight the strategies for the regulation of ROS by scaffold design and processing technology. Taken together, developing ROS-based biomaterials may not only help develop advanced platforms for improving injury microenvironment but also accelerate tissue regeneration.",
        "DOI": "10.3389/fbioe.2021.821288",
        "paper_author": "Shafiq M.",
        "affiliation_name": "Donghua University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60010953"
    },
    {
        "paper_title": "Several issues worthy of attention in current lacustrine shale oil exploration and development",
        "publication": "Shiyou Kantan Yu Kaifa/Petroleum Exploration and Development",
        "citied_by": "95",
        "cover_date": "2021-12-23",
        "Abstract": "Based on the current research status of shale oil exploration and development at home and abroad, combing the field observations, dissection of typical shale oil regions, analysis and testing of organic-rich shale samples, etc., we compare the differences in geological and engineering characteristics of shale oil reservoirs in marine and continental basins between China and the United States. We put forward 8 issues worthy of attention in the exploration and development of lacustrine shale oil in typical basins of China, including the concept of tight oil and shale oil, differences between continental and marine shale oil reservoirs, medium-low maturity and medium-high maturity, vertical permeability and horizontal permeability, source-reservoir and source-caprock, geology and engineering, selection criteria of favorable areas and \"sweet spots\", and basic scientific research and application research. By comparing and analyzing organic-rich shales in the Triassic Yanchang Formation of the Ordos Basin, the Permian Lucaogou Formation in the Jimsar Sag of the Junggar Basin, the Permian Fengcheng Formation in the Mahu Sag, the Cretaceous Qingshankou & Nenjiang Formation in the Songliao Basin and the Paleogene Kongdian & Shahejie Formation in the Bohai Bay Basin, from shale oil exploration to development, three key scientific issues must be studied in-depth in the future: (1) the physical, chemical and biological processes during the deposition of terrestrial fine-grained sediments and the formation mechanism of terrestrial organic-rich shale; (2) diagenesis-hydrocarbon-generation and storage dynamics, hydrocarbon occurrence and enrichment mechanism; (3) the fracturing mechanisms of terrestrial shale layers in different diagenetic stages and the multi-phase and multi-scale flow mechanism of shale oil in shale layers of different maturities. Clarifying the main controlling factors of shale oil reservoir characterization, oil-bearing properties, compressibility and fluidity of shale oil with different maturities and establishing a lacustrine shale oil enrichment model and the evaluation methodology can provide effective development methods, and theoretical foundation, and technical support for the large scale economical exploration and development of lacustrine shale oil resources in China.",
        "DOI": "10.11698/PED.2021.06.20",
        "paper_author": "Jin Z.",
        "affiliation_name": "Peking University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014966"
    },
    {
        "paper_title": "Immune and genome engineering as the future of transplantable tissue",
        "publication": "New England Journal of Medicine",
        "citied_by": "32",
        "cover_date": "2021-12-23",
        "Abstract": "NA",
        "DOI": "10.1056/NEJMra1913421",
        "paper_author": "Elisseeff J.",
        "affiliation_name": "Johns Hopkins Department of Biomedical Engineering",
        "affiliation_city": "Baltimore",
        "affiliation_country": "United States",
        "affiliation_id": "60145989"
    },
    {
        "paper_title": "Recent Advances of Biomedical Materials for Prevention of Post-ESD Esophageal Stricture",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "7",
        "cover_date": "2021-12-22",
        "Abstract": "Esophageal stricture commonly occurs in patients that have suffered from endoscopic submucosal dissection (ESD), and it makes swallowing difficult for patients, significantly reducing their life qualities. So far, the prevention strategies applied in clinical practice for post-ESD esophageal stricture usually bring various inevitable complications, which drastically counteract their effectiveness. Nowadays, with the widespread investigation and application of biomedical materials, lots of novel approaches have been devised in terms of the prevention of esophageal stricture. Biomedical polymers and biomedical-derived materials are the most used biomedical materials to prevent esophageal stricture after ESD. Both of biomedical polymers and biomedical-derived materials possess great physicochemical properties such as biocompatibility and biodegradability. Moreover, some biomedical polymers can be used as scaffolds to promote cell growth, and biomedical-derived materials have biological functions similar to natural organisms, so they are important in tissue engineering. In this review, we have summarized the current approaches for preventing esophageal stricture and put emphasis on the discussion of the roles biomedical polymers and biomedical-derived materials acted in esophageal stricture prevention. Meanwhile, we proposed several potential methods that may be highly rational and feasible in esophageal stricture prevention based on other researches associated with biomedical materials. This review is expected to offer a significant inspiration from biomedical materials to explore more effective, safer, and more economical strategies to manage post-ESD esophageal stricture.",
        "DOI": "10.3389/fbioe.2021.792929",
        "paper_author": "Bao Y.",
        "affiliation_name": "Tongji University School of Medicine",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60129180"
    },
    {
        "paper_title": "Extracellular hyaluronate pressure shaped by cellular tethers drives tissue morphogenesis",
        "publication": "Cell",
        "citied_by": "52",
        "cover_date": "2021-12-22",
        "Abstract": "How tissues acquire complex shapes is a fundamental question in biology and regenerative medicine. Zebrafish semicircular canals form from invaginations in the otic epithelium (buds) that extend and fuse to form the hubs of each canal. We find that conventional actomyosin-driven behaviors are not required. Instead, local secretion of hyaluronan, made by the enzymes uridine 5′-diphosphate dehydrogenase (ugdh) and hyaluronan synthase 3 (has3), drives canal morphogenesis. Charged hyaluronate polymers osmotically swell with water and generate isotropic extracellular pressure to deform the overlying epithelium into buds. The mechanical anisotropy needed to shape buds into tubes is conferred by a polarized distribution of actomyosin and E-cadherin-rich membrane tethers, which we term cytocinches. Most work on tissue morphogenesis ascribes actomyosin contractility as the driving force, while the extracellular matrix shapes tissues through differential stiffness. Our work inverts this expectation. Hyaluronate pressure shaped by anisotropic tissue stiffness may be a widespread mechanism for powering morphological change in organogenesis and tissue engineering.",
        "DOI": "10.1016/j.cell.2021.11.025",
        "paper_author": "Munjal A.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746"
    },
    {
        "paper_title": "The Red Edge: Bilin-Binding Photoreceptors as Optogenetic Tools and Fluorescence Reporters",
        "publication": "Chemical Reviews",
        "citied_by": "32",
        "cover_date": "2021-12-22",
        "Abstract": "This review adds the bilin-binding phytochromes to the Chemical Reviews thematic issue \"Optogenetics and Photopharmacology\". The work is structured into two parts. We first outline the photochemistry of the covalently bound tetrapyrrole chromophore and summarize relevant spectroscopic, kinetic, biochemical, and physiological properties of the different families of phytochromes. Based on this knowledge, we then describe the engineering of phytochromes to further improve these chromoproteins as photoswitches and review their employment in an ever-growing number of different optogenetic applications. Most applications rely on the light-controlled complex formation between the plant photoreceptor PhyB and phytochrome-interacting factors (PIFs) or C-Terminal light-regulated domains with enzymatic functions present in many bacterial and algal phytochromes. Phytochrome-based optogenetic tools are currently implemented in bacteria, yeast, plants, and animals to achieve light control of a wide range of biological activities. These cover the regulation of gene expression, protein transport into cell organelles, and the recruitment of phytochrome-or PIF-Tagged proteins to membranes and other cellular compartments. This compilation illustrates the intrinsic advantages of phytochromes compared to other photoreceptor classes, e.g., their bidirectional dual-wavelength control enabling instant ON and OFF regulation. In particular, the long wavelength range of absorption and fluorescence within the \"transparent window\"makes phytochromes attractive for complex applications requiring deep tissue penetration or dual-wavelength control in combination with blue and UV light-sensing photoreceptors. In addition to the wide variability of applications employing natural and engineered phytochromes, we also discuss recent progress in the development of bilin-based fluorescent proteins.",
        "DOI": "10.1021/acs.chemrev.1c00194",
        "paper_author": "Tang K.",
        "affiliation_name": "Heinrich-Heine-Universität Düsseldorf",
        "affiliation_city": "Dusseldorf",
        "affiliation_country": "Germany",
        "affiliation_id": "60025310"
    },
    {
        "paper_title": "Surface engineering of biodegradable implants: Emerging trends in bioactive ceramic coatings and mechanical treatments",
        "publication": "Materials Advances",
        "citied_by": "28",
        "cover_date": "2021-12-21",
        "Abstract": "Biodegradable polymers, metals, and ceramics have emerged as promising alternatives to prepare degradable implants in recent years, which are better alternatives to conventional non-degradable implants to treat a broad range of disorders. Surface engineering strategies are widely applied for enhancing their performance, including orthopedic, cardiovascular, and craniofacial devices, among many others. Bioactive ceramic coatings on degradable biomedical implants can enhance bio-integration and augment healing while tailoring the degradation rate of the device. Bioactive ceramics form a chemical bond with the surrounding tissue, thus helping in the integration process of the implanted polymer or metal device. Several coatings also impart antibacterial activity to minimize infections. Additionally, mechanical surface treatments have emerged as a promising route for surface engineering and have been predominantly used to modify the surface of degradable metallic implants. The mechanical treatment of the surface primarily enhances the bio-corrosion resistance of the implants without compromising biocompatibility. Surface mechanical treatments also improve the biomechanical performance of the implant through surface nanocrystallization. The present review gives an overview of bioactive ceramics commonly used as a coating material for degradable biomedical implants and the effect of bioactive ceramic coating on their biological, corrosion, and mechanical responses. This review also features state-of-the-art mechanical techniques utilized for surface modification of degradable implants. Gaps in the current technology that can be addressed in future research are identified to improve the clinical success of surface-modified degradable implants as they rapidly emerge as the next-generation devices.",
        "DOI": "10.1039/d1ma00733e",
        "paper_author": "Nilawar S.",
        "affiliation_name": "Indian Institute of Science",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "60014097"
    },
    {
        "paper_title": "Multifarious applications of bioactive glasses in soft tissue engineering",
        "publication": "Biomaterials Science",
        "citied_by": "10",
        "cover_date": "2021-12-21",
        "Abstract": "Tissue engineering (TE), a new paradigm in regenerative medicine, repairs and restores the diseased or damaged tissues and eliminates drawbacks associated with autografts and allografts. In this context, many biomaterials have been developed for regenerating tissues and are considered revolutionary in TE due to their flexibility, biocompatibility, and biodegradability. One such well-documented biomaterial is bioactive glasses (BGs), known for their osteoconductive and osteogenic potential and their abundant orthopedic and dental clinical applications. However, in the last few decades, the soft tissue regenerative potential of BGs has demonstrated great promise. Therefore, this review comprehensively covers the biological application of BGs in the repair and regeneration of tissues outside the skeleton system. BGs promote neovascularization, which is crucial to encourage host tissue integration with the implanted construct, making them suitable biomaterial scaffolds for TE. Moreover, they heal acute and chronic wounds and also have been reported to restore the injured superficial intestinal mucosa, aiding in gastroduodenal regeneration. In addition, BGs promote regeneration of the tissues with minimal renewal capacity like the heart and lungs. Besides, the peripheral nerve and musculoskeletal reparative properties of BGs are also reported. These results show promising soft tissue regenerative potential of BGs under preclinical settings without posing significant adverse effects. Albeit, there is limited bench-to-bedside clinical translation of elucidative research on BGs as they require rigorous pharmacological evaluations using standardized animal models for assessing biomolecular downstream pathways. This journal is",
        "DOI": "10.1039/d1bm01104a",
        "paper_author": "Majumdar S.",
        "affiliation_name": "Banaras Hindu University",
        "affiliation_city": "Varanasi",
        "affiliation_country": "India",
        "affiliation_id": "60008721"
    },
    {
        "paper_title": "Biocompatible pectin-based hybrid hydrogels for tissue engineering applications",
        "publication": "New Journal of Chemistry",
        "citied_by": "14",
        "cover_date": "2021-12-21",
        "Abstract": "Hybrid hydrogels made of chemically modified pectin, gelatin and xanthan gum have been formulated and processed through a double crosslinking step, aimed at wound healing applications. The formulation of hybrid hydrogels finds its cornerstone in the possibility to create a supportive environment for cell adhesion and proliferation, ensuring the transport of nutrients via porous structures, together with mechanical properties closely comparable to the native tissue. The hydrogels present a good swelling behavior, resistance to dissolution and fragmentation in simulated biological environment (PBS 1× and DMEM) for up to 20 days and the porous structure, as pictured via scanning electron microscopy, has been foreseen to help cell migration and the exchange of biomolecules. Rheological characterization showed desired mechanical features, while the biocompatibility has been assessed via live/dead assay on murine fibroblasts. Finally, the hybrid hydrogels have also been proved suitable for mechanical extrusion, demonstrating the possibility of cell encapsulation in the future perspective of 3D bioprinting applications.",
        "DOI": "10.1039/d1nj04142h",
        "paper_author": "Tortorella S.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA"
    },
    {
        "paper_title": "Mechanically robust hybrid hydrogels of photo-crosslinkable gelatin and laminin-mimetic peptide amphiphiles for neural induction",
        "publication": "Biomaterials Science",
        "citied_by": "12",
        "cover_date": "2021-12-21",
        "Abstract": "Self-assembling bio-instructive materials that can provide a biomimetic tissue microenvironment with the capability to regulate cellular behaviors represent an attractive platform in regenerative medicine. Herein, we develop a hybrid neuro-instructive hydrogel that combines the properties of a photo-crosslinkable gelatin methacrylate (GelMA) and self-assembling peptide amphiphiles (PAs) bearing a laminin-derived neuro-inductive epitope (PA-GSR). Electrostatic interaction and ultraviolet light crosslinking mechanisms were combined to create dual-crosslinked hybrid hydrogels with tunable stiffness. Spectroscopic, microscopic and theoretical techniques show that the cationic PA-GSR(+) electrostatically co-assembles with the negatively charged GelMA to create weak hydrogels with hierarchically ordered microstructures, which were further photo-crosslinked to create mechanically robust hydrogels. Dynamic oscillatory rheology and micromechanical testing show that photo-crosslinking of the co-assembled GelMA and PA-GSR(+) hydrogel results in robust hydrogels displaying improved stiffness. Gene expression analysis was used to show that GelMA/PA-GSR(+) hydrogels can induce human mesenchymal stem cells (hMSCs) into neural-lineage cells and supports neural-lineage specification of neuroblast-like cells (SH-SY5Y) in a growth-factor-free manner. Also, metabolomics analysis suggests that the hydrogel alters the metabolite profiles in the cells by affecting multiple molecular pathways. This work highlights a new approach for the design of PA-based hybrid hydrogels with robust mechanical properties and biological functionalities for nerve tissue regeneration. This journal is",
        "DOI": "10.1039/d1bm01350e",
        "paper_author": "Isik M.",
        "affiliation_name": "Ankara Üniversitesi",
        "affiliation_city": "Ankara",
        "affiliation_country": "Turkey",
        "affiliation_id": "60012603"
    },
    {
        "paper_title": "Engineering Electrospun Nanofibers for the Treatment of Oral Diseases",
        "publication": "Frontiers in Chemistry",
        "citied_by": "18",
        "cover_date": "2021-12-20",
        "Abstract": "With the increase of consumption of high-sugar foods, beverages, tobacco, and alcohol, the incidence rate of oral diseases has been increasing year by year. Statistics showed that the prevalence of oral diseases such as dental caries, dental pulpal disease, and periodontal disease has reached as high as 97% in 2015 in China. It is thus urgent to develop functional materials or products for the treatment of oral diseases. Electrospinning has been a widely used technology that is capable of utilizing polymer solution to generate micro/nano fibers under an appropriate high voltage condition. Owing to their excellent structures and biological performances, materials prepared by electrospinning technology have been used for a wide range of oral-related applications, such as tissue restoration, controlled drug release, anti-cancer, etc. In this regard, this article reviews the application and progress of electrospun nanofibers to various oral diseases in recent years. Firstly, engineering strategies of a variety of nanofiber structures together with their resultant functions will be introduced. Then, biological functions of electrospun nanofibers as well as their applications in the treatment of oral diseases are summarized and demonstrated. Finally, the development viewpoint of functional nanofibers is prospected, which is expected to lay the foundation and propose the direction for further clinical application.",
        "DOI": "10.3389/fchem.2021.797523",
        "paper_author": "Wang Y.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434"
    },
    {
        "paper_title": "Bioinspired Silk Fiber Spinning System via Automated Track-Drawing",
        "publication": "ACS Applied Bio Materials",
        "citied_by": "7",
        "cover_date": "2021-12-20",
        "Abstract": "Regenerated silk fibroin (SF) fiber is a multifaceted protein matrix suitable for engineering a wide variety of biological materials. Numerous artificial spinning systems have been developed to mimic the molecular structure and hierarchical properties found in native silks. Here, we show a bioinspired technique that can readily form nanofibers and induce both orientation and structure formation of crystalline β-sheet assemblies seen in natural silk. In this study, electrospun postdrawn SF nanofibers were fabricated using an automated track-drawing (TD) approach for the continuous production of highly aligned protein nanofibers. This one-step postdrawing process simulates the dominant pulling force seen in natural spinning. The mechanical performance of the postdrawn SF nanofibers with a draw ratio of 2 (DR2) via TD exhibited a 115% increase in Young’s modulus and an 80% increase in ultimate tensile strength, compared with the undrawn SF fibers after water treatment. It was also determined that the intermolecular β-sheet content in DR2 nanofibers increased by 75%. This contribution led to higher glass-transition and degradation temperatures. These biomimetic fibers with structural hierarchy and mechanical properties may be used to build high-performance load-bearing and directionally propagating structures relevant in biomaterial and sustainable material applications.",
        "DOI": "10.1021/acsabm.1c00630",
        "paper_author": "Jao D.",
        "affiliation_name": "Henry M. Rowan College of Engineering",
        "affiliation_city": "Glassboro",
        "affiliation_country": "United States",
        "affiliation_id": "60279446"
    },
    {
        "paper_title": "Microstructured optical fiber filled with glycerin for temperature measurement based on dispersive wave and soliton",
        "publication": "Optics Express",
        "citied_by": "8",
        "cover_date": "2021-12-20",
        "Abstract": "A nonlinear temperature sensor was proposed drawing on dispersive wave (DW) and soliton in an in-house made silica microstructured optical fiber (MOF). Glycerin with high thermo-optical coefficient was filled into the MOF air holes as the thermal medium. Using a 1050 nm femtosecond laser as the pump source, DW and soliton were experimentally and theoretically explored for temperature sensing by detecting their central wavelength shift of 3-dB bandwidth. The results showed that the higher the average pump power, the higher the temperature sensitivity of DW and soliton. When the DW blue-shifted relative to the soliton, the temperature sensitivity of DW was higher than that of soliton, and the experimental maximum values were 0.928 nm/°C(DW) and -0.923 nm/°C(soliton). Our work explored the nonlinear phenomenon for optical fiber-based sensing technology and verified that both DW and soliton can be used to realize temperature sensors of high sensitivity and good mechanical strength. The sensing characteristic difference of DW and soliton revealed in this work might provide a new way for solving the cross-sensitivity of dual-parameter sensing in biological engineering, disease detection and environmental monitoring without introducing extra structural complexity. Copy; 2021 Optical Society of America.",
        "DOI": "10.1364/OE.441576",
        "paper_author": "Cheng T.",
        "affiliation_name": "The State Key Laboratory of Synthetical Automation for Process Industries",
        "affiliation_city": "Shenyang",
        "affiliation_country": "China",
        "affiliation_id": "60119041"
    },
    {
        "paper_title": "Role of mesenchymal stem cells migration in bone injury repair",
        "publication": "Journal of Prevention and Treatment for Stomatological Diseases",
        "citied_by": "0",
        "cover_date": "2021-12-20",
        "Abstract": "Mesenchymal stem cells (MSCs) are capable of self-replication and multi-directional differentiation, which are very important for the development and reconstruction of mesenchymal tissue. Bone tissue damage repair involves the participation of various cells and molecules. The recovery of bone mass requires sufficiently many MSCs to migrate to the damaged site to perform the reconstruction function. The local inflammatory response at the injury site can recruit MSCs and promote new bone formation. Simultaneously, niche changes during the migration of MSCs will affect their biological performance and initiate the phase of directed differentiation. This article explores the relevant mechanisms that mediate the migration of MSCs in the process of bone injury repair, including the regulation of immune cells and chemotactic signaling molecules in the inflammatory response in the bone repair stage through signaling pathways such as BMP/Smads. Then, it summarizes the mechanism by which the high matrix stiffness upregulates the expression of the integrin and focal adhesions to promote the MSCs migration and osteogenic differentiation. Simultaneously, the migration ability of MSCs can be regulated through drugs or genetic modification to promote the bone injury repair. The improvement of MSCs migration ability can shorten the time of bone tissue damage repair and improve the bone quality. This article reviews the role of the MSCs migration ability in bone tissue injury repair to provide a reference for the application of MSCs with high migration ability in the fields of stem cell therapy for bone related diseases and bone tissue engineering.",
        "DOI": "10.12016/j.issn.2096-1456.2021.12.009",
        "paper_author": "Yan S.",
        "affiliation_name": "State Key Laboratory of Oral Disease",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60109922"
    },
    {
        "paper_title": "Shape design and flow field characteristics of a robotic fish imitating the head of a hammerhead",
        "publication": "Lixue Xuebao/Chinese Journal of Theoretical and Applied Mechanics",
        "citied_by": "4",
        "cover_date": "2021-12-18",
        "Abstract": "In recent years, the exploitation and utilization of marine resources have risen to a social research highlight. In this context, domestic and overseas scholars work to promote the study on many aspects of underwater vehicles. As an important part of the research, the hull shape design of the underwater vehicles has direct relation to their underwater hydrodynamic characteristics. A variety of fishes in nature have attracted extensive attention from researchers for their good hydraulic resistance performance. In order to design a hull shape of underwater vehicle with good hydrodynamic characteristics, this paper focuses on the study of Sphyrna with a winglike head which enables their nimble swimming in oceans. This paper took Sphyrna as the bionic object, analyzed the water resistance reduction effects of three species of Sphyrna by establishing models, selected the biological shape characteristics of hammerhead shark as the reference to design the characteristic outline curve of the hull. Furthermore, a kind of hull shape of underwater vehicle has been designed according to engineering practice. Ansys Mosaic Technology was applied to establish a 3D structured flow field mesh model, and a Fluent simulation of the model followed. Apart from that, the author compared it with the shapes of common wing-shaped hulls and rotational underwater vehicles, focusing on its resistance performance. The result of a simulation analysis shows that the Sphyrna bionic model demonstrates better hydrodynamic characteristics in a stationary flow field than those of the two kinds of common underwater vehicles. Additionally, this paper also designed a comparative experiment to explore the characteristics of the flow field around the Sphyrna bionic model, which is of great guiding significance for the study on reducing the interference of the vehicles to the surrounding flow field and improving the stealthiness of the vehicles, and also provides a new direction for the design of underwater vehicles.",
        "DOI": "10.6052/0459-1879-21-160",
        "paper_author": "Ma K.",
        "affiliation_name": "Hefei University of Technology",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60002836"
    },
    {
        "paper_title": "Engineering-geological and geoecological aspects of formation of dry dumps on hydrodumps",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "2",
        "cover_date": "2021-12-17",
        "Abstract": "The paper discusses the issues of increasing the dumping capacity of hydrodumps and their reclamation by filling them with dump embankments from relatively strong overburden. Without the implementation of this measure, the alluvial massifs are inaccessible for a long time for various mining and transport equipment due to the low bearing capacity of the rocks. The specifics of the formation of the composition, state and properties of rocks of alluvial massifs due to the development of fractionation and filtration consolidation processes are noted. The technology of dumping the surface of hydrodump by controlled deformation of the slopes of the first dump layer has been substantiated. A method has been developed for predicting the parameters of intrusion-replacement of alluvial rocks by bulk ones using numerical modeling of the FEM in the Euler formulation. The obtained mechanical properties and regularities of the deformation behavior of technogenic rocks were used to perform geomechanical calculations when justifying the stable parameters of the slopes of the formed natural-technical systems (NTS) \"hydrodump+dump\"and compaction of embankments to justify the mining-technical stage of reclamation. A geoecological assessment of the impact of the dump NTS on the natural environment has been carried out, which is expressed in the acquisition of land from circulation and the disruption of the natural landscape. The conditions for the formation of technogenic eluvium on the surface of the dump suitable for biological reclamation are considered.",
        "DOI": "10.1088/1755-1315/938/1/012007",
        "paper_author": "Kutepov Y.I.",
        "affiliation_name": "Saint Petersburg Mining University",
        "affiliation_city": "Saint Petersburg",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60029071"
    },
    {
        "paper_title": "An environmental engineering approach to wastewater treatment with bivalves in the coastal zone",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "0",
        "cover_date": "2021-12-17",
        "Abstract": "High tolerance to pollution and filtration capacity of some seston-eating bivalves and mussels of g. Mytilus first of all, principally determine mussel populations as a powerful natural biofilter. Both marine and freshwater mussels consume relatively large amounts of seston, feeding directly on the primary producers. Particles with contaminants extracted from ambient water during the filtration are accumulated in mussel pseudofaeces and faeces discharged after digestion. These specific particles of faeces and soft pseudofeaces become very suitable substrata for bacteria development with following contaminant destruction. Moreover, such biodeposits appeared to be the nutritious food for bottom detritophages, in particular of polychaetes and amphipods. Some fluid metabolites excreted by mussels, i.e. dissolved organic matter (DOM) have a pronounced biological activity to producers. In general, mussels possess high resistance to acute and chronic pollution stress, although their growth may slow down and even stops. In clean conditions food supply is the most important factor in determining activity and growth rate of mussels for northern environment. Mussel and some other aquaculture, as a relatively new application of environmental engineering is able to improve the recycling of nutrients from wastewater to bioproduction and greatly reduce the risk of environmental degradation in the coastal zone.",
        "DOI": "10.1088/1755-1315/938/1/012021",
        "paper_author": "Gudimov A.V.",
        "affiliation_name": "Murmansk Marine Biological Institute of the Russian Academy of Sciences",
        "affiliation_city": "Murmansk",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60096213"
    },
    {
        "paper_title": "Advances of terahertz technology in neuroscience: Current status and a future perspective",
        "publication": "iScience",
        "citied_by": "48",
        "cover_date": "2021-12-17",
        "Abstract": "Terahertz (THz) waves are ranged between microwave and infrared region in the electromagnetic spectrum. THz technology has been demonstrated promising potential for biomedical applications. Exploration of biological effects of THz waves has emerged as a critical new area in life sciences. It is critical to uncover the effects of THz waves on complex biological systems in order to lay out the framework for THz technology development and future applications. Specifically, THz radiation has been shown to affect the nervous system, including the structure of nerve cell membranes, genes expressions, and cytokines level. In this review, we primarily discuss the biological impacts and mechanisms of THz waves on the nervous system at the organisms, cellular, and molecular levels. The future application perspectives of THz technologies in neuroscience are also highlighted and proposed.",
        "DOI": "10.1016/j.isci.2021.103548",
        "paper_author": "Zhang J.",
        "affiliation_name": "Dalian Medical University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60005229"
    },
    {
        "paper_title": "Plant-Based Biosensors for Detecting CRISPR-Mediated Genome Engineering",
        "publication": "ACS Synthetic Biology",
        "citied_by": "10",
        "cover_date": "2021-12-17",
        "Abstract": "CRISPR/Cas has recently emerged as the most reliable system for genome engineering in various species. However, concerns about risks associated with the CRISPR/Cas technology are increasing on potential unintended DNA changes that might accidentally arise from CRISPR gene editing. Developing a system that can detect and report the presence of active CRISPR/Cas tools in biological systems is therefore very necessary. Here, we developed four real-time detection systems that can spontaneously indicate the presence of active CRISPR-Cas tools for genome editing and gene regulation including CRISPR/Cas9 nuclease, base editing, prime editing, and CRISPRa in plants. Using the fluorescence-based molecular biosensors, we demonstrated that the activities of CRISPR/Cas9 nuclease, base editing, prime editing, and CRISPRa can be effectively detected in transient expression via protoplast transformation and leaf infiltration (in Arabidopsis, poplar, and tobacco) and stable transformation in Arabidopsis.",
        "DOI": "10.1021/acssynbio.1c00455",
        "paper_author": "Yuan G.",
        "affiliation_name": "Oak Ridge National Laboratory",
        "affiliation_city": "Oak Ridge",
        "affiliation_country": "United States",
        "affiliation_id": "60024266"
    },
    {
        "paper_title": "Synthetic Biology Toolkits and Metabolic Engineering Applied in Corynebacterium glutamicum for Biomanufacturing",
        "publication": "ACS Synthetic Biology",
        "citied_by": "19",
        "cover_date": "2021-12-17",
        "Abstract": "Corynebacterium glutamicum is an important workhorse in industrial white biotechnology. It has been widely applied in the producing processes of amino acids, fuels, and diverse value-added chemicals. With the continuous disclosure of genetic regulation mechanisms, various strategies and technologies of synthetic biology were used to design and construct C. glutamicum cells for biomanufacturing and bioremediation. This study mainly aimed to summarize the design and construction strategies of C. glutamicum-engineered strains, which were based on genomic modification, synthetic biological device-assisted metabolic flux optimization, and directed evolution-based engineering. Then, taking two important bioproducts (N-acetylglucosamine and hyaluronic acid) as examples, the applications of C. glutamicum cell factories were introduced. Finally, we discussed the current challenges and future development trends of C. glutamicum-engineered strain construction.",
        "DOI": "10.1021/acssynbio.1c00355",
        "paper_author": "Chai M.",
        "affiliation_name": "Jiangnan University",
        "affiliation_city": "Wuxi",
        "affiliation_country": "China",
        "affiliation_id": "60007029"
    },
    {
        "paper_title": "Expansion of the Yeast Modular Cloning Toolkit for CRISPR-Based Applications, Genomic Integrations and Combinatorial Libraries",
        "publication": "ACS Synthetic Biology",
        "citied_by": "22",
        "cover_date": "2021-12-17",
        "Abstract": "Standardisation of genetic parts has become a topic of increasing interest over the last decades. The promise of simplifying molecular cloning procedures, while at the same time making them more predictable and reproducible has led to the design of several biological standards, one of which is modular cloning (MoClo). The Yeast MoClo toolkit provides a large library of characterised genetic parts combined with a comprehensive and flexible assembly strategy. Here we aimed to (1) simplify the adoption of the standard by providing a simple design tool for including new parts in the MoClo library, (2) characterise the toolkit further by demonstrating the impact of a BglII site in promoter parts on protein expression, and (3) expand the toolkit to enable efficient construction of gRNA arrays, marker-less integration cassettes and combinatorial libraries. These additions make the toolkit more applicable for common engineering tasks and will further promote its adoption in the yeast biological engineering community.",
        "DOI": "10.1021/acssynbio.1c00408",
        "paper_author": "Otto M.",
        "affiliation_name": "Chalmers University of Technology",
        "affiliation_city": "Gothenburg",
        "affiliation_country": "Sweden",
        "affiliation_id": "60000990"
    },
    {
        "paper_title": "Brightening up Biology: Advances in Luciferase Systems for in Vivo Imaging",
        "publication": "ACS Chemical Biology",
        "citied_by": "57",
        "cover_date": "2021-12-17",
        "Abstract": "Bioluminescence imaging (BLI) using luciferase reporters is an indispensable method for the noninvasive visualization of cell populations and biochemical events in living animals. BLI is widely performed with preclinical rodent models to understand disease processes and evaluate potential cell- or gene-based therapies. However, in vivo BLI remains constrained by low photon production and tissue attenuation, limiting the sensitivity of reporting from small numbers of cells in deep locations and hindering its application to larger animal models. This Review highlights recent advances in the development of luciferase systems that improve the sensitivity of in vivo BLI and discusses the expanding array of biological applications.",
        "DOI": "10.1021/acschembio.1c00549",
        "paper_author": "Liu S.",
        "affiliation_name": "Robarts Research Institute",
        "affiliation_city": "London",
        "affiliation_country": "Canada",
        "affiliation_id": "60029991"
    },
    {
        "paper_title": "Virtual Parts Repository 2: Model-Driven Design of Genetic Regulatory Circuits",
        "publication": "ACS Synthetic Biology",
        "citied_by": "4",
        "cover_date": "2021-12-17",
        "Abstract": "Engineering genetic regulatory circuits is key to the creation of biological applications that are responsive to environmental changes. Computational models can assist in understanding especially large and complex circuits for which manual analysis is infeasible, permitting a model-driven design process. However, there are still few tools that offer the ability to simulate the system under design. One of the reasons for this is the lack of accessible model repositories or libraries that cater to the modular composition of models of synthetic systems. Here, we present the second version of the Virtual Parts Repository, a framework to facilitate the model-driven design of genetic regulatory circuits, which provides reusable, modular, and composable models. The new framework is service-oriented, easier to use in computational workflows, and provides several new features and access methods. New features include supporting hierarchical designs via a graph-based repository or compatible remote repositories, enriching existing designs, and using designs provided in Synthetic Biology Open Language documents to derive system-scale and hierarchical Systems Biology Markup Language models. We also present a reaction-based modeling abstraction inspired by rule-based modeling techniques to facilitate scalable and modular modeling of complex and large designs. This modeling abstraction enhances the modeling capability of the framework, for example, to incorporate design patterns such as roadblocking, distributed deployment of genetic circuits using plasmids, and cellular resource dependency. The framework and the modeling abstraction presented in this paper allow computational design tools to take advantage of computational simulations and ultimately help facilitate more predictable applications.",
        "DOI": "10.1021/acssynbio.1c00157",
        "paper_author": "Mısırlı G.",
        "affiliation_name": "Keele University",
        "affiliation_city": "Keele",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60030210"
    },
    {
        "paper_title": "Optogenetic axon guidance in embryonic zebrafish",
        "publication": "STAR Protocols",
        "citied_by": "2",
        "cover_date": "2021-12-17",
        "Abstract": "Axons form the long-range connections of biological neuronal networks, which are built through the developmental process of axon guidance. Here, we describe a protocol to precisely and non-invasively control axonal growth trajectories in live zebrafish embryos using focal light activation of a photoactivatable Rac1. We outline techniques for photostimulation, time-lapse imaging, and immunohistochemistry. These approaches enable engineering of long-range axonal circuitry or repair of defective circuits in living zebrafish, despite a milieu of competing endogenous signals and repulsive barriers. For complete details on the use and execution of this protocol, please refer to Harris et al. (2020).",
        "DOI": "10.1016/j.xpro.2021.100947",
        "paper_author": "Harris J.M.",
        "affiliation_name": "Harvard Department of Stem Cell and Regenerative Biology",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60145297"
    },
    {
        "paper_title": "Zippered G-quadruplex/hemin DNAzyme: exceptional catalyst for universal bioanalytical applications",
        "publication": "Nucleic Acids Research",
        "citied_by": "42",
        "cover_date": "2021-12-16",
        "Abstract": "G-quadruplex (G4)/hemin DNAzyme is promising horseradish peroxidase (HRP)-mimic candidate in the biological field. However, its relatively unsatisfactory catalytic capacity limits the potential applications. Inspired by nature protease, we conducted a proximity-enhanced cofactor assembly strategy (PECA) to form an exceptional HRP mimic, namely zippered G4/hemin DNAzyme (Z-G4/H). The hybridization of short oligonucleotides induced proximity assembly of the DNA-grafted hemin (DGH) with the complementary G4 sequences (cG4s), mimicking the tight configuration of protease cofactor and apoenzyme. The detailed investigations of catalytic efficiency and mechanism verified the higher activity, more rapid catalytic rate and high environmental tolerance of the Z-G4/H than the classical G4/hemin DNAzymes (C-G4/H). Furthermore, a proximity recognition transducer has been developed based on the PECA for sensitive detection of gene rearrangement and imaging human epidermal growth factor receptor 2 protein (HER2) dimerization on cell surfaces. Our studies demonstrate the high efficiency of Z-G4/H and its universal application potential in clinical diagnostics and biomolecule interaction research. It also may offer significant opportunities and inspiration for the engineering of the protease-free mimic enzyme.",
        "DOI": "10.1093/nar/gkab1178",
        "paper_author": "Li J.",
        "affiliation_name": "Chongqing Medical University",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60020870"
    },
    {
        "paper_title": "Optogenetic Interrogation of Circuits Following Neurotrauma",
        "publication": "Frontiers in Molecular Neuroscience",
        "citied_by": "0",
        "cover_date": "2021-12-16",
        "Abstract": "Biological and engineering strategies for neural repair and recovery from neurotrauma continue to emerge at a rapid pace. Until recently, studies of the impact of neurotrauma and repair strategies on the reorganization of the central nervous system have focused on broadly defined circuits and pathways. Optogenetic modulation and recording methods now enable the interrogation of precisely defined neuronal populations in the brain and spinal cord, allowing unprecedented precision in electrophysiological and behavioral experiments. This mini-review summarizes the spectrum of light-based tools that are currently available to probe the properties and functions of well-defined neuronal subpopulations in the context of neurotrauma. In particular, we highlight the challenges to implement these tools in damaged and reorganizing tissues, and we discuss best practices to overcome these obstacles.",
        "DOI": "10.3389/fnmol.2021.803856",
        "paper_author": "Ceto S.",
        "affiliation_name": "École Polytechnique Fédérale de Lausanne",
        "affiliation_city": "Lausanne",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60028186"
    },
    {
        "paper_title": "Olfactory response of Trichogramma pretiosum (Hymenoptera: Trichogrammatidae) to volatiles induced by transgenic maize",
        "publication": "Bulletin of Entomological Research",
        "citied_by": "5",
        "cover_date": "2021-12-16",
        "Abstract": "Plants not only respond to herbivorous damage but adjust their defense system after egg deposition by pest insects. Thereby, parasitoids use oviposition-induced plant volatiles to locate their hosts. We investigated the olfactory behavioral responses of Trichogramma pretiosum Riley, 1879 (Hymenoptera: Trichogrammatidae) to volatile blends emitted by maize (Zea mays L.) with singular and stacked events after oviposition by Spodoptera frugiperda Smith, 1797 (Hymenoptera: Trichogrammatidae) moths. Additionally, we examined possible variations in gene expression and on oviposition-induced volatiles. We used a Y-tube olfactometer to test for the wasp responses to volatiles released by maize plants oviposited by S. frugiperda and not-oviposited plants. Using the real-time PCR technique (qRT-PCR), we analyzed the expression of lipoxygenase and three terpene synthases genes, which are enzymes involved in the synthesis of volatile compounds that attract parasitoids of S. frugiperda. Olfactometer tests showed that T. pretiosum is strongly attracted by volatiles from transgenic maize emitted by S. frugiperda oviposition (VTPRO 3, more than 75% individuals were attracted). The relative expression of genes TPS10, LOX e STC was higher in transgenic hybrids than in the conventional (isogenic line) hybrids. The GC-MS analysis revealed that some volatile compounds are released exclusively by transgenic maize. This study provides evidence that transgenic hybrids enhanced chemical cues under oviposition-induction and helped to increase T. pretiosum efficiency in S. frugiperda control. This finding shows that among the evaluated hybrids, genetically modified hybrids can improve the biological control programs, since they potentialize the egg parasitoid foraging, integrating pest management.",
        "DOI": "10.1017/S0007485321000341",
        "paper_author": "Nascimento P.T.",
        "affiliation_name": "Universidade Federal de Lavras",
        "affiliation_city": "Lavras",
        "affiliation_country": "Brazil",
        "affiliation_id": "60017841"
    },
    {
        "paper_title": "Progress in Research on Physiological Function and Mechanism of Oral Hyaluronic Acid",
        "publication": "Shipin Kexue/Food Science",
        "citied_by": "7",
        "cover_date": "2021-12-15",
        "Abstract": "Hyaluronic acid (HA) is widely found in various tissues of the human body and has various physiological functions such as moisturizing and lubricating effects, and it is involved in various biological processes such as wound healing, inflammatory response, and tissue repair. As an important medical and cosmetic material, HA has been widely used in medicine and cosmetic products. On January 7, 2021, the National Health Commission of China issued a document approving sodium hyaluronate as a “new food ingredient” that can be added in common foods. Oral administration is the most desirable, economical and convenient way of drug delivery, and there is high compliance with it. In this paper, we review representative published research findings on oral HA, with focuses on its absorption, distribution and metabolic pathways in the body, as well as its protective functions on different tissues and organs, which when combined with pharmacological and toxicological studies may provide a scientific basis for the development and application of oral HA formulations and provide improved knowledge of oral HA.",
        "DOI": "10.7506/spkx1002-6630-20210729-347",
        "paper_author": "Wang Z.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278"
    },
    {
        "paper_title": "Influence of humic substances on the landfill leachate biodegradability with a focus on temporal seasonality",
        "publication": "Water Science and Technology",
        "citied_by": "1",
        "cover_date": "2021-12-15",
        "Abstract": "The high resilience to biological treatments from the landfill leachate is generally associated with the presence of humic substances (HS). The brown color characteristic of this effluent is also related to these substances. Landfill leachate with low biodegradability can make biological treatments unfeasible, which can drive up the cost for the treatment of large leachate volumes. In this context, this research aimed to characterize the leachate in different seasonal periods, and verify the influence of HS species on the biodegradability of the effluent to assist in the selection of adequate treatment techniques. The HS quantification was performed using the modified Lowry method and speciation through fractionation according to the molar masses of the HS species. The tropical regions can be the precursor for the rapid stabilization of biodegradable organic matter. The warmer climate contributed to a reduced BOD/COD ratio (0.03) and the predominance of compounds of lower mass (e.g.: fulvic acids). The tests showed an HS concentration of 26.9% of the total COD in the raw leachate in the rainy season, which increased to 37.3% in the dry season. Approximately 70% of HS species refer to fulvic acids, a fraction identified as having the highest biologic treatment resilience.",
        "DOI": "10.2166/wst.2021.499",
        "paper_author": "Moravia W.G.",
        "affiliation_name": "Federal Center of Technological Education of Minas Gerais",
        "affiliation_city": "Belo Horizonte",
        "affiliation_country": "Brazil",
        "affiliation_id": "112637850"
    },
    {
        "paper_title": "Cognitive Testing of an Electronic Consent Platform: Researcher Perspectives",
        "publication": "Studies in Health Technology and Informatics",
        "citied_by": "2",
        "cover_date": "2021-12-15",
        "Abstract": "This study focuses on feedback from domain experts to assess usability and acceptance of the E-Consent electronic consent platform. Quantitative and qualitative data were captured throughout the usability inspection, which was structured around a cognitive walkthrough with heuristics evaluation. Additional surveys measured biobanking knowledge and attitudes and familiarity with informed consent. A semi-structured qualitative interview captured open-ended feedback. 23 researchers of various ages and job titles were included for analysis. The System Usability Scale (SUS) provided a standardized reference for usability and satisfaction, and the mean result of 86.7 corresponds with an 'above average' usability rating in the >90th percentile. Overall, participants believe that electronic consenting using this platform will be faster than previous workflows while enhancing patient understanding, and human rapport is still a key component of the consent process. Expert review has provided valuable insight and actionable information that will be used to further enhance this maturing platform.",
        "DOI": "10.3233/SHTI210772",
        "paper_author": "Robins D.",
        "affiliation_name": "Icahn School of Medicine at Mount Sinai",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60012981"
    },
    {
        "paper_title": "Vaccines 2020: The era of the digital vaccine is here",
        "publication": "Science Translational Medicine",
        "citied_by": "15",
        "cover_date": "2021-12-15",
        "Abstract": "NA",
        "DOI": "10.1126/scitranslmed.abm3249",
        "paper_author": "Pizza M.",
        "affiliation_name": "GlaxoSmithKline SpA",
        "affiliation_city": "Verona",
        "affiliation_country": "Italy",
        "affiliation_id": "60111447"
    },
    {
        "paper_title": "Silicon Nitride, a Bioceramic for Bone Tissue Engineering: A Reinforced Cryogel System With Antibiofilm and Osteogenic Effects",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "18",
        "cover_date": "2021-12-15",
        "Abstract": "Silicon nitride (SiN [Si3N4]) is a promising bioceramic for use in a wide variety of orthopedic applications. Over the past decades, it has been mainly used in industrial applications, such as space shuttle engines, but not in the medical field due to scarce data on the biological effects of SiN. More recently, it has been increasingly identified as an emerging material for dental and orthopedic implant applications. Although a few reports about the antibacterial properties and osteoconductivity of SiN have been published to date, there have been limited studies of SiN-based scaffolds for bone tissue engineering. Here, we developed a silicon nitride reinforced gelatin/chitosan cryogel system (SiN-GC) by loading silicon nitride microparticles into a gelatin/chitosan cryogel (GC), with the aim of producing a biomimetic scaffold with antibiofilm and osteogenic properties. In this scaffold system, the GC component provides a hydrophilic and macroporous environment for cells, while the SiN component not only provides antibacterial properties and osteoconductivity but also increases the mechanical stiffness of the scaffold. This provides enhanced mechanical support for the defect area and a better osteogenic environment. First, we analyzed the scaffold characteristics of SiN-GC with different SiN concentrations, followed by evaluation of its apatite-forming capacity in simulated body fluid and protein adsorption capacity. We further confirmed an antibiofilm effect of SiN-GC against Escherichia coli (E. coli) and Staphylococcus aureus (S. aureus) as well as enhanced cell proliferation, mineralization, and osteogenic gene upregulation for MC3T3-E1 pre-osteoblast cells. Finally, we developed a bioreactor to culture cell-laden scaffolds under cyclic compressive loading to mimic physiological conditions and were able to demonstrate improved mineralization and osteogenesis from SiN-GC. Overall, we confirmed the antibiofilm and osteogenic effect of a silicon nitride reinforced cryogel system, and the results indicate that silicon nitride as a biomaterial system component has a promising potential to be developed further for bone tissue engineering applications.",
        "DOI": "10.3389/fbioe.2021.794586",
        "paper_author": "Lee S.S.",
        "affiliation_name": "ETH Zürich",
        "affiliation_city": "Zurich",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60025858"
    },
    {
        "paper_title": "Biotechnological approaches to develop nitrogen-fixing cereals: A review",
        "publication": "Spanish Journal of Agricultural Research",
        "citied_by": "3",
        "cover_date": "2021-12-15",
        "Abstract": "Agricultural yields are often limited by nitrogen (N) availability, especially in countries of the developing world, whereas in industrialized nations the application of chemical N fertilizers has reached unsustainable levels that have resulted in severe environmental consequences. Finding alternatives to inorganic fertilizers is critical for sustainable and secure food production. Although gaseous nitrogen (N2) is abundant in the atmosphere, it cannot be assimilated by most living organisms. Only a selected group of microorganisms termed diazotrophs, have evolved the ability to reduce N2 to generate NH3 in a process known as biological nitrogen fixation (BNF) catalysed by nitrogenase, an oxygen-sensitive enzyme complex. This ability presents an opportunity to improve the nutrition of crop plants, through the introduction into cereal crops of either the N fixing bacteria or the nitrogenase enzyme responsible for N fixation. This review explores three potential approaches to obtain N-fixing cereals: (a) engineering the nitrogenase enzyme to function in plant cells; (b) engineering the legume symbiosis into cereals; and (c) engineering cereals with the capability to associate with N-fixing bacteria.",
        "DOI": "10.5424/sjar/2021194-18346",
        "paper_author": "Boujenna A.",
        "affiliation_name": "Université Abdelmalek Essaadi",
        "affiliation_city": "Tetouan",
        "affiliation_country": "Morocco",
        "affiliation_id": "60025506"
    },
    {
        "paper_title": "Multifunctional Metal-Organic Framework Exoskeletons Protect Biohybrid Sperm Microrobots for Active Drug Delivery from the Surrounding Threats",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "23",
        "cover_date": "2021-12-15",
        "Abstract": "Utilizing spermatozoa as the engine unit of robotic systems at a microscale has brought revolutionized inspirations and strategies to the biomedical community. However, the motility of sperms is impaired by the surrounding threats. For example, the antisperm antibody (AsA) can specifically bind with surface antigens on the sperm membrane and adversely affect their propulsion, hindering the operation of sperm-based microrobots in practical environments. In the present work, we report a biohybrid sperm microrobot by encapsulating sperm cells within metal-organic frameworks (MOFs) and zeolitic imidazolate framework-8 (ZIF-8) nanoparticles (NPs) (ZIFSpermbot), capable of active drug delivery and cytoprotection from the biological threats of AsA. ZIF-8 NPs can be facilely coated on the sperm membrane through complexation with tannic acid. Such cell surface engineering has a negligible impact on sperm motility under optimized conditions. The selective permeability of the resulting porous ZIF-8 wrappings protects ZIFSpermbots from the specific binding of AsA, enabling the preservation of intrinsic propulsion of the sperm engine. Besides, ZIF-8 wrappings sustainably release zinc ions and attenuate the oxidative damage generated in sperm cells, allowing the maintenance of sperm movement. Combining the effective protection of sperm propulsion with the drug-loading capacity of ZIF-8 NPs provides new applicability to ZIFSpermbots in risky surroundings with AsA, exhibiting rapid migration in a microfluidic device for active drug delivery with enhanced therapeutic efficacy due to their retained effective propulsion. Imparting bioengine-based microrobots with multifunctional wrappings holds great promise for designing adaptive cell robots that endure harsh environments toward locally extended and diverse operations, facilitating their use in practical and clinical applications.",
        "DOI": "10.1021/acsami.1c18597",
        "paper_author": "Chen Q.",
        "affiliation_name": "Shantou University Medical College",
        "affiliation_city": "Shantou",
        "affiliation_country": "China",
        "affiliation_id": "60010687"
    },
    {
        "paper_title": "Erythropoietin, as a biological macromolecule in modification of tissue engineered constructs: A review",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "4",
        "cover_date": "2021-12-15",
        "Abstract": "In recent years, tissue engineering has emerged as a promising approach to address limitations of organ transplantation. The ultimate goal of tissue engineering is to provide scaffolds that closely mimic the physicochemical and biological cues of native tissues' extracellular matrix. In this endeavor, new generation of scaffolds have been designed that utilize the incorporation of signaling molecules in order to improve cell recruitment, enhance angiogenesis, exert healing activities, and increase the engraftment of the scaffolds. Among different signaling molecules, the role of erythropoietin (EPO) in regenerative medicine is increasingly being appreciated. It is a biological macromolecule which can prevent programed cell death, modulate inflammation, induce cell proliferation, and provide tissue protection in different disease models. In this review, we have outlined and critically analyzed different techniques of scaffolds' modification with EPO or EPO-loaded nanoparticles. We have also explored different strategies for the incorporation of EPO into scaffolds. Non-hematopoietic functions of EPO have also been discussed. Finalizing with detailed discussion surrounding the applications, challenges, and future perspectives of EPO-modified scaffolds in regenerative medicine.",
        "DOI": "10.1016/j.ijbiomac.2021.11.065",
        "paper_author": "Wu X.y.",
        "affiliation_name": "Jiangsu Province Hospital of TCM",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60082195"
    },
    {
        "paper_title": "Green and efficient in-situ biosynthesis of antioxidant and antibacterial bacterial cellulose using wine pomace",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "21",
        "cover_date": "2021-12-15",
        "Abstract": "Biologically active bacterial cellulose (BC) was efficiently synthesized in situ using wine pomace and its hydrolysate. The structural and biomechanical properties together with the biological functions of the BC were investigated. Functional BC from wine pomace and its enzymatic hydrolysate were of high purity and had higher crystallinity indexes (90.61% and 89.88%, respectively) than that from HS medium (82.26%). FTIR results proved the in-situ bindings of polyphenols to the functionalized BC. Compared to BC from HS medium, wine pomace-based BC had more densely packed ultrafine fibrils, higher diameter range distributions of fiber ribbon, but lower thermal decomposition temperatures, as revealed by the SEM micrographs and DSC data. Meanwhile, wine pomace-based BC exhibited higher loads in tensile strength and higher hardness (4.95 ± 0.31 N and 5.13 ± 0.63 N, respectively) than BC in HS medium (3.43 ± 0.14 N). Furthermore, BC synthesized from wine pomace hydrolysate exhibited a slower release rate of phenolic compounds, and possessed more antioxidant activities and better bacteriostatic effects than BC from wine pomace. These results demonstrate that BC synthesized in situ from wine pomace (especially from enzymatic hydrolysate) is a promising biomolecule with a potential application in wound dressing, tissue engineering, and other biomedical fields.",
        "DOI": "10.1016/j.ijbiomac.2021.11.049",
        "paper_author": "Li Z.y.",
        "affiliation_name": "Nanjing Agricultural University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60024045"
    },
    {
        "paper_title": "Design and study of in vivo bone formation characteristics of biodegradable bioceramic",
        "publication": "Materials and Design",
        "citied_by": "11",
        "cover_date": "2021-12-15",
        "Abstract": "In this paper, two groups of titanium alloy and biodegradable ceramic scaffolds with the same pore structure were designed, and the cell proliferation and bone tissue growth of the two groups were studied by cell proliferation experiment and animal experiment. The results show that the biological properties of biodegradable ceramic scaffolds are obviously better than those of titanium alloy scaffolds. The cell proliferation experiment in vitro showed that with the passage of time, the number of cell proliferation and the activity of ALP in biodegradable ceramic scaffolds were higher than those in titanium alloy scaffolds. The results of animal implantation experiments show that the amount of bone tissue in the ceramic scaffold is several times than that of titanium alloy in the same implantation time, indicating that the ceramic scaffold has great research and application potential in the field of bone tissue engineering.",
        "DOI": "10.1016/j.matdes.2021.110242",
        "paper_author": "Wang S.",
        "affiliation_name": "Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60016521"
    },
    {
        "paper_title": "On the feasibility of spray-dried eudragit-trehalose microparticles for enteric drug delivery",
        "publication": "International Journal of Pharmaceutics",
        "citied_by": "2",
        "cover_date": "2021-12-15",
        "Abstract": "Enteric infections have long constituted a silent epidemic responsible for hundreds of thousands of deaths around the world every year. Because of the global rise in antibiotic-resistant bacteria and the slow development of new small-molecule antibiotics, alternatives such as bacteriophage therapy have become a much sought-after option in the treatment of enteric infections. However, the administration of therapeutics through the oral route to target gastrointestinal infections poses challenges to dosage formulation because these active ingredients, particularly relatively fragile biological entities, require protection from the stomach's harsh acids. Encapsulation of the therapeutics within a pH-responsive coating capable of surviving low pH conditions has the potential to provide such protection. In this study, we developed a spray-dried powder vehicle capable of withstanding low pH comparable to stomach conditions, using Eudragit® S100 as a protective particle coating and trehalose as a stabilizing excipient for a possible active component. A particle formation model and a monodisperse droplet chain technique were initially used to study the formation process of Eudragit-trehalose composite microparticles at different ratios and in different ratios of water–ethanol solvent, which showed formation of particles with Eudragit shells varying in thickness from 0.13 μm to 0.75 μm. Promising Eudragit-trehalose formulations were subsequently spray-dried and their survival in acidic and alkaline environments studied using a new shadowgraphic imaging method. The results demonstrated that Eudragit was capable of creating a protective shell in the particles irrespective of the type of solvent used to prepare the formulations. The trehalose cores of particles with higher than 5% w/w of Eudragit remained protected after one hour of exposure at pH 2, indicating the potential of Eudragit-trehalose formulations for enteric delivery of drugs.",
        "DOI": "10.1016/j.ijpharm.2021.121264",
        "paper_author": "Bin Karim S.",
        "affiliation_name": "University of Alberta",
        "affiliation_city": "Edmonton",
        "affiliation_country": "Canada",
        "affiliation_id": "60030835"
    },
    {
        "paper_title": "Guar (Cyamopsis tetragonoloba L.) plant gum: From biological applications to advanced nanomedicine",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "52",
        "cover_date": "2021-12-15",
        "Abstract": "Natural polymers are an efficient class of eco-friendly and biodegradable polymers, because they are readily available, come from natural sources, inexpensive and can be chemically modified with the correct reagents. Guar gum (GG) is a natural polymer with great potential to be used in pharmaceutical formulations due to its unique composition and lack of toxicity. GG can be designed to suit the needs of the biological and medical engineering sectors. In the development of innovative drug delivery systems, GG is commonly utilized as a rate-controlling excipient. In this review, different properties of GG including chemical composition, extraction methods and its usefulness in diabetes, cholesterol lowering, weight control, tablet formulations as well as its food application were discussed. The other purpose of this study is to evaluate potential use of GG and its derivatives for advanced nanomedicine such as drug delivery, tissue engineering and nanosensing. It should be noted that some applicable patents in medical area have also been included in the rest of this survey to extend knowledge about guar gum and its polymeric nature.",
        "DOI": "10.1016/j.ijbiomac.2021.11.028",
        "paper_author": "Dehghani Soltani M.",
        "affiliation_name": "Yazd University",
        "affiliation_city": "Yazd",
        "affiliation_country": "Iran",
        "affiliation_id": "60000159"
    },
    {
        "paper_title": "Rubber tree seed utilization for green energy, revenue generation and sustainable development– A comprehensive review",
        "publication": "Industrial Crops and Products",
        "citied_by": "19",
        "cover_date": "2021-12-15",
        "Abstract": "With the growing awareness and sensitivity towards green energy, it makes an excellent opportunity to promote rubber trees [Hevea brasiliensis (Willd. ex A.Juss.) Muell.Arg.] as an alternate source for sustainable development and cleaner production. In recent years, rubber tree has extensively been used only for its latex. The most neglected yet abundant by-product of the rubber tree is the seed biomass. The rubber tree seeds can yield a constant source of biomass which would need a little care, financial investment, and time. This biomass efficiently can be used in several small-scale or medium-scale industries, and one of the positive aspects of using this biomass is its zero or neutral CO2 emission. A little effort, if given into its resource utilization, can go a long way in augmenting the income and improving the livelihood of the rubber tree cultivators, as well as help to develop a cleaner and sustainable environment. Instead of using the seeds as mere propagating material, these can otherwise be used in organic farming. Rubber tree seeds being protein-rich, the seed cakes and seed meal after the oil extraction can act as an abundant source of organic manure and a potential natural fertilizer. The seeds have an intrinsic property of acting as herbicides and fungicides. The seed cake, owing to its nutritional value, can be used as cattle and poultry feed. The problem of food scarcity is a major contributing factor to malnutrition in the underprivileged sections of society. The rubber tree seeds can play an influential role by supplementing protein and as an alternate source of food, thereby helping the developing nations combat the food crisis. The few available reports regarding rubber tree seeds consumed by the tribes inhabiting the Amazon basin are worth mentioning. Rubber tree seeds contain cyanogenic compounds, and extensive research is needed to develop a methodology to eliminate such toxic compounds, which can help humanity overcome the challenges of food shortages in underdeveloped and developing nations. In today's COVID-19 pandemic scenario, there is a multiple-fold increase in demand for soaps and handwash for personal hygiene. This demand shall continue to grow in the coming days, and the inclusion of rubber tree seed oil (RSO) in producing soaps may ease the burden on vegetable oil, which can be used for human consumption. Rubber tree seed oil can also be used effectively in the cosmetics industry. Several encouraging reports support the idea of the inclusion of RSO in cosmetics to minimize the detrimental effects of harmful chemicals on the human body. The use of rubber tree seed oil as an alternate energy source cannot be downplayed. Rubber tree seed oil not only has a high ability to become an excellent source of biofuel but also has enormous potential in other industrial sectors. Products derived from RSO are used in several industrial sectors, including the paint industry, soap industry, and engineering sector as core binders. All products obtained from rubber trees can clearly show a path for cleaner green energy production and help to establish a rapport between nature and livelihood generation. The present review investigates the overall possibilities of rubber tree seed utilization as an alternate source of biomass and its venture into the various fields of biological utility and possible means of revenue generation in developing countries.",
        "DOI": "10.1016/j.indcrop.2021.114186",
        "paper_author": "Bhattacharjee A.",
        "affiliation_name": "Tripura University",
        "affiliation_city": "Agartala",
        "affiliation_country": "India",
        "affiliation_id": "60018446"
    },
    {
        "paper_title": "Development of novel hyaluronic acid/human-like collagen bio-composite membranes: A facile “surface modification-assembly” approach",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "8",
        "cover_date": "2021-12-15",
        "Abstract": "The merits of hyaluronic acid (HA) as a representative biological carbohydrate polymers especially in bioactivity and tailorability makes it ideal building block for the engineering of tissue engineering scaffolds. HA-based bio-composites integrate the characteristics of multi-component materials, possessing versatility and further improving the therapeutic efficacy. Human like collagen (HLC), which is hydrophilic, biomimetic, and bio-safe, with human tissue-derived collagen biofunction, has attracted extensive attention worldwide. Herein, we developed a novel method for HA/HLC bio-composite membranes preparation, comprising one-step surface modification-assembly process by which the HLC self-assembles are simultaneously loaded on the oxidized-modified HA (oxi-HA) from the surface/interface micro-scale. Comprehensive material characterizations and in vitro/in vivo biostudies proved that the HLC/oxi-HA composite membranes exhibited significantly enhanced biological activity, hemostatic performances, and wound healing properties compared to that of the pristine HA. The results of this study highlight the great potential of the prepared biomimetic HLC/oxi-HA bio-composites as a new generation of multifunctional HA-based wound-healing materials.",
        "DOI": "10.1016/j.ijbiomac.2021.10.091",
        "paper_author": "Luo X.",
        "affiliation_name": "Shaanxi University of Science and Technology",
        "affiliation_city": "Xinyang",
        "affiliation_country": "China",
        "affiliation_id": "60069726"
    },
    {
        "paper_title": "Growth factors, as biological macromolecules in bioactivity enhancing of electrospun wound dressings for diabetic wound healing: A review",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "46",
        "cover_date": "2021-12-15",
        "Abstract": "Impaired wound healing is of the most conspicuous characteristics of diabetic mellitus. Reduced blood flow, chronic inflammatory reactions, infection, endothelial dysfunction, elevated levels of reactive oxygen species, and metabolic disorders cause wounds to heal more slowly in these patients. Previous studies have reported useful impacts of growth factors in management of such wounds. However, due to their short half-life and low stability, a suitable delivery platform with sustained release profile may boost their healing potential. Controlled and localized delivery of growth factors via electrospun fibers have been extensively explored in previous studies. The electrospinning method; although not new, has turned out to be extremely effective for the preparation of delivery carriers for growth factors. Due to their structural resemblance to native tissues' extracellular matrix, high encapsulation efficacy, tunability, and high surface to volume ratio, electrospun scaffolds have gained significant attention in drug delivery and tissue engineering. In the current review, careful integration of current research regarding the applications of growth factors' delivery through electrospun fibers in diabetic wounds healing has been done. This review will not only give an insight into the current updates, but will also highlights the future perspectives and challenges.",
        "DOI": "10.1016/j.ijbiomac.2021.09.210",
        "paper_author": "Zhang Y.",
        "affiliation_name": "Chengdu University of Traditional Chinese Medicine",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60000196"
    },
    {
        "paper_title": "A review of mechanochromic polymers and composites: From material design strategy to advanced electronics application",
        "publication": "Composites Part B: Engineering",
        "citied_by": "57",
        "cover_date": "2021-12-15",
        "Abstract": "The design and fabrication of functional polymers with fascinating mechanochromic properties are of profound significance to their prospective applications, such as wearable electronic skin, smart screen, artificial muscle, encryption, and anti-counterfeiting devices. Drawn inspiration from color-changing properties of biological skins, numerous approaches, from molecular synthesis to special biomimicry engineering, have been employed to construct flexible stimuli-responsive materials with superior mechano-stimulated optical change performance. In this review, we highlight and discuss recent important progress in material structure design strategy for mechanochromic polymers and composites. These optical variations primarily originate from the force-induced molecular structure change, disruption of intermolecular interaction, evolution of physical photonic and morphological structure. Moreover, according to their respective structure-property relationships, their multifunctional applications in advanced electronics field are also demonstrated with representative examples. Furthermore, a summary and perspective regarding the existing challenges in this field will be discussed, aiming to provide valuable insight into their future developments. We believe this feature review will bring helpful guidance to readers for choosing effective chromogenic material design method to satisfy different application requirements.",
        "DOI": "10.1016/j.compositesb.2021.109434",
        "paper_author": "Guo Q.",
        "affiliation_name": "Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60016521"
    },
    {
        "paper_title": "Predicting the mechanical properties of biopolymer gels using neural networks trained on discrete fiber network data",
        "publication": "Computer Methods in Applied Mechanics and Engineering",
        "citied_by": "25",
        "cover_date": "2021-12-15",
        "Abstract": "Biopolymer gels, such as those made out of fibrin or collagen, are widely used in tissue engineering applications and biomedical research. Moreover, fibrin naturally assembles into gels in vivo during wound healing and thrombus formation. The macroscale properties of fibrin and other biopolymer gels are dictated by the response of a microscale fiber network. Hence, accurate description of biopolymer gels can be achieved using representative volume elements (RVE) that explicitly model the discrete fiber networks of the microscale. These RVE models, however, cannot be efficiently used to model the macroscale due to the challenges and computational demands of multiscale coupling. Here, we propose the use of an artificial, fully connected neural network (FCNN) to efficiently capture the behavior of the RVE models. The FCNN was trained on 1100 fiber networks subjected to 121 biaxial deformations. The stress data from the RVE, together with the total energy on the fibers and the condition of incompressibility of the surrounding matrix, were used to determine the derivatives of an unknown strain energy function with respect to the deformation invariants. During training, the loss function was modified to ensure convexity of the strain energy function and symmetry of its Hessian. A general FCNN model was coded into a user material subroutine (UMAT) in the software Abaqus. The UMAT implementation takes in the structure and parameters of an arbitrary FCNN as material parameters from the input file. The inputs to the FCNN include the first two isochoric invariants of the deformation. The FCNN outputs the derivatives of the strain energy with respect to the isochoric invariants. In this work, the FCNN trained on the discrete fiber network data was used in finite element simulations of biopolymer gels using our UMAT. We anticipate that this work will enable further integration of machine learning tools with computational mechanics. It will also improve computational modeling of biological materials characterized by a multiscale structure.",
        "DOI": "10.1016/j.cma.2021.114160",
        "paper_author": "Leng Y.",
        "affiliation_name": "Weldon School of Biomedical Engineering",
        "affiliation_city": "West Lafayette",
        "affiliation_country": "United States",
        "affiliation_id": "60015912"
    },
    {
        "paper_title": "Facet-dependent photoactivity of Mn<inf>3</inf>O<inf>4</inf>/BiOCl for naproxen detoxication: Strengthening effect of Mn valence cycle",
        "publication": "Applied Catalysis B: Environmental",
        "citied_by": "26",
        "cover_date": "2021-12-15",
        "Abstract": "Utilizing photocatalysis to degrade pollution is emerging as a promising way to treat wastewater, but is challenged by low efficiency and scanty toxicity cognition. In this work, Mn3O4/BiOCl based crystal plane engineering systems are applied for naproxen (NPX) degradation, and Mn3O4/BiOCl010 displayed better degradation rate, which is 16 and 8 times than that of the Mn3O4/BiOCl001 and BiOCl010. According to the degradation pathway analysis and biological toxicity experiments, the toxicity of the degradation solution increased first and then decreased, which may be caused by the mineralization of NPX and more toxic intermediates. Affected by the distinct internal charge transfer directions of the two crystal planes of BiOCl, Mn3O4/BiOCl010 heterojunction system has a faster charge transform than that of Mn3O4/BiOCl001. Moreover, the valence cycle of Mn can further accelerate the charge transfer, which can also provide a powerful driving force for NPX elimination.",
        "DOI": "10.1016/j.apcatb.2021.120672",
        "paper_author": "Jiang R.",
        "affiliation_name": "Hohai University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60010851"
    },
    {
        "paper_title": "A DNA-derived phage nose using machine learning and artificial neural processing for diagnosing lung cancer",
        "publication": "Biosensors and Bioelectronics",
        "citied_by": "27",
        "cover_date": "2021-12-15",
        "Abstract": "There is a growing interest in electronic nose-based diagnostic systems that are fast and portable. However, existing technologies are suitable only for operation in the laboratory, making them difficult to apply in a rapid, non-face-to-face, and field-suitable manner. Here, we demonstrate a DNA-derived phage nose (D2pNose) as a portable respiratory disease diagnosis system requiring no pretreatment. D2pNose was produced based on phage colour films implanted with DNA sequences from mammalian olfactory receptor cells, and as a result, it possesses the comprehensive reactivity of these cells. The manipulated surface chemistry of the genetically engineered phages was verified through a correlation analysis between the calculated and the experimentally measured reactivity. Breaths from 31 healthy subjects and 31 lung cancer patients were collected and exposed to D2pNose without pretreatment. With the help of deep learning and neural pattern separation, D2pNose has achieved a diagnostic success rate of over 75% and a classification success rate of over 86% for lung cancer based on raw human breath. Based on these results, D2pNose can be expected to be directly applicable to other respiratory diseases.",
        "DOI": "10.1016/j.bios.2021.113567",
        "paper_author": "Lee J.M.",
        "affiliation_name": "Pusan National University",
        "affiliation_city": "Busan",
        "affiliation_country": "South Korea",
        "affiliation_id": "60008783"
    },
    {
        "paper_title": "Metal-phenolic networks as a novel filler to advance multi-functional immunomodulatory biocomposites",
        "publication": "Chemical Engineering Journal",
        "citied_by": "39",
        "cover_date": "2021-12-15",
        "Abstract": "Here, we exploited the potential applications of metal-phenolic networks (MPNs) as a novel type of filler for next-generation multi-functional immunomodulatory biocomposites. Tannic acid (TA) and Mg2+ were selected as the model phenolic ligand and metal ion, respectively, and used to assemble MPN particles, and a TA-Mg/polycaprolactone (PCL) composite nanofibrous scaffold was then prepared by blending electrospinning. Measurements of the resultant composite scaffold verified strong hydrogen-bonding interactions between TA motifs and PCL chains and the good dispersity of MPN particles throughout the substrate. Due to the pH-responsive disassembly kinetics of MPN complexes, both TA and Mg2+ displayed pH-responsive sustained release behaviour, thus eliciting significant biological effects. Specifically, TA and Mg2+ synergistically generated an anti-inflammatory micro-environment, which was beneficial for osteogenesis, and Mg2+ directly stimulated the osteogenic differentiation of stem cells. Consequently, the composite membrane significantly enhanced in vivo osteogenic performance when used as a barrier membrane to guide bone tissue regeneration. One unique advantage of this filler is that it combines the functions of both metal ions and phenolic ligands. By selecting different phenolic ligands and metal ions, a series of novel MPN-based fillers with unique functions could be easily obtained, suggesting that this system has a wide range of potential applications for next-generation multi-functional biocomposites.",
        "DOI": "10.1016/j.cej.2021.131825",
        "paper_author": "Gao X.",
        "affiliation_name": "West China School/Hospital of Stomatology Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60110206"
    },
    {
        "paper_title": "Computer-aided study of the impedance dispersion of biological tissues",
        "publication": "Journal of Physics: Conference Series",
        "citied_by": "1",
        "cover_date": "2021-12-14",
        "Abstract": "The article considers the development of a software and hardware system to study the impedance dispersion of biological fluids and tissues using an alternating signal generated and received by SensorDaq and LabView software. The design and development of the impedance measurement software and hardware system are described in detail. The impedance and capacitance values of the biological object were obtained when scanning at various frequencies and temperatures corresponding to different object conditions. The results of the system testing are shown, and the conclusions on the interaction nature of biological tissue and an external current are drawn.",
        "DOI": "10.1088/1742-6596/2142/1/012012",
        "paper_author": "Malikov V.N.",
        "affiliation_name": "Altai State University, Barnaul",
        "affiliation_city": "Barnaul",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60020346"
    },
    {
        "paper_title": "Reduced Pressure Drop in Viscoelastic Polydimethylsiloxane Wall Channels",
        "publication": "Langmuir",
        "citied_by": "2",
        "cover_date": "2021-12-14",
        "Abstract": "Polydimethylsiloxane (PDMS) is an important viscoelastic material that finds applications in a large number of engineering systems, particularly lab-on-chip microfluidic devices built with a flexible substrate. Channels made of PDMS, used for transporting analytes, are integral to these applications. The PDMS viscoelastic nature can induce additional hydrodynamic contributions at the soft wall/fluid interface compared to rigid walls. In this research, we investigated the pressure drop within PDMS channels bounded by rigid tubes (cellulose tubes). The bulging effect of the PDMS was limited by the rigid tubes under flowing fluids. The PDMS viscoelasticity was modulated by changing the ratio of the base to the cross-linker from 10:1 to 35:1. We observed that the pressure drop of the flowing fluids within the channel decreased with the increased loss tangent of the PDMS in the examined laminar regime [Reynolds number (Re) ∼23-58.6 for water and Re ∼0.69-8.69 for glycerol solution]. The elastic PDMS 10:1 wall channels followed the classical Hagen Poiseuille's equation, but the PDMS walls with lower cross-linker concentrations and thicker walls decreased pressure drops. The friction factor (f) for the PDMS channels with the two working fluids could be approximated as f = 47/Re. We provide a correlation between the pressure drop and PDMS viscoelasticity based on experimental findings. In the correlation, the loss tangent predominates; the larger the loss tangent, the smaller is the pressure drop. The research findings appear to be unexpected if only considering the energy dissipation of viscoelastic PDMS walls. We attributed the reduction in the pressure drop to a lubricating effect of the viscoelastic PDMS walls in the presence of the working fluids. Our results reveal the importance of the subtle diffusion of the residual oligomers and water from the bulk to the soft wall/fluid interface for the observed pressure drop in soft wall channels.",
        "DOI": "10.1021/acs.langmuir.1c02087",
        "paper_author": "Kim A.R.",
        "affiliation_name": "Waterloo Institute for Nanotechnology",
        "affiliation_city": "Waterloo",
        "affiliation_country": "Canada",
        "affiliation_id": "60115730"
    },
    {
        "paper_title": "Nanoscale mineralization of cell-laden methacrylated gelatin hydrogels using calcium carbonate-calcium citrate core-shell microparticles",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "6",
        "cover_date": "2021-12-14",
        "Abstract": "Conventional biomaterials developed for bone regeneration fail to fully recapitulate the nanoscale structural organization and complex composition of the native bone microenvironment. Therefore, despite promoting osteogenic differentiation of stem cells, they fall short of providing the structural, biochemical, and mechanical stimuli necessary to drive osteogenesis for bone regeneration and function. To address this, we have recently developed a novel strategy to engineer bone-like tissue using a biomimetic approach to achieve rapid and controlled nanoscale mineralization of a cell-laden matrix in the presence of osteopontin, a non-collagenous protein, and a supersaturated solution of calcium and phosphate medium. Here, we build on this approach to engineer bone regeneration scaffolds comprising methacrylated gelatin (GelMA) hydrogels incorporated with calcium citrate core-shell microparticles as a sustained and reliable source of calcium ions for in situ mineralization. We demonstrate successful biomineralization of GelMA hydrogels by embedded calcium carbonate-calcium citrate core-shell microparticles with the resultant mineral chemistry, structure, and organization reminiscent of that of native bone. The biomimetic mineralization was further shown to promote osteogenic differentiation of encapsulated human mesenchymal stem cells even in the absence of other exogenous osteogenic induction factors. Ultimately, by combining the superior biological response engendered by biomimetic mineralization with the intrinsic tissue engineering advantages offered by GelMA, such as biocompatibility, biodegradability, and printability, we envision that our system offers great potential for bone regeneration efforts. This journal is",
        "DOI": "10.1039/d1tb01673c",
        "paper_author": "Subbiah R.",
        "affiliation_name": "Oregon Health &amp; Science University",
        "affiliation_city": "Portland",
        "affiliation_country": "United States",
        "affiliation_id": "60016733"
    },
    {
        "paper_title": "Recent development in graphdiyne and its derivative materials for novel biomedical applications",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "27",
        "cover_date": "2021-12-14",
        "Abstract": "Graphdiyne (GDY), which possess sp-and sp2-hybridized carbon and Dirac cones, offers unique physical and chemical properties, including an adjustable intrinsic bandgap, excellent charge carrier transfer efficiency, and superior conductivity compared to other carbon allotropes. These exceptional qualities of GDY and its derivatives have been successfully used in a variety of fields, including catalysis, energy, environmental protection, and biological applications. Herein, we focus on the potential application of GDY and its derivatives in the biomedical domain, including biosensing, biological protection, cancer therapy, and antibacterial agents, demonstrating how the biomimetic behavior of these materials can be a step forward in bridging the gap between nature and applications. Considering the excellent biocompatibility, solubility and selectivity of GDY and its derived materials, they have shown great potential as biosensing and bio-imaging materials. The unusual combination of properties in GDY has been used in biological applications such as \"OFF-ON\"DNA detection and enzymatic sensing, where GDY has a greater adsorption capacity than graphene and other 2D materials, resulting in increased sensitivity. GDY and its derivatives have also been used in cancer treatment due to their high doxorubicin (DOX) loading capacity (using-stacking) and photothermal conversion ability, and radiation protection since their initial biological use. The poor biodegradation rate of graphene demands the search for new nanomaterials. Accordingly, GDY has better biocompatibility and bio-safety than other 2D nanomaterials, especially graphene and its oxide, due to its absence of aggregation in the physiological environment. Thus, GDY-based nanomaterials have become promising candidates as bio-delivery carriers. Besides, GDY and GDY-based materials have also shown interesting applications in the fields of cell-culture, cell-growth and tissue engineering. Herein, we present a comprehensive review on the applications of GDY and its derivatives as biomedical materials, followed by their future perspectives. This review will provide an outlook for the application of graphene and its derivatives and may open up new horizons to inspire broader interests across various disciplines. Finally, the future prospects for GDY-based materials are examined for their potential biological use. This journal is",
        "DOI": "10.1039/d1tb01794b",
        "paper_author": "Khan K.",
        "affiliation_name": "Dongguan University of Technology",
        "affiliation_city": "Dongguan",
        "affiliation_country": "China",
        "affiliation_id": "60073518"
    },
    {
        "paper_title": "Biological Activities and Emerging Roles of Lignin and Lignin-Based Products-A Review",
        "publication": "Biomacromolecules",
        "citied_by": "118",
        "cover_date": "2021-12-13",
        "Abstract": "Bioactive substances, displaying excellent biocompatibility, chemical stability, and processability, could be extensively applied in biomedicine and tissue engineering. In recent years, plant-based bioactive substances such as flavonoids, vitamins, terpenes, and lignin have received considerable attention due to their human health benefits and pharmaceutical/medical applications. Among them is lignin, an amorphous biomacromolecule mainly derived from the combinatorial radical coupling of three phenylpropane units (p-hydroxypenyl, guaiacyl, and syringyl) during lignification. Lignin possesses intrinsic bioactivities (antioxidative, antibacterial, anti-UV activities, etc.) against phytopathogens. Lignin also enhances the plant resistance (adaptability) against environmental stresses. The abundant structural features of lignin offer other significant bioactivities including antitumor and antivirus bioactivities, regulation of plant growth, and enzymatic hydrolysis of cellulose. This Review reports the latest research results on the bioactive potential of lignin and lignin-based substances in biomedicine, agriculture, and biomass conversion. Moreover, the interfacial reactions and bonding mechanisms of lignin with biotissue/cells and other constituents were also discussed, aiming at promoting the conversion or evolution of lignin from industrial wastes to value-added bioactive materials.",
        "DOI": "10.1021/acs.biomac.1c00805",
        "paper_author": "Shu F.",
        "affiliation_name": "Nanjing Forestry University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60025665"
    },
    {
        "paper_title": "Nanocomposite Conductive Bioinks Based on Low-Concentration GelMA and MXene Nanosheets/Gold Nanoparticles Providing Enhanced Printability of Functional Skeletal Muscle Tissues",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "59",
        "cover_date": "2021-12-13",
        "Abstract": "There is a growing need to develop novel well-characterized biological inks (bioinks) that are customizable for three-dimensional (3D) bioprinting of specific tissue types. Gelatin methacryloyl (GelMA) is one such candidate bioink due to its biocompatibility and tunable mechanical properties. Currently, only low-concentration GelMA hydrogels (≤5% w/v) are suitable as cell-laden bioinks, allowing high cell viability, elongation, and migration. Yet, they offer poor printability. Herein, we optimize GelMA bioinks in terms of concentration and cross-linking time for improved skeletal muscle C2C12 cell spreading in 3D, and we augment these by adding gold nanoparticles (AuNPs) or a two-dimensional (2D) transition metal carbide (MXene nanosheets) for enhanced printability and biological properties. AuNP and MXene addition endowed GelMA with increased conductivity (up to 0.8 ± 0.07 and 0.9 ± 0.12 S/m, respectively, compared to 0.3 ± 0.06 S/m for pure GelMA). Furthermore, it resulted in an improvement of rheological properties and printability, specifically at 10 °C. Improvements in electrical and rheological properties led to enhanced differentiation of encapsulated myoblasts and allowed for printing highly viable (97%) stable constructs. Taken together, these results constitute a significant step toward fabrication of 3D conductive tissue constructs with physiological relevance.",
        "DOI": "10.1021/acsbiomaterials.1c01193",
        "paper_author": "Boularaoui S.",
        "affiliation_name": "Khalifa University of Science and Technology",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60104134"
    },
    {
        "paper_title": "Bone Scaffolds: An Incorporation of Biomaterials, Cells, and Biofactors",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "58",
        "cover_date": "2021-12-13",
        "Abstract": "Large injuries to bones are still one of the most challenging musculoskeletal problems. Tissue engineering can combine stem cells, scaffold biomaterials, and biofactors to aid in resolving this complication. Therefore, this review aims to provide information on the recent advances made to utilize the potential of biomaterials for making bone scaffolds and the assisted stem cell therapy and use of biofactors for bone tissue engineering. The requirements and different types of biomaterials used for making scaffolds are reviewed. Furthermore, the importance of stem cells and biofactors (growth factors and extracellular vesicles) in bone regeneration and their use in bone scaffolds and the key findings are discussed. Lastly, some of the main obstacles in bone tissue engineering and future trends are highlighted.",
        "DOI": "10.1021/acsbiomaterials.1c00920",
        "paper_author": "Bahraminasab M.",
        "affiliation_name": "Semnan University of Medical Sciences and Health Services",
        "affiliation_city": "Semnan",
        "affiliation_country": "Iran",
        "affiliation_id": "60024530"
    },
    {
        "paper_title": "Redox-Responsive Hydrogels with Decoupled Initial Stiffness and Degradation",
        "publication": "Biomacromolecules",
        "citied_by": "15",
        "cover_date": "2021-12-13",
        "Abstract": "Disulfide-cross-linked hydrogels have been widely used for biological applications because of their degradability in response to redox stimuli. However, degradability often depends on polymer concentration, which also influences the hydrogel mechanical properties such as the initial stiffness. Here, we describe a one-pot cross-linking approach utilizing both a thiol-ene reaction through a Michael pathway with divinyl sulfone (DVS) to form non-reducible thioether bonds and thiol oxidation promoted by ferric ethylenediaminetetraacetic acid (Fe-EDTA) to form reducible disulfide bonds. The ratio between these two bonds was modulated by varying the DVS concentration used, and the initial shear or elastic modulus and degradation rate of the hydrogels were decoupled. These gels had tunable release rates of encapsulated dextran when exposed to 10 μM glutathione. Fibroblast encapsulation results suggested good cytocompatibility of the cross-linking reactions. This work shows the potential of combining DVS and Fe-EDTA to create thiol-cross-linked hydrogels as redox-responsive drug delivery vehicles and tissue engineering scaffolds with variable degradability.",
        "DOI": "10.1021/acs.biomac.1c01180",
        "paper_author": "Lin C.Y.",
        "affiliation_name": "Purdue University",
        "affiliation_city": "West Lafayette",
        "affiliation_country": "United States",
        "affiliation_id": "60009254"
    },
    {
        "paper_title": "Composite Microgels for Imaging-Monitored Tracking of the Delivery of Vascular Endothelial Growth Factor to Ischemic Muscles",
        "publication": "Biomacromolecules",
        "citied_by": "3",
        "cover_date": "2021-12-13",
        "Abstract": "Monitoring the supply of vascular endothelial growth factor (VEGF) to ischemic tissues provides information on its biodistribution and delivery to meet the requirements of therapeutic angiogenesis and tissue engineering applications. We herein report the use of microfluidically generated microgels containing VEGF-conjugated fluorescent carbon dots (CDs) (VEGF-CDs), a gelatin-phenol conjugate, and silk fibroin for imaging-monitored tracking of VEGF delivery to ischemic muscles. An in vitro release study and a bioactivity assay indicated that the VEGF-CDs were released in a sustained manner with high bioactivity. The microgels showed a high angiogenesis potential, along with a strong fluorescent signal, for the chicken chorioallantoic membrane and chick embryo. Imaging and studies of therapeutic modalities of the composite microgels indicated their effective localization in ischemic tissues and sustained VEGF release, which resulted in enhanced therapeutic angiogenesis of ischemic muscles. This work reveals the success of using VEGF-loaded composite polymer microgels for efficient and monitored VEGF delivery by intramuscular administration for ischemic disease treatment.",
        "DOI": "10.1021/acs.biomac.1c01116",
        "paper_author": "Basiri H.",
        "affiliation_name": "University of Tehran",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60022927"
    },
    {
        "paper_title": "Modulating Surface Properties of the Linothele fallax Spider Web by Solvent Treatment",
        "publication": "Biomacromolecules",
        "citied_by": "5",
        "cover_date": "2021-12-13",
        "Abstract": "Linothele fallax (Mello-Leitão) (L. fallax) spider web, a potentially attractive tissue engineering material, was investigated using quantitative peak force measurement atomic force microscopy and scanning electron microscopy with energy dispersive spectroscopy both in its natural state and after treatment with solvents of different protein affinities, namely, water, ethanol, and dimethyl sulfoxide (DMSO). Native L. fallax silk threads are densely covered by globular objects, which constitute their inseparable parts. Depending on the solvent, treating L. fallax modifies its appearance. In the case of water and ethanol, the changes are minor. In contrast, DMSO practically removes the globules and fuses the threads into dense bands. Moreover, the solvent treatment influences the chemistry of the threads' surface, changing their adhesive and, therefore, biocompatibility and cell adhesion properties. On the other hand, the solvent-treated web materials' contact effect on different types of biological matter differs considerably. Protein-rich matter controls humidity better when wrapped in spider silk treated with more hydrophobic solvents. However, carbohydrate plant materials retain more moisture when wrapped in native spider silk. The extracts produced with the solvents were analyzed using nuclear magnetic resonance (NMR) and liquid chromatography-mass spectrometry techniques, revealing unsaturated fatty acids as representative adsorbed species, which may explain the mild antibacterial effect of the spider silk. The extracted metabolites were similar for the different solvents, meaning that the globules were not \"dissolved\"but \"fused into\"the threads themselves, being supposedly rolled-in knots of the protein chain.",
        "DOI": "10.1021/acs.biomac.1c00787",
        "paper_author": "Kiseleva A.",
        "affiliation_name": "Saint Petersburg National Research University of Information Technologies, Mechanics and Optics University ITMO",
        "affiliation_city": "Saint Petersburg",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60072485"
    },
    {
        "paper_title": "Carbohydrate-based materials in tissue engineering applications",
        "publication": "Nanoengineering of Biomaterials: Drug Delivery &amp; Biomedical Applications, 2 Volumes",
        "citied_by": "4",
        "cover_date": "2021-12-10",
        "Abstract": "Carbohydrates demonstrated crucial roles in various biological pathways including cellular interactions with other cells and their matrices. Carbohydrates are abundantly found in the extracellular matrix (ECM). In this regards, carbohydrate-based scaffolds (oligosaccharides and polysaccharides) have been frequently implemented for stem-cell culture and tissue engineering. An ideal scaffold should be capable of providing favorable environment for directing stem cell for tissue engineering and cell therapy purposes. Carbohydrates as an important component of ECM showed great potential to fabricate versatile scaffolds that simulate the natural environment of stem cells. This chapter summarized scaffold preparation methods and described the current status of oligosaccharides-and polysaccharides-based scaffolds for application in tissue engineering. In the near future, carbohydrate-based scaffolds may be applied to design and fabricate sophisticated scaffolds that can determine and regulate the fate of the stem cells.",
        "DOI": "10.1002/9783527832095.ch18",
        "paper_author": "Alibolandi M.",
        "affiliation_name": "Pharmaceutical Research Center",
        "affiliation_city": "Mashhad",
        "affiliation_country": "Iran",
        "affiliation_id": "60196664"
    },
    {
        "paper_title": "Synthesis of pH-Responsive Polymer Sponge Coatings and Freestanding Films via Vapor-Phase Deposition",
        "publication": "ACS Applied Polymer Materials",
        "citied_by": "11",
        "cover_date": "2021-12-10",
        "Abstract": "Porous polymer materials are desired for a variety of applications such as catalysis, filtration, sensing, optics, and biological engineering. In this work, we present a modified initiated chemical vapor deposition (iCVD) process to synthesize spongelike stimuli-responsive poly(methacrylic acid) (PMAA) polymer coatings and freestanding films characterized by micron-sized pores, pore interconnectivity, and varying heights. The carboxylic acid functional group in the PMAA sponge allows for pH-responsive behavior ideal for biomedical applications and separations. Thermal annealing was used to control the dissolution of sponge coatings in different pH environments. Ethylene glycol diacrylate was introduced during the fabrication process to form freestanding sponges with pH-responsive swelling behavior, and glycidyl methacrylate was introduced during the fabrication process to increase the durability of sponge coatings. Hierarchical structures with a bottom sponge layer and a top pillared layer were fabricated in situ by varying processing conditions. The sponge structures were coated with a fluorinated polymer to fabricate superhydrophobic structures with self-cleaning properties. Our fabrication process offers an all-dry one-pot method to synthesize polymer sponges with different functionalities for a range of applications in drug delivery, sensor, and separation applications.",
        "DOI": "10.1021/acsapm.1c01151",
        "paper_author": "Bacheller S.",
        "affiliation_name": "USC Viterbi School of Engineering",
        "affiliation_city": "Los Angeles",
        "affiliation_country": "United States",
        "affiliation_id": "60143535"
    },
    {
        "paper_title": "Strategies for all-at-once and stepwise selection of cells with multiple genetic manipulations",
        "publication": "Biochemical and Biophysical Research Communications",
        "citied_by": "2",
        "cover_date": "2021-12-10",
        "Abstract": "The genetic manipulation of cells followed by their selection is indispensable for cell biological research. Although antibiotics-resistant genes are commonly used as selection markers, optimization of the condition for each selective agent is required. Here we utilized split-inteins and the drug-selectable marker puromycin N-acetyltransferase (PAC) to develop a system that enables the selection of cells simultaneously or sequentially transfected with multiple genetic constructs, using only puromycin. The active PAC enzyme was reconstituted by intein-mediated trans-splicing at several inherent or engineered serine/cysteine residues. Multiple splitting and reconstitution of active PAC was readily achieved by selecting optimum division sites based on the cellular tolerance to various puromycin concentrations. To achieve the stepwise selection method, PAC-intein fragments were transduced into cells using a virus-like particle (VLP) composed of HIV-1 gag-pol and VSV-G. The PAC-intein-VLP successfully conferred sufficient PAC activity for puromycin selection, which was quickly diminished in the absence of the VLP. Our findings demonstrate a versatile strategy for establishing markers for all-at-once or stepwise selection of multiple genetic manipulations, which will be useful in many fields of biology.",
        "DOI": "10.1016/j.bbrc.2021.10.016",
        "paper_author": "Horikawa M.",
        "affiliation_name": "Graduate School of Medicine",
        "affiliation_city": "Sapporo",
        "affiliation_country": "Japan",
        "affiliation_id": "60171692"
    },
    {
        "paper_title": "Postharvest handling: A systems approach",
        "publication": "Postharvest Handling: A Systems Approach",
        "citied_by": "1",
        "cover_date": "2021-12-09",
        "Abstract": "Postharvest Handling: A Systems Approach introduces a new concept in the handling of fresh fruits and vegetable. Traditional treatments have been either physiologically based with an emphasis on biological tissue or technologically based with an emphasis on storage and handling. This book integrates all processes from production practices through consumer consumption with an emphasis on understanding market forces and providing fresh product that meets consumer expectations. Postharvest physiologists and technologists across the disciplines of agricultural economics, agricultural engineering, food science and horticulture along with handlers of minially-processed products within the fresh produce fruit and vegetable processing industries will find this to be an invaluable source of information.",
        "DOI": "10.1016/C2009-0-03328-5",
        "paper_author": "Shewfelt R.L.",
        "affiliation_name": "University of Georgia",
        "affiliation_city": "Athens",
        "affiliation_country": "United States",
        "affiliation_id": "60029747"
    },
    {
        "paper_title": "From Bioinspired to Bioinformed: Benefits of Greater Engagement From Biologists",
        "publication": "Frontiers in Ecology and Evolution",
        "citied_by": "14",
        "cover_date": "2021-12-09",
        "Abstract": "Bioinspiration and biomimetics is a rapidly growing field where insights from biology are used to solve current design challenges. Nature provides an abundance of inspiration to draw upon, yet biological information is under-exploited due to a concerning lack of engagement from biologists. To assess the extent of this problem, we surveyed the current state of the field using the Web of Science database and found that only 41% of publications on bioinspired or biomimetic research included an author affiliated with a biology-related department or organisation. In addition, most publications focus exclusively on a limited range of popular model species. Considering these findings, we highlight key reasons why greater engagement from biologists will enable new and significant insights from natural selection and the diversity of life. Likewise, biologists are missing unique opportunities to study biological phenomena from the perspective of other disciplines, particularly engineering. We discuss the importance of striving toward a bioinformed approach, as current limitations in the field can only be overcome with a greater understanding of the ecological and evolutionary contexts behind each bioinspired/biomimetic solution.",
        "DOI": "10.3389/fevo.2021.790270",
        "paper_author": "Ng L.",
        "affiliation_name": "School of Biosciences",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60118642"
    },
    {
        "paper_title": "Engineering of a Biologically Active Insulin Dimer",
        "publication": "Journal of Medicinal Chemistry",
        "citied_by": "11",
        "cover_date": "2021-12-09",
        "Abstract": "The growing epidemic of diabetes means that there is a need for therapies that are more efficacious, safe, and convenient. Here, we report the efficient synthesis of a novel disulfide dimer of human insulin tethered at the N-terminus of its B-chain through placement of a cysteine residue. The resulting peptide was shown to bind to both the insulin receptor isoform B and insulin-like growth factor-1 receptor with comparable affinity to native insulin. In in vivo insulin tolerance tests, the dimer was equipotent to Actrapid insulin and possessed a sustained duration of action greater than that of Actrapid and Glargine. While the secondary structure of our dimeric insulin was similar to that of insulin, it was more resistant to proteolysis. More importantly, our analogue was produced in quantitative yield from a monomeric thiol insulin scaffold. Our results suggest that this dimer has significant potential to address the clinical needs in the treatment of diabetes.",
        "DOI": "10.1021/acs.jmedchem.1c01594",
        "paper_author": "Liu M.",
        "affiliation_name": "University of Melbourne",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60026553"
    },
    {
        "paper_title": "A Study to Compare the Fouling Resistance and Self-cleaning Properties of Two-patterned Surfaces with an Un-patterned Control Surface",
        "publication": "Journal of Physics: Conference Series",
        "citied_by": "2",
        "cover_date": "2021-12-08",
        "Abstract": "Biofouling is an unwelcomed phenomenon where unwanted biological matter adheres to surfaces with the presence of water, resulting in alteration to the properties of the surface. This affects many industries, especially the marine industry. Multiple biofouling control studies have been conducted to minimize damage and maintenance cost of these surfaces. With rising concerns on the toxicity of current control methods towards the environment, non-toxic methods shown to be effective are surface modifications such as self-cleaning or biomimetic textured surfaces. One of the biomimetic surfaces, shark's skin has shown anti-fouling properties due to its surface riblets with low drag properties based on studies done. However, few researches are conducted to implement these biomimetic surface topographies for real anti-fouling applications. Therefore, this project explores the possibilities in implementing biomimetic surface topographies such as shark's skin in real life applications using computational fluid dynamics (CFD) analysis and also to manufacture these surfaces using 3D printing methods. A computer-aided design (CAD) model of shark skin and un-patterned surface topographies are used to study the behavior of fluid over these surfaces in CFD fluent in ANSYS software. The hydrodynamic variable data such as wall shear stress over the surface topography is represented in a contour and vector plot, these results are then analyzed. According to the hypotheses, the biomimetic shark skin surface topography will show higher wall shear stress, indicating anti-fouling properties. In the next part of this project is the manufacturing of these surface, the goal is to provide a cheaper alternative to current micro-structured surface production methods such as photolithography. Additive manufacturing such as fused deposition modeling (FDM) 3D printing can potentially provide a manufacturing method with a much lower cost and time needed. Thus, 3D printing of the biomimetic shark skin surface topography will be carried out in this project to determine if FDM can provide a manufacturing solution to anti-fouling micro-topography surfaces.",
        "DOI": "10.1088/1742-6596/2120/1/012015",
        "paper_author": "Wong F.Y.M.",
        "affiliation_name": "Taylor's University Malaysia",
        "affiliation_city": "Subang Jaya",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60104614"
    },
    {
        "paper_title": "Avian Egg: A Multifaceted Biomaterial for Tissue Engineering",
        "publication": "Industrial and Engineering Chemistry Research",
        "citied_by": "26",
        "cover_date": "2021-12-08",
        "Abstract": "Avian eggs offer a natural and environmentally friendly source of raw materials, and many of their components hold great potential in tissue engineering. An avian egg consists of several beneficial elements: the protective eggshell, the eggshell membrane, the egg white (albumen), and the egg yolk (vitellus). The eggshell is mostly composed of calcium carbonate and has intrinsic biological properties that stimulate bone repair. It is a suitable precursor for the synthesis of hydroxyapatite and calcium phosphate, which are particularly relevant to bone tissue engineering. The eggshell membrane is a thin protein-based layer with a fibrous structure composed of several valuable biopolymers, such as collagen and hyaluronic acid, also found in the human extracellular matrix. As a result, the eggshell membrane has found several applications in skin tissue repair and regeneration. The egg white is a protein-rich material that is under investigation for the design of functional protein-based hydrogel scaffolds. The egg yolk, composed mainly of lipids, also contains diverse essential nutrients (e.g., proteins, minerals, and vitamins) and has potential applications in wound healing and bone tissue engineering. This review summarizes the advantages and status of egg components in tissue engineering and regenerative medicine as well as their current limitations and future perspectives.",
        "DOI": "10.1021/acs.iecr.1c03085",
        "paper_author": "Mahdavi S.",
        "affiliation_name": "Burn and Wound Healing Research Center",
        "affiliation_city": "Shiraz",
        "affiliation_country": "Iran",
        "affiliation_id": "60159774"
    },
    {
        "paper_title": "Childhood Cartilage ECM Enhances the Chondrogenesis of Endogenous Cells and Subchondral Bone Repair of the Unidirectional Collagen-dECM Scaffolds in Combination with Microfracture",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "27",
        "cover_date": "2021-12-08",
        "Abstract": "Despite the formation of mechanically inferior fibrocartilage, microfracture (MF) still remains the gold standard to repair the articular cartilage defects in clinical settings. To date, although many tissue-engineering scaffolds have been developed to enhance the MF outcome, the clinical outcomes remain inconsistent. Decellularized extracellular matrix (dECM) is among the most promising scaffold for cartilage repair due to its inheritance of the natural cartilage components. However, the impact of dECM from different developmental stages on cellular chondrogenesis and therapeutic effect remains elusive, as the development of native cartilage involves the distinct temporal dependency of the ECM components and various growth factors. Herein, we hypothesized that the immature cartilage dECM at various developmental stages was inherently different, and would consequently impact the chondrogenic potential BMSCs. In this study, we fabricated three different unidirectional collagen-dECM scaffolds sourced from neonatal, childhood, and adolescent rabbit cartilage tissues, and identified the age-dependent biological variations, including DNA, cartilage-specific proteins, and growth factors; along with the mechanical and degradation differences. Consequently, the different local cellular microenvironments provided by these scaffolds led to the distinctive cell morphology, circularity, proliferation, chondrogenic genes expression, and chondrogenesis of BMSCs in vitro, and the different gross morphology, cartilage-specific protein production, and subchondral bone repair when in combination with microfracture in vivo. Together, this work highlights the immature cartilage dECM at different developmental stages that would result in the diversified effects to BMSCs, and childhood cartilage would be considered the optimal dECM source for the further development of dECM-based tissue engineering scaffolds in articular cartilage repair.",
        "DOI": "10.1021/acsami.1c19447",
        "paper_author": "Cao H.",
        "affiliation_name": "Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60016521"
    },
    {
        "paper_title": "Metapopulations with habitat modification",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "21",
        "cover_date": "2021-12-07",
        "Abstract": "Across the tree of life, organisms modify their local environment, rendering it more or less hospitable for other species. Despite the ubiquity of these processes, simple models that can be used to develop intuitions about the consequences of widespread habitat modification are lacking. Here, we extend the classic Levins metapopulation model to a setting where each of n species can colonize patches connected by dispersal, and when patches are vacated via local extinction, they retain a “memory” of the previous occupant—modeling habitat modification. While this model can exhibit a wide range of dynamics, we draw several overarching conclusions about the effects of modification and memory. In particular, we find that any number of species may potentially coexist, provided that each is at a disadvantage when colonizing patches vacated by a conspecific. This notion is made precise through a quantitative stability condition, which provides a way to unify and formalize existing conceptual models. We also show that when patch memory facilitates coexistence, it generically induces a positive relationship between diversity and robustness (tolerance of disturbance). Our simple model provides a portable, tractable framework for studying systems where species modify and react to a shared landscape.",
        "DOI": "10.1073/pnas.2109896118",
        "paper_author": "Miller Z.R.",
        "affiliation_name": "Department of Ecology and Evolution, The University of Chicago",
        "affiliation_city": "Chicago",
        "affiliation_country": "United States",
        "affiliation_id": "60117702"
    },
    {
        "paper_title": "Accelerating strain phenotyping with desorption electrospray ionization-imaging mass spectrometry and untargeted analysis of intact microbial colonies",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "10",
        "cover_date": "2021-12-07",
        "Abstract": "Reading and writing DNA were once the rate-limiting step in synthetic biology workflows. This has been replaced by the search for the optimal target sequences to produce systems with desired properties. Directed evolution and screening mutant libraries are proven technologies for isolating strains with enhanced performance whenever specialized assays are available for rapidly detecting a phenotype of interest. Armed with technologies such as CRISPR-Cas9, these experiments are capable of generating libraries of up to 1010 genetic variants. At a rate of 102 samples per day, standard analytical methods for assessing metabolic phenotypes represent a major bottleneck to modern synthetic biology workflows. To address this issue, we have developed a desorption electrospray ionization–imaging mass spectrometry screening assay that directly samples microorganisms. This technology increases the throughput of metabolic measurements by reducing sample preparation and analyzing organisms in a multiplexed fashion. To further accelerate synthetic biology workflows, we utilized untargeted acquisitions and unsupervised analytics to assess multiple targets for future engineering strategies within a single acquisition. We demonstrate the utility of the developed method using Escherichia coli strains engineered to overproduce free fatty acids. We determined discrete metabolic phenotypes associated with each strain, which include the primary fatty acid product, secondary products, and additional metabolites outside the engineered product pathway. Furthermore, we measured changes in amino acid levels and membrane lipid composition, which affect cell viability. In sum, we present an analytical method to accelerate synthetic biology workflows through rapid, untargeted, and multiplexed metabolomic analyses.",
        "DOI": "10.1073/pnas.2109633118",
        "paper_author": "Ellis B.M.",
        "affiliation_name": "Vanderbilt University",
        "affiliation_city": "Nashville",
        "affiliation_country": "United States",
        "affiliation_id": "60003915"
    },
    {
        "paper_title": "Traversing Excitonic and Ionic Landscapes: Reduced-Dimensionality-Inspired Design of Organometal Halide Semiconductors for Energy Applications",
        "publication": "Accounts of Chemical Research",
        "citied_by": "8",
        "cover_date": "2021-12-07",
        "Abstract": "ConspectusAt the very heart of the global semiconductor industry lies the omnipresent push for new materials discovery. New materials constantly rise and fall out of fashion in the scientific literature, with those passing an initial phase of research scrutiny becoming hotbeds of characterization and optimization efforts. Yet, innumerable hours of painstaking research have been devoted to materials that have ultimately fallen by the wayside after crossing over an indefinable threshold, whereupon historical optimism is met with newfound skepticism. Materials have to perform well, and they have to do it quickly. In the past decade, metal-halide perovskites (MHPs) have garnered widespread attention. The hegemonic view in both academic and industrial circles is that these materials could be engineered to meet the demands of the semiconductor industry. Their promise as inexpensive solar cell devices is highly attractive, and it has been nothing short of remarkable that efficiencies have risen from 3.8% in 2009 to more than 25.5% in 2021. Moreover, MHPs are poised to be revolutionary materials in more ways than one. The highest MHP LED efficiency was recently reported (23.4%), and MHPs have demonstrated promise in photodetectors, memristors, and transistors. However, the many excellent properties of MHPs are contrasted by longstanding stability and reproducibility limitations that have hindered their commercialization. Overcoming the limitations of MHPs is ultimately a materials engineering problem, which should be solved by mapping more precise relationships between structure, composition, and device performance. In 1958, Francis Crick famously developed the central dogma of molecular biology which describes the unidirectional flow of information in biological systems. In the words of Crick, \"nature has devised a unique instrument in which an underlying simplicity is used to express great subtlety and versatility.\"In this Account, taking inspiration from the hierarchical organization of nature, we describe a hierarchical approach to materials engineering of organic metal-halide semiconductors. We demonstrate that organo-metal halide semiconductors' dimensionality, composition, and morphology dictate their optoelectronic properties and can be exploited in defining more explicit relationships between structure and function. Here, we traverse three-dimensional (3D), two-dimensional (2D), and one-dimensional (1D) organo-metal halide semiconductors, detailing the morphological and compositional differences in each and the implications that can be drawn within each domain on the engineering process. Control over ion migration pathways via morphology engineering as well as control over charge formation in organic-inorganic semiconductors is demonstrated. Fundamental insights into the amount of static and dynamic disorder in the MHP lattice are provided, which can be continuously tuned as a function of composition and morphology. Using electroabsorption spectroscopy on 2D MHPs, a disorder-induced dipole moment in the exciton proportional to the summed value of static and dynamic disorder is measured. Spectroscopic isolation of exciton features in 2D MHP electroabsorption spectra allows us to obtain precise, model-independent measurements of exciton binding energies to study the effect of chemical substitutions, such as Sn2+ → Pb2+, on the value of the exciton binding energy. Finally, we conclude that this multidimensional platform, with the aid of machine learning and robotics, will be foundational in accurately predicting structure-property-device relationships in organo-metal halide semiconductors in the future.",
        "DOI": "10.1021/acs.accounts.1c00492",
        "paper_author": "Powell D.",
        "affiliation_name": "University of Utah, College Of Science",
        "affiliation_city": "Salt Lake City",
        "affiliation_country": "United States",
        "affiliation_id": "60014130"
    },
    {
        "paper_title": "Decoding lignin valorization pathways in the extremophilic: Bacillus ligniniphilus L1 for vanillin biosynthesis",
        "publication": "Green Chemistry",
        "citied_by": "38",
        "cover_date": "2021-12-07",
        "Abstract": "The biggest challenge in the biological valorization of lignin is the achievement of a simple and effective route to produce fine chemicals through bacteria. In this study, system biology-guided biosynthesis of vanillin through lignin depolymerization using extremophilic Bacillus ligniniphilus L1 was investigated. As a result, the lignin metabolic network was elucidated. The position of vanillin as the central metabolite of lignin metabolism was confirmed in B. ligniniphilus L1. Genetic engineering of B. ligniniphilus L1 through knocking out vanillin dehydrogenase gene (vdh) to attenuate vanillin catabolism coupled with lignin pretreatment strategies has increased the vanillin titer by 28-fold (352 mg L-). Moreover, a chassis cell milking approach has been successfully developed to debottleneck the cytotoxicity of vanillin. After seven fermentation cycles, vanillin yielded was found to be 1.95 μmol per mg cell dry weight, which was 7.6-fold more than the conventional fermentation. This study has demonstrated the biosynthetic platform for vanillin production and opens a promising avenue towards the cleaner production of valuable chemicals from lignin. This journal is",
        "DOI": "10.1039/d1gc02692e",
        "paper_author": "Zhu D.",
        "affiliation_name": "Jiangsu University",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60017482"
    },
    {
        "paper_title": "Molecularly Imprinted and Cladded Nanoparticles Provide Better Phosphorylation Recognition",
        "publication": "Analytical Chemistry",
        "citied_by": "35",
        "cover_date": "2021-12-07",
        "Abstract": "Phosphorylation is one of the most frequently occurring post-translation modifications in mammals. Because abnormal protein phosphorylation is related to many diseases, phosphorylation analysis is essential for a sound understanding of protein phosphorylation and its relationship with diseases. Among several types of reagents for phosphorylation recognition, molecularly imprinted polymers (MIPs), as synthetic mimics of antibodies, have exhibited unique strengths that can overcome the drawbacks of biological reagents. However, the performance of current MIPs has remained unideal. Meanwhile, while the currently existing imprinting methods have permitted the production of several material formats, such as crushed particles and mesoporous nanoparticles, a general method allowing for the preparation of monodispersed molecularly imprinted nanoparticles has not been developed yet. Herein, we report a new approach called reverse microemulsion template docking surface imprinting and cladding (RMTD-SIC) for facile preparation of monodispersed imprinted nanoparticles for better phosphorylation recognition. Through rational design and controllable engineering, monodisperse imprinted and cladded nanoparticles specific to general phosphorylation and tyrosine phosphorylation were synthesized, which yield the highest imprinting factors as compared with published studies. The prepared nanomaterials exhibited excellent specificity and affinity, allowing for specific enrichment and improved mass spectrometric identification of target phosphorylated peptides from complex samples containing 100-fold more abundant interfering peptides. Therefore, the RMTD-SIC approach holds great potential for phosphorylation analysis and phosphorylation recognition-based applications.",
        "DOI": "10.1021/acs.analchem.1c04070",
        "paper_author": "Zhao J.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100"
    },
    {
        "paper_title": "Addressable graphene encapsulation of wet specimens on a chip for optical, electron, infrared and X-ray based spectromicroscopy studies",
        "publication": "Lab on a Chip",
        "citied_by": "6",
        "cover_date": "2021-12-07",
        "Abstract": "Label-free spectromicroscopy methods offer the capability to examine complex cellular phenomena. Electron and X-ray based spectromicroscopy methods, though powerful, have been hard to implement with hydrated objects due to the vacuum incompatibility of the samples and due to the parasitic signals from (or drastic attenuation by) the liquid matrix surrounding the biological object of interest. Similarly, for many techniques that operate at ambient pressure, such as Fourier transform infrared spectromicroscopy (FTIRM), the aqueous environment imposes severe limitations due to the strong absorption of liquid water in the infrared regime. Here we propose a microfabricated multi-compartmental and reusable hydrated sample platform suitable for use with several analytical techniques, which employs the conformal encapsulation of biological specimens by a few layers of atomically thin graphene. Such an electron, X-ray, and infrared transparent, molecularly impermeable and mechanically robust enclosure preserves the hydrated environment around the object for a sufficient time to allow in situ examination of hydrated bio-objects with techniques operating under both ambient and high vacuum conditions. An additional hydration source, provided by hydrogel pads lithographically patterned in the liquid state near/around the specimen and co-encapsulated, has been added to further extend the hydration lifetime. Note that the in-liquid lithographic electron beam-induced gelation procedure allows for addressable capture and immobilization of the biological cells from the solution. Scanning electron microscopy and optical fluorescence microscopy, as well as synchrotron radiation based FTIR and X-ray fluorescence microscopy, have been used to test the applicability of the platform and for its validation with yeast, A549 human carcinoma lung cells and micropatterned gels as biological object phantoms.",
        "DOI": "10.1039/d1lc00440a",
        "paper_author": "Arble C.",
        "affiliation_name": "National Institute of Standards and Technology",
        "affiliation_city": "Gaithersburg",
        "affiliation_country": "United States",
        "affiliation_id": "60023053"
    },
    {
        "paper_title": "Phosphorous pentoxide-free bioactive glass exhibits dose-dependent angiogenic and osteogenic capacities which are retained in glass polymeric composite scaffolds",
        "publication": "Biomaterials Science",
        "citied_by": "5",
        "cover_date": "2021-12-07",
        "Abstract": "Bioactive glasses (BGs) are attractive materials for bone tissue engineering because of their bioactivity and osteoinductivity. In this study, we report the synthesis of a novel phosphorous pentoxide-free, silicate-based bioactive glass (52S-BG) composed of 52.1% SiO2, 23.2% Na2O and 22.6% CaO (wt%). The glass was thoroughly characterized. The biocompatibility and osteogenic properties of 52S-BG particles were analyzed in vitro with human adipose-derived mesenchymal stem cells (AdMSCs) and human osteoblasts. 52S-BG particles were biocompatible and induced mineralized matrix deposition and the expression of osteogenic markers (RunX2, alkaline phosphatase, osteocalcin, osteopontin, collagen I) and the angiogenic marker vascular endothelial growth factor (VEGF). Angiogenic properties were additionally confirmed in a zebrafish embryo model. 52S-BG was added to poly-ϵ-caprolactone (PCL) to obtain a composite with 10 wt% glass content. Composite PCL/52S-BG scaffolds were fabricated by additive manufacturing and displayed high porosity (76%) and pore interconnectivity. The incorporation of 52S-BG particles increased the Young's modulus of PCL scaffolds from 180 to 230 MPa. AdMSC seeding efficiency and proliferation were higher in PCL/52S-BG compared to PCL scaffolds, indicating improved biocompatibility. Finally, 52S-BG incorporation improved the scaffolds' osteogenic and angiogenic properties by increasing mineral deposition and inducing relevant gene expression and VEGF protein secretion. Overall, 52S-BG particles and PCL/52S-BG composites may be attractive for diverse bone engineering applications requiring concomitant angiogenic properties. This journal is",
        "DOI": "10.1039/d1bm01311d",
        "paper_author": "Font Tellado S.",
        "affiliation_name": "Klinikum Rechts der Isar",
        "affiliation_city": "Munich",
        "affiliation_country": "Germany",
        "affiliation_id": "60103459"
    },
    {
        "paper_title": "Unlocking the potential of Escherichia coli modified magnetic particles for chiral discrimination of racemic tryptophan",
        "publication": "Journal of Chromatography A",
        "citied_by": "0",
        "cover_date": "2021-12-06",
        "Abstract": "Enzymes possess a highly specific affinity toward their substrates. In this study, an enzyme-based biological method was established for chiral discrimination of D/L-tryptophan (Trp). The polydopamine modified magnetic particles (PDA@Fe3O4) were prepared for immobilization of the genetically engineered bacterium Escherichia coli (E. coli) DH5α. The bacteria-magnetic particles conjugates (bacteria@PDA@Fe3O4) demonstrate excellent chiral discrimination performance toward D/L-Trp at pH 7.0 and 45 °C. The investigation for the principle exhibits that the immobilized E. coli DH5α can produce tryptophanase, and the enzyme can selectively recognize and degrade L-Trp. The Michaelis constant of tryptophanase produced by bacteria@PDA@Fe3O4 was measured to be 25.7 µg mL−1. This method avoids the purification of tryptophanase and unlocks the potential of bacteria modified magnetic particles for chiral discrimination of racemic tryptophan.",
        "DOI": "10.1016/j.chroma.2021.462638",
        "paper_author": "Li L.",
        "affiliation_name": "South China Normal University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60005816"
    },
    {
        "paper_title": "A gain-of-function mutation of the MATE family transporter DTX6 confers paraquat resistance in Arabidopsis",
        "publication": "Molecular Plant",
        "citied_by": "15",
        "cover_date": "2021-12-06",
        "Abstract": "Paraquat is one of the most widely used nonselective herbicides and has elicited the emergence of paraquat-resistant weeds. However, the molecular mechanisms of paraquat resistance are not completely understood. Here we report the Arabidopsis gain-of-function mutant pqt15-D with significantly enhanced resistance to paraquat and the corresponding gene PQT15, which encodes the Multidrug and Toxic Extrusion (MATE) transporter DTX6. A point mutation at +932 bp in DTX6 causes a G311E amino acid substitution, enhancing the paraquat resistance of pqt15-D, and overexpression of DTX6/PQT15 in the wild-type plants also results in strong paraquat resistance. Moreover, heterologous expression of DTX6 and DTX6-D in Escherichia coli significantly enhances bacterial resistance to paraquat. Importantly, overexpression of DTX6-D enables Arabidopsis plants to tolerate 4 mM paraquat, a near-commercial application level. DTX6/PQT15 is localized in the plasma membrane and endomembrane, and functions as a paraquat efflux transporter as demonstrated by paraquat efflux assays with isolated protoplasts and bacterial cells. Taken together, our results demonstrate that DTX6/PQT15 is an efflux transporter that confers paraquat resistance by exporting paraquat out of the cytosol. These findings reveal a molecular mechanism of paraquat resistance in higher plants and provide a promising candidate gene for engineering paraquat-resistant crops.",
        "DOI": "10.1016/j.molp.2021.09.004",
        "paper_author": "Xia J.Q.",
        "affiliation_name": "Hefei National Laboratory for Physical Sciences at the Microscale",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60089931"
    },
    {
        "paper_title": "Bio-based poly (butylene succinate): Recent progress, challenges and future opportunities",
        "publication": "European Polymer Journal",
        "citied_by": "128",
        "cover_date": "2021-12-05",
        "Abstract": "Rising energy concerns, rapid infrastructure development, and greater environmental awareness have fueled the demand for sustainable materials. In this direction, sustainable bio-based polymer generated from different resources through several operations can meet most of the annual synthetic plastics demand at least in Europe. The advancement of sustainable technologies for the effective utilization of sustainable materials for bioplastic and biomaterials production can afford a novel biorenewable source of sustainable products and biofuel as well as address the rising environmental concerns. Poly(butylene succinate) is one biopolymer that has enormous potential to be used in a wide range of applications. There is currently no extensive review on the PBS based polymer covering the advanced technologies for the development of high-value material. This article covers the advanced state of synthesis, process integrating biological and thermochemical conversion to produce bioplastics (PBS), physico-chemical and mechanical properties, and the recent applications. We have also provided a structural perspective on how PBS can be adopted via appropriate engineering/ modification to its properties. Different changes in the precursors of polymer materials and composites enable a various range of applications, including but not limited to the manufacturing of high-performance polymer materials to composites.",
        "DOI": "10.1016/j.eurpolymj.2021.110855",
        "paper_author": "Platnieks O.",
        "affiliation_name": "Riga Technical University",
        "affiliation_city": "Riga",
        "affiliation_country": "Latvia",
        "affiliation_id": "60071057"
    },
    {
        "paper_title": "Development of modified and multifunctional poly(glycerol sebacate) (PGS)-based biomaterials for biomedical applications",
        "publication": "European Polymer Journal",
        "citied_by": "40",
        "cover_date": "2021-12-05",
        "Abstract": "In the recent decade, Poly (glycerol sebacate) (PGS) has received tremendous attention in versatile biomedical fields because of its superior elasticity, excellent biocompatibility, and biodegradability. Conventionally, PGS comprised of glycerol and sebacic acid is prepared via a two-step polymerization, where synthesis parameters such as curing time and temperature, and feeding ratio of the reagents can be readily tailored to improve the performance for the ultimate use. However, such tweaks are no longer able to catch the high demand of intended biomedical applications. As such, a series of modification strategies and construction modalities have been developed to extend traditional PGS with a wider range of physicochemical, mechanical, and biological properties for unmet biomedical needs. Herein, we present a comprehensive literature review of these advanced modification approaches ranging from hydrophilization, functionalization, and mechanical reinforcement. Moreover, various PGS-related constructions used in biomedical applications are highlighted, including hard tissue engineering, soft tissue engineering, and drug delivery and device design. From the perspective of potential clinical use, challenges and limitations of current PGS-based biomaterials, and their future development are also discussed in this review.",
        "DOI": "10.1016/j.eurpolymj.2021.110830",
        "paper_author": "Sha D.",
        "affiliation_name": "Key Laboratory for Ultrafine Materials of Ministry of Education",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60135025"
    },
    {
        "paper_title": "Rapid spectroscopic method for quantifying gluten concentration as a potential biomarker to test adulteration of green banana flour",
        "publication": "Spectrochimica Acta - Part A: Molecular and Biomolecular Spectroscopy",
        "citied_by": "17",
        "cover_date": "2021-12-05",
        "Abstract": "The demand for gluten-free banana flour has led manufactures to enforce strict measures for quality control. A need has arisen for the development of more sensitive and reliable methods to test the quality of green banana flour (GBF). The objective of this study was to develop rapid visible to near-infrared (Vis-NIR) based spectroscopic models to detect gluten concentration, as a biomarker to detect wheat flour adulteration in green banana flour (GBF). Spectroscopic data were acquired using a desktop (FOSS®) Vis-NIR spectroscopy ranging from 400 to 2500 nm of the electromagnetic spectrum. The spectral and reference data were submitted to principal component analysis (PCA) and partial least squares regression (PLSR) for the development of gluten adulteration detection models. Calibration models were constructed based on a full cross-validation approach, consisting of 51 samples for the calibration set and 21 samples for the test set. PCA scores plot discriminated gluten adulterated and unadulterated GBF samples with 100% accuracy for the first two principal components (PCs). The optimal prediction model was obtained after a combination of baseline (offset and baseline linear correlation) and standard normal variate (SNV) pre-processing technique. This model showed a 94% coefficient of determination of cross-validation (R2cv) and prediction (R2p); root mean square error of cross-validation (RMSECV) of 3.7 mg/kg, root mean square error of prediction (RMSEP) of 3.9 mg/kg; and RPD value of 4. This work has demonstrated that Vis-NIRS method is a robust and feasible technology that may be used to ensure the safety of banana flour and that this product stays gluten-free by providing good and reliable gluten detection and quantification prediction models.",
        "DOI": "10.1016/j.saa.2021.120081",
        "paper_author": "Ndlovu P.F.",
        "affiliation_name": "University of KwaZulu-Natal",
        "affiliation_city": "Durban",
        "affiliation_country": "South Africa",
        "affiliation_id": "60010499"
    },
    {
        "paper_title": "Metal oxide/graphene nanocomposites and their biomedical applications",
        "publication": "Metal Oxides for Biomedical and Biosensor Applications",
        "citied_by": "3",
        "cover_date": "2021-12-03",
        "Abstract": "Graphene is considered as one of the most significant material in the field of nanotechnology since discovery as it exhibits unique physicochemical and biological properties. The biocompatible nature and favorable dimensions render them suitable for interactions with cells and tissues. When combined with various metal oxides, the intrinsic properties get enhanced resulting in synergistic effect in various applications. Graphene-based nanomaterials have gained popularity exponentially as biosensing and bioimaging agent. Moreover various current researches are exploring the potentiality of graphene nanocomposites as gene or drug carrier or as candidate for cancer therapy and tissue engineering. The chapter also deals with various researches conducted using antibacterial metal oxide-graphene nanocomposites along with the various synthesis routes followed.",
        "DOI": "10.1016/B978-0-12-823033-6.00020-X",
        "paper_author": "Bardhan S.",
        "affiliation_name": "Jadavpur University",
        "affiliation_city": "Kolkata",
        "affiliation_country": "India",
        "affiliation_id": "60020825"
    }
]