[
    {
        "paper_title": "Thiol-norbornene gelatin hydrogels: Influence of thiolated crosslinker on network properties and high definition 3D printing",
        "publication": "Biofabrication",
        "citied_by": "43",
        "cover_date": "2020-12-31",
        "Abstract": "Photocrosslinkable gelatin hydrogels are excellent bioinks or biomaterial ink components to serve biofabrication applications. Especially the widely investigated gelatin-methacroyl (gel-MA) hydrogels hold an impressive track record. However, over the past decade, increasing attention is being paid to thiol-ene photo-click chemistry to obtain hydrogel networks benefitting from a faster reactivity (i.e. seconds vs minutes) along with superior biocompatibility and processability. In order to exploit this photo-click chemistry, often an ene-functionality (e.g. norbornene) is introduced onto gelatin followed by crosslinking in the presence of a multifunctional thiol (e.g. dithiothreitol). To date, very limited research has been performed on the influence of the applied thiolated crosslinker on the final hydrogel properties. Therefore, the present work assesses the influence of different thiolated crosslinkers on the crosslinking kinetics, mechanical properties and biological performance of the hydrogels upon encapsulation of primary adipose tissue-derived stem cells which indicated a cell viability exceeding 70%. Furthermore, the different formulations were processed using two-photon polymerization which indicated, in addition to differences in processing window and swelling ratio, a previously unreported phenomenon. At high intensities (i.e. ≥150 mW), the laser results in cleavage of the gelatin backbone even in the absence of distinct photo-cleavable functionalities. This can have potential to introduce channels or softer regions in gels to result in zones characterized by different degradation speeds or the formation of blood vessels. Consequently, the present study can be used to provide guidance towards tailoring the thiol-ene system towards the desired applications.",
        "DOI": "10.1088/1758-5090/abc95f",
        "paper_author": "van Hoorick J.",
        "affiliation_name": "Universiteit Gent",
        "affiliation_city": "Ghent",
        "affiliation_country": "Belgium",
        "affiliation_id": "60033316"
    },
    {
        "paper_title": "NHEJ inhibitor SCR7 and its different forms: Promising CRISPR tools for genome engineering",
        "publication": "Gene",
        "citied_by": "11",
        "cover_date": "2020-12-30",
        "Abstract": "The CRISPR-Cas system currently stands as one of the best multifaceted tools for site-specific genome engineering in mammals. An important aspect of research in this field focusses on improving the specificity and efficacy of precise genome editing in multiple model systems. The cornerstone of this mini-review is one of the extensively investigated small molecule inhibitor, SCR7, which abrogates NHEJ, a Ligase IV-dependent DSB repair pathway, thus guiding integration of the foreign DNA fragment via the more precise homology directed repair during genome editing. One of our recent studies sheds light on properties of different forms of SCR7. Here, we give a succinct account on the use of SCR7 and its different forms in CRISPR-Cas system, highlighting their chemical properties and biological relevance as potent efficiency-enhancing CRISPR tools.",
        "DOI": "10.1016/j.gene.2020.144997",
        "paper_author": "Ray U.",
        "affiliation_name": "Indian Institute of Science",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "60014097"
    },
    {
        "paper_title": "Structural and Functional Analyses of a Spiro-Carbon-Forming, Highly Promiscuous Epoxidase from Fungal Natural Product Biosynthesis",
        "publication": "Biochemistry",
        "citied_by": "10",
        "cover_date": "2020-12-29",
        "Abstract": "Biosynthesis of fungal nonribosomal peptides frequently involves redox enzymes such as flavin-containing monooxygenase (FMO) to introduce complexity into the core chemical structure. One such example is the formation of spiro-carbons catalyzed by various oxidases. Because many chemically complex spiro-carbon-bearing natural products exhibit useful biological activities, understanding the mechanism of spiro-carbon biosynthesis is of great interest. We previously identified FqzB, an FMO from the fumiquinazoline biosynthetic pathway responsible for epoxidation of fumiquinazoline F that crosstalks with the fumitremorgin biosynthetic pathway to form spirotryprostatin A via epoxidation of the precursor fumitremorgin C. What makes FqzB more interesting is its relaxed substrate specificity, where it can accept a range of other substrates, including tryprostatins A and B along with its original substrate fumiquinazoline F. Here, we characterized FqzB crystallographically and examined FqzB and its site-specific mutants kinetically to understand how this promiscuous epoxidase works. Furthermore, the mutagenesis studies as well as computational docking experiments between the FqzB crystal structure and its known substrates spirotryprostatin A and B, as well as fumitremorgin C and fumiquinazoline F, provided insight into potential modes of substrate recognition and the source of broad substrate tolerance exhibited by this epoxidase. This study serves as a foundation for further characterization and engineering of this redox enzyme, which has potential utility as a valuable catalyst with broad substrate tolerance and an ability to introduce chemical complexity into carbon frameworks for chemoenzymatic and biosynthetic applications.",
        "DOI": "10.1021/acs.biochem.0c00896",
        "paper_author": "Matsushita T.",
        "affiliation_name": "University of Shizuoka",
        "affiliation_city": "Shizuoka",
        "affiliation_country": "Japan",
        "affiliation_id": "60012080"
    },
    {
        "paper_title": "Defects and defect engineering in Soft Matter",
        "publication": "Soft Matter",
        "citied_by": "63",
        "cover_date": "2020-12-28",
        "Abstract": "Soft matter covers a wide range of materials based on linear or branched polymers, gels and rubbers, amphiphilic (macro)molecules, colloids, and self-assembled structures. These materials have applications in various industries, all highly important for our daily life, and they control all biological functions; therefore, controlling and tailoring their properties is crucial. One way to approach this target is defect engineering, which aims to control defects in the material's structure, and/or to purposely add defects into it to trigger specific functions. While this approach has been a striking success story in crystalline inorganic hard matter, both for mechanical and electronic properties, and has also been applied to organic hard materials, defect engineering is rarely used in soft matter design. In this review, we present a survey on investigations on defects and/or defect engineering in nine classes of soft matter composed of liquid crystals, colloids, linear polymers with moderate degree of branching, hyperbranched polymers and dendrimers, conjugated polymers, polymeric networks, self-assembled amphiphiles and proteins, block copolymers and supramolecular polymers. This overview proposes a promising role of this approach for tuning the properties of soft matter. This journal is",
        "DOI": "10.1039/d0sm01371d",
        "paper_author": "Jangizehi A.",
        "affiliation_name": "Johannes Gutenberg-Universität Mainz",
        "affiliation_city": "Mainz",
        "affiliation_country": "Germany",
        "affiliation_id": "60031216"
    },
    {
        "paper_title": "Engineering of chiral nanomaterials for biomimetic catalysis",
        "publication": "Chemical Science",
        "citied_by": "58",
        "cover_date": "2020-12-28",
        "Abstract": "Chiral nanomaterial-based biomimetic catalysts can trigger a similar biological effect to natural catalysts and exhibit high performance in biological applications. Especially, their active center similarity and substrate selectivity promoted their superior biocatalytic activity. Here, modification of critical elements, such as size, morphology, nanocrystal facets, chiral surface and active sites, for controlling the catalytic efficiency of individual chiral nanoparticles (NPs) and chiral nanoassemblies has been demonstrated, which had a synergistic effect on overcoming the defects of pre-existing nanocatalysts. Noticeably, application of external forces (light or magnetism) has resulted in obvious enhancement in biocatalytic efficiency. Chiral nanomaterials served as preferable biomimetic nanocatalysts due to their special structural configuration and chemical constitution advantages. Furthermore, the current challenges and future research directions of the preparation of high-performance bioinspired chiral nanomaterials for biological applications are discussed.",
        "DOI": "10.1039/d0sc03245j",
        "paper_author": "Zhang H.",
        "affiliation_name": "Jiangnan University",
        "affiliation_city": "Wuxi",
        "affiliation_country": "China",
        "affiliation_id": "60007029"
    },
    {
        "paper_title": "In vitro evaluation of surface biological properties of decellularized aorta for cardiovascular use",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "9",
        "cover_date": "2020-12-28",
        "Abstract": "The aim of this study was to determine an in vitro evaluation method that could directly predict in vivo performance of decellularized tissue for cardiovascular use. We hypothesized that key factors for in vitro evaluation would be found by in vitro assessment of decellularized aortas that previously showed good performance in vivo, such as high patency. We chose porcine aortas, decellularized using three different decellularization methods: sodium dodecyl-sulfate (SDS), freeze-thawing, and high-hydrostatic pressurization (HHP). Immunohistological staining, a blood clotting test, scanning electron microscopy (SEM) analysis, and recellularization of endothelial cells were used for the in vitro evaluation. There was a significant difference in the remaining extracellular matrix (ECM) components, ECM structure, and the luminal surface structure between the three decellularized aortas, respectively, resulting in differences in the recellularization of endothelial cells. On the other hand, there was no difference observed in the blood clotting test. These results suggested that the blood clotting test could be a key evaluation method for the prediction of in vivo performance. In addition, evaluation of the luminal surface structure and the recellularization experiment should be packaged as an in vitro evaluation because the long-term patency was probably affected. The evaluation approach in this study may be useful to establish regulations and a quality management system for a cardiovascular prosthesis.",
        "DOI": "10.1039/d0tb01830a",
        "paper_author": "Kobayashi M.",
        "affiliation_name": "Institute of Science Tokyo",
        "affiliation_city": "Tokyo",
        "affiliation_country": "Japan",
        "affiliation_id": "60283164"
    },
    {
        "paper_title": "Growing tool-kit of photosensitizers for clinical and non-clinical applications",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "20",
        "cover_date": "2020-12-28",
        "Abstract": "Photosensitizers are photosensitive molecules utilized in clinical and non-clinical applications by taking advantage of light-mediated reactive oxygen generation, which triggers local and systemic cellular toxicity. Photosensitizers are used for diverse biological applications such as spatio-temporal inactivation of a protein in a living system by chromophore-assisted light inactivation, localized cell photoablation, photodynamic and immuno-photodynamic therapy, and correlative light-electron microscopy imaging. Substantial efforts have been made to develop several genetically encoded, chemically synthesized, and nanotechnologically driven photosensitizers for successful implementation in redox biology applications. Genetically encoded photosensitizers (GEPS) or reactive oxygen species (ROS) generating proteins have the advantage of using them in the living system since they can be manipulated by genetic engineering with a variety of target-specific genes for the precise spatio-temporal control of ROS generation. The GEPS variety is limited but is expanding with a variety of newly emerging GEPS proteins. Apart from GEPS, a large variety of chemically- and nanotechnologically-empowered photosensitizers have been developed with a major focus on photodynamic therapy-based cancer treatment alone or in combination with pre-existing treatment methods. Recently, immuno-photodynamic therapy has emerged as an effective cancer treatment method using smartly designed photosensitizers to initiate and engage the patient's immune system so as to empower the photosensitizing effect. In this review, we have discussed various types of photosensitizers, their clinical and non-clinical applications, and implementation toward intelligent efficacy, ROS efficiency, and target specificity in biological systems.",
        "DOI": "10.1039/d0tb02085k",
        "paper_author": "Das S.",
        "affiliation_name": "Goa University",
        "affiliation_city": "Taleigao",
        "affiliation_country": "India",
        "affiliation_id": "60019020"
    },
    {
        "paper_title": "Efficient photoactivatable Dre recombinase for cell type-specific spatiotemporal control of genome engineering in the mouse",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "13",
        "cover_date": "2020-12-26",
        "Abstract": "Precise genetic engineering in specific cell types within an intact organism is intriguing yet challenging, especially in a spatiotemporal manner without the interference caused by chemical inducers. Here we engineered a photoactivatable Dre recombinase based on the identification of an optimal split site and demonstrated that it efficiently regulated transgene expression in mouse tissues spatiotemporally upon blue light illumination. Moreover, through a double-floxed inverted open reading frame strategy, we developed a Cre-activated light-inducible Dre (CALID) system. Taking advantage of well-defined cell-type–specific promoters or a well-established Cre transgenic mouse strain, we demonstrated that the CALID system was able to activate endogenous reporter expression for either bulk or sparse labeling of CaMKIIα-positive excitatory neurons and parvalbumin interneurons in the brain. This flexible and tunable system could be a powerful tool for the dissection and modulation of developmental and genetic complexity in a wide range of biological systems.",
        "DOI": "10.1073/PNAS.2003991117",
        "paper_author": "Li H.",
        "affiliation_name": "East China Normal University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60021200"
    },
    {
        "paper_title": "THE PERFORMATIVE NARRATIVITY of BIOPICTURES in the CONTEXT of BIOPOWER, BIOPOLITICS and A “WAR of IMAGES” after 9/11AS the EXAMPLES of CONTEMPORARY CLONOPHOBIA and ICONOPHOBIA",
        "publication": "Art Inquiry",
        "citied_by": "0",
        "cover_date": "2020-12-25",
        "Abstract": "The essay attempts to outline the main aspects of visual culture studies as the emergent theoretical formation of the performative narrativity of biopictures in the context of biopower, biopolitics and the “War of Images” as the examples of iconophobia and clonophobia. The subject of the performative narrativity of biopictures has been taken up in a discussion on some main ideas that seem to have been fundamental both for the negative and positive aspects of W.J.T. Mitchell’s agency concept of “visual subjects” in the context of meaning reproduction and iterability. The concept of biopictures also includes notions such as the very idea of an analogy to living forms of organisms, which is a metaphorical relationship, similar in the nature of things to the relation between biological and social bodies. The narrative issues of biopictures are addressed in the scenes where we see the velociraptor with the letters of the DNA code projected onto its skin, in Steven Spielberg’s Jurassic Park (1993), and the anonymous storm troopers who march off to their deaths, in George Lucas’s Star Wars, Episode II: Attack of the Clones (2002). Performative biopictures can be considered as living organisms, thematically referring to visual digital techniques and genetic engineering. Writing on biopictures as the tools of biopower and biopolitics, Mitchell recalls Michel Foucault’s and Giorgio Agamben’s concepts in which biopower and biopolitics have participated in the fundamental process of neoliberal power and creating living beings while exercising control over them. In the paper, the narrative and performative features of image as a “visual subject” have been described in feminist theory, cultural studies (Jacques Lacan, Stuart Hall) and visual culture studies (Nicholas Mirzoeff). The paper contains descriptions of the photo-collage From Dust to DNA by Kevin Clarke and Mikey Flowers, and a mural on the viaduct on the road to Tikrit, depicting Saddam’s clone army. These artworks have been discussed in the context of the “War on Terror,” in which all contemporary terrorism is bioterrorism based on the “suicide metaphor” of an “autoimmune disease” used by Jacques Derrida. The essay concludes with a reference to Mieke Bal’s “close reading” concept, in which performativity is combined with narrativity, as narrators can assign agency to the subject of narration and they embody anxiety over the processes of image making and destroying (iconoclasm).",
        "DOI": "10.26485/AI/2020/22/9",
        "paper_author": "Chmielecki K.",
        "affiliation_name": "Strzemiński Academy of Fine Arts in Łódź",
        "affiliation_city": null,
        "affiliation_country": "Poland",
        "affiliation_id": "125786615"
    },
    {
        "paper_title": "Surface engineered biomaterials and ureteral stents inhibiting biofilm formation and encrustation",
        "publication": "Surface and Coatings Technology",
        "citied_by": "38",
        "cover_date": "2020-12-25",
        "Abstract": "Protection of ureteral stents against infections is a significant current challenge raised by increasing the number of stentings and infections, microbial resistance to conventional antibiotics and multi-drugs treatments, side effects for the patients like damage of surrounding tissue and high morbidity. Surface engineered biomaterials and ureteral stents, reducing biofilm formation and encrustation would contribute to mitigation of the problem. The aim of this review is to present the progress during the last 5 years in the development of surface engineered antimicrobial biomaterials and stents with expectation to raise some new fruitful ideas in this direction. Strategies aimed at preventing, disrupting, or removing adherent microbes and biofilms from biomaterials and ureteral stents are its main subject. Various antibacterial agents, modifications, and coatings as well as preparation, deposition and characterization techniques are among the topics covered. A brief market analysis is also included covering the significance of ureteral stents associated infections and a mode of development of a biofilm. The review of the progress during the last 5 years shows a continuing interest in surface modification and coating employing three principal anti-biofilm strategies: 1) mechanical detachment; 2) killing microbial cells and 3) creation of low-adhesive surfaces. The known surface engineering solutions report a reduced, to some extent, biofilm formation and encrustation of biomaterials and ureteral stents, but none of them is able to totally stop their development. Some new trends are observed, such as complementary antimicrobial protection by coating and flow dynamic; biodegradable coatings releasing antimicrobial agent; quasi irremovable surface coatings, delivering drug or antimicrobial agent as well as new carbon and biodegradable materials; bacteriophages and phage cocktails, etc. Almost all of them are under intense in vitro studies; only few of them were studied in vivo animal models and none in humans. Some of the liquid infused coatings, already tested in animal models, seem to be the closest to clinical application but so far no one has been applied to ureteral stents. This review outlines some future research directions and major challenges in the surface engineered biomaterials and ureteral stents. It gives ideas how, by surface engineering, to approach more closely the “clean” ureteral stent to not allow microbial adhesion and encrustation and thus sharply reduce the ureteral stents associated infections and stent dysfunction. The most important prerequisite of the non-toxic “clean” surface is to be low adhesive. Its anti-biofilm performance could be improved by including bio-surfactant and/or inhibitor of quorum sensing (QS) and/or inhibitor of the crosslinking of the exopolymeric substances (EPSs). The key to identifying a “universal” surface that would repel/release all microbial cells is maybe hidden in the in-depth understanding of the mechanism of the initial reversible adsorption of the EPSs secreted by microbial cells, since it initiates the whole biological cascade of biofilm development.",
        "DOI": "10.1016/j.surfcoat.2020.126424",
        "paper_author": "Vladkova T.G.",
        "affiliation_name": "University of Chemical Technology and Metallurgy Sofia",
        "affiliation_city": "Sofia",
        "affiliation_country": "Bulgaria",
        "affiliation_id": "60022097"
    },
    {
        "paper_title": "Chemical Protein Synthesis in Medicinal Chemistry",
        "publication": "Journal of Medicinal Chemistry",
        "citied_by": "23",
        "cover_date": "2020-12-24",
        "Abstract": "Although the majority of proteins used for biomedical research are produced using living systems such as bacteria, biological means for producing proteins can be advantageously complemented by protein semisynthesis or total chemical synthesis. The latter approach is particularly useful when the proteins to be produced are toxic for the expression system or show unusual features that cannot be easily programmed in living organisms. The aim of this review is to provide a wide overview of the use of chemical protein synthesis in medicinal chemistry with a special focus on the production of post-translationally modified proteins and backbone cyclized proteins.",
        "DOI": "10.1021/acs.jmedchem.0c01082",
        "paper_author": "Agouridas V.",
        "affiliation_name": "Université de Lille",
        "affiliation_city": "Lille",
        "affiliation_country": "France",
        "affiliation_id": "60104665"
    },
    {
        "paper_title": "Design and Implementation of a blood pressure device with high sampling frequency to analyze cardiovascular diseases in LabVIEW",
        "publication": "6th Iranian Conference on Signal Processing and Intelligent Systems, ICSPIS 2020",
        "citied_by": "6",
        "cover_date": "2020-12-23",
        "Abstract": "considering the prevalence of hypertension in communities, the measurement of blood pressure is one of the most important parameters in the field of health. The first biomedical parameter taken from clients in health centers is blood pressure changes. With the advancement of technology in the field of medical engineering, analog blood pressure monitors have gradually been replaced by digital devices, such that the digital blood pressure monitors are used today. In this study, a system was designed and built that measures changes in blood pressure non-invasively and by an oscillometric method with high sampling frequency. In this research, first, the blood pressure hardware was designed and manufactured by instrumentation amplifier circuits to obtain the highest quality pressure signal. Then, in order to receive the signal and send digital data, the sampling frequency of one kHz was set in the microcontroller software to digitize the analog signal with high accuracy. Finally, the blood pressure signals were recorded with very low noise, and also systolic and diastolic pressures were calculated with appropriate quality in LabVIEW software. The performance of the device was tested on 20 subjects and the results were compared with valid digital sphygmomanometer. The number of heartbeats was also displayed according to the processing performed on the signal of changes in blood pressure. The system designed in this study provides the possibility of research on cardiovascular diseases by considering the record of the signal of high sampling frequency blood pressure changes and storing its data on the computer.",
        "DOI": "10.1109/ICSPIS51611.2020.9349618",
        "paper_author": "Hoseinzadeh M.S.",
        "affiliation_name": "Islamic Azad University, Science and Research Branch",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60105242"
    },
    {
        "paper_title": "Common features of swirling motion of two immiscible fluids in closed vortex reactors",
        "publication": "Journal of Physics: Conference Series",
        "citied_by": "0",
        "cover_date": "2020-12-23",
        "Abstract": "The paper analyses the typical topology of swirling flows of two immiscible fluids generated in the cylindrical container by its rotating end wall. Using the flow visualization and velocity measurements by PIV for different parameters of rotation of the upper end of the cylinder, this study reveals general features of the evolution of counter flow (bubble-like vortex breakdown, VB) which is common for vortex flows with various liquids at the interface or the solid rotated end. In both fluids, the rotation generates centrifugal meridional circulations and a local circulation cell (vortex breakdown bubble, VBB). The research shows that the scenario for the VBB appearance depends weakly on the properties of the medium that restricts the circulation of the working fluid. Patterns and formation of cellular structure appear common for flows with \"liquid bottom\" and \"liquid rotating lid\". The VBB scenario is similar to that occurring in a single-fluid flow and in the upper or lower fluids of a two-fluid flow, but the range of the Reynolds numbers can be different depending on the volume of the upper fluid and kinematic viscosity of the lower liquid. This study can serve as the first step in the “rotating liquid lid” and “liquid lid” technology for chemical and biological processes where fine, gentle, and nonintrusive mixing is favourable.",
        "DOI": "10.1088/1742-6596/1683/2/022033",
        "paper_author": "Naumov I.V.",
        "affiliation_name": "Institute of Thermophysics, Siberian Branch, Russian Academy of Sciences",
        "affiliation_city": "Novosibirsk",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60069634"
    },
    {
        "paper_title": "Experimental studies of hydrogen-absorbing properties of intermetallic compound LaNi<inf>4.4</inf>Fe<inf>0.3</inf>Al<inf>0.3</inf>for hydrogen purification",
        "publication": "Journal of Physics: Conference Series",
        "citied_by": "2",
        "cover_date": "2020-12-23",
        "Abstract": "Hydrogen/methane mixtures draw attention due to the idea of the injection of hydrogen into natural gas networks and biological production of biohythane by one- and two-step anaerobic fermentation/digestion methods. It is hard to extract hydrogen from dilute mixtures with methane by traditional separation processes, since hydrogen is the minor component with low partial pressure. Metal hydrides selectively absorb hydrogen and offer an opportunity to overcome the limitations of traditional separation methods. Intermetallic alloy of lowered pressure LaNi4.4Fe0.3Al0.3was made (obtained) to use it in the extraction of hydrogen out of a mixture of gases. Hydrogen absorption properties of alloy were investigated. PCT isotherms between 313K and 353K, porosity, average particle size, specific surface area and permeability of metal hydride bed were measured, X-ray diffraction (XRD) and SEM investigation of bed structure were implemented. Experimental study of processes during the extraction of hydrogen out of binary mixture H2-CH4 (10% vol.-90% vol.) were carried out by means of continuous-flow metal hydride reactor RSP-8, filled with 1 kg of LaNi4.4Fe0.3Al0.3. Recover ratio with the mixture pressure of 1.0 MPa stood at 70%.",
        "DOI": "10.1088/1742-6596/1683/3/032036",
        "paper_author": "Blinov D.V.",
        "affiliation_name": "Joint Institute for High Temperatures of the Russian Academy of Sciences",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60017889"
    },
    {
        "paper_title": "Non-contact heat transfer models identification: Laser hyperthermia of superficial human tissues",
        "publication": "Journal of Physics: Conference Series",
        "citied_by": "1",
        "cover_date": "2020-12-23",
        "Abstract": "Planning and predicting the processes of biological tissues heating associated with therapeutic effects involves high-precision mathematical modelling. However, the thermophysical properties of tissues can vary greatly from patient to patient. The paper presents a computational and experimental method for identifying mathematical models of heat transfer, not involving the placement of temperature sensors inside of the studied object. The experimental setup consists of a flat sample of the material, a laser setup, and a thermal imaging camera. The surface thermal response to the pulsed heat flux of the laser is an array of input data for the developed software package. The heat transfer coefficient and heat flux density are determined iteratively by minimizing the residual functional between the calculated and experimental values. The method was tested when determining the characteristics of a specimen of low-pressure polyethylene. The result was obtained in 5 iterations and under the influence of external natural convection, and without taking into account the translucency of the material, a discrepancy of calculated and experimental values of 3.5% was shown. The method can be used to plan the therapeutic process in order to ensure its maximum effectiveness.",
        "DOI": "10.1088/1742-6596/1683/2/022011",
        "paper_author": "Semenov D.S.",
        "affiliation_name": "Moscow Aviation Institute (National Research University)",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60069256"
    },
    {
        "paper_title": "Heavy metals absorption by excessive activated sludge of biological treatment facilities",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "0",
        "cover_date": "2020-12-23",
        "Abstract": "The study was conducted at the biological treatment facilities of Veliky Novgorod. It has been established that the main percentage of metals is contained in the organic component of the conditionally solid phase of excess activated sludge. Based on the study of the elemental composition of the excess activated sludge, it is concluded that organic compounds containing aromatic, aliphatic and amine-containing functional groups are very diverse in the excess activated sludge. Main classes of substances making up the excess activated sludge are established. The mass fractions of the main classes of organic compounds established by the rational method are in good agreement with the analysis of the main classes of organic compounds that make up the excess activated sludge of biological treatment plants. The main compounds making up the inorganic component of the conditionally solid phase of excess activated sludge are determined. The study reveals a large variety of both organic and inorganic compounds in the excess activated sludge, which are able to bind heavy metal ions from aqueous medium due to physical and chemical interactions.",
        "DOI": "10.1088/1755-1315/613/1/012167",
        "paper_author": "Zykova I.V.",
        "affiliation_name": "Yaroslav-the-Wise Novgorod State University",
        "affiliation_city": "Veliky Novgorod",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60020104"
    },
    {
        "paper_title": "Phytoremediation as a method for cleaning sludge beds of biological treatment plants from heavy metals",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "2",
        "cover_date": "2020-12-23",
        "Abstract": "The aim of this study is to select a phytoremediation plant for cleaning sludge beds of biological treatment plants from heavy metals. The study was conducted on sludge beds of biological treatment facilities of Veliky Novgorod with a sludge retention time of 1 year and 15 years. It is established that the forms of metals in the sludges and wastewater sludge depend on the nature of the metal. Manganese (II) predominantly binds to compounds that make up sludge and wastewater sludge by the ion exchange mechanism, copper (II) - by the complex formation mechanism, zinc (II) - is codeposited with calcium and magnesium carbonates, manganese (IV) and iron hydroxides (III). Six selected plants were analyzed (bedstraw, cow vetch, field daisy, silverweed cinquefoil, base vervain, winter cress), those growing on sludge beds with a sludge retention time of 15 years, for the content of copper (II), zinc (II) and manganese (II) in different parts of plants. The phytoremediation plant was selected according to the indicators of the coefficient of biological accumulation (coefficient of biological accumulation) and translocation factor. It has been established that the bedstraw can be called a universal phytoremediation plant, in the absence of significant sludge contamination with copper (II), it is most preferable to use base vervain. Selected phytoremediation plants can be used for artificial planting on sludge beds in order to further use these beds as fertile lands.",
        "DOI": "10.1088/1755-1315/613/1/012168",
        "paper_author": "Zykova I.V.",
        "affiliation_name": "Yaroslav-the-Wise Novgorod State University",
        "affiliation_city": "Veliky Novgorod",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60020104"
    },
    {
        "paper_title": "Mesenchymal stem cell-derived extracellular matrix (mECM): a bioactive and versatile scaffold for musculoskeletal tissue engineering",
        "publication": "Biomedical Materials (Bristol)",
        "citied_by": "11",
        "cover_date": "2020-12-23",
        "Abstract": "Mesenchymal stem cell-derived extracellular matrix (mECM) has received increased attention in the fields of tissue engineering and scaffold-assisted regeneration. mECM exhibits many unique characteristics, such as robust bioactivity, biocompatibility, ease of use, and the potential for autologous tissue engineering. As the use of mECM has increased in musculoskeletal tissue engineering, it should be noted that mECM generated from current methods has inherited insufficiencies, such as low mechanical properties and lack of internal architecture. In this review, we first summarize the development and use of mECM as a scaffold for musculoskeletal tissue regeneration and highlight our current progress on moving this technology toward clinical application. Then we review recent methods to improve the properties of mECM that will overcome current weaknesses. Lastly, we propose future studies that will pave the road for mECM application in regenerating tissues in humans.",
        "DOI": "10.1088/1748-605X/abb6b3",
        "paper_author": "Zhang X.",
        "affiliation_name": "University of Pittsburgh School of Medicine",
        "affiliation_city": "Pittsburgh",
        "affiliation_country": "United States",
        "affiliation_id": "60001361"
    },
    {
        "paper_title": "Tracking collective cell motion by topological data analysis",
        "publication": "PLoS Computational Biology",
        "citied_by": "16",
        "cover_date": "2020-12-23",
        "Abstract": "By modifying and calibrating an active vertex model to experiments, we have simulated numerically a confluent cellular monolayer spreading on an empty space and the collision of two monolayers of different cells in an antagonistic migration assay. Cells are subject to inertial forces and to active forces that try to align their velocities with those of neighboring ones. In agreement with experiments in the literature, the spreading test exhibits formation of fingers in the moving interfaces, there appear swirls in the velocity field, and the polar order parameter and the correlation and swirl lengths increase with time. Numerical simulations show that cells inside the tissue have smaller area than those at the interface, which has been observed in recent experiments. In the antagonistic migration assay, a population of fluidlike Ras cells invades a population of wild type solidlike cells having shape parameters above and below the geometric critical value, respectively. Cell mixing or segregation depends on the junction tensions between different cells. We reproduce the experimentally observed antagonistic migration assays by assuming that a fraction of cells favor mixing, the others segregation, and that these cells are randomly distributed in space. To characterize and compare the structure of interfaces between cell types or of interfaces of spreading cellular monolayers in an automatic manner, we apply topological data analysis to experimental data and to results of our numerical simulations. We use time series of data generated by numerical simulations to automatically group, track and classify the advancing interfaces of cellular aggregates by means of bottleneck or Wasserstein distances of persistent homologies. These techniques of topological data analysis are scalable and could be used in studies involving large amounts of data. Besides applications to wound healing and metastatic cancer, these studies are relevant for tissue engineering, biological effects of materials, tissue and organ regeneration.",
        "DOI": "10.1371/journal.pcbi.1008407",
        "paper_author": "Bonilla L.L.",
        "affiliation_name": "Universidad Carlos III de Madrid",
        "affiliation_city": "Getafe",
        "affiliation_country": "Spain",
        "affiliation_id": "60001741"
    },
    {
        "paper_title": "Design and Applications of Water-Soluble Coordination Cages",
        "publication": "Chemical Reviews",
        "citied_by": "364",
        "cover_date": "2020-12-23",
        "Abstract": "Compartmentalization of the aqueous space within a cell is necessary for life. In similar fashion to the nanometer-scale compartments in living systems, synthetic water-soluble coordination cages (WSCCs) can isolate guest molecules and host chemical transformations. Such cages thus show promise in biological, medical, environmental, and industrial domains. This review highlights examples of three-dimensional synthetic WSCCs, offering perspectives so as to enhance their design and applications. Strategies are presented that address key challenges for the preparation of coordination cages that are soluble and stable in water. The peculiarities of guest binding in aqueous media are examined, highlighting amplified binding in water, changing guest properties, and the recognition of specific molecular targets. The properties of WSCC hosts associated with biomedical applications, and their use as vessels to carry out chemical reactions in water, are also presented. These examples sketch a blueprint for the preparation of new metal-organic containers for use in aqueous solution, as well as guidelines for the engineering of new applications in water.",
        "DOI": "10.1021/acs.chemrev.0c00672",
        "paper_author": "Percástegui E.G.",
        "affiliation_name": "University of Cambridge",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60031101"
    },
    {
        "paper_title": "Cationic Nanoparticle-Mediated Activation of Natural Killer Cells for Effective Cancer Immunotherapy",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "54",
        "cover_date": "2020-12-23",
        "Abstract": "Natural killer (NK) cells have been recognized as a next-generation therapy for cancer as they are less likely to trigger adverse events (e.g., cytokine storm or graft-versus-host disease) than T cell-based therapeutics. Although NK cell activation strategies through genetic engineering and cytokine treatment have been actively studied for successful cancer treatment, the approaches are inefficient, expensive, and involve complex processing. Here, we developed a facile and efficient method of activating NK cells using cationic nanoparticles (cNPs). The cytotoxic activity of cNP-treated primary NK and NK-92MI cells against triple-negative breast cancer cells was over 2-fold higher than that of control NK cells in vitro. Molecular biological analyses confirmed that cNPs altered the expression of CCR4 and CXCR4 of NK cells that function as chemokine receptors. In vitro live cell imaging showed that the NK cells treated with cNPs were better than control NK cells at interacting with cancer cells. Consistent with these in vitro results, cNP-treated NK cells effectively inhibited tumor growth in an in vivo tumor animal model of triple-negative breast cancer. Additionally, NK cells treated with cNPs were tracked effectively in vivo by magnetic resonance imaging. Thus, cNP-mediated activation of NK cells has great potential as an NK cell-based cancer immunotherapy. Most of all, activating NK cells using cNPs has a great advantage over conventional methods in that immune cells can be activated by a one-step facile process with exogenously charged nanomaterials, without the need for genetic engineering or cytokine treatment.",
        "DOI": "10.1021/acsami.0c16357",
        "paper_author": "Kim K.S.",
        "affiliation_name": "College of Medicine, Pochon CHA University",
        "affiliation_city": "Pocheon",
        "affiliation_country": "South Korea",
        "affiliation_id": "60005389"
    },
    {
        "paper_title": "Nanotechnologies in agricultural engineering: Practice and prospects",
        "publication": "E3S Web of Conferences",
        "citied_by": "11",
        "cover_date": "2020-12-22",
        "Abstract": "The use of powdered concentrates increases the digestibility of feed components by the animal body. The biological activity of organic products increases due to the intensification of the process of useful substances extraction from them. The scientific basis for the formation of nanotechnologies is system effects, as well as features of physical, mechanical and biochemical phenomena that occur in powdered materials at the atomic and molecular levels and provide a synergistic effect. Using modern analytical tools in the field of nanoparticle research, a method for conducting search experiments has been developed, which provides for the possibility of studying the transformations occurring in the deep layers of substances and trace elements. Fine fractions participate in the formation of the structure of the final product, act as its leavening agents and sweeteners, as well as absorbers of excess moisture contained in raw materials. Hypersonic grinding using quantum aerogravity technology has shown the applicability, scientific and technical significance and prospects of this direction in the development of the powder industry.",
        "DOI": "10.1051/e3sconf/202022201022",
        "paper_author": "Kerimov M.",
        "affiliation_name": "Saint-Petersburg State Agrarian University",
        "affiliation_city": "Saint Petersburg",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60113537"
    },
    {
        "paper_title": "Dynamic Flexible Hydrogel Network with Biological Tissue-like Self-Protective Functions",
        "publication": "Chemistry of Materials",
        "citied_by": "36",
        "cover_date": "2020-12-22",
        "Abstract": "Biological tissues are capable of stiffening and self-healing as they are strained or damaged in order to preserve their integrity and functionalities. However, mimicking both strain-stiffening and self-healing functions of biological tissues in biocompatible flexible hydrogels remains a challenge. Here, we report a flexible hydrogel constructed by two biocompatible polymers, which can smartly adopt biological strain-stiffening or self-healing strategy to maintain the structural integrity and functionalities in response to mechanical deformation. The hydrogel can be reversibly and repeatedly stiffened up to eight times of its original modulus as it is strained, without showing mechanical hysteresis. Besides, the damaged hydrogel can repeatedly self-heal within seconds and fully retains the strain-stiffening capability. In addition, benefitting from the excellent biocompatibility and dynamic nature, the biomimetic hydrogel can be facilely applied for 3D cell encapsulation. This work provides novel insights into the molecular design of tissue-like self-protective soft materials, which may also inspire the development of biomimetic cell culture matrices, artificial tissues, as well as soft machines and robotics for various biomedical and engineering applications.",
        "DOI": "10.1021/acs.chemmater.0c03526",
        "paper_author": "Wang W.",
        "affiliation_name": "University of Alberta",
        "affiliation_city": "Edmonton",
        "affiliation_country": "Canada",
        "affiliation_id": "60030835"
    },
    {
        "paper_title": "Mie Resonance Engineering in Meta-Shell Supraparticles for Nanoscale Nonlinear Optics",
        "publication": "ACS Nano",
        "citied_by": "21",
        "cover_date": "2020-12-22",
        "Abstract": "Supraparticles are coordinated assemblies of discrete nanoscale building blocks into complex and hierarchical colloidal superstructures. Holistic optical responses in such assemblies are not observed in an individual building block or in their bulk counterparts. Furthermore, subwavelength dimensions of the unit building blocks enable engraving optical metamaterials within the supraparticle, which thus far has been beyond the current pool of colloidal engineering. This can lead to effective optical features in a colloidal platform with ability to tune the electromagnetic responses of these particles. Here, we introduce and demonstrate the nanophotonics of meta-shell supraparticle (MSP), an all dielectric colloidal superstructure having an optical nonlinear metamaterial shell conformed onto a spherical core. We show that the metamaterial shell facilitates engineering the Mie resonances in the MSP that enable significant enhancement of the second harmonic generation (SHG). We show several orders of magnitude enhancement of second-harmonic generation in an MSP compared to its building blocks. Furthermore, we show an absolute conversion efficiency as high as 10-7 far from the damage threshold, setting a benchmark for SHG with low-index colloids. The MSP provides pragmatic solutions for instantaneous wavelength conversions with colloidal platforms that are suitable for chemical and biological applications. Their engineerability and scalability promise a fertile ground for nonlinear nanophotonics in the colloidal platforms with structural and material diversity.",
        "DOI": "10.1021/acsnano.0c07127",
        "paper_author": "Bahng J.H.",
        "affiliation_name": "California Institute of Technology Division of Engineering and Applied Science",
        "affiliation_city": "Pasadena",
        "affiliation_country": "United States",
        "affiliation_id": "60143898"
    },
    {
        "paper_title": "Molecular to Macroscale Energy Absorption Mechanisms in Biological Body Armour Illuminated by Scanning X-ray Diffraction with in Situ Compression",
        "publication": "ACS Nano",
        "citied_by": "8",
        "cover_date": "2020-12-22",
        "Abstract": "Determining multiscale, concurrent strain, and deformation mechanisms in hierarchical biological materials is a crucial engineering goal, to understand structural optimization strategies in Nature. However, experimentally characterizing complex strain and displacement fields within a 3D hierarchical composite, in a multiscale full-field manner, is challenging. Here, we determined the in situ strains at the macro-, meso-, and molecular-levels in stomatopod cuticle simultaneously, by exploiting the anisotropy of the 3D fiber diffraction coupled with sample rotation. The results demonstrate the method, using the mineralized 3D α-chitin fiber networks as strain sensors, can capture submicrometer deformation of a single lamella (mesoscale), can extract strain information on multiple constituents concurrently, and shows that α-chitin fiber networks deform elastically while the surrounding matrix deforms plastically before systematic failure under compression. Further, the results demonstrate a molecular-level prestrain gradient in chitin fibers, resulting from different mineralization degrees in the exo- A nd endo cuticle.",
        "DOI": "10.1021/acsnano.0c02879",
        "paper_author": "Zhang Y.",
        "affiliation_name": "Institute of High Energy Physics, Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027631"
    },
    {
        "paper_title": "Solution of the fundamental tasks of deep processing of plant waste in the reshetnev Siberian State University of Science and Technology",
        "publication": "Khimiya Rastitel'nogo Syr'ya",
        "citied_by": "0",
        "cover_date": "2020-12-21",
        "Abstract": "A special issue of the journal \"Chemistry of Plant Raw Materials\" published on the 65th anniversary of the department \"Chemical Technology of Wood and Biotechnology\", the 90th anniversary of the Siberian State Technological University and the 60th anniversary of the Siberian State Aerospace University. The combination of the two largest and socio-economically significant universities ensured the creation in 2016 of the Reshetnev Siberian State University of science and technology. This is the first supporting university in Eastern Siberia, providing training for highly qualified specialists in more than 100 programs for the forestry, woodworking and chemical industries, aviation and space industry, mechanical engineering, scientific and financial organizations, international and Russian business structures, and the media. The introductory article presents a brief historical excursion, the main directions and prospects of scientific activity of the department “Chemical technology of wood and biotechnology”. They are related to solving the problem of deep complex processing of plant materials with the involvement of modern biological and chemical technologies.",
        "DOI": "10.14258/JCPRM.2020048438",
        "paper_author": "Akbulatov E.S.",
        "affiliation_name": "Reshetnev Siberian State University of Science and Technology",
        "affiliation_city": "Krasnoyarsk",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60075528"
    },
    {
        "paper_title": "Investigation of the Bragg peak degradation caused by homogeneous and heterogeneous lung tissue substitutes: Proton beam experiments and comparison to current clinical dose calculation",
        "publication": "Physics in Medicine and Biology",
        "citied_by": "11",
        "cover_date": "2020-12-21",
        "Abstract": "Submillimetre structures of lung tissue are not represented in computed tomography images used for radiotherapeutic dose calculation. In order to study the effect experimentally, lung substitutes with properties similar to lung tissue were chosen, namely two types of commercial lung tissue equivalent plates (LTEPs) (CIRS, USA), two types of cork, balsawood, floral foam and konjac sponge. Laterally integrated dose profiles were measured as a function of depth for proton pencil beams (PBs) with an initial nominal energy of 97.4 and 148.2 MeV, respectively. The obtained dose profiles were investigated for their shifting and degradation of the Bragg peak (BP) caused by the materials, expressed as water equivalent thickness (WET) and full width half maximum. The set-up was simulated in the treatment planning system (TPS) RayStation using the Monte Carlo (MC) dose calculation algorithm. While the WET between experiment and dose calculation agreed within 0.5 mm, except for floral foam, the full width half maximum was underestimated in the TPS by up to 2.3 mm. Normalisation to the same mass thickness of the lung substitutes allowed to classify LTEPs and balsawood as homogeneous and cork, floral foam and konjac sponge as heterogeneous materials. The material specific BP degradation was up to 3.4 times higher for the heterogeneous samples. The modulation power as a measure for the heterogeneity was compared to the spectrum of Hounsfield units (HU) of the materials. A clear correlation was not found, but with further improvements the HU spectrum may serve as an indicator for the material heterogeneity. Further, MC simulations of binary voxel models using GATE/Geant4 were performed to investigate the influence of grain size and mass density. For mass densities similar to lung tissue the BP degradation had a maximum at 3 and 7 mm grain size.",
        "DOI": "10.1088/1361-6560/abc938",
        "paper_author": "Hranek A.",
        "affiliation_name": "Medizinische Universität Wien",
        "affiliation_city": "Vienna",
        "affiliation_country": "Austria",
        "affiliation_id": "60011394"
    },
    {
        "paper_title": "Silk fibroin photo-lyogels containing microchannels as a biomaterial platform for: In situ tissue engineering",
        "publication": "Biomaterials Science",
        "citied_by": "21",
        "cover_date": "2020-12-21",
        "Abstract": "The biophysical properties of biomaterials are key to directing the biological responses and biomaterial integration and function in in situ tissue engineering approaches. We present silk photo-lyogels, a biomaterial format fabricated using a new combinatorial approach involving photo-initiated crosslinking of silk fibroin via di-tyrosine bonds followed by lyophilization to generate 3D, porous lyogels showing physical properties distinct to those of lyophilized silk sponges or silk hydrogels. This fabrication approach allowed introduction of microchannels into 3D constructs via biofabrication approaches involving silk crosslinking around an array of 3D printed photocurable resin pillars to generate parallel channels or around a 3D printed sacrificial thermosensitive gel to generate interconnected channels in a rapid manner and without the need for chemical modification of silk fibroin. The presence of interconnected microchannels significantly improved migration of endothelial cells into 3D photo-lyogels in vitro, and tissue infiltration, photo-lyogel integration, and vascularization when implanted in vivo in a mouse subcutaneous model. Taken together, these findings demonstrate the feasibility and utility of a new combinatorial fabrication approach for generation of silk biomaterials that support cell interactions and implant integration for in situ tissue engineering approaches.",
        "DOI": "10.1039/d0bm01010c",
        "paper_author": "Baptista M.",
        "affiliation_name": "UNSW Sydney",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60028333"
    },
    {
        "paper_title": "Biomaterial-based approaches to engineering immune tolerance",
        "publication": "Biomaterials Science",
        "citied_by": "10",
        "cover_date": "2020-12-21",
        "Abstract": "The development of biomaterial-based therapeutics to induce immune tolerance holds great promise for the treatment of autoimmune diseases, allergy, and graft rejection in transplantation. Historical approaches to treat these immunological challenges have primarily relied on systemic delivery of broadly-acting immunosuppressive agents that confer undesirable, off-target effects. The evolution and expansion of biomaterial platforms has proven to be a powerful tool in engineering immunotherapeutics and enabled a great diversity of novel and targeted approaches in engineering immune tolerance, with the potential to eliminate side effects associated with systemic, non-specific immunosuppressive approaches. In this review, we summarize the technological advances within three broad biomaterials-based strategies to engineering immune tolerance: nonspecific tolerogenic agent delivery, antigen-specific tolerogenic therapy, and the emergent area of tolerogenic cell therapy.",
        "DOI": "10.1039/d0bm01171a",
        "paper_author": "Emerson A.E.",
        "affiliation_name": "Ira A. Fulton Schools of Engineering",
        "affiliation_city": "Tempe",
        "affiliation_country": "United States",
        "affiliation_id": "60139200"
    },
    {
        "paper_title": "Enabling high-throughput single-animal gene-expression studies with molecular and micro-scale technologies",
        "publication": "Lab on a Chip",
        "citied_by": "4",
        "cover_date": "2020-12-21",
        "Abstract": "Gene expression and regulation play diverse and important roles across all living systems. By quantifying the expression, whether in a sample of single cells, a specific tissue, or in a whole animal, one can gain insights into the underlying biology. Many biological questions now require single-animal and tissue-specific resolution, such as why individuals, even within an isogenic population, have variations in development and aging across different tissues and organs. The popular techniques that quantify the transcriptome (e.g. RNA-sequencing) process populations of animals and cells together and thus, have limitations in both individual and spatial resolution. There are single-animal assays available (e.g. fluorescent reporters); however, they suffer other technical bottlenecks, such as a lack of robust sample-handling methods. Microfluidic technologies have demonstrated various improvements throughout the years, and it is likely they can enhance the impact of these single-animal gene-expression assays. In this perspective, we aim to highlight how the engineering/method-development field have unique opportunities to create new tools that can enable us to robustly answer the next set of important questions in biology that require high-density, high-quality gene expression data.",
        "DOI": "10.1039/d0lc00881h",
        "paper_author": "Wan J.",
        "affiliation_name": "Georgia Institute of Technology",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60019647"
    },
    {
        "paper_title": "Progress in the mechanical modulation of cell functions in tissue engineering",
        "publication": "Biomaterials Science",
        "citied_by": "49",
        "cover_date": "2020-12-21",
        "Abstract": "In mammals, mechanics at multiple stages - nucleus to cell to ECM - underlie multiple physiological and pathological functions from its development to reproduction to death. Under this inspiration, substantial research has established the role of multiple aspects of mechanics in regulating fundamental cellular processes, including spreading, migration, growth, proliferation, and differentiation. However, our understanding of how these mechanical mechanisms are orchestrated or tuned at different stages to maintain or restore the healthy environment at the tissue or organ level remains largely a mystery. Over the past few decades, research in the mechanical manipulation of the surrounding environment - known as substrate or matrix or scaffold on which, or within which, cells are seeded - has been exceptionally enriched in the field of tissue engineering and regenerative medicine. To do so, traditional tissue engineering aims at recapitulating key mechanical milestones of native ECM into a substrate for guiding the cell fate and functions towards specific tissue regeneration. Despite tremendous progress, a big puzzle that remains is how the cells compute a host of mechanical cues, such as stiffness (elasticity), viscoelasticity, plasticity, non-linear elasticity, anisotropy, mechanical forces, and mechanical memory, into many biological functions in a cooperative, controlled, and safe manner. High throughput understanding of key cellular decisions as well as associated mechanosensitive downstream signaling pathway(s) for executing these decisions in response to mechanical cues, solo or combined, is essential to address this issue. While many reports have been made towards the progress and understanding of mechanical cues - particularly, substrate bulk stiffness and viscoelasticity - in regulating the cellular responses, a complete picture of mechanical cues is lacking. This review highlights a comprehensive view on the mechanical cues that are linked to modulate many cellular functions and consequent tissue functionality. For a very basic understanding, a brief discussion of the key mechanical players of ECM and the principle of mechanotransduction process is outlined. In addition, this review gathers together the most important data on the stiffness of various cells and ECM components as well as various tissues/organs and proposes an associated link from the mechanical perspective that is not yet reported. Finally, beyond addressing the challenges involved in tuning the interplaying mechanical cues in an independent manner, emerging advances in designing biomaterials for tissue engineering are also explored.",
        "DOI": "10.1039/d0bm01255f",
        "paper_author": "Dey K.",
        "affiliation_name": "University of Chittagong",
        "affiliation_city": "Chittagong",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60033059"
    },
    {
        "paper_title": "Simulating selective binding of a biological template to a nanoscale architecture: A core concept of a clamp-based binding-pocket-favored N-terminal-domain assembly",
        "publication": "Nanoscale",
        "citied_by": "20",
        "cover_date": "2020-12-21",
        "Abstract": "The biological template and its mutants have vital significance in next generation remediation, electrochemical, photovoltaic, catalytic, sensing and digital memory devices. However, a microscopic model describing the biotemplating process is generally lacking on account of modelling complexity, which has prevented widespread commercial use of biotemplates. Here, we demonstrate M13-biotemplating kinetics in atomic resolution by leveraging large-scale molecular dynamics (MD) simulations. The model reveals the assembly of gold nanoparticles on two experimentally-based M13 phage types using full M13-capsid structural models and with polarizable gold nanoparticles in explicit solvent. Both mechanistic and structural insights into the selective binding affinity of the M13 phage to gold nanoparticles are obtained based on a previously unconsidered clamp-based binding-pocket-favored N-terminal-domain assembly and also on surface-peptide flexibility. These results provide a deeper level of understanding of protein sequence-based affinity and open the route for genetically engineering a wide range of 3D electrodes for high-density low-cost device integration. This journal is",
        "DOI": "10.1039/d0nr07320b",
        "paper_author": "Li L.",
        "affiliation_name": "MIT School of Engineering",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60140949"
    },
    {
        "paper_title": "Nanoplatform-based cascade engineering for cancer therapy",
        "publication": "Chemical Society Reviews",
        "citied_by": "139",
        "cover_date": "2020-12-21",
        "Abstract": "Various therapeutic techniques have been studied for treating cancer precisely and effectively, such as targeted drug delivery, phototherapy, tumor-specific catalytic therapy, and synergistic therapy, which, however, evoke numerous challenges due to the inherent limitations of these therapeutic modalities and intricate biological circumstances as well. With the remarkable advances of nanotechnology, nanoplatform-based cascade engineering, as an efficient and booming strategy, has been tactfully introduced to optimize these cancer therapies. Based on the designed nanoplatforms, pre-supposed cascade processes could be triggered under specific conditions to generate/deliver more therapeutic species or produce stronger tumoricidal effects inside tumors, aiming to achieve cancer therapy with increased anti-tumor efficacy and diminished side effects. In this review, the recent advances in nanoplatform-based cascade engineering for cancer therapy are summarized and discussed, with an emphasis on the design of smart nanoplatforms with unique structures, compositions and properties, and the implementation of specific cascade processes by means of endogenous tumor microenvironment (TME) resources and/or exogenous energy inputs. This fascinating strategy presents unprecedented potential in the enhancement of cancer therapies, and offers better controllability, specificity and effectiveness of therapeutic functions compared to the corresponding single components/functions. In the end, challenges and prospects of such a burgeoning strategy in the field of cancer therapy will be discussed, hopefully to facilitate its further development to meet the personalized treatment demands. This journal is",
        "DOI": "10.1039/d0cs00607f",
        "paper_author": "Chen J.",
        "affiliation_name": "Shanghai Institute of Ceramics, Chinese Academy of Sciences",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60020044"
    },
    {
        "paper_title": "Evaporation Induced Spontaneous Micro-Vortexes through Engineering of the Marangoni Flow",
        "publication": "Angewandte Chemie - International Edition",
        "citied_by": "25",
        "cover_date": "2020-12-21",
        "Abstract": "Vortex flow fields are widely used to manipulate objects at the microscale in microfluidics. Previous approaches to produce the vortex flow field mainly focused on inertia flows. It remains a challenge to create vortexes in Stokes flow regime. Here we reported an evaporation induced spontaneous vortex flow system in Stokes flow regime by engineering Marangoni flow in a micro-structured microfluidic chip. The Marangoni flow is created by nonuniform evaporation of surfactant solution. Various vortexes are constructed by folding the air–water interface via microstructures. Patterns of vortexes are programmable by designing the geometry of the microstructures and are predictable using numerical simulations. Moreover, rotation of micro-objects and enrichment of micro-particles using vortex flow is demonstrated. This approach to create vortexes will provide a promising platform for various microfluidic applications such as biological analysis, chemical synthesis, and nanomaterial assembly.",
        "DOI": "10.1002/anie.202008477",
        "paper_author": "Cai Z.",
        "affiliation_name": "Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60019499"
    },
    {
        "paper_title": "Highly Specific, Single-step Cancer Cell Isolation with Multi-Aptamer-Mediated Proximity Ligation on Live Cell Membranes",
        "publication": "Angewandte Chemie - International Edition",
        "citied_by": "91",
        "cover_date": "2020-12-21",
        "Abstract": "A single-step method for isolation of specific cells based on multiple surface markers will have unique advantages because of its scalability, efficacy, and mildness. Herein, we developed multi-aptamer-mediated proximity ligation method on live cell membranes that leverages a multi-receptor co-recognition design for enhanced specificity, as well as a robust in situ signal amplification design for improved sensitivity of cell isolation. We demonstrated the promising efficacy of our method on differentiating tumor cell subtypes in both cell mixtures and clinical samples. Owing to its simple and fast operation with excellent cell isolation sensitivity and accuracy, this approach will have broad applications in biological science, biomedical engineering, and personalized medicine.",
        "DOI": "10.1002/anie.202011198",
        "paper_author": "Gao Q.",
        "affiliation_name": "Shanghai Jiao Tong University School of Medicine",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60082819"
    },
    {
        "paper_title": "Principle and application of urea wastewater biological treatment technology",
        "publication": "Zhongguo Huanjing Kexue/China Environmental Science",
        "citied_by": "5",
        "cover_date": "2020-12-20",
        "Abstract": "The treatment of urea wastewater has become an urgent problem. Biological treatment is a popular method in dealing with urea wastewater due to the advantages of short process flow, low cost, anti-shock load and no secondary pollution etc. In this review, based on the principle of urea bio-hydrolysis, the development process, enzymatic structure and hydrolysis mechanism of urease were analyzed in depth from the mechanism, and the application of traditional biological urea denitrification method was systematically reviewed. In addition, in order to better understand the potential of anaerobic ammonia-oxidizing bacteria to degrade urea and its application in practical engineering, this paper summarized the relevant research results from the perspectives of microbiology and engineering application. Finally, the Suggestions and prospects of the research on biological treatment of urea wastewater are put forward in order to provide a strong theoretical basis and technical support for practical engineering application.",
        "DOI": "NA",
        "paper_author": "Jia F.X.",
        "affiliation_name": "Beijing Jiaotong University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022381"
    },
    {
        "paper_title": "Biomaterials in meniscus repair",
        "publication": "Lower Extremity Joint Preservation: Techniques for Treating the Hip, Knee, and Ankle",
        "citied_by": "0",
        "cover_date": "2020-12-19",
        "Abstract": "Biological augmentation techniques and meniscus tissue engineering strategies are being devised to enhance the likelihood and rate of healing in meniscus repair. Preclinical and clinical studies have shown that the introduction of cellular elements of blood, bone marrow, and related growth factors has the potential to enhance meniscus repair. The next area where the biomaterials play a main role in meniscus repair is partial or total meniscal replacement with 3D scaffolds. The panoply of biomaterials that has been used in meniscus tissue engineering strategies is presented. The short guide how to use these in clinical practice with expected outcomes is described.",
        "DOI": "10.1007/978-3-030-57382-9_14",
        "paper_author": "Piontek T.",
        "affiliation_name": "Poznan University of Medical Sciences",
        "affiliation_city": "Poznan",
        "affiliation_country": "Poland",
        "affiliation_id": "60069010"
    },
    {
        "paper_title": "Improving Biological Treatment of Real Bilge Wastewater With Zero Valent Iron and Activated Charcoal Addition",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "8",
        "cover_date": "2020-12-18",
        "Abstract": "From the ships engine rooms a recalcitrant wastewater is produced called “bilge” which contains oil, metal working fluids, surfactants, and salinity. This study investigated the treatment of real bilge wastewater in short experiments using the following processes: (i) anaerobic digestion with granular sludge and ZVI addition for enhancement of methane production, (ii) activated charcoal addition to biological treatment (aerobic and anaerobic) for Chemical Oxygen Demand (COD) significant reduction and (iii) combination of ZVI and anaerobic charcoal addition for high performance treatment. The addition of ZVI in anaerobic sludge resulted in higher performance mostly in cumulative CH4 production. The microbial profile of anaerobic granular sludge exposed to ZVI was determined and Acetobacterium and Arcobacter were the most dominant bacteria genera. Activated charcoal achieved higher COD removal, compared to biological degradation (aerobic and anaerobic). The combination of the two mechanisms, activated charcoal and biomass, had higher COD removal only for aerobic biomass. The combination of ZVI and activated charcoal to anaerobic digestion resulted in higher CH4 production and significant COD removal in short contact time.",
        "DOI": "10.3389/fbioe.2020.614510",
        "paper_author": "Mazioti A.A.",
        "affiliation_name": "Cyprus University of Technology",
        "affiliation_city": "Limassol",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60077474"
    },
    {
        "paper_title": "Study on industrial applications of papain: A succinct review",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "31",
        "cover_date": "2020-12-18",
        "Abstract": "Papain is an enzyme having proteolytic function with cysteine protease activity obtain from papaya having green color and is acquired from latex. It is classified in superfamily. Papain has function essential of proteolysis widely for peptides of amino acid in all living beings. Present review shed light on general properties, structuring features and biological importance of papain, especially its industrial applications for different purposes, which includes food, Pharmaceuticals, Breweries, leather, meat, detergent and other fields, with the help of technological advancement; it is now used to treat lethal diseases and additionally scientist's are taking benefit of it for drug designing so there are high demands for its export. Papain uncommon properties have been making it more appreciable commercially. Papaya is present or grows in all tropical areas as there are no seasonal limitations for its growth and papain is resistant over wide range of Ph and temperature, so it has high demand for export and there is good prospect of papain marketing. Farmers at lower levels could use this enzyme as high source of income. Through recombinant DNA technology, engineering of proteins and procedures of immobilization papain could be ideal for biotechnological and industrial applications. Researchers could explore more potent applications by understanding detail mechanism and functions of papain. Then there will be novel papain function that would fulfill the massive need for betterment of life.",
        "DOI": "10.1088/1755-1315/614/1/012171",
        "paper_author": "Shouket H.A.",
        "affiliation_name": "Amin Welfare &amp; Teaching Hospital",
        "affiliation_city": "Sialkot",
        "affiliation_country": "Pakistan",
        "affiliation_id": "125585924"
    },
    {
        "paper_title": "The influence of different aged Black Saxaul plants on distribution, growth and accumulation of aboveground phytomass of Poa Bulboza L.",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "1",
        "cover_date": "2020-12-18",
        "Abstract": "The purpose of this study was to determine the nature and degree of influence of different-aged plants of Black Saxaul on Bulbous Bluegrass-one of the dominant species of sagebrush-ephemeral pastures. The study was conducted using phytometer method in the conditions of the desert zone of Uzbekistan on the ephemeroid-wormwood-black saxaul phytocenosis, formed as a result of self-seeding on inter-band spaces of pasture-protective Black Saxaul plantations. It is established that the character of the phytogenic influence of Saxaul on Bluegrass can be characterized as ambiguous conjugacy: In the minimal phytogenic field, the character of this influence is negative and therefore is gradually replaced, as a result of which the number of this species-phytometer significantly decreases, there are zones where bluegrass is absent. Growing specimens are stunted and poorly developed, so they accumulate insignificant aboveground phytomass. The character of the influence of Saxaul in the outer part of the phytogenic field on bluegrass was positive. Therefore, it is numerous here, grows better and accumulates 1,5-3 times more aboveground phytomass than outside the phytogenic field (control). Within the phytogenic field of Black Saxaul for Bluegrass Bulbous most \"environmentally comfortable place\"is the border of the internal and external parts of this field. In this part of the phytogenic field, due to its ecological and biological properties, the number of phytometer species reaches the highest value; they grow rapidly and accumulate the largest aboveground phytomass. The degree of influence depends on the age status of the Black Saxaul.The highest degree of influence on the abundance, growth and formation of over ground phytomass of Bluegrass Bulbous is observed in the phytogenic field of middle-aged species-edificators: The minimum field increases and reaches its maximum in the area where Bluegrass Bulbous is completely displaced, and on the border of internal and external parts and in the outer part opposed to a phytogenic one field due to the positive influence of species-edificators of the number of phytometra increases sharply, the values of the linear growth of shoots and accumulation of aboveground biomass reach the highest values. The smallest phytogenic effect of the edifier species on the phytometer species is observed in the phytogenic field of virginal plants of the black saxaul. The phytogenic effect on bluegrass is distributed in virginal individuals of the active species outside the crown at a distance of 90 cm, in young generative-by 120 cm and in middle-aged generative-by 150 cm and even 180 cm. When further removed, the distribution, growth and formation of aboveground phytomass of the phytometer species does not depend on the edifier species.",
        "DOI": "10.1088/1755-1315/614/1/012163",
        "paper_author": "Ubaydullayev S.",
        "affiliation_name": "Karshi Branch of Tashkent Institute of Irrigation and Agricultural Mechanization Engineers",
        "affiliation_city": "Karshi",
        "affiliation_country": "Uzbekistan",
        "affiliation_id": "60123668"
    },
    {
        "paper_title": "Laser Biotechnology for Nutritional Health, Sustainable Environment and Development",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "21",
        "cover_date": "2020-12-18",
        "Abstract": "The key factor for sustainable development is the integration of sensitive methods for early detection of environmental risk factors for nutritional health with efficient primary prevention against contamination of the food chains as well as deficiency of biologically active trace elements in the human diet. Proper algorithms of laser photostimulation are recommended both for more efficient biological treatment of wastewater and also for a proper amount of essential elements in cultivated plants supplemented by other modern biotechnology for multiplication e.g. vegetables. Laser biotechnology is also recommended for better reclamation followed by enhancement of biomass and bioenergy production in different regions of the world as a contribution to sustainable development and the creation of many green jobs. This eco-innovation supplemented with the complementary biotechnologies e.g. reclamation of semiarid areas, modern apiculture integrated with the cultivation of medical plants, cultivation of algae, aquaculture, energy plantations, reforestation and protection of biodiversity could contribute to better adaptation to climate change and situation connected with COVID-19 pandemic and risk of worsening human health, malnutrition, and hunger.",
        "DOI": "10.1088/1755-1315/614/1/012108",
        "paper_author": "Dobrowolski J.W.",
        "affiliation_name": "AGH University of Krakow",
        "affiliation_city": "Krakow",
        "affiliation_country": "Poland",
        "affiliation_id": "60017351"
    },
    {
        "paper_title": "Research of agrochemical and mechanical properties of soils processed with hydrogel",
        "publication": "IOP Conference Series: Earth and Environmental Science",
        "citied_by": "3",
        "cover_date": "2020-12-18",
        "Abstract": "The results of many years of research on the effect of polymer hydrogels for agriculture on soil structure were presented. By sampling soils at various depths, the biological changes of microorganisms that occur under the influence of hydrogels were studied. It was shown that the use of hydrogels leads to an improvement in the basic physicochemical properties of non-irrigated agricultural lands and an increase in soil fertility. The use of hydrogel absorbent on typical non-irrigated lands allowed increasing soil moisture and improving its properties.",
        "DOI": "10.1088/1755-1315/614/1/012121",
        "paper_author": "Sherkuziev D.S.",
        "affiliation_name": "Namangan Institute of Engineering and Technology",
        "affiliation_city": "Namangan",
        "affiliation_country": "Uzbekistan",
        "affiliation_id": "60120809"
    },
    {
        "paper_title": "Properties of Tilapia Collagen as a Biomaterial for Tissue Engineering: A Review",
        "publication": "IOP Conference Series: Materials Science and Engineering",
        "citied_by": "8",
        "cover_date": "2020-12-18",
        "Abstract": "Collagen is one of the common biopolymers used as a biomaterial in tissue engineering applications due to its biocompatibility and biodegradability properties. Collagen derived from various sources and mostly found in porcine and bovine skin. However, due to religious concerns and the dangers of animal-borne diseases possesses by these mammalian derived collagens, marine collagens are extensively investigated as an alternative to substitute mammalian collagens in tissue engineering applications. Among those marine collagens, tilapia (Oreochromis niloticus) collagens are known to have a great potential to be used as biomaterials for tissue engineering application due to its higher thermal stability compared to other marine sources. Therefore, this study aims to review chemical and biological properties of tilapia collagen as a biomaterial for tissue engineering applications. The contents are mainly focused on the extraction yield, amino acid composition, thermal stability, cross-linking, biocompatibility, biodegradability, immunogenicity and hemostasis of tilapia collagen.",
        "DOI": "10.1088/1757-899X/932/1/012021",
        "paper_author": "Zain N.M.",
        "affiliation_name": "Universiti Teknologi Malaysia",
        "affiliation_city": "Johor Bahru",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60021005"
    },
    {
        "paper_title": "Integration and Co-design of Memristive Devices and Algorithms for Artificial Intelligence",
        "publication": "iScience",
        "citied_by": "56",
        "cover_date": "2020-12-18",
        "Abstract": "Memristive devices share remarkable similarities to biological synapses, dendrites, and neurons at both the physical mechanism level and unit functionality level, making the memristive approach to neuromorphic computing a promising technology for future artificial intelligence. However, these similarities do not directly transfer to the success of efficient computation without device and algorithm co-designs and optimizations. Contemporary deep learning algorithms demand the memristive artificial synapses to ideally possess analog weighting and linear weight-update behavior, requiring substantial device-level and circuit-level optimization. Such co-design and optimization have been the main focus of memristive neuromorphic engineering, which often abandons the “non-ideal” behaviors of memristive devices, although many of them resemble what have been observed in biological components. Novel brain-inspired algorithms are being proposed to utilize such behaviors as unique features to further enhance the efficiency and intelligence of neuromorphic computing, which calls for collaborations among electrical engineers, computing scientists, and neuroscientists.",
        "DOI": "10.1016/j.isci.2020.101809",
        "paper_author": "Wang W.",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256"
    },
    {
        "paper_title": "Automating Cloning by Natural Transformation",
        "publication": "ACS Synthetic Biology",
        "citied_by": "12",
        "cover_date": "2020-12-18",
        "Abstract": "Affordable and automated cloning platforms are essential to many synthetic biology studies. However, the traditional E. coli-based cloning is a major bottleneck as it requires heat shock or electroporation implemented in the robotic workflows. To overcome this problem, we explored bacterial natural transformation for automatic DNA cloning and engineering. Recombinant plasmids are efficiently generated from Gibson or overlap extension PCR (OE-PCR) products by simply adding the DNA into Acinetobacter baylyi ADP1 cultures. No DNA purification, competence induction, or special equipment is required. Up to 10,000 colonies were obtained per microgram of DNA, while the number of false positive colonies was low. We cloned and engineered 21 biosynthetic gene clusters (BGCs) of various types, with length from 1.5 to 19 kb and GC content from 35% to 72%. One of them, a nucleoside BGC, showed antibacterial activity. Furthermore, the method was easily transferred to a low-cost benchtop robot with consistent cloning efficiency. Thus, this automatic natural transformation (ANT) cloning provides an easy, robust, and affordable platform for high throughput DNA engineering.",
        "DOI": "10.1021/acssynbio.0c00240",
        "paper_author": "Jiang X.",
        "affiliation_name": "The Novo Nordisk Foundation Center for Biosustainability",
        "affiliation_city": "Lyngby",
        "affiliation_country": "Denmark",
        "affiliation_id": "60244423"
    },
    {
        "paper_title": "A Hybrid Flux Balance Analysis and Machine Learning Pipeline Elucidates Metabolic Adaptation in Cyanobacteria",
        "publication": "iScience",
        "citied_by": "38",
        "cover_date": "2020-12-18",
        "Abstract": "Machine learning has recently emerged as a promising tool for inferring multi-omic relationships in biological systems. At the same time, genome-scale metabolic models (GSMMs) can be integrated with such multi-omic data to refine phenotypic predictions. In this work, we use a multi-omic machine learning pipeline to analyze a GSMM of Synechococcus sp. PCC 7002, a cyanobacterium with large potential to produce renewable biofuels. We use regularized flux balance analysis to observe flux response between conditions across photosynthesis and energy metabolism. We then incorporate principal-component analysis, k-means clustering, and LASSO regularization to reduce dimensionality and extract key cross-omic features. Our results suggest that combining metabolic modeling with machine learning elucidates mechanisms used by cyanobacteria to cope with fluctuations in light intensity and salinity that cannot be detected using transcriptomics alone. Furthermore, GSMMs introduce critical mechanistic details that improve the performance of omic-based machine learning methods.",
        "DOI": "10.1016/j.isci.2020.101818",
        "paper_author": "Vijayakumar S.",
        "affiliation_name": "Teesside University",
        "affiliation_city": "Middlesbrough",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60025655"
    },
    {
        "paper_title": "Nrl Is Dispensable for Specification of Rod Photoreceptors in Adult Zebrafish Despite Its Deeply Conserved Requirement Earlier in Ontogeny",
        "publication": "iScience",
        "citied_by": "13",
        "cover_date": "2020-12-18",
        "Abstract": "The transcription factor NRL (neural retina leucine zipper) has been canonized as the master regulator of photoreceptor cell fate in the retina. NRL is necessary and sufficient to specify rod cell fate and to preclude cone cell fate in mice. By engineering zebrafish, we tested if NRL function has conserved roles beyond mammals or beyond nocturnal species, i.e., in a vertebrate possessing a greater and more typical diversity of cone sub-types. Transgenic expression of Nrl from zebrafish or mouse was sufficient to induce rod photoreceptor cells. Zebrafish nrl−/− mutants lacked rods (and had excess UV-sensitive cones) as young larvae; thus, the conservation of Nrl function between mice and zebrafish appears sound. Strikingly, however, rods were abundant in adult nrl−/− null mutant zebrafish. Rods developed in adults despite Nrl protein being undetectable. Therefore, a yet-to-be-revealed non-canonical pathway independent of Nrl is able to specify the fate of some rod photoreceptors.",
        "DOI": "10.1016/j.isci.2020.101805",
        "paper_author": "Oel A.P.",
        "affiliation_name": "University of Alberta",
        "affiliation_city": "Edmonton",
        "affiliation_country": "Canada",
        "affiliation_id": "60030835"
    },
    {
        "paper_title": "Heterologous Expression of Cryptomaldamide in a Cyanobacterial Host",
        "publication": "ACS Synthetic Biology",
        "citied_by": "28",
        "cover_date": "2020-12-18",
        "Abstract": "Filamentous marine cyanobacteria make a variety of bioactive molecules that are produced by polyketide synthases, nonribosomal peptide synthetases, and hybrid pathways that are encoded by large biosynthetic gene clusters. These cyanobacterial natural products represent potential drug leads; however, thorough pharmacological investigations have been impeded by the limited quantity of compound that is typically available from the native organisms. Additionally, investigations of the biosynthetic gene clusters and enzymatic pathways have been difficult due to the inability to conduct genetic manipulations in the native producers. Here we report a set of genetic tools for the heterologous expression of biosynthetic gene clusters in the cyanobacteria Synechococcus elongatus PCC 7942 and Anabaena (Nostoc) PCC 7120. To facilitate the transfer of gene clusters in both strains, we engineered a strain of Anabaena that contains S. elongatus homologous sequences for chromosomal recombination at a neutral site and devised a CRISPR-based strategy to efficiently obtain segregated double recombinant clones of Anabaena. These genetic tools were used to express the large 28.7 kb cryptomaldamide biosynthetic gene cluster from the marine cyanobacterium Moorena (Moorea) producens JHB in both model strains. S. elongatus did not produce cryptomaldamide; however, high-titer production of cryptomaldamide was obtained in Anabaena. The methods developed in this study will facilitate the heterologous expression of biosynthetic gene clusters isolated from marine cyanobacteria and complex metagenomic samples.",
        "DOI": "10.1021/acssynbio.0c00431",
        "paper_author": "Taton A.",
        "affiliation_name": "School of Biological Sciences",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60121501"
    },
    {
        "paper_title": "Creating Red Light-Switchable Protein Dimerization Systems as Genetically Encoded Actuators with High Specificity",
        "publication": "ACS Synthetic Biology",
        "citied_by": "20",
        "cover_date": "2020-12-18",
        "Abstract": "Protein dimerization systems controlled by red light with increased tissue penetration depth are a highly needed tool for clinical applications such as cell and gene therapies. However, mammalian applications of existing red light-induced dimerization systems are hampered by limitations of their two components: A photosensory protein (or photoreceptor) which often requires a mammalian exogenous chromophore and a naturally occurring photoreceptor binding protein typically having a complex structure and nonideal binding properties. Here, we introduce an efficient, generalizable method (COMBINES-LID) for creating highly specific, reversible light-induced heterodimerization systems independent of any existing binders to a photoreceptor. It involves a two-step binder screen (phage display and yeast two-hybrid) of a combinatorial nanobody library to obtain binders that selectively engage a light-activated form of a photoswitchable protein or domain not the dark form. Proof-of-principle was provided by engineering nanobody-based, red light-induced dimerization (nanoReD) systems comprising a truncated bacterial phytochrome sensory module using a mammalian endogenous chromophore, biliverdin, and light-form specific nanobodies. Selected nanoReD systems were biochemically characterized, exhibiting low dark activity and high induction specificity, and further demonstrated for the reversible control of protein translocation and activation of gene expression in mice. Overall, COMBINES-LID opens new opportunities for creating genetically encoded actuators for the optical manipulation of biological processes.",
        "DOI": "10.1021/acssynbio.0c00397",
        "paper_author": "Huang Z.",
        "affiliation_name": "University of Washington",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60015481"
    },
    {
        "paper_title": "Data-driven methods for reduced-order modeling",
        "publication": "Snapshot-Based Methods and Algorithms",
        "citied_by": "4",
        "cover_date": "2020-12-16",
        "Abstract": "Data-driven mathematical methods are increasingly important for characterizing complex systems across the physical, engineering, and biological sciences. These methods aim to discover and exploit a relatively small subset of the full highdimensional state space where low-dimensional models can be used to describe the evolution of the system. Emerging dimensionality reduction methods, such as the dynamic mode decomposition (DMD) and its Koopman generalization, have garnered attention due to the fact that they can (i) discover low-rank spatio-temporal patterns of activity, (ii) embed the dynamics in the subspace in an equation-free manner (i. e., the governing equations are unknown), unlike Galerkin projection onto proper orthogonal decomposition modes, and (iii) provide approximations in terms of linear dynamical systems, which are amenable to simple analysis techniques. The selection of observables (features) for the DMD/Koopman architecture can yield accurate low-dimensional embeddings for nonlinear partial differential equations (PDEs) while limiting computational costs. Indeed, a good choice of observables, including time delay embeddings, can often linearize the nonlinear manifold by making the spatiotemporal dynamics weakly nonlinear. In addition to DMD/Koopman decompositions, coarse-grained models for spatio-temporal systems can also be discovered using the sparse identification of nonlinear dynamics (SINDy) algorithm which allows one to construct reduced-order models in low-dimensional embeddings. These methods can be used in a nonintrusive, equation-free manner for improved computational performance on parametric PDE systems.",
        "DOI": "10.1515/9783110671490-007",
        "paper_author": "Brunton S.L.",
        "affiliation_name": "UW College of Engineering",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60028661"
    },
    {
        "paper_title": "A bio-hybrid odor-guided autonomous palm-sized air vehicle",
        "publication": "Bioinspiration and Biomimetics",
        "citied_by": "39",
        "cover_date": "2020-12-16",
        "Abstract": "Biohybrid systems integrate living materials with synthetic devices, exploiting their respective advantages to solve challenging engineering problems. One challenge of critical importance to society is detecting and localizing airborne volatile chemicals. Many flying animals depend their ability to detect and locate the source of aerial chemical plumes for finding mates and food sources. A robot with comparable capability could reduce human hazard and drastically improve performance on tasks such as locating disaster survivors, hazardous gas leaks, incipient fires, or explosives. Three advances are needed before they can rival their biological counterparts: (1) a chemical sensor with a much faster response time that nevertheless satisfies the size, weight, and power constraints of flight, (2) a design, sensor suite, and control system that allows it to move toward the source of a plume fully autonomously while navigating obstacles, and (3) the ability to detect the plume with high specificity and sensitivity among the assortment of chemicals that invariably exist in the air. Here we address the first two, introducing a human-safe palm-sized air vehicle equipped with the odor-sensing antenna of an insect, the first odor-sensing biohybrid robot system to fly. Using this sensor along with a suite of additional navigational sensors, as well as passive wind fins, our robot orients upwind and navigates autonomously toward the source of airborne plumes. Our robot is the first flying biohybrid system to successfully perform odor localization in a confined space, and it is able to do so while detecting and avoiding obstacles in its flight path. We show that insect antennae respond more quickly than metal oxide gas sensors, enabling odor localization at an improved speed over previous flying robots. By using the insect antennae, we anticipate a feasible path toward improved chemical specificity and sensitivity by leveraging recent advances in gene editing.",
        "DOI": "10.1088/1748-3190/abbd81",
        "paper_author": "Anderson M.J.",
        "affiliation_name": "UW College of Engineering",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60028661"
    },
    {
        "paper_title": "Self-assembly-based posttranslational protein oscillators",
        "publication": "Science Advances",
        "citied_by": "5",
        "cover_date": "2020-12-16",
        "Abstract": "Recent advances in synthetic posttranslational protein circuits are substantially impacting the landscape of cellular engineering and offer several advantages compared to traditional gene circuits. However, engineering dynamic phenomena such as oscillations in protein-level circuits remains an outstanding challenge. Few examples of biological posttranslational oscillators are known, necessitating theoretical progress to determine realizable oscillators. We construct mathematical models for two posttranslational oscillators, using few components that interact only through reversible binding and phosphorylation/dephosphorylation reactions. Our designed oscillators rely on the self-assembly of two protein species into multimeric functional enzymes that respectively inhibit and enhance this self-assembly. We limit our analysis to within experimental constraints, finding (i) significant portions of the restricted parameter space yielding oscillations and (ii) that oscillation periods can be tuned by several orders of magnitude using recent advances in computational protein design. Our work paves the way for the rational design and realization of protein-based dynamic systems.",
        "DOI": "10.1126/sciadv.abc1939",
        "paper_author": "Kimchi O.",
        "affiliation_name": "Harvard John A. Paulson School of Engineering and Applied Sciences",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60077572"
    },
    {
        "paper_title": "Impact of chemically synthesized zinc oxide nanoparticles on saline stressed wheat",
        "publication": "Plant Cell Biotechnology and Molecular Biology",
        "citied_by": "9",
        "cover_date": "2020-12-16",
        "Abstract": "Nanotechnology is such a multidisciplinary technique comprises agriculture, medicine, fabrics, electronic, food packaging because it's several engineering methodologies, but still needing much research because of controversial issues about safety and toxicity. Our present study was performed in two successive seasons of 2018 through 2020 to determine the effect of chemically engineered ZnO nanoparticles (NPs) on salinity stress tolerance to wheat cultivars Misr1 (tolerant) and Gimmeza11 (sensitive). Data showed an increase of some biochemical parameters such as photosynthetic pigments, reduced glutathione increased intensity of some native PAGE bands of superoxide dismutase which may be related to salt tolerance and decreasing malondialdehyde. Some changes in protein biosynthesis of wheat leaves were observed between presence (1) or absence (0) of some bands due to the application of ZnO NPs which may be related to the antagonistic effect between metals among them Zn. The most effective concentration was 1.0ppm for most determined parameters. ZnO NPs was evaluated on molecular DNA level of wheat plant using Inverse sequence-tagged repeat (ISTR) assay against five primers which appeared change in bands number with highest polymorphic bands 86.6% polymorphism at F9, B3 primer and 20 unique bands with primer F4, B7, values indicates the degree of alterations in DNA according to the highest polymorphic bands which treated with ZnO NPs as compared with the control but we can't ignore the role of DNA repair system enzymes. The biological study revealed the effectiveness of ZnO NPs as a foliar spray on two wheat cultivars (Misr 1 and Gimmeza11). So, to clarify their safety we explored the median lethal dose (LD50) on Wistar Albino rats and repeated doses for 28 days. ZnO NPs have no effect on the levels of liver or kidney functions and histopathological cases, all of which remained within the normalized values so that, the debate about using ZnO NPs application in fields in wide spectrum may be turned off.",
        "DOI": "NA",
        "paper_author": "Farroh K.Y.",
        "affiliation_name": "Agricultural Research Center",
        "affiliation_city": "Giza",
        "affiliation_country": "Egypt",
        "affiliation_id": "60019332"
    },
    {
        "paper_title": "Stretchable, Healable, and Degradable Soft Ionic Microdevices Based on Multifunctional Soaking-Toughened Dual-Dynamic-Network Organohydrogel Electrolytes",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "62",
        "cover_date": "2020-12-16",
        "Abstract": "Electronic materials and devices that can mimic biological systems featured with elasticity, toughness, self-healing, degradability, and environmental friendliness drive the technological developments in fields spanning from bioelectronics, biomedical diagnosis and therapy, electronic skin, and soft robotics to Internet-of-Things with \"green\"electronics. Among them, ionic devices based on gel electrolytes have emerged as attractive candidates for biomimetic systems. Herein, we presented a straightforward approach to demonstrate soft ionic microdevices based on a versatile organohydrogel platform acting as both a free-standing, stretchable, adhesive, healable, and entirely degradable support and a highly conductive, dehydration- and freezing-tolerant electrolyte. This is achieved by forming a gelatin/ferric-ion-cross-linked polyacrylic acid (GEL/PAA) dual dynamic supramolecular network followed by soaking into a NaCl glycerol/water solution to further toughen the gelatin network via solvent displacement, thus obtaining a high toughness of 1.34 MJ·cm-3 and a high ionic conductivity (>7 mS·cm-1). Highly stretchable and multifunctional ionic microdevices are then fabricated based on the organohydrogel electrolytes by simple transfer printing of carbon-based microelectrodes onto the prestretched gel surface. Proof-of-concept microdevices including resistive strain sensors and microsupercapacitors are demonstrated, which displayed outstanding stretchability to 300% strain, resistance to dehydration for >6 months, autonomous self-healing, and rapid room-temperature degradation within hours. The present material design and fabrication approach for the organohydrogel-based ionic microdevices will provide promising scope for life-like and sustainable electronic systems.",
        "DOI": "10.1021/acsami.0c14472",
        "paper_author": "Fang L.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182"
    },
    {
        "paper_title": "Layered Antimicrobial Selenium Nanoparticle-Calcium Phosphate Coating on 3D Printed Scaffolds Enhanced Bone Formation in Critical Size Defects",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "26",
        "cover_date": "2020-12-16",
        "Abstract": "Preventing bacterial colonization on scaffolds while supporting tissue formation is highly desirable in tissue engineering as bacterial infection remains a clinically significant risk to any implanted biomaterials. Elemental selenium (Se0) nanoparticles have emerged as a promising antimicrobial biomaterial without tissue cell toxicity, yet it remains unknown if their biological properties are from soluble Se ions or from direct cell-nanoparticle interactions. To answer this question, in this study, we developed a layered coating consisting of a Se nanoparticle layer underneath a micrometer-thick, biomimetic calcium phosphate (CaP) layer. We showed, for the first time, that the release of soluble HSe- ions from the Se nanoparticles strongly inhibited planktonic growth and biofilm formation of key bacteria, Staphylococcus aureus. The Se-CaP coating was found to support higher bone formation than the CaP-only coating in critical-size calvarial defects in rats; this finding could be directly attributed to the released soluble Se ions as the CaP layers in both groups had no detectable differences in the porous morphology, chemistry, and release of Ca or P. The Se-CaP coating was highly versatile and applicable to various surface chemistries as it formed through simple precipitation from aqueous solutions at room temperature and therefore could be promising in bone regeneration scaffolds or orthopedic implant applications.",
        "DOI": "10.1021/acsami.0c17017",
        "paper_author": "Vaquette C.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004"
    },
    {
        "paper_title": "Review on 3d Printing of Biological Tissues and the Materialization",
        "publication": "IOP Conference Series: Materials Science and Engineering",
        "citied_by": "1",
        "cover_date": "2020-12-15",
        "Abstract": "3D printing is one of the recently evolved manufacturing techniques which has wide range of applications in engineering, education, art and science. Bioprinting is the recent advancement of additive manufacturing process in the area of medicine. It is a process which involves layering and curing of biological cells or tissues and turning it into a fully functioning organ or hard supports(bones). It has solved the problem of shortage of organs for transplantation. It would be very difficult to find the right organ according to the needs of a particular person but this recent advancement has given a right solution for it. Bioprinters typically uses bioinks which dispenses through the nozzle of the printer for deposition, and a dissolvable hydrogel is used in order to protect and support the tissues of the organic material. This type of printing is done in lab environment only under a controlled system.",
        "DOI": "10.1088/1757-899X/988/1/012128",
        "paper_author": "Adharsh S.",
        "affiliation_name": "Chennai Institute of Technology",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60114413"
    },
    {
        "paper_title": "Overview of Polylactic acid and its derivatives in medicinal applications",
        "publication": "IOP Conference Series: Materials Science and Engineering",
        "citied_by": "4",
        "cover_date": "2020-12-15",
        "Abstract": "Biopolymers are most commonly used in many medical applications nowadays. Polylactic acid is widely used for many biological applications due to its biocompatible, biodegradable, and non-toxic properties. In this review, Polylactic acid usage in medical applications like tissue engineering, fracture repairs, orthopedic, drug delivery carriers, antimicrobial agents, stents is considered. The current medical field scenario briefly reviewed to assess Polylactic acid's potential usage and its derivatives in biomedical applications.",
        "DOI": "10.1088/1757-899X/988/1/012003",
        "paper_author": "Senthamaraikannan C.",
        "affiliation_name": "Sri Venkateswara College of Engineering, Sriperumbudur",
        "affiliation_city": "Sriperumbudur",
        "affiliation_country": "India",
        "affiliation_id": "60069599"
    },
    {
        "paper_title": "An engineered 4-1BBL fusion protein with “activity on demand”",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "18",
        "cover_date": "2020-12-15",
        "Abstract": "Engineered cytokines are gaining importance in cancer therapy, but these products are often limited by toxicity, especially at early time points after intravenous administration. 4-1BB is a member of the tumor necrosis factor receptor superfamily, which has been considered as a target for therapeutic strategies with agonistic antibodies or using its cognate cytokine ligand, 4-1BBL. Here we describe the engineering of an antibody fusion protein, termed F8-4-1BBL, that does not exhibit cytokine activity in solution but regains biological activity on antigen binding. F8-4-1BBL bound specifically to its cognate antigen, the alternatively spliced EDA domain of fibronectin, and selectively localized to tumors in vivo, as evidenced by quantitative biodistribution experiments. The product promoted a potent antitumor activity in various mouse models of cancer without apparent toxicity at the doses used. F8-4-1BBL represents a prototype for antibody-cytokine fusion proteins, which conditionally display “activity on demand” properties at the site of disease on antigen binding and reduce toxicity to normal tissues.",
        "DOI": "10.1073/pnas.2013615117",
        "paper_author": "Mock J.",
        "affiliation_name": "ETH Zürich",
        "affiliation_city": "Zurich",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60025858"
    },
    {
        "paper_title": "Atomic-scale evidence for highly selective electrocatalytic N−N coupling on metallic MoS<inf>2</inf>",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "17",
        "cover_date": "2020-12-15",
        "Abstract": "Molybdenum sulfide (MoS2) is the most widely studied transition-metal dichalcogenide (TMDs) and phase engineering can markedly improve its electrocatalytic activity. However, the selectivity toward desired products remains poorly explored, limiting its application in complex chemical reactions. Here we report how phase engineering of MoS2 significantly improves the selectivity for nitrite reduction to nitrous oxide, a critical process in biological denitrification, using continuous-wave and pulsed electron paramagnetic resonance spectroscopy. We reveal that metallic 1T-MoS2 has a protonation site with a pKa of ∼5.5, where the proton is located ∼3.26 Å from redox-active Mo site. This protonation site is unique to 1T-MoS2 and induces sequential proton−electron transfer which inhibits ammonium formation while promoting nitrous oxide production, as confirmed by the pH-dependent selectivity and deuterium kinetic isotope effect. This is atomic-scale evidence of phase-dependent selectivity on MoS2, expanding the application of TMDs to selective electrocatalysis.",
        "DOI": "10.1073/pnas.2008429117",
        "paper_author": "He D.",
        "affiliation_name": "RIKEN Center for Sustainable Resource Science",
        "affiliation_city": "Yokohama",
        "affiliation_country": "Japan",
        "affiliation_id": "60274643"
    },
    {
        "paper_title": "An Evolutionary Strategy for Identification of Higher Order, Green Fluorescent Host–Guest Pairs Compatible with Living Systems",
        "publication": "Chemistry - A European Journal",
        "citied_by": "1",
        "cover_date": "2020-12-15",
        "Abstract": "Engineered miniprotein host–small-molecule guest pairs could be utilized to design new processes within cells as well as investigate fundamental aspects of cell signaling mechanisms. However, the development of host–guest pairs capable of functioning in living systems has proven challenging. Moreover, few examples of host–guest pairs with stoichiometries other than 2:1 exist, significantly hindering the ability to study the influence of oligomerization state on signaling fidelity. Herein, we present an approach to identify host–guest systems for relatively small green fluorescent guests by incorporation into cyclic peptides. The optimal host–guest pair produced a 10-fold increase in green fluorescence signal upon binding. Biophysical characterization clearly demonstrated higher order supramolecular assembly, which could be visualized on the surface of living yeast cells using a turn-on fluorescence readout. This work further defines evolutionary design principles to afford host–guest pairs with stoichiometries other than 2:1 and enables the identification of spectrally orthogonal host–guest pairs.",
        "DOI": "10.1002/chem.202002423",
        "paper_author": "Casey G.R.",
        "affiliation_name": "University of Nebraska–Lincoln",
        "affiliation_city": "Lincoln",
        "affiliation_country": "United States",
        "affiliation_id": "60026306"
    },
    {
        "paper_title": "The Chemistry and Applications of Heteroisoindigo Units as Enabling Links for Semiconducting Materials",
        "publication": "Accounts of Chemical Research",
        "citied_by": "55",
        "cover_date": "2020-12-15",
        "Abstract": "ConspectusBecause of their lowerature processing properties and inherent mechanical flexibility, semiconducting materials are promising candidates for enabling flexible displays, renewable energy, biological sensors, and healthcare. Progress has been made in materials performance by developing judicious materials design strategies. For example, improvements in electron transport have required new electron-deficient aromatics. Among them, isoindigo (IID) is an important functional group utilized in conjugated aromatics, where the structure combines two sets of five-membered electron-withdrawing lactam rings, exhibiting enhanced solubility, excellent chemical and thermal stabilities, broad absorption, and intriguing electron affinity.In the past decade, researchers have mainly focused on IID-based materials. However, the effect of heteroatom modification of the IID core has rarely been systemically investigated. In conventional conjugated polymers, single bonds connect the monomers, leading to energetic disorder and torsion defects, while ladder-type polymers are often intractable because of their fused nature. In this regard, the molecular design of new πscaffolds based on IID is central to the development of high-performance semiconductor polymers. Especially, a complete refresh of molecular design strategies and novel conjugated polymers with unique structures are needed to circumvent the disadvantages of the conventional ladder-type polymers.In this Account, we systematically summarize our recent progress in the design, synthesis, and structure-property relationships of IID-and particularly hetero-IID-based functional materials. More specifically, starting with molecular engineering of hetero-IIDs with variable electronic effects, conjugation lengths, and numbers of heterorings, we discuss the effect of the heteroring on the absorption spectra and energy levels. Additionally, we investigate a series of electron-withdrawing substitution of IIDs and hetero-IIDs and their molecular self-assembly behavior and the device performance. Furthermore, we discuss a series of IID-bis(EDOT) copolymers with hydrophilic ethylene glycol side chains for accumulation-mode organic thin-film electrochemical transistors, in which the relationships among the molecular structure, operational stability, film morphology, and device performance were revealed. Compared with IID polymers, the HOMO levels and optical band gaps of the thiophene and thienothiophene IID copolymers markedly decrease, and these polymers exhibit ambipolar charge transport. When we further expanded the IID core to a thieno[3,2-b][1]benzothiophene isoindigo (TBTI) core, such as in TBTIT, bulk-heterojunction solar cells employing this polymer class as the electron donor achieved good efficiency for additive-and annealing-free device conditions. When we introduced electron-deficient pyridine on the IID core, both the LUMO and HOMO energy levels of the copolymers markedly decreased, which significantly improved the electron mobility. In addition, we compare the correlation between the polymer structures of IID and hetero-IID copolymers with thiophene and benzothiophene as comonomers and their absorption spectra and energy levels. In particular, we evaluate the planarity and the dihedral angle between the repeat units, with systematic analysis by theoretical calculations to support our design concepts. We discuss polymer designs arising from simple aldol condensation, where the rigid backbone conformation has been locked by the double bonds. Our polymers display broad absorption from the visible to the NIR-II region, and more importantly, the high electron affinities of these polymers provide a platform to realize ambient-stable electron transport in solution-processed organic thin-film transistors. These exciting results are expected to open doors to new horizons of semiconducting materials in terms of other charming applications and the design and synthesis of superior materials.",
        "DOI": "10.1021/acs.accounts.0c00480",
        "paper_author": "Wang Y.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182"
    },
    {
        "paper_title": "Is my sdm good enough? insights from a citizen science dataset in a point process modeling framework",
        "publication": "Ecological Modelling",
        "citied_by": "3",
        "cover_date": "2020-12-15",
        "Abstract": "Citizen science programs, and particularly atlas schemes based on opportunistic biological records, are very important sources of data for species distribution models and conservation. Nevertheless, these data are prone to bias, particularly when they come from less popular or hard to detect/identify species, such as insects. With such biased data, it is important to evaluate the stability of the model predictions. In recent years, point process models (PPMs) have shown their strength as a unifying framework to fit presence-only species distribution models with many advantages in model implementation and interpretation; PPMs are closely connected to methods already in widespread use in ecology such as MaxEnt and to logistic regression and benefit from being more transparent about resource selection and absence handling. Moreover, there is a well-developed set of tools to fit these models and assess various features of the underlying model, including model stability. However, such tools are currently unavailable when point process models are fitted with a lasso penalty, which has been shown to improve predictive performance. Based on the French citizen science program “Stag beetle Quest”, we propose new methods to assess model stability in this context. The ultimate goal was to develop a set of functions to analyze PPM models with lasso penalties fitted with presence-only data. To assess model stability, we randomly sampled different subsets of locations with varying size from the whole dataset and used the proposed tools to compare fitted intensities and model coefficients. All the developed measures are complementary and can be used to identify at what number of point locations the model stabilizes, which will be dependent on the dataset. Our work presents a new toolbox to explore questions around model stability based on the number of locations in the context of point process models with a lasso penalty and confirms once more the use of the point process modeling framework as a flexible and unifying framework to fit presence-only species distribution models.",
        "DOI": "10.1016/j.ecolmodel.2020.109283",
        "paper_author": "Leandro C.",
        "affiliation_name": "Université Paul-Valéry Montpellier III",
        "affiliation_city": "Montpellier",
        "affiliation_country": "France",
        "affiliation_id": "60009278"
    },
    {
        "paper_title": "Production, characterization and application of nanocarriers made of polysaccharides, proteins, bio-polyesters and other biopolymers: A review",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "87",
        "cover_date": "2020-12-15",
        "Abstract": "Chitosan, collagen, gelatin, polylactic acid and polyhydroxyalkanoates are notable examples of biopolymers, which are essentially bio-derived polymers produced by living cells. With the right techniques, these biological macromolecules can be exploited for nanotechnological advents, including for the fabrication of nanocarriers. In the world of nanotechnology, it is highly essential (and optimal) for nanocarriers to be biocompatible, biodegradable and non-toxic for safe in vivo applications, including for drug delivery, cancer immunotherapy, tissue engineering, gene delivery, photodynamic therapy and many more. The recent advancements in understanding nanotechnology and the physicochemical properties of biopolymers allows us to modify biological macromolecules and use them in a multitude of fields, most notably for clinical and therapeutic applications. By utilizing chitosan, collagen, gelatin, polylactic acid, polyhydroxyalkanoates and various other biopolymers as synthesis ingredients, the ‘optimal’ properties of a nanocarrier can easily be attained. With emphasis on the aforementioned biological macromolecules, this review presents the various biopolymers utilized for nanocarrier synthesis along with their specific synthetization methods. We further discussed on the characterization techniques and related applications for the synthesized nanocarriers.",
        "DOI": "10.1016/j.ijbiomac.2020.10.104",
        "paper_author": "Samrot A.V.",
        "affiliation_name": "MAHSA University",
        "affiliation_city": "Kuala Langat",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60278951"
    },
    {
        "paper_title": "Enhanced osteogenesis using poly (L-lactide-co-D, L-lactide)/poly (acrylic acid) nanofibrous scaffolds in presence of dexamethasone-loaded molecularly imprinted polymer nanoparticles",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "30",
        "cover_date": "2020-12-15",
        "Abstract": "The aim of this work is to prepare nanofibrous scaffolds based on poly (L-lactide-D, L-lactide)/poly (acrylic acid) [PLDLLA/PAAc] blends in the presence of Dexamethasone [Dexa]-loaded poly (2-hydroxyethyl methacrylate) [HEMA] as molecular imprinted polymer [MIP] nanoparticles [NPs] for enhancing osteogenesis. By adding 10 wt% of PAAc to the PLDLLA and employing response surface methodology, the average diameter of the electrospun nanofibers is approximately 237 nm. To increase the osteogenesis performance of the optimized nanofibrous scaffolds, the MIP nanoparticles are synthesized using HEMA monomer and Dexa template with a molar ratio of 10 to 1. Accordingly, these crosslinked drug nanocarriers exhibit an average diameter of around 122 nm and imprinting factor of approximately 1.8, enabling to adsorb Dexa molecules around 57%. Afterward, the Dexa-loaded MIP NPs have capability of a controlled drug release with ultimate value of 60% during 72 h. The simultaneous use of PLDLLA/PAAc-10 nanofibrous scaffold and Dexa-loaded MIP NPs within the cultivation media of fibroblast and mesenchymal stem cells is carried out by thiazolyl blue assay and acridine/ethidium bromide staining as well as alkaline phosphate/calcium content test, and alizarin red staining. The results reveal the remarkable efficiency of the blend nanofibers besides the MIP containing Dexa, thereby using for bone tissue engineering applications, potentially.",
        "DOI": "10.1016/j.ijbiomac.2020.10.078",
        "paper_author": "Ghaffari-Bohlouli P.",
        "affiliation_name": "University of Tehran",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60022927"
    },
    {
        "paper_title": "GDP-altrose as novel product of GDP-mannose 3,5-epimerase: Revisiting its reaction mechanism",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "5",
        "cover_date": "2020-12-15",
        "Abstract": "GDP-mannose 3,5-epimerase (GM35E) catalyzes the double epimerization of GDP-mannose to yield GDP-L-galactose. GDP-L-gulose (C5-epimer) has previously been detected as a byproduct of this reaction, indicating that C3,5-epimerization occurs through an initial epimerization at C5. Given these products, GM35E constitutes a valuable bridge between D- and L-hexoses. In order to fully exploit this potential, the enzyme might be subjected to specificity engineering for which profound mechanistic insights are beneficial. Accordingly, this study further elucidated GM35E's reaction mechanism. For the first time, the production of the C3-epimer GDP-altrose was demonstrated, resulting in an adjustment of the acknowledged reaction mechanism. As GM35E converts GDP-mannose to GDP-L-gulose, GDP-altrose and GDP-L-galactose in a 72:4:4:20 ratio, this indicates that the enzyme does not discriminate between the C3 and C5 position as initial epimerization site. This was also confirmed by a structural investigation. Based on a mutational analysis of the active site, residues S115 and R281 were attributed a stabilizing function, which is believed to support the reactivation process of the catalytic residues. This paper eventually reflected on some engineering strategies that aim to change the enzyme towards a single specificity.",
        "DOI": "10.1016/j.ijbiomac.2020.10.067",
        "paper_author": "Gevaert O.",
        "affiliation_name": "Universiteit Gent",
        "affiliation_city": "Ghent",
        "affiliation_country": "Belgium",
        "affiliation_id": "60033316"
    },
    {
        "paper_title": "Usability as a guiding principle for the design of paper-based, point-of-care devices – A review",
        "publication": "Analytica Chimica Acta",
        "citied_by": "49",
        "cover_date": "2020-12-15",
        "Abstract": "Due to their portability, versatility for supporting multiple assay formats, and potential for resulting in low-cost assays, paper-based analytical devices (PADs) are an increasingly popular format as a platform for the development of point-of-care tests. However, very few PADs have been translated successfully to their intended environments outside of academic settings. Often overlooked as a factor that inhibits translation, usability is a vital characteristic of any successful point-of-care test. Recent advancements in PAD design have demonstrated improved usability by simplifying various aspects of user operation, including sample collection, sample processing, device operation, detection, and readout/interpretation. Field testing at various stages of device design can offer critical feedback about device usability, especially when it involves the proposed end-user or other stakeholders. By highlighting advances in usability, we aim to encourage thoughtful and rigorous design at the academic prototyping stage to address one outstanding hurdle that limits the number of PADs that make it from the benchtop to the point-of-care.",
        "DOI": "10.1016/j.aca.2020.09.063",
        "paper_author": "Murray L.P.",
        "affiliation_name": "Tufts University",
        "affiliation_city": "Medford",
        "affiliation_country": "United States",
        "affiliation_id": "60023143"
    },
    {
        "paper_title": "In vitro and in vivo study of naturally derived alginate/hydroxyapatite bio composite scaffolds",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "56",
        "cover_date": "2020-12-15",
        "Abstract": "Biogenic bioceramics scaffolds are receiving considerable attention for bone restoration applications. Compared with scaffolds of chemical origin, biogenic scaffolds exhibit greater biocompatibility and enhanced bioactive features. In the present study, porous biogenic hydroxyapatite (bHA) was prepared via a polymeric infiltration route and was subsequently coated with alginate to produce alginate/biogenic hydroxyapatite (Alg/bHA) composites. Alginate was used to enhance the mechanical properties as well as the bioactivity and biodegradability of the HA scaffolds. A coating of 3%w/v alginate applied for 10 min was found to result in the best coating for the HA porous scaffolds. The in vitro study demonstrated that the prepared composites had acceptable bioactivity and biodegradability characteristics. The histological study in femur bone of rats indicated that the 3Alg/HA scaffolds capable of supporting both endochondral and intramembranous bone formation. The defect was fully regenerated and mostly filled with the mature lamellar bone after 6 months, with Ca/P atomic ratio similar to the rat's normal bone. The studied scaffolds provide a promising therapeutic option to enhance local bone healing because they do not damage liver or kidney functions and do not induce carcinogenic or inflammatory effects. Accordingly, 3Alg/HA scaffolds are recommended for the tissue engineering applications.",
        "DOI": "10.1016/j.ijbiomac.2020.10.014",
        "paper_author": "Mahmoud E.M.",
        "affiliation_name": "National Research Centre",
        "affiliation_city": "Giza",
        "affiliation_country": "Egypt",
        "affiliation_id": "60014618"
    },
    {
        "paper_title": "Magnetic hyperthermia study of magnetosome chain systems in tissue-mimicking phantom",
        "publication": "Journal of Molecular Liquids",
        "citied_by": "19",
        "cover_date": "2020-12-15",
        "Abstract": "Magnetosomes produced by magnetotactic bacteria are biological membrane-enveloped magnetic nanoparticles. Extracted magnetosomes having the form of long chains as well as shortened chains with individual magnetosomes were prepared. The morphology (chain sizes) was modified in the sonication process and its impact was studied by transmission electron microscopy and dynamic light scattering. Fast magnetization saturation of magnetosome samples and the Verwey transition were detected by temperature-dependent magnetization measurements. To study the heating response to the applied alternating magnetic field (magnetic hyperthermia) magnetosomes were added into tissue-mimicking phantom. Temperature evolution and specific absorption rate (SAR) were measured and analyzed. It was found that embedding magnetosome chains in gel phantoms lead to a noticeable decrease in the efficiency of heating due to deterioration of Brownian mechanism.",
        "DOI": "10.1016/j.molliq.2020.114470",
        "paper_author": "Molcan M.",
        "affiliation_name": "Slovak Academy of Sciences",
        "affiliation_city": "Bratislava",
        "affiliation_country": "Slovakia",
        "affiliation_id": "60010330"
    },
    {
        "paper_title": "SrO assisted 1393 glass scaffold with enhanced biological compatibility",
        "publication": "Journal of Non-Crystalline Solids",
        "citied_by": "8",
        "cover_date": "2020-12-15",
        "Abstract": "Being therapeutic ion strontium is often substituted for calcium to confer enhanced therapeutic potential in bioactive glasses. The present study deals with the evaluation of desired physico-chemical and biological compatibilities of SrO derived bioactive 1393 glass scaffolds. Herein, the SrO substituted for CaO (0, 5, 20, 50 and 100%) in 1393 glass based scaffolds (namely S1, S2, S3, S4 and S5) were prepared through the most versatile sol gel route followed by foam replica technique. The In-vitro bioactivity of the scaffolds characterized by XRD, FTIR, SEM-EDX, and pH behavior was enhanced by increasing SrO percentage in parent 1393 glass system. Physicomechanical properties were also considerably improved in SrO derived scaffolds than that of the pure glass system in both ‘as prepared’ and ‘during soaking in SBF’. Further, the formation of strontium hydroxycarbonated apatite [Sr-HCA; Ca(10-x)Srx(PO4)6-y(CO3)y(OH)2] layer on the SrO derived scaffolds have improved the cell-scaffold interactions and augmented the biocompatibility in SrO substituted scaffolds. Therefore, SrO derived 1393 glass scaffolds seem potential biomaterials for neo bone tissue regenerative application especially trabecular bones.",
        "DOI": "10.1016/j.jnoncrysol.2020.120392",
        "paper_author": "Ali A.",
        "affiliation_name": "Indian Institute of Technology (BHU) Varanasi",
        "affiliation_city": "Varanasi",
        "affiliation_country": "India",
        "affiliation_id": "60019106"
    },
    {
        "paper_title": "Modular engineering of Shiraia bambusicola for hypocrellin production through an efficient CRISPR system",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "17",
        "cover_date": "2020-12-15",
        "Abstract": "Shiraia bambusicola exhibits an excellent capability to produce high-value pharmacological drugs, such as hypocrellin. However, less effective molecular tools hamper the processes to discover or exploit these metabolites. To address this issue, the more effective CRISPR/Cas9 system was constructed by optimizing the sgRNA transcription elements and disrupting the endogenous non-homologous end-joining pathway. These tactics prompted the gene-targeting frequency of 100% and simultaneously multiplex genome editing in S. bambusicola. This optimal CRISPR system encouraged us to rewire the entire hypocrellin flux and improve the yield by orchestrating the substrate pool supply, the central hypocrellin pathway, and the antioxidant system. Thus, 8632 mg/L hypocrellin was obtained, resulting in a 12-fold increase than that of the wild-type strain. This engineered S. bambusicola can still endure oxidative stresses from higher target metabolites and sustain an excellent biological activity. This study provides a whole conception to establish the more efficient genome-editing system. Higher conserved transcription elements for sgRNA expressions inspire us to adopt this system for gene modifications of other filamentous fungi. The rational and global biosystems outline will offer guidance to modulate metabolite productivity in other filamentous fungi.",
        "DOI": "10.1016/j.ijbiomac.2020.09.208",
        "paper_author": "Deng H.",
        "affiliation_name": "Jiangnan University",
        "affiliation_city": "Wuxi",
        "affiliation_country": "China",
        "affiliation_id": "60007029"
    },
    {
        "paper_title": "Bioinspired lipid-polysaccharide modified hybrid nanoparticles as a brain-targeted highly loaded carrier for a hydrophilic drug",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "23",
        "cover_date": "2020-12-15",
        "Abstract": "Lipid-polysaccharide modified biohybrid nanoparticles (NPs) are eminent drug carriers for brain targeting, owing to their ability to prolong the circulation time and penetrate the blood brain barrier (BBB). Biohybrid NPs particular interest arises from their potential to mimic biological components. Herein, we prepared bioinspired lipid polymeric NPs, either naked or surface modified by a synthesized biocompatible dextran–cholic acid (DxC). The nanoprecipitation method was tailored to allow the assembly of the multicomponent NPs in a single step. Modulating the solvent/antisolvent system provided lipid polymer hybrid NPs in the size of 111.6 ± 11.4 nm size. The NPs encapsulated up to 92 ± 1.2% of a hydrophilic anti-Alzheimer drug, rivastigmine (Riv). The brain uptake, biodistribution and pharmacokinetics studies, proved the efficient fast penetration of the bioinspired surface modified NPs to the brain of healthy albino rats. The modified nanocarrier caused a 5.4 fold increase in brain targeting efficiency compared to the drug solution. Furthermore, the presence of DxC increased Riv's brain residence time up to 40 h. The achieved results suggest that the fabricated biohybrid delivery system was able to circumvent the BBB and is expected to minimize Riv systemic side effects.",
        "DOI": "10.1016/j.ijbiomac.2020.09.170",
        "paper_author": "Omar S.H.",
        "affiliation_name": "Faculty of Pharmacy - Ain Shams University",
        "affiliation_city": "Cairo",
        "affiliation_country": "Egypt",
        "affiliation_id": "60216981"
    },
    {
        "paper_title": "Lattice design and 3D-printing of PEEK with Ca<inf>10</inf>(OH)(PO<inf>4</inf>)<inf>3</inf> and in-vitro bio-composite for bone implant",
        "publication": "International Journal of Biological Macromolecules",
        "citied_by": "64",
        "cover_date": "2020-12-15",
        "Abstract": "The addition of biomaterials such as Calcium Hydroxyapatite (cHAp) and incorporation of porosity into poly-ether-ether-ketone (PEEK) are effective ways to improve bone-implant interfaces and osseointegration of PEEK composite. Hence, the morphological effects of nanocomposite on surfaces biocompatibility of a newly fabricated composite of PEEK polymer and cHAp for a bone implant, using additive manufacturing (AM) were investigated. Fused deposition modeling (FDM) method and a surface treatment strategy were employed to create a microporous scaffold. PEEK osteointegration was slow and, therefore, it was accelerated by surface coatings with the incorporation of bioactive cHAp, with enhanced mechanical and biological behaviors for bone implants. Characterization of the new PEEK/cHAp composite was done by X-ray diffraction (XRD), differential scanning calorimetry (DSC), mechanical tests of traction and flexion, thermal dynamic mechanical analysis (DMA). Also, the PEEK/cHAp induced the formation of apatite after immersion in the simulated body fluid of DMEM for different days to check its biological bioactivity for an implant. In-vivo results depicted that the osseointegration and the biological activity around the PEEK/cHAp composite were higher than that of PEEK. The increase in the mechanical performance of cHAp-coated PEEK can be attributed to the increase in the degree of crystallinity and accumulation of residual polymer.",
        "DOI": "10.1016/j.ijbiomac.2020.09.175",
        "paper_author": "Oladapo B.I.",
        "affiliation_name": "De Montfort University",
        "affiliation_city": "Leicester",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60017098"
    },
    {
        "paper_title": "Bone-derived dECM/alginate bioink for fabricating a 3D cell-laden mesh structure for bone tissue engineering",
        "publication": "Carbohydrate Polymers",
        "citied_by": "123",
        "cover_date": "2020-12-15",
        "Abstract": "Alginate bioink has been widely employed to fabricate 3D cell-laden structures because of its low toxicity, appropriate biocompatibility, and easy/fast cross-linking ability. However, the low bioactivity of the hydrogel is a main shortcoming, so that physical or chemical modification with bioactive components is a promising strategy to efficiently increase the biological activity of alginate hydrogel. The present study proposes a new method to obtain bioactive alginate-based bioink by supplementing it with methacrylated (Ma)-decellularized extracellular matrix (dECM) derived from bone tissues. We demonstrate that the appropriate processing conditions and concentration of Ma-dECM in the bioink offer not only reasonable printability for fabricating 3D cell-laden structures, but also meaningful cell viability of the printed cell-laden construct. Moreover, the biologically improved microenvironment of alginate-based cell-laden structures formed using our method demonstrated a substantial effect on the osteogenic differentiation of the human adipose derived stem cells that were laden in the bioink.",
        "DOI": "10.1016/j.carbpol.2020.116914",
        "paper_author": "Lee J.",
        "affiliation_name": "Sungkyunkwan University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60007511"
    },
    {
        "paper_title": "State-of-the-art methods for overcoming temperature polarization in membrane distillation process: A review",
        "publication": "Journal of Membrane Science",
        "citied_by": "191",
        "cover_date": "2020-12-15",
        "Abstract": "Membrane distillation (MD) technology has been mainly used as a treatment method for saline or contaminated wastewater. Despite the rapid progress in material engineering and design of novel MD systems, principal challenges as temperature polarization (TP) and high-energy consumption per unit of produced water still restrict its commercialization. Recently, TP mitigation has been addressed by modification and configuration of MD systems or by using advanced materials for membrane fabrication. These include coating thermally conductive or photonic nanomaterials on the membrane's surface or using thermally conductive metallic based membranes that impact heat dispersion along the membrane. In addition, frame-like turbulence promoters and modified feed channels were shown to lower TP by enhancing the characteristics of the feed flow. Finally, systems able to directly heat the membrane's surface without preheating the feed solution, including solar, Joule, and induction heating, were shown effective in eliminating TP due to the higher temperature at the membrane-water interface in comparison to the temperature of the bulk feed solution. The review aims to summarize recent advances made in TP mitigation for MD systems and assess their influence on distillation efficiency. We include a brief description of the TP phenomenon and its observed effects on MD and describe advanced MD processes from the aspects of low or negligible TP, high distillate flux, and improved energy efficiency.",
        "DOI": "10.1016/j.memsci.2020.118413",
        "paper_author": "Anvari A.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60149188"
    },
    {
        "paper_title": "Development of an integrated aerobic granular sludge MBR and reverse osmosis process for municipal wastewater reclamation",
        "publication": "Science of the Total Environment",
        "citied_by": "13",
        "cover_date": "2020-12-15",
        "Abstract": "The reclamation of municipal wastewater to obtain high-grade product water is a growing need due to the pressing global water shortage. However, the existing municipal wastewater treatment plants (WWTPs) with the conventional activated sludge process as a core is not a sustainable engineering solution towards future water sustainability. To tackle such an emerging water-wastewater nexus, a ferrous-assisted aerobic granular sludge membrane bioreactor and reverse osmosis (AGSMBR-RO) process was developed for municipal wastewater reclamation. Results show that about 99.9%, 99.7% and nearly 100% of dissolved organic carbon (DOC), ammonium-N and total phosphorus (TP), respectively, could be removed in the ferrous-assisted AGSMBR-RO process, while the product water could meet the typical NEWater quality of Singapore with respect to the parameters analysed in this study. Moreover, it was found that an addition of 6 mg/L of ferrous could improve the stability of aerobic granular sludge (AGS) through the coagulation and flocculation of suspended flocs as well as phosphorus removal. These in turn led to reduced membrane fouling in both AGSMBR and RO units. Consequently, the proposed process is a promising alternative for municipal wastewater reclamation.",
        "DOI": "10.1016/j.scitotenv.2020.141309",
        "paper_author": "Wang S.",
        "affiliation_name": "Nanyang Environment &amp; Water Research Institute",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60118763"
    },
    {
        "paper_title": "A length scale insensitive anisotropic phase field fracture model for hyperelastic composites",
        "publication": "International Journal of Mechanical Sciences",
        "citied_by": "71",
        "cover_date": "2020-12-15",
        "Abstract": "Fracture of composites consisting of isotropic matrix and anisotropic fibers is an essential problem in many engineering applications. The computational simulation of such a fracture is complicated, but the use of phase field models (PFMs) is promising. Indeed, in PFMs, sharp cracks are not treated as discontinuities; instead, they are approximated as thin damage bands. Thus, PFMs can seamlessly model complex crack patterns like branching, merging, and fragmentation. However, previous PFMs for anisotropic fracture, which are mostly based on a PFM using a simple quadratic degradation function without any user-defined parameters, provide solutions that are sensitive to a length scale (that controls the width of the damage band). Moreover, those PFMs have considered a same softening behavior for isotropic and anisotropic part of composite – which is not correct. This paper presents a length scale insensitive PFM for brittle fracture of anisotropic hyperelastic solids considering distinct softening behavior of isotropic matrix and anisotropic fibers. This model is an extension of the model of Wu [JMPS, 103 (2017)] with a rational degradation function dependent on elasticity and fracture related material parameters. Fracture of fiber-reinforced composites and biological tissues, simulated using the proposed model within the framework of the finite element method, is presented with predictions in good agreement with previous findings and experiments. Most importantly, the results are independent of the incorporated length scale parameter. Moreover, preliminary results show that the proposed model is as efficient as the previous models.",
        "DOI": "10.1016/j.ijmecsci.2020.105941",
        "paper_author": "Mandal T.K.",
        "affiliation_name": "Monash University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60019578"
    },
    {
        "paper_title": "Electrospinning nanofiber scaffolds for soft and hard tissue regeneration",
        "publication": "Journal of Materials Science and Technology",
        "citied_by": "181",
        "cover_date": "2020-12-15",
        "Abstract": "Tissue engineering is an interdisciplinary field that integrates medical, biological, and engineering expertise to restore or regenerate the functionality of healthy tissues and organs. The three fundamental pillars of tissue engineering are scaffolds, cells, and biomolecules. Electrospun nanofibers have been successfully used as scaffolds for a variety of tissue engineering applications because they are biomimetic of the natural, fibrous extracellular matrix (ECM) and contain a three-dimensional (3D) network of interconnected pores. In this review, we provide an overview of the electrospinning process, its principles, and the application of the resultant electrospun nanofibers for tissue engineering. We first briefly introduce the electrospinning process and then cover its principles and standard equipment for biomaterial fabrication. Next, we highlight the most important and recent advances related to the applications of electrospun nanofibers in tissue engineering, including skin, blood vessels, nerves, bone, cartilage, and tendon/ligament applications. Finally, we conclude with current advancements in the fabrication of electrospun nanofiber scaffolds and their biomedical applications in emerging areas.",
        "DOI": "10.1016/j.jmst.2020.04.037",
        "paper_author": "Xie X.",
        "affiliation_name": "Donghua University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60010953"
    },
    {
        "paper_title": "Mechano-active biomaterials for tissue repair and regeneration",
        "publication": "Journal of Materials Science and Technology",
        "citied_by": "17",
        "cover_date": "2020-12-15",
        "Abstract": "There is a lack of effective tissue repair and regeneration strategies in current clinical practices. Numerous studies have suggested that smart or responsive biomaterials possessing the ability to respond to endogenous stimuli in vivo may positively mediate the tissue micro-environment towards a tissue repair or regeneration. Mechanical stimuli, which constantly exist in a wide range of biological systems and are involved in almost all the physiological processes, belong to such stimuli to which responsive biomaterials can respond. In recent studies, a new type of smart biomaterials, which can dynamically adapt to the mechanical stimuli in vivo and thus has specific functionality consistently mediated by such mechanical stimuli, has emerged. In contrast to common biomaterials that passively react to the mechanical environment of an implantation site, such mechano-active biomaterials have enabled various active or automatic strategies for tissue repair or regeneration, such as providing precise spatial-temporal controls on delivery of drugs or cells in the organs of the musculoskeletal and the circulatory systems; in situ reconstructing the original or a favorable mechanical environment at a lesion site; and accelerating the tissue remodeling or healing process via a mechanobiological effect. This article elucidates a perspective of perfecting tissue repair or regeneration using mechano-active biomaterials, especially highlighting the rationale behind the concept of mechano-active biomaterials and their potential in the repair or regeneration of musculoskeletal and cardiovascular tissues. Albeit outstanding challenges and unknowns, the emergence of mechano-active biomaterials has become a new avenue for tissue engineering and regenerative medicine.",
        "DOI": "10.1016/j.jmst.2020.03.074",
        "paper_author": "Lin X.",
        "affiliation_name": "Soochow University",
        "affiliation_city": "Suzhou",
        "affiliation_country": "China",
        "affiliation_id": "60010432"
    },
    {
        "paper_title": "Palm vein recognition, a review on prospects and challenges based on CASIA's dataset",
        "publication": "Proceedings - International Conference on Developments in eSystems Engineering, DeSE",
        "citied_by": "3",
        "cover_date": "2020-12-14",
        "Abstract": "With the development of technology, recognition has become now a very important and main thing due to the large number of fraud and forgery operations that occur. The traditional methods such as signature and recognition based on knowledge do not meet the safety requirements due to the ease of forging and stealing them, as biometric technologies have emerged as an alternative to them due to the high security provided and accuracy. Biometrics rely on behavioral and physiological characteristics such as recognition based on palm veins to provide maximum protection and avoid unauthorized access to our personal property. In this paper, we will talk about authentication through palm veins. They are biological properties that do not change over time, and each person has his own pattern of veins, even symmetric twins have different patterns. These veins are not seen with the eye, which is difficult to forge and steal as the pattern of veins is extracted by near infrared rays palm veins images are considered one of the most promising technologies that meet the advanced safety requirements of modern privacy policies for highly sensitive systems. The authentication system through palm veins generally content from four steps, namely acquisition of image, preprocessing, extraction of feature and feature matching. In each stage, there is a set of methods used in this research. We will talk about these methods used in the palm vein by using the cassia database.",
        "DOI": "10.1109/DeSE51703.2020.9450241",
        "paper_author": "Al-Jaberi A.S.",
        "affiliation_name": "University of Al-Qadisiyah",
        "affiliation_city": "Al-Qadisiyah",
        "affiliation_country": "Iraq",
        "affiliation_id": "60077692"
    },
    {
        "paper_title": "Structural Equilibrium Control of Network Systems",
        "publication": "Proceedings of the IEEE Conference on Decision and Control",
        "citied_by": "1",
        "cover_date": "2020-12-14",
        "Abstract": "In the analysis and design of a network system, one is often faced with the situation where the network structure is known but the node dynamics is almost unknown. Thus structural analysis problems, in which the prior knowledge is almost about the network structure, have received attention in science and engineering fields. Along this line of research, this paper addresses a structural design problem, that is, to find a sign pattern of the control input such that any constant input with the sign pattern drives the system to a desirable steady state in a qualitative sense. A solution is presented by reducing the problem into a design problem of the so-called sign-solvable equation, which is a linear equation whose qualitative solution can be determined from the prior knowledge of the sign pattern of the coefficients. Our framework is demonstrated by applying to a control problem of the biological network of apoptosis.",
        "DOI": "10.1109/CDC42340.2020.9304083",
        "paper_author": "Azuma S.I.",
        "affiliation_name": "Nagoya University",
        "affiliation_city": "Nagoya",
        "affiliation_country": "Japan",
        "affiliation_id": "60000264"
    },
    {
        "paper_title": "Stem Cell-Friendly Scaffold Biomaterials: Applications for Bone Tissue Engineering and Regenerative Medicine",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "78",
        "cover_date": "2020-12-14",
        "Abstract": "Bone is a dynamic organ with high regenerative potential and provides essential biological functions in the body, such as providing body mobility and protection of internal organs, regulating hematopoietic cell homeostasis, and serving as important mineral reservoir. Bone defects, which can be caused by trauma, cancer and bone disorders, pose formidable public health burdens. Even though autologous bone grafts, allografts, or xenografts have been used clinically, repairing large bone defects remains as a significant clinical challenge. Bone tissue engineering (BTE) emerged as a promising solution to overcome the limitations of autografts and allografts. Ideal bone tissue engineering is to induce bone regeneration through the synergistic integration of biomaterial scaffolds, bone progenitor cells, and bone-forming factors. Successful stem cell-based BTE requires a combination of abundant mesenchymal progenitors with osteogenic potential, suitable biofactors to drive osteogenic differentiation, and cell-friendly scaffold biomaterials. Thus, the crux of BTE lies within the use of cell-friendly biomaterials as scaffolds to overcome extensive bone defects. In this review, we focus on the biocompatibility and cell-friendly features of commonly used scaffold materials, including inorganic compound-based ceramics, natural polymers, synthetic polymers, decellularized extracellular matrix, and in many cases, composite scaffolds using the above existing biomaterials. It is conceivable that combinations of bioactive materials, progenitor cells, growth factors, functionalization techniques, and biomimetic scaffold designs, along with 3D bioprinting technology, will unleash a new era of complex BTE scaffolds tailored to patient-specific applications.",
        "DOI": "10.3389/fbioe.2020.598607",
        "paper_author": "Zhang Y.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434"
    },
    {
        "paper_title": "Stem Cell Mechanobiology and the Role of Biomaterials in Governing Mechanotransduction and Matrix Production for Tissue Regeneration",
        "publication": "Frontiers in Bioengineering and Biotechnology",
        "citied_by": "83",
        "cover_date": "2020-12-14",
        "Abstract": "Mechanobiology has underpinned many scientific advances in understanding how biophysical and biomechanical cues regulate cell behavior by identifying mechanosensitive proteins and specific signaling pathways within the cell that govern the production of proteins necessary for cell-based tissue regeneration. It is now evident that biophysical and biomechanical stimuli are as crucial for regulating stem cell behavior as biochemical stimuli. Despite this, the influence of the biophysical and biomechanical environment presented by biomaterials is less widely accounted for in stem cell-based tissue regeneration studies. This Review focuses on key studies in the field of stem cell mechanobiology, which have uncovered how matrix properties of biomaterial substrates and 3D scaffolds regulate stem cell migration, self-renewal, proliferation and differentiation, and activation of specific biological responses. First, we provide a primer of stem cell biology and mechanobiology in isolation. This is followed by a critical review of key experimental and computational studies, which have unveiled critical information regarding the importance of the biophysical and biomechanical cues for stem cell biology. This review aims to provide an informed understanding of the intrinsic role that physical and mechanical stimulation play in regulating stem cell behavior so that researchers may design strategies that recapitulate the critical cues and develop effective regenerative medicine approaches.",
        "DOI": "10.3389/fbioe.2020.597661",
        "paper_author": "Naqvi S.M.",
        "affiliation_name": "University of Galway",
        "affiliation_city": "Galway",
        "affiliation_country": "Ireland",
        "affiliation_id": "60008539"
    },
    {
        "paper_title": "Biodegradable composite material for bone reconstruction: Medical and biological research",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2020-12-14",
        "Abstract": "Modern and promising concepts in bone reconstruction surgery are related to the achievements in tissue engineering, the key element of which is artificially created tissue equivalents (matrices) in which the cells can attach, proliferate and differentiate with subsequent new tissue formation. Recently there has been an increasing interest in the development of new biodegradable matrices used in reconstructive surgery. The biological properties of bioresorbable PURASORB PL-38 polylactic acid-based polymers formed by the method of aerodynamic molding in a turbulent gas flow were studied. To enhance the biological activity of the implants, two types of filler were used: dicalcium phosphate dihydrate and hydroxyapatite, which were included in the structure of the material using laser ablation method. The osteointegrative properties of the implants were tested on 48 male Wistar rats weighting 180-200 g. The rats were divided into 3 groups depending on the test sample. The follow-up ranged from 15 to 90 days. Microscopic study revealed inflammatory giant cell infiltrate with the presence of histiocytes and fibroblasts around the implants. The inflammatory infiltrate persisted for 60 days and gradually replaced the resorbable implant material, providing its biodegradability. On day 90 after implantation, decreased inflammatory infiltrate (a decrease in the number of giant cells) was observed in all groups of the studied samples. Osteogenesis occurred only in cases of the damage to bone tissue, when the implant was in close contact with both the cranial bones and the pelvic bones. The results obtained demonstrated that the biodegradable implant made of PURASORB PL polylactic acid polymer and organic mineral filler obtained by the method of laser ablation of a solid target made from dicalcium phosphate dihydrate showed the best integration properties.",
        "DOI": "10.1063/5.0034328",
        "paper_author": "Kulbakin D.",
        "affiliation_name": "Tomsk National Research Medical Center, Russian Academy of Sciences",
        "affiliation_city": "Tomsk",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60072487"
    },
    {
        "paper_title": "Ecological globalistics and the paradigm of world civilization development",
        "publication": "E3S Web of Conferences",
        "citied_by": "0",
        "cover_date": "2020-12-14",
        "Abstract": "The nature of public perception of global environmental problems and ways to solve them becomes a paradigm for the development of civilization. The lack of resources necessary for the normal life of people has caused the development of a complex of catastrophic processes. Among them, the most important are: water, food and demographic crises, as well as the crisis of biodiversity, which consists in the widespread destruction of areas of the environment suitable for habitat of plants and animals. The real solution to these problems requires two conditions to be met. First, it is the creation of a scientific basis for the development of a global strategy for the preservation of conditions on the planet suitable for the existence of humans and other organisms. Secondly, it is the need to change the paradigm of environmental perception. The global technogenesis of the biosphere inevitably leads to a widespread transformation of natural conditions. All ecosystems are being transformed into natural and technical systems. The preservation of conditions favorable for human life and other biological species in them is possible only on the basis of the creation and inclusion in these systems of technical means that perform regulatory functions. This approach contradicts traditional ecological thinking and requires a transition to a new paradigm, which can be designated as creative.",
        "DOI": "10.1051/e3sconf/202021711003",
        "paper_author": "Suzdaleva A.",
        "affiliation_name": "Moscow State University of Civil Engineering",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60024799"
    },
    {
        "paper_title": "New technological concept of utilization animal and poultry waste",
        "publication": "E3S Web of Conferences",
        "citied_by": "5",
        "cover_date": "2020-12-14",
        "Abstract": "Methods of disposal of manure/litter. There is a large amount of biological waste as a source of organic nitrogen in humus-forming fertilizer. The solution to this situation is the use of a new technological process-blending manure/litter with slaughter waste, as well as subsequent autoclave treatment and drying of the mixture. Equipment for manure/litter drying can be installed on the territory of the livestock/poultry complex in a convenient location. Installation options will be different, depending on the type of manure/litter, the presence/absence of slaughter production, the type of animals or birds, but only slightly. The set of equipment will be almost the same in all cases. As a fundamental decision on the use of new technology at the state level would be the following. Logistical, technological and territorial unification of two major tasks: disposal of solid waste with obtaining huge amounts of thermal energy and simultaneous disposal of manure/litter to produce humus-forming fertilizer. The economic efficiency of the proposed technology is determined by the cost of drying. The production of dried fertilizer is very energy intensive, since have to evaporate huge amounts of water.",
        "DOI": "10.1051/e3sconf/202021709011",
        "paper_author": "Mamas N.",
        "affiliation_name": "Kuban State Agrarian University",
        "affiliation_city": "Krasnodar",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60005163"
    },
    {
        "paper_title": "Algorithm for recognizing and measuring parameters of biological objects in agriculture based on deep learning convolutional neural networks",
        "publication": "E3S Web of Conferences",
        "citied_by": "1",
        "cover_date": "2020-12-14",
        "Abstract": "As of today existing techniques and tools for measuring leaf area involve the detachment of leaves for further scanning and calculations to determine leaf area. The disadvantages of existing solutions for determining the area of the sheet surface are labor intensity, the duration of these studies, the relatively low accuracy of measurements. Due to these facts this study is an important work aimed to simplifying the process of analyzing biological parameters and other important characteristics of plants, as well as increasing the efficiency of this agrotechnical task. This work aims developing a set of software tools with trained neural networks to determine whether a photographed leaf belongs to the leaves of a soybean crop, assess the health of soybean plants and determine the surface area of a soybean leaf with geotagging.",
        "DOI": "10.1051/e3sconf/202021710006",
        "paper_author": "Kurbanov R.",
        "affiliation_name": "Federal Scientific Agroengineering Center VIM",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60116434"
    },
    {
        "paper_title": "The relationship of psychological, clinical and biological components in epilepsy",
        "publication": "E3S Web of Conferences",
        "citied_by": "14",
        "cover_date": "2020-12-14",
        "Abstract": "This study examined the relationship patterns of psychological characteristics, clinical and biological indicators, their relationship in the structure of the personality of epilepsy patients. The aim of this work was to study the ratio of biological and clinical and psychological components in the structure of a person suffering from epilepsy. Such characteristics was conducted as the type of disease seizures and duration of the disease were taken into account: simple, complex partial seizures, duration of the disease up to 30 years dominated. The verification of the diagnosis in the patients examined was carried out on the basis of clinical and neurological, psychopathological, pathopsychological, EEG examination and computer tomography data of the brain. The study of biological, clinical and psychological characteristics of epileptic patients was carried out using the method of clinical observation, psychodiagnostic method \"Diagnosis of satisfaction of basic needs.\"In patients with epilepsy revealed reliable multidimensional clinical and psychological characteristics of satisfaction of the main groups of needs: material needs, security needs, social (interpersonal) needs, the need for recognition, the need for self-expression.The considered characteristics are of interest to doctors, clinical psychologists and other professionals involved in preventive, therapeutic and rehabilitation measures of epilepsy patients.",
        "DOI": "10.1051/e3sconf/202021708006",
        "paper_author": "Tokareva N.",
        "affiliation_name": "Ogarev Mordovia State University",
        "affiliation_city": "Saransk",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60023713"
    },
    {
        "paper_title": "Tubular Silk Fibroin/Gelatin-Tyramine Hydrogel with Controllable Layer Structure and Its Potential Application for Tissue Engineering",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "20",
        "cover_date": "2020-12-14",
        "Abstract": "In recent years, biomimetic tubular scaffolds have been widely used to repair various human tissue defects, due to their hollow structure similar to the native tissues such as blood vessel, trachea, ureter, and bone marrow cavity. However, there are still many challenges in manufacturing a tubular hydrogel scaffold with suitable mechanical properties, specific microstructure, and good biocompatibility. In this study, we exploited an enzymatic cross-linking method using horseradish peroxidase (HRP) as an enzyme and hydrogen peroxide (H2O2) as a substrate, and combining with gelatin's thermal sensitivity to produce an enzymatically cross-linked silk fibroin/gelatin-tyramine (E-SF/GT) tubular hydrogel. Through further treatment with methanol, we fabricated an EM-SF/GT tubular hydrogel with fine-wall architecture that consists of two different layers (inner and outer, dense and porous). Mechanical measurement showed that the compressive moduli values were up to 4.82 MPa and the tensile moduli values were up to 4.79 kPa under the static loading conditions. Also, degradation test showed that the hydrogel's degradation time was prolonged. Finally, the bioactivity was tested by seeding mouse bone marrow mesenchymal stem cells (mBMSCs) in the lumen of a small-diameter (2 mm) EM-SF/GT tubular hydrogel. Cell morphology and immunofluorescence test indicated that mBMSCs differentiated into endothelial cells and lined the inner surface of the tubular hydrogel under induction. This work provided a feasible strategy for developing tubular hydrogels, which could be potentially used as scaffolds for hollow multilayer tissue engineering, such as blood vessels.",
        "DOI": "10.1021/acsbiomaterials.0c01183",
        "paper_author": "Xu S.",
        "affiliation_name": "South China University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60024542"
    },
    {
        "paper_title": "Three-Dimensional Printed Hydrogels with High Elasticity, High Toughness, and Ionic Conductivity for Multifunctional Applications",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "10",
        "cover_date": "2020-12-14",
        "Abstract": "Hydrogels have drawn extensive attention due to their unique physical and biological properties. However, the relatively low mechanical strength and poor processability of hydrogels limit their applications. Especially, the emerging 3D printing technology for nontoxic hydrogels requires proper formability and controllable mechanical behaviors. In this study, a new strategy to construct a novel double-network biocompatible hydrogel from poly(ethylene glycol) diacrylate (PEGDA) and short-chain chitosan (CS) via ionic-covalent cross-linking is by a two-step method involving UV curing followed by immersion in an anionic solution. The CS-based ionic network and PEGDA-based covalent network as well as the hydrogen bonds between them jointly induce excellent mechanical properties, which can be regulated by changing the PEGDA/CS content and ionic cross-linking time. Compared with conventional hydrogels, this mechanically optimized hydrogel exhibits a superior elastic modulus (3.84 ± 0.4 MPa), higher tensile strength (7.23 ± 0.2 MPa), and higher tensile strain (162 ± 7%). Notably, its excellent printing capability through the citrate anionic solution adjustment enables 3D printing with precision, flexibility, and a complex inner structure by extrusion in air at room temperature. In addition, a number of citrate ions existed in the ionic network, giving the hydrogels good electrical conductivity. Therefore, this printable, conductive, and tough hydrogel exhibits potential for vascular engineering, cartilage tissue engineering, and wearable device applications.",
        "DOI": "10.1021/acsbiomaterials.0c01413",
        "paper_author": "Deng Z.",
        "affiliation_name": "South China University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60024542"
    },
    {
        "paper_title": "Advanced biomedical applications based on emerging 3D cell culturing platforms",
        "publication": "Journal of Materials Chemistry B",
        "citied_by": "42",
        "cover_date": "2020-12-14",
        "Abstract": "It is of great value to develop reliable in vitro models for cell biology and toxicology. However, ethical issues and the decreasing number of donors restrict the further use of traditional animal models in various fields, including the emerging fields of tissue engineering and regenerative medicine. The huge gap created by the restrictions in animal models has pushed the development of the increasingly recognized three-dimensional (3D) cell culture, which enables cells to closely simulate authentic cellular behaviour such as close cell-to-cell interactions and can achieve higher functionality. Furthermore, 3D cell culturing is superior to the traditional 2D cell culture, which has obvious limitations and cannot closely mimic the structure and architecture of tissues. In this study, we review several methods used to form 3D multicellular spheroids. The extracellular microenvironment of 3D spheroids plays a role in many aspects of biological sciences, including cell signalling, cell growth, cancer cell generation, and anti-cancer drugs. More recently, they have been explored as basic construction units for tissue and organ engineering. We review this field with a focus on the previous research in different areas using spheroid models, emphasizing aqueous two-phase system (ATPS)-based techniques. Multi-cellular spheroids have great potential in the study of biological systems and can closely mimic the in vivo environment. New technologies to form and analyse spheroids such as the aqueous two-phase system and magnetic levitation are rapidly overcoming the technical limitations of spheroids and expanding their applications in tissue engineering and regenerative medicine. This journal is",
        "DOI": "10.1039/d0tb01658f",
        "paper_author": "Wang A.",
        "affiliation_name": "University of Hull",
        "affiliation_city": "Hull",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60030469"
    },
    {
        "paper_title": "Halloysite nanotubes-the nano-bio interface",
        "publication": "Nanoscale",
        "citied_by": "71",
        "cover_date": "2020-12-14",
        "Abstract": "The numerous biological applications of nanoparticles in general and nano-clays in particular are rooted in understanding and harnessing their dynamic nano-bio interface. Among clays, the intrinsically-mesoporous halloysite nanotubes (HNTs) have emerged in recent years as promising nanomaterials. The diverse interactions of these nanotubes with living cells, encompassing electrostatic, van der Waals, and ion exchange, along with cellular response, are crucial in determining the behaviour of HNTs in biological systems. Thus, rational engineering of the nanotube properties allows for vast applications ranging from bacteria encapsulation for bioremediation, through algae flocculation for aquaculture, to intracellular drug delivery. This review summarizes the many aspects of the nano-bio interface of HNTs with different cell types (bacteria, algae and fungi, and mammalian cells), highlighting biocompatibility/bio-adverse properties, interaction mechanisms, and the latest cutting-edge technologies. This journal is",
        "DOI": "10.1039/d0nr06820a",
        "paper_author": "Prinz Setter O.",
        "affiliation_name": "Technion - Israel Institute of Technology",
        "affiliation_city": "Haifa",
        "affiliation_country": "Israel",
        "affiliation_id": "60022403"
    },
    {
        "paper_title": "Enhanced Osteogenic Potential of Phosphonated-Siloxane Hydrogel Scaffolds",
        "publication": "Biomacromolecules",
        "citied_by": "10",
        "cover_date": "2020-12-14",
        "Abstract": "In a material-guided approach, instructive scaffolds that leverage potent chemistries may efficiently promote bone regeneration. A siloxane macromer has been previously shown to impart osteoinductivity and bioactivity when included in poly(ethylene glycol) diacrylate (PEG-DA) hydrogel scaffolds. Herein, phosphonated-siloxane macromers were evaluated for enhancing the osteogenic potential of siloxane-containing PEG-DA scaffolds. Two macromers were prepared with different phosphonate pendant group concentrations, poly(diethyl(2-(propylthio)ethyl)phosphonate methylsiloxane) diacrylate (PPMS-DA) and 25%-phosphonated analogue (PPMS-DA 25%). Macroporous, templated scaffolds were prepared by cross-linking these macromers with PEG-DA at varying mol % (15:85, 30:70, and 45:55 PPMS-DA to PEG-DA; 30:70 PPMS-DA 25% to PEG-DA). Other scaffolds were also prepared by combining PEG-DA with PDMS-MA (i.e., no phosphonate) or with vinyl phosphonate (i.e., no siloxane). Scaffold material properties were thoroughly assessed, including pore morphology, hydrophobicity, swelling, modulus, and bioactivity. Scaffolds were cultured with human bone marrow-derived mesenchymal stem cells (normal media) and calcium deposition and protein expression were assessed at 14 and 28 days.",
        "DOI": "10.1021/acs.biomac.0c01293",
        "paper_author": "Frassica M.T.",
        "affiliation_name": "Department of Biological and Agricultural Engineering",
        "affiliation_city": "College Station",
        "affiliation_country": "United States",
        "affiliation_id": "60149057"
    },
    {
        "paper_title": "Gold Nanoparticle-Based Platforms for Diagnosis and Treatment of Myocardial Infarction",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "38",
        "cover_date": "2020-12-14",
        "Abstract": "In recent years, an increasing rate of mortality due to myocardial infarction (MI) has led to the development of nanobased platforms, especially gold nanoparticles (AuNPs), as promising nanomaterials for diagnosis and treatment of MI. These promising NPs have been used to develop different nanobiosensors, mainly optical sensors for early detection of biomarkers as well as biomimetic/bioinspired platforms for cardiac tissue engineering (CTE). Therefore, in this Review, we presented an overview on the potential application of AuNPs as optical (surface plasmon resonance, colorimetric, fluorescence, and chemiluminescence) nanobiosensors for early diagnosis and prognosis of MI. On the other hand, we discussed the potential application of AuNPs either alone or with other NPs/polymers as promising three-dimensional (3D) scaffolds to regulate the microenvironment and mimic the morphological and electrical features of cardiac cells for potential application in CTE. Furthermore, we presented the challenges and ongoing efforts associated with the application of AuNPs in the diagnosis and treatment of MI. In conclusion, this Review may provide outstanding information regarding the development of AuNP-based technology as a promising platform for current MI treatment approaches.",
        "DOI": "10.1021/acsbiomaterials.0c00955",
        "paper_author": "Khan S.",
        "affiliation_name": "Zhengzhou University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60018554"
    },
    {
        "paper_title": "The Functional Role of Interface Tissue Engineering in Annulus Fibrosus Repair: Bridging Mechanisms of Hydrogel Integration with Regenerative Outcomes",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "25",
        "cover_date": "2020-12-14",
        "Abstract": "Hydrogels are extraordinarily versatile by design and can enhance repair in diseased and injured musculoskeletal tissues. Biological fixation of these constructs is a significant determinant factor that is critical to the clinical success and functionality of regenerative technologies for musculoskeletal repair. In the context of an intervertebral disc (IVD) herniation, nucleus pulposus tissue protrudes through the ruptured annulus fibrosus (AF), consequentially impinging on spinal nerve roots and causing debilitating pain. Discectomy is the surgical standard of care to treat symptomatic herniation; however these procedures do not repair AF defects, and these lesions are a significant risk factor for recurrent herniation. Advances in tissue engineering utilize adhesive hydrogels as AF sealants; however these repair strategies have yet to progress beyond preclinical animal models because these biomaterials are often plagued by poor integration with AF tissue and lead to large variability in repair outcomes. These critical barriers to translation motivate this article to review the material composition of hydrogels that have been evaluated in situ for AF repair, proposed mechanisms of how these biomaterials interface with AF tissue, and their functional outcomes after treatment in order to inform the development of new hydrogels for AF repair. In this systematic review, we identify 18 hydrogel formulations evaluated for AF repair, all of which demonstrate large heterogeneity in their interfacing mechanisms and reported outcome measures to assess the effectiveness of repair. Hydrogels that covalently bond to AF tissue were found to be the most successful in improving IVD biomechanical properties from the injured state, but none were able to restore properties to the intact state suggesting that new repair strategies with innovative surface chemistries are an important future direction. We additionally review biomechanical evaluation methods and recommend standardization in the field of AF tissue engineering to establish mechanical benchmarks for translation and ensure clinical feasibility.",
        "DOI": "10.1021/acsbiomaterials.0c01320",
        "paper_author": "Distefano T.J.",
        "affiliation_name": "Icahn School of Medicine at Mount Sinai",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60012981"
    },
    {
        "paper_title": "Recent Advances in the Regenerative Approaches for Traumatic Spinal Cord Injury: Materials Perspective",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "38",
        "cover_date": "2020-12-14",
        "Abstract": "Spinal cord injury (SCI) is a devastating health condition that may lead to permanent disabilities and death. Understanding the pathophysiological perspectives of traumatic SCI is essential to define mechanisms that can help in designing recovery strategies. Since central nervous system tissues are notorious for their deficient ability to heal, efforts have been made to identify solutions to aid in restoration of the spinal cord tissues and thus its function. The two main approaches proposed to address this issue are neuroprotection and neuro-regeneration. Neuroprotection involves administering drugs to restore the injured microenvironment to normal after SCI. As for the neuro-regeneration approach, it focuses on axonal sprouting for functional recovery of the injured neural tissues and damaged axons. Despite the progress made in the field, neural regeneration treatment after SCI is still unsatisfactory owing to the disorganized way of axonal growth and extension. Nanomedicine and tissue engineering are considered promising therapeutic approaches that enhance axonal growth and directionality through implanting or injecting of the biomaterial scaffolds. One of these recent approaches is nanofibrous scaffolds that are used to provide physical support to maintain directional axonal growth in the lesion site. Furthermore, these preferable tissue-engineered substrates can afford axonal regeneration by mimicking the extracellular matrix of the neural tissues in terms of biological, chemical, and architectural characteristics. In this review, we discuss the regenerative approach using nanofibrous scaffolds with a focus on their fabrication methods and their properties that define their functionality performed to heal the neural tissue efficiently.",
        "DOI": "10.1021/acsbiomaterials.0c01074",
        "paper_author": "Abbas W.A.",
        "affiliation_name": "School of Sciences and Engineering",
        "affiliation_city": "New Cairo",
        "affiliation_country": "Egypt",
        "affiliation_id": "60218045"
    },
    {
        "paper_title": "Optimizing the Polymer Chemistry and Synthesis Method of PolySTAT, an Injectable Hemostat",
        "publication": "ACS Biomaterials Science and Engineering",
        "citied_by": "12",
        "cover_date": "2020-12-14",
        "Abstract": "There is a lack of prehospital hemostatic agents, especially for noncompressible hemorrhage. We previously reported PolySTAT, a unimeric, injectable hemostatic agent, that physically cross-links fibrin to strengthen clots. In this work, we sought to improve the water-solubility and synthesis yield of PolySTAT to increase the likelihood of clinical translation, reduce cost, and facilitate future mass production. First, we focused on side-chain engineering of the carrier polymer backbone to improve water-solubility. We found that substitution of the 2-hydroxyethyl methacrylate (HEMA) monomer with glycerol monomethacrylate (GmMA) significantly improved the water-solubility of PolySTAT without compromising efficacy. Both materials increased clot firmness and decreased lysis as measured by rotational thromboelastometry (ROTEM). Additionally, we confirmed the in vivo activity of GmMA-based PolySTAT by improving rat survival in a femoral artery bleed model. Second, to reduce waste, we evaluated PolySTAT synthesis via direct polymerization of peptide monomers. Methacrylamide and methacrylate peptide-monomers were synthesized and polymerized via reversible addition-fragmentation chain transfer (RAFT) polymerization. This approach markedly improved the yield of PolySTAT synthesis while maintaining its biological activity in ROTEM. This work demonstrates the flexibility of PolySTAT to a variety of comonomers and synthetic routes and establishes direct RAFT polymerization of peptide monomers as a potential route of mass production.",
        "DOI": "10.1021/acsbiomaterials.0c01189",
        "paper_author": "Lamm R.J.",
        "affiliation_name": "Department of Bioengineering",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60156836"
    },
    {
        "paper_title": "Design and Development of a Biologically Inspired Robotic Cat for Research and Education",
        "publication": "30th International Conference on Computer Theory and Applications, ICCTA 2020 - Proceedings",
        "citied_by": "5",
        "cover_date": "2020-12-12",
        "Abstract": "Biologically Inspired Robots are one of the most emerging technologies in robotics field where engineering knowledge can be used in biological systems to generate new hypothesis of different research. In this paper, we present a biologically inspired robotic cat for both experts and non-experts to use as a learning platform as well as to keep as a pet. Our main goal is to introduce a robotic companion that is very cost effective, easy to assemble using off the shelf components and also can be used to learn advanced robotics. In the same time, our robot can be a helping hand to the elderly people with dementia to reduce their anxiety and depression. This robot can be operated autonomously along with android Bluetooth application to make it more user friendly. After performing several experiments and testing, the main prototype robot has been built to emulate the gestures of a cat.",
        "DOI": "10.1109/ICCTA52020.2020.9477678",
        "paper_author": "Abrar M.M.",
        "affiliation_name": "Ahsanullah University of Science and Technology",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60086002"
    },
    {
        "paper_title": "An Innovative, Practical-based and Commercial-based Approach: Techno-Commerce Entrepreneurship Shaping the Outcome-based Learning",
        "publication": "Proceeding - 2020 IEEE 8th Conference on Systems, Process and Control, ICSPC 2020",
        "citied_by": "2",
        "cover_date": "2020-12-11",
        "Abstract": "The revolution of Industrial Revolution 4.0 (IR4.0) shows massive advances in all disciplines, economies, industries and business transformation. New technologies advancement and changing demands are fusing the physical, digital, biological paradigms and engineering world; impacting, altering and changing numerous disciplines especially in the perception of the norm, culture as well as the way human and community lives, work and. The same should apply to the education industry. IR 4.0 has given new impetus to education transformation; we are expecting innovative changes in education. We foresee programme curriculum disciplined by digital physical frames, artificial intelligence; more profound changes in major aspects of content, delivery/pedagogy and structure of education is expected. However, there exist a 'dive-in' knowledge gap between 'technopreneurship' 'entrepreneurship' and 'digital commerce'. These three areas are somehow being delivered separately in most university programmes; is this 'change' meeting the industry changing demand? Malaysia's digital commerce education is critically far from meeting industry's expectation. This study initiates a successful paradigm shift of delivering techno-commerce entrepreneurship project to the undergraduate students emphasizing a broad range of practical skill-sets, knowledge, exposure and life-long learning in digital entrepreneurship revolution and transformation. The paradigm shift addresses the challenges and obstacles faced by most HLEs as well as giving a general broad overview transforming theory-based courses to a practical-based and thereafter commercialise the project in marketplaces with adoption of technological advances in digital business transformation.",
        "DOI": "10.1109/ICSPC50992.2020.9305778",
        "paper_author": "Wong W.Y.",
        "affiliation_name": "Universiti Tunku Abdul Rahman",
        "affiliation_city": "Kajang",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60090708"
    },
    {
        "paper_title": "Microfluidic Organ Chip for in Vitro Model of Blood Glucose Monitoring and Regulation",
        "publication": "E3S Web of Conferences",
        "citied_by": "2",
        "cover_date": "2020-12-11",
        "Abstract": "This study is based on our iGEM (international genetically engineered machine) 2019 competition project in which an in vitro model was establis ad to simulate the human monitoring and regulation of blood glucose level using the \"liver-on-a-chip\"and a genetically engineered bacterium capable of producing proinsulin efficiently. The microfluidic device is able to accommodate cellular chassis loaded with biological parts for diabetic treatment. In addition, electroc amical biosensors were designed to detect the differential glucose concentration from the both chambers of the organ chip. The model can test different c amicals and organs, w an the components in the channels and cells are altered. We have thus accomplis ad an in vitro model of how the proinsulin generated by engineered bacteria works on liver cells. In the near future, our research paradigm will be shifted to bacterial implantation in the human intestines to replace pancreas for the automatic secretion of insulin for diabetic patients.",
        "DOI": "10.1051/e3sconf/202021804029",
        "paper_author": "Wu Y.",
        "affiliation_name": "Hainan University",
        "affiliation_city": "Haikou",
        "affiliation_country": "China",
        "affiliation_id": "60017716"
    },
    {
        "paper_title": "Nitroxide-Mediated Polymerization: A Versatile Tool for the Engineering of Next Generation Materials",
        "publication": "ACS Applied Polymer Materials",
        "citied_by": "80",
        "cover_date": "2020-12-11",
        "Abstract": "Nitroxide-mediated polymerization (NMP) is a reversible-deactivation radical polymerization technique (RDRP) that facilitates the synthesis of well-defined and complex macromolecular architectures, with low polymer dispersity and high chain end homogeneity. NMP is an industrially robust technique that is inherently simple, often only requiring a single unimolecular initiator with a monomer to perform the polymerization, followed by a simple precipitation/filtration to workup the final product. Unlike other RDRP techniques, NMP provides clean well-defined polymers, without the need for transition metal complexes, which is favorable for some sensitive biological and electronic applications. This Review focuses on the use of these engineered polymers, synthesized by NMP, in emerging applications, such as next-generation lithium batteries, organic electronics, drug delivery systems, biosourced materials, photolithography, and photopolymerization. Emphasis is placed on publications since 2015.",
        "DOI": "10.1021/acsapm.0c00888",
        "paper_author": "Lamontagne H.R.",
        "affiliation_name": "University of Ottawa",
        "affiliation_city": "Ottawa",
        "affiliation_country": "Canada",
        "affiliation_id": "60028897"
    }
]