[
    {
        "paper_title": "Towards 6G wireless communication networks: vision, enabling technologies, and new paradigm shifts",
        "publication": "Science China Information Sciences",
        "citied_by": "1477",
        "cover_date": "2021-01-01",
        "Abstract": "The fifth generation (5G) wireless communication networks are being deployed worldwide from 2020 and more capabilities are in the process of being standardized, such as mass connectivity, ultra-reliability, and guaranteed low latency. However, 5G will not meet all requirements of the future in 2030 and beyond, and sixth generation (6G) wireless communication networks are expected to provide global coverage, enhanced spectral/energy/cost efficiency, better intelligence level and security, etc. To meet these requirements, 6G networks will rely on new enabling technologies, i.e., air interface and transmission technologies and novel network architecture, such as waveform design, multiple access, channel coding schemes, multi-antenna technologies, network slicing, cell-free architecture, and cloud/fog/edge computing. Our vision on 6G is that it will have four new paradigm shifts. First, to satisfy the requirement of global coverage, 6G will not be limited to terrestrial communication networks, which will need to be complemented with non-terrestrial networks such as satellite and unmanned aerial vehicle (UAV) communication networks, thus achieving a space-air-ground-sea integrated communication network. Second, all spectra will be fully explored to further increase data rates and connection density, including the sub-6 GHz, millimeter wave (mmWave), terahertz (THz), and optical frequency bands. Third, facing the big datasets generated by the use of extremely heterogeneous networks, diverse communication scenarios, large numbers of antennas, wide bandwidths, and new service requirements, 6G networks will enable a new range of smart applications with the aid of artificial intelligence (AI) and big data technologies. Fourth, network security will have to be strengthened when developing 6G networks. This article provides a comprehensive survey of recent advances and future trends in these four aspects. Clearly, 6G with additional technical requirements beyond those of 5G will enable faster and further communications to the extent that the boundary between physical and cyber worlds disappears.",
        "DOI": "10.1007/s11432-020-2955-6",
        "paper_author": "You X.",
        "affiliation_name": "Southeast University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60005244",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "The Genome Sequence Archive Family: Toward Explosive Data Growth and Diverse Data Types",
        "publication": "Genomics, Proteomics and Bioinformatics",
        "citied_by": "890",
        "cover_date": "2021-08-01",
        "Abstract": "The Genome Sequence Archive (GSA) is a data repository for archiving raw sequence data, which provides data storage and sharing services for worldwide scientific communities. Considering explosive data growth with diverse data types, here we present the GSA family by expanding into a set of resources for raw data archive with different purposes, namely, GSA (https://ngdc.cncb.ac.cn/gsa/), GSA for Human (GSA-Human, https://ngdc.cncb.ac.cn/gsa-human/), and Open Archive for Miscellaneous Data (OMIX, https://ngdc.cncb.ac.cn/omix/). Compared with the 2017 version, GSA has been significantly updated in data model, online functionalities, and web interfaces. GSA-Human, as a new partner of GSA, is a data repository specialized in human genetics-related data with controlled access and security. OMIX, as a critical complement to the two resources mentioned above, is an open archive for miscellaneous data. Together, all these resources form a family of resources dedicated to archiving explosive data with diverse types, accepting data submissions from all over the world, and providing free open access to all publicly available data in support of worldwide research activities.",
        "DOI": "10.1016/j.gpb.2021.08.001",
        "paper_author": "Chen T.",
        "affiliation_name": "Beijing Institute of Genomics Chinese Academy of Sciences (China National Center for Bioinformation)",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60278195",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A survey on security and privacy of federated learning",
        "publication": "Future Generation Computer Systems",
        "citied_by": "878",
        "cover_date": "2021-02-01",
        "Abstract": "Federated learning (FL) is a new breed of Artificial Intelligence (AI) that builds upon decentralized data and training that brings learning to the edge or directly on-device. FL is a new research area often referred to as a new dawn in AI, is in its infancy, and has not yet gained much trust in the community, mainly because of its (unknown) security and privacy implications. To advance the state of the research in this area and to realize extensive utilization of the FL approach and its mass adoption, its security and privacy concerns must be first identified, evaluated, and documented. FL is preferred in use-cases where security and privacy are the key concerns and having a clear view and understanding of risk factors enable an implementer/adopter of FL to successfully build a secure environment and gives researchers a clear vision on possible research areas. This paper aims to provide a comprehensive study concerning FL's security and privacy aspects that can help bridge the gap between the current state of federated AI and a future in which mass adoption is possible. We present an illustrative description of approaches and various implementation styles with an examination of the current challenges in FL and establish a detailed review of security and privacy concerns that need to be considered in a thorough and clear context. Findings from our study suggest that overall there are fewer privacy-specific threats associated with FL compared to security threats. The most specific security threats currently are communication bottlenecks, poisoning, and backdoor attacks while inference-based attacks are the most critical to the privacy of FL. We conclude the paper with much needed future research directions to make FL adaptable in realistic scenarios.",
        "DOI": "10.1016/j.future.2020.10.007",
        "paper_author": "Mothukuri V.",
        "affiliation_name": "Kennesaw State University",
        "affiliation_city": "Kennesaw",
        "affiliation_country": "United States",
        "affiliation_id": "60019740",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "Federated Learning for Internet of Things: A Comprehensive Survey",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "794",
        "cover_date": "2021-07-01",
        "Abstract": "The Internet of Things (IoT) is penetrating many facets of our daily life with the proliferation of intelligent services and applications empowered by artificial intelligence (AI). Traditionally, AI techniques require centralized data collection and processing that may not be feasible in realistic application scenarios due to the high scalability of modern IoT networks and growing data privacy concerns. Federated Learning (FL) has emerged as a distributed collaborative AI approach that can enable many intelligent IoT applications, by allowing for AI training at distributed IoT devices without the need for data sharing. In this article, we provide a comprehensive survey of the emerging applications of FL in IoT networks, beginning from an introduction to the recent advances in FL and IoT to a discussion of their integration. Particularly, we explore and analyze the potential of FL for enabling a wide range of IoT services, including IoT data sharing, data offloading and caching, attack detection, localization, mobile crowdsensing, and IoT privacy and security. We then provide an extensive survey of the use of FL in various key IoT applications such as smart healthcare, smart transportation, Unmanned Aerial Vehicles (UAVs), smart cities, and smart industry. The important lessons learned from this review of the FL-IoT services and applications are also highlighted. We complete this survey by highlighting the current challenges and possible directions for future research in this booming area.",
        "DOI": "10.1109/COMST.2021.3075439",
        "paper_author": "Nguyen D.C.",
        "affiliation_name": "Faculty of Science, Engineering and Built Environment",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60088596",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Global land use changes are four times greater than previously estimated",
        "publication": "Nature Communications",
        "citied_by": "763",
        "cover_date": "2021-12-01",
        "Abstract": "Quantifying the dynamics of land use change is critical in tackling global societal challenges such as food security, climate change, and biodiversity loss. Here we analyse the dynamics of global land use change at an unprecedented spatial resolution by combining multiple open data streams (remote sensing, reconstructions and statistics) to create the HIstoric Land Dynamics Assessment + (HILDA +). We estimate that land use change has affected almost a third (32%) of the global land area in just six decades (1960-2019) and, thus, is around four times greater in extent than previously estimated from long-term land change assessments. We also identify geographically diverging land use change processes, with afforestation and cropland abandonment in the Global North and deforestation and agricultural expansion in the South. Here, we show that observed phases of accelerating (~1960–2005) and decelerating (2006–2019) land use change can be explained by the effects of global trade on agricultural production.",
        "DOI": "10.1038/s41467-021-22702-2",
        "paper_author": "Winkler K.",
        "affiliation_name": "Wageningen University &amp; Research",
        "affiliation_city": "Wageningen",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60004156",
        "affiliation_state": "Gelderland"
    },
    {
        "paper_title": "Network intrusion detection system: A systematic study of machine learning and deep learning approaches",
        "publication": "Transactions on Emerging Telecommunications Technologies",
        "citied_by": "724",
        "cover_date": "2021-01-01",
        "Abstract": "The rapid advances in the internet and communication fields have resulted in a huge increase in the network size and the corresponding data. As a result, many novel attacks are being generated and have posed challenges for network security to accurately detect intrusions. Furthermore, the presence of the intruders with the aim to launch various attacks within the network cannot be ignored. An intrusion detection system (IDS) is one such tool that prevents the network from possible intrusions by inspecting the network traffic, to ensure its confidentiality, integrity, and availability. Despite enormous efforts by the researchers, IDS still faces challenges in improving detection accuracy while reducing false alarm rates and in detecting novel intrusions. Recently, machine learning (ML) and deep learning (DL)-based IDS systems are being deployed as potential solutions to detect intrusions across the network in an efficient manner. This article first clarifies the concept of IDS and then provides the taxonomy based on the notable ML and DL techniques adopted in designing network-based IDS (NIDS) systems. A comprehensive review of the recent NIDS-based articles is provided by discussing the strengths and limitations of the proposed solutions. Then, recent trends and advancements of ML and DL-based NIDS are provided in terms of the proposed methodology, evaluation metrics, and dataset selection. Using the shortcomings of the proposed methods, we highlighted various research challenges and provided the future scope for the research in improving ML and DL-based NIDS.",
        "DOI": "10.1002/ett.4150",
        "paper_author": "Ahmad Z.",
        "affiliation_name": "Universiti Malaysia Sarawak",
        "affiliation_city": "Kota Samarahan",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60024451",
        "affiliation_state": "Sarawak"
    },
    {
        "paper_title": "Artificial intelligence in sustainable energy industry: Status Quo, challenges and opportunities",
        "publication": "Journal of Cleaner Production",
        "citied_by": "602",
        "cover_date": "2021-03-20",
        "Abstract": "The energy industry is at a crossroads. Digital technological developments have the potential to change our energy supply, trade, and consumption dramatically. The new digitalization model is powered by the artificial intelligence (AI) technology. The integration of energy supply, demand, and renewable sources into the power grid will be controlled autonomously by smart software that optimizes decision-making and operations. AI will play an integral role in achieving this goal. This study focuses on the use of AI techniques in the energy sector. This study aims to present a realistic baseline that allows researchers and readers to compare their AI efforts, ambitions, new state-of-the-art applications, challenges, and global roles in policymaking. We covered three major aspects, including: i) the use of AI in solar and hydrogen power generation; (ii) the use of AI in supply and demand management control; and (iii) recent advances in AI technology. This study explored how AI techniques outperform traditional models in controllability, big data handling, cyberattack prevention, smart grid, IoT, robotics, energy efficiency optimization, predictive maintenance control, and computational efficiency. Big data, the development of a machine learning model, and AI will play an important role in the future energy market. Our study's findings show that AI is becoming a key enabler of a complex, new and data-related energy industry, providing a key magic tool to increase operational performance and efficiency in an increasingly cut-throat environment. As a result, the energy industry, utilities, power system operators, and independent power producers may need to focus more on AI technologies if they want meaningful results to remain competitive. New competitors, new business strategies, and a more active approach to customers would require informed and flexible regulatory engagement with the associated complexities of customer safety, privacy, and information security. Given the pace of development in information technology, AI and data analysis, regulatory approvals for new services and products in the new Era of digital energy markets can be enforced as quickly and efficiently as possible.",
        "DOI": "10.1016/j.jclepro.2021.125834",
        "paper_author": "Ahmad T.",
        "affiliation_name": "State Key Laboratory of Internet of Things for Smart City",
        "affiliation_city": "Taipa",
        "affiliation_country": "Macao",
        "affiliation_id": "60202520",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Overfishing drives over one-third of all sharks and rays toward a global extinction crisis",
        "publication": "Current Biology",
        "citied_by": "591",
        "cover_date": "2021-11-08",
        "Abstract": "The scale and drivers of marine biodiversity loss are being revealed by the International Union for Conservation of Nature (IUCN) Red List assessment process. We present the first global reassessment of 1,199 species in Class Chondrichthyes—sharks, rays, and chimeras. The first global assessment (in 2014) concluded that one-quarter (24%) of species were threatened. Now, 391 (32.6%) species are threatened with extinction. When this percentage of threat is applied to Data Deficient species, more than one-third (37.5%) of chondrichthyans are estimated to be threatened, with much of this change resulting from new information. Three species are Critically Endangered (Possibly Extinct), representing possibly the first global marine fish extinctions due to overfishing. Consequently, the chondrichthyan extinction rate is potentially 25 extinctions per million species years, comparable to that of terrestrial vertebrates. Overfishing is the universal threat affecting all 391 threatened species and is the sole threat for 67.3% of species and interacts with three other threats for the remaining third: loss and degradation of habitat (31.2% of threatened species), climate change (10.2%), and pollution (6.9%). Species are disproportionately threatened in tropical and subtropical coastal waters. Science-based limits on fishing, effective marine protected areas, and approaches that reduce or eliminate fishing mortality are urgently needed to minimize mortality of threatened species and ensure sustainable catch and trade of others. Immediate action is essential to prevent further extinctions and protect the potential for food security and ecosystem functions provided by this iconic lineage of predators.",
        "DOI": "10.1016/j.cub.2021.08.062",
        "paper_author": "Dulvy N.K.",
        "affiliation_name": "Simon Fraser University",
        "affiliation_city": "Burnaby",
        "affiliation_country": "Canada",
        "affiliation_id": "60018491",
        "affiliation_state": "BC"
    },
    {
        "paper_title": "Lightweight, Flexible Cellulose-Derived Carbon Aerogel@Reduced Graphene Oxide/PDMS Composites with Outstanding EMI Shielding Performances and Excellent Thermal Conductivities",
        "publication": "Nano-Micro Letters",
        "citied_by": "560",
        "cover_date": "2021-12-01",
        "Abstract": "In order to ensure the operational reliability and information security of sophisticated electronic components and to protect human health, efficient electromagnetic interference (EMI) shielding materials are required to attenuate electromagnetic wave energy. In this work, the cellulose solution is obtained by dissolving cotton through hydrogen bond driving self-assembly using sodium hydroxide (NaOH)/urea solution, and cellulose aerogels (CA) are prepared by gelation and freeze-drying. Then, the cellulose carbon aerogel@reduced graphene oxide aerogels (CCA@rGO) are prepared by vacuum impregnation, freeze-drying followed by thermal annealing, and finally, the CCA@rGO/polydimethylsiloxane (PDMS) EMI shielding composites are prepared by backfilling with PDMS. Owing to skin-core structure of CCA@rGO, the complete three-dimensional (3D) double-layer conductive network can be successfully constructed. When the loading of CCA@rGO is 3.05 wt%, CCA@rGO/PDMS EMI shielding composites have an excellent EMI shielding effectiveness (EMI SE) of 51 dB, which is 3.9 times higher than that of the co-blended CCA/rGO/PDMS EMI shielding composites (13 dB) with the same loading of fillers. At this time, the CCA@rGO/PDMS EMI shielding composites have excellent thermal stability (THRI of 178.3 °C) and good thermal conductivity coefficient (λ of 0.65 W m-1 K-1). Excellent comprehensive performance makes CCA@rGO/PDMS EMI shielding composites great prospect for applications in lightweight, flexible EMI shielding composites. Graphic abstract: [Figure not available: see fulltext.]",
        "DOI": "10.1007/s40820-021-00624-4",
        "paper_author": "Song P.",
        "affiliation_name": "Northwestern Polytechnical University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60003977",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Federated learning for internet of things: Recent advances, taxonomy, and open challenges",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "525",
        "cover_date": "2021-07-01",
        "Abstract": "The Internet of Things (IoT) will be ripe for the deployment of novel machine learning algorithm for both network and application management. However, given the presence of massively distributed and private datasets, it is challenging to use classical centralized learning algorithms in the IoT. To overcome this challenge, federated learning can be a promising solution that enables on-device machine learning without the need to migrate the private end-user data to a central cloud. In federated learning, only learning model updates are transferred between end-devices and the aggregation server. Although federated learning can offer better privacy preservation than centralized machine learning, it has still privacy concerns. In this paper, first, we present the recent advances of federated learning towards enabling federated learning-powered IoT applications. A set of metrics such as sparsification, robustness, quantization, scalability, security, and privacy, is delineated in order to rigorously evaluate the recent advances. Second, we devise a taxonomy for federated learning over IoT networks. Finally, we present several open research challenges with their possible solutions.",
        "DOI": "10.1109/COMST.2021.3090430",
        "paper_author": "Khan L.U.",
        "affiliation_name": "Kyung Hee University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60001873",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A survey on federated learning: The journey from centralized to distributed on-site learning and beyond",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "512",
        "cover_date": "2021-04-01",
        "Abstract": "Driven by privacy concerns and the visions of deep learning, the last four years have witnessed a paradigm shift in the applicability mechanism of machine learning (ML). An emerging model, called federated learning (FL), is rising above both centralized systems and on-site analysis, to be a new fashioned design for ML implementation. It is a privacy-preserving decentralized approach, which keeps raw data on devices and involves local ML training while eliminating data communication overhead. A federation of the learned and shared models is then performed on a central server to aggregate and share the built knowledge among participants. This article starts by examining and comparing different ML-based deployment architectures, followed by in-depth and in-breadth investigation on FL. Compared to the existing reviews in the field, we provide in this survey a new classification of FL topics and research fields based on thorough analysis of the main technical challenges and current related work. In this context, we elaborate comprehensive taxonomies covering various challenging aspects, contributions, and trends in the literature, including core system models and designs, application areas, privacy and security, and resource management. Furthermore, we discuss important challenges and open research directions toward more robust FL systems.",
        "DOI": "10.1109/JIOT.2020.3030072",
        "paper_author": "Abdulrahman S.",
        "affiliation_name": "École de Technologie Supérieure",
        "affiliation_city": "Montreal",
        "affiliation_country": "Canada",
        "affiliation_id": "60026786",
        "affiliation_state": "QC"
    },
    {
        "paper_title": "Empowering Things with Intelligence: A Survey of the Progress, Challenges, and Opportunities in Artificial Intelligence of Things",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "484",
        "cover_date": "2021-05-15",
        "Abstract": "In the Internet-of-Things (IoT) era, billions of sensors and devices collect and process data from the environment, transmit them to cloud centers, and receive feedback via the Internet for connectivity and perception. However, transmitting massive amounts of heterogeneous data, perceiving complex environments from these data, and then making smart decisions in a timely manner are difficult. Artificial intelligence (AI), especially deep learning, is now a proven success in various areas, including computer vision, speech recognition, and natural language processing. AI introduced into the IoT heralds the era of AI of things (AIoT). This article presents a comprehensive survey on AIoT to show how AI can empower the IoT to make it faster, smarter, greener, and safer. Specifically, we briefly present the AIoT architecture in the context of cloud computing, fog computing, and edge computing. Then, we present progress in AI research for IoT from four perspectives: 1) perceiving; 2) learning; 3) reasoning; and 4) behaving. Next, we summarize some promising applications of AIoT that are likely to profoundly reshape our world. Finally, we highlight the challenges facing AIoT and some potential research opportunities.",
        "DOI": "10.1109/JIOT.2020.3039359",
        "paper_author": "Zhang J.",
        "affiliation_name": "School of Computer Science",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60099659",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "A Survey on Mobile Augmented Reality with 5G Mobile Edge Computing: Architectures, Applications, and Technical Aspects",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "471",
        "cover_date": "2021-04-01",
        "Abstract": "The Augmented Reality (AR) technology enhances the human perception of the world by combining the real environment with the virtual space. With the explosive growth of powerful, less expensive mobile devices, and the emergence of sophisticated communication infrastructure, Mobile Augmented Reality (MAR) applications are gaining increased popularity. MAR allows users to run AR applications on mobile devices with greater mobility and at a lower cost. The emerging 5G communication technologies act as critical enablers for future MAR applications to achieve ultra-low latency and extremely high data rates while Multi-access Edge Computing (MEC) brings enhanced computational power closer to the users to complement MAR. This paper extensively discusses the landscape of MAR through the past and its future prospects with respect to the 5G systems and complementary technology MEC. The paper especially provides an informative analysis of the network formation of current and future MAR systems in terms of cloud, edge, localized, and hybrid architectural options. The paper discusses key application areas for MAR and their future with the advent of 5G technologies. The paper also discusses the requirements and limitations of MAR technical aspects such as communication, mobility management, energy management, service offloading and migration, security, and privacy and analyzes the role of 5G technologies.",
        "DOI": "10.1109/COMST.2021.3061981",
        "paper_author": "Siriwardhana Y.",
        "affiliation_name": "Centre for Wireless Communications",
        "affiliation_city": "Oulu",
        "affiliation_country": "Finland",
        "affiliation_id": "60001738",
        "affiliation_state": "North Ostrobothnia"
    },
    {
        "paper_title": "Secure State Estimation and Control of Cyber-Physical Systems: A Survey",
        "publication": "IEEE Transactions on Systems, Man, and Cybernetics: Systems",
        "citied_by": "438",
        "cover_date": "2021-01-01",
        "Abstract": "Cyber-physical systems (CPSs) empower the integration of physical processes and cyber infrastructure with the aid of ubiquitous computation resources and communication capabilities. CPSs have permeated modern society and found extensive applications in a wide variety of areas, including energy, transportation, advanced manufacturing, and medical health. The security of CPSs against cyberattacks has been regarded as a long-standing concern. However, CPSs suffer from extendable vulnerabilities that are beyond classical networked systems due to the tight integration of cyber and physical components. Sophisticated and malicious cyberattacks continue to emerge to adversely impact CPS operation, resulting in performance degradation, service interruption, and system failure. Secure state estimation and control technologies play a vital role in warranting reliable monitoring and operation of safety-critical CPSs. This article provides a review of the state-of-the-art results for secure state estimation and control of CPSs. Specifically, the latest development of secure state estimation is summarized in light of different performance indicators and defense strategies. Then, the recent results on secure control are discussed and classified into three categories: 1) centralized secure control; 2) distributed secure control; and 3) resource-aware secure control. Furthermore, two specific application examples of water supply distribution systems and wide-area power systems are presented to demonstrate the applicability of secure state estimation and control approaches. Finally, several challenging issues are discussed to direct future research.",
        "DOI": "10.1109/TSMC.2020.3041121",
        "paper_author": "Ding D.",
        "affiliation_name": "Swinburne University of Technology",
        "affiliation_city": "Hawthorn",
        "affiliation_country": "Australia",
        "affiliation_id": "60030804",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "A review on machine learning in 3D printing: applications, potential, and challenges",
        "publication": "Artificial Intelligence Review",
        "citied_by": "438",
        "cover_date": "2021-01-01",
        "Abstract": "Additive manufacturing (AM) or 3D printing is growing rapidly in the manufacturing industry and has gained a lot of attention from various fields owing to its ability to fabricate parts with complex features. The reliability of the 3D printed parts has been the focus of the researchers to realize AM as an end-part production tool. Machine learning (ML) has been applied in various aspects of AM to improve the whole design and manufacturing workflow especially in the era of industry 4.0. In this review article, various types of ML techniques are first introduced. It is then followed by the discussion on their use in various aspects of AM such as design for 3D printing, material tuning, process optimization, in situ monitoring, cloud service, and cybersecurity. Potential applications in the biomedical, tissue engineering and building and construction will be highlighted. The challenges faced by ML in AM such as computational cost, standards for qualification and data acquisition techniques will also be discussed. In the authors’ perspective, in situ monitoring of AM processes will significantly benefit from the object detection ability of ML. As a large data set is crucial for ML, data sharing of AM would enable faster adoption of ML in AM. Standards for the shared data are needed to facilitate easy sharing of data. The use of ML in AM will become more mature and widely adopted as better data acquisition techniques and more powerful computer chips for ML are developed.",
        "DOI": "10.1007/s10462-020-09876-9",
        "paper_author": "Goh G.D.",
        "affiliation_name": "Singapore Centre for 3D Printing",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60119025",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Federated Learning Meets Blockchain in Edge Computing: Opportunities and Challenges",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "416",
        "cover_date": "2021-08-15",
        "Abstract": "Mobile-edge computing (MEC) has been envisioned as a promising paradigm to handle the massive volume of data generated from ubiquitous mobile devices for enabling intelligent services with the help of artificial intelligence (AI). Traditionally, AI techniques often require centralized data collection and training in a single entity, e.g., an MEC server, which is now becoming a weak point due to data privacy concerns and high overhead of raw data communications. In this context, federated learning (FL) has been proposed to provide collaborative data training solutions, by coordinating multiple mobile devices to train a shared AI model without directly exposing their underlying data, which enjoys considerable privacy enhancement. To improve the security and scalability of FL implementation, blockchain as a ledger technology is attractive for realizing decentralized FL training without the need for any central server. Particularly, the integration of FL and blockchain leads to a new paradigm, called FLchain, which potentially transforms intelligent MEC networks into decentralized, secure, and privacy-enhancing systems. This article presents an overview of the fundamental concepts and explores the opportunities of FLchain in MEC networks. We identify several main issues in FLchain design, including communication cost, resource allocation, incentive mechanism, security and privacy protection. The key solutions and the lessons learned along with the outlooks are also discussed. Then, we investigate the applications of FLchain in popular MEC domains, such as edge data sharing, edge content caching and edge crowdsensing. Finally, important research challenges and future directions are also highlighted.",
        "DOI": "10.1109/JIOT.2021.3072611",
        "paper_author": "Nguyen D.C.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "A Blockchain-Based Decentralized Federated Learning Framework with Committee Consensus",
        "publication": "IEEE Network",
        "citied_by": "416",
        "cover_date": "2021-03-01",
        "Abstract": "Federated learning has been widely studied and applied to various scenarios, such as financial credit, medical identification, and so on. Under these settings, federated learning protects users from exposing their private data, while cooperatively training a shared machine learning algorithm model (i.e., the global model) for a variety of realworld applications. The only data exchanged is the gradient of the model or the updated model (i.e., the local model update). However, the security of federated learning is increasingly being questioned, due to the malicious clients or central servers' constant attack on the global model or user privacy data. To address these security issues, we propose a decentralized federated learning framework based on blockchain, that is, a Block-chain-based Federated Learning framework with Committee consensus (BFLC). Without a centralized server, the framework uses blockchain for the global model storage and the local model update exchange. To enable the proposed BFLC, we also devise an innovative committee consensus mechanism, which can effectively reduce the amount of consensus computing and reduce malicious attacks. We then discuss the scalability of BFLC, including theoretical security, storage optimization, and incentives. Finally, based on a FISCO blockchain system, we perform experiments using an AlexNet model on several frameworks with a real-world dataset FEMNIST. The experimental results demonstrate the effectiveness and security of the BFLC framework.",
        "DOI": "10.1109/MNET.011.2000263",
        "paper_author": "Li Y.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "The persistent threat of emerging plant disease pandemics to global food security",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "415",
        "cover_date": "2021-06-08",
        "Abstract": "Plant disease outbreaks are increasing and threaten food security for the vulnerable in many areas of the world. Now a global human pandemic is threatening the health of millions on our planet. A stable, nutritious food supply will be needed to lift people out of poverty and improve health outcomes. Plant diseases, both endemic and recently emerging, are spreading and exacerbated by climate change, transmission with global food trade networks, pathogen spillover, and evolution of new pathogen lineages. In order to tackle these grand challenges, a new set of tools that include disease surveillance and improved detection technologies including pathogen sensors and predictive modeling and data analytics are needed to prevent future outbreaks. Herein, we describe an integrated research agenda that could help mitigate future plant disease pandemics.",
        "DOI": "10.1073/pnas.2022239118",
        "paper_author": "Ristaino J.B.",
        "affiliation_name": "NC State University",
        "affiliation_city": "Raleigh",
        "affiliation_country": "United States",
        "affiliation_id": "60004923",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "CorrAUC: A Malicious Bot-IoT Traffic Detection Method in IoT Network Using Machine-Learning Techniques",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "403",
        "cover_date": "2021-03-01",
        "Abstract": "Identification of anomaly and malicious traffic in the Internet-of-Things (IoT) network is essential for the IoT security to keep eyes and block unwanted traffic flows in the IoT network. For this purpose, numerous machine-learning (ML) technique models are presented by many researchers to block malicious traffic flows in the IoT network. However, due to the inappropriate feature selection, several ML models prone misclassify mostly malicious traffic flows. Nevertheless, the significant problem still needs to be studied more in-depth that is how to select effective features for accurate malicious traffic detection in the IoT network. To address the problem, a new framework model is proposed. First, a novel feature selection metric approach named CorrAUC is proposed, and then based on CorrAUC, a new feature selection algorithm named CorrAUC is developed and designed, which is based on the wrapper technique to filter the features accurately and select effective features for the selected ML algorithm by using the area under the curve (AUC) metric. Then, we applied the integrated TOPSIS and Shannon entropy based on a bijective soft set to validate selected features for malicious traffic identification in the IoT network. We evaluate our proposed approach by using the Bot-IoT data set and four different ML algorithms. The experimental results analysis showed that our proposed method is efficient and can achieve >96% results on average.",
        "DOI": "10.1109/JIOT.2020.3002255",
        "paper_author": "Shafiq M.",
        "affiliation_name": "Guangzhou University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60025345",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "COVID-19 implications on household income and food security in Kenya and Uganda: Findings from a rapid assessment",
        "publication": "World Development",
        "citied_by": "396",
        "cover_date": "2021-01-01",
        "Abstract": "This study assessed implications of the Coronavirus Disease 19 (COVID-19) pandemic on household income and food security in two East African countries – Kenya and Uganda, using online survey data from 442 respondents. Results show that more than two-thirds of the respondents experienced income shocks due to the COVID-19 crisis. Food security and dietary quality worsened, as measured by the food insecurity experience scale and the frequency of consumption of nutritionally-rich foods. The proportion of food insecure respondents increased by 38% and 44% in Kenya and Uganda respectively, and in both countries, the regular consumption of fruits decreased by about 30% during the COVID-19 pandemic, compared to a normal period (before the pandemic). Results from probit regressions show that the income-poor households and those dependent on labour income were more vulnerable to income shock, and had poorer food consumption during the COVID-19 pandemic compared to other respondent categories. As such, they were more likely to employ food-based coping strategies compared to those pursuing alternative livelihoods, who generally relied on savings. Farmers were less likely to experience worsened food security compared to other respondent categories who depended to a great extent on market sources for food. In both countries, participation in national social security schemes was less likely to mitigate respondents’ income shock during the COVID-19 period. Conversely, membership in savings and loan groups was correlated with less likelihood of suffering income shocks and reduction in food consumption. The results suggest that ongoing and future government responses should focus on structural changes in social security by developing responsive packages to cushion members pushed into poverty by such pandemics while building strong financial institutions to support the recovery of businesses in the medium term, and ensuring the resilience of food supply chains particularly those making available nutrient-dense foods.",
        "DOI": "10.1016/j.worlddev.2020.105199",
        "paper_author": "Kansiime M.K.",
        "affiliation_name": "CABI, Kenya",
        "affiliation_city": "Nairobi",
        "affiliation_country": "Kenya",
        "affiliation_id": "60070565",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "DeepFed: Federated Deep Learning for Intrusion Detection in Industrial Cyber-Physical Systems",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "392",
        "cover_date": "2021-08-01",
        "Abstract": "The rapid convergence of legacy industrial infrastructures with intelligent networking and computing technologies (e.g., 5G, software-defined networking, and artificial intelligence), have dramatically increased the attack surface of industrial cyber-physical systems (CPSs). However, withstanding cyber threats to such large-scale, complex, and heterogeneous industrial CPSs has been extremely challenging, due to the insufficiency of high-quality attack examples. In this article, we propose a novel federated deep learning scheme, named DeepFed, to detect cyber threats against industrial CPSs. Specifically, we first design a new deep learning-based intrusion detection model for industrial CPSs, by making use of a convolutional neural network and a gated recurrent unit. Second, we develop a federated learning framework, allowing multiple industrial CPSs to collectively build a comprehensive intrusion detection model in a privacy-preserving way. Further, a Paillier cryptosystem-based secure communication protocol is crafted to preserve the security and privacy of model parameters through the training process. Extensive experiments on a real industrial CPS dataset demonstrate the high effectiveness of the proposed DeepFed scheme in detecting various types of cyber threats to industrial CPSs and the superiorities over state-of-the-art schemes.",
        "DOI": "10.1109/TII.2020.3023430",
        "paper_author": "Li B.",
        "affiliation_name": "Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60016521",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Federated Machine Learning: Survey, Multi-Level Classification, Desirable Criteria and Future Directions in Communication and Networking Systems",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "392",
        "cover_date": "2021-04-01",
        "Abstract": "The communication and networking field is hungry for machine learning decision-making solutions to replace the traditional model-driven approaches that proved to be not rich enough for seizing the ever-growing complexity and heterogeneity of the modern systems in the field. Traditional machine learning solutions assume the existence of (cloud-based) central entities that are in charge of processing the data. Nonetheless, the difficulty of accessing private data, together with the high cost of transmitting raw data to the central entity gave rise to a decentralized machine learning approach called Federated Learning. The main idea of federated learning is to perform an on-device collaborative training of a single machine learning model without having to share the raw training data with any third-party entity. Although few survey articles on federated learning already exist in the literature, the motivation of this survey stems from three essential observations. The first one is the lack of a fine-grained multi-level classification of the federated learning literature, where the existing surveys base their classification on only one criterion or aspect. The second observation is that the existing surveys focus only on some common challenges, but disregard other essential aspects such as reliable client selection, resource management and training service pricing. The third observation is the lack of explicit and straightforward directives for researchers to help them design future federated learning solutions that overcome the state-of-the-art research gaps. To address these points, we first provide a comprehensive tutorial on federated learning and its associated concepts, technologies and learning approaches. We then survey and highlight the applications and future directions of federated learning in the domain of communication and networking. Thereafter, we design a three-level classification scheme that first categorizes the federated learning literature based on the high-level challenge that they tackle. Then, we classify each high-level challenge into a set of specific low-level challenges to foster a better understanding of the topic. Finally, we provide, within each low-level challenge, a fine-grained classification based on the technique used to address this particular challenge. For each category of high-level challenges, we provide a set of desirable criteria and future research directions that are aimed to help the research community design innovative and efficient future solutions. To the best of our knowledge, our survey is the most comprehensive in terms of challenges and techniques it covers and the most fine-grained in terms of the multi-level classification scheme it presents.",
        "DOI": "10.1109/COMST.2021.3058573",
        "paper_author": "Wahab O.A.",
        "affiliation_name": "Université du Québec en Outaouais",
        "affiliation_city": "Gatineau",
        "affiliation_country": "Canada",
        "affiliation_id": "60020288",
        "affiliation_state": "QC"
    },
    {
        "paper_title": "Synthetic data in machine learning for medicine and healthcare",
        "publication": "Nature Biomedical Engineering",
        "citied_by": "375",
        "cover_date": "2021-06-01",
        "Abstract": "NA",
        "DOI": "10.1038/s41551-021-00751-8",
        "paper_author": "Chen R.J.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Low-Latency Federated Learning and Blockchain for Edge Association in Digital Twin Empowered 6G Networks",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "366",
        "cover_date": "2021-07-01",
        "Abstract": "Emerging technologies, such as digital twins and 6th generation (6G) mobile networks, have accelerated the realization of edge intelligence in industrial Internet of Things (IIoT). The integration of digital twin and 6G bridges the physical system with digital space and enables robust instant wireless connectivity. With increasing concerns on data privacy, federated learning has been regarded as a promising solution for deploying distributed data processing and learning in wireless networks. However, unreliable communication channels, limited resources, and lack of trust among users hinder the effective application of federated learning in IIoT. In this article, we introduce the digital twin wireless networks (DTWN) by incorporating digital twins into wireless networks, to migrate real-time data processing and computation to the edge plane. Then, we propose a blockchain empowered federated learning framework running in the DTWN for collaborative computing, which improves the reliability and security of the system and enhances data privacy. Moreover, to balance the learning accuracy and time cost of the proposed scheme, we formulate an optimization problem for edge association by jointly considering digital twin association, training data batch size, and bandwidth allocation. We exploit multiagent reinforcement learning to find an optimal solution to the problem. Numerical results on real-world dataset show that the proposed scheme yields improved efficiency and reduced cost compared to benchmark learning methods.",
        "DOI": "10.1109/TII.2020.3017668",
        "paper_author": "Lu Y.",
        "affiliation_name": "Beijing University of Posts and Telecommunications",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016930",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Convergent communication, sensing and localization in 6g systems: An overview of technologies, opportunities and challenges",
        "publication": "IEEE Access",
        "citied_by": "360",
        "cover_date": "2021-01-01",
        "Abstract": "Herein, we focus on convergent 6G communication, localization and sensing systems by identifying key technology enablers, discussing their underlying challenges, implementation issues, and recommending potential solutions. Moreover, we discuss exciting new opportunities for integrated localization and sensing applications, which will disrupt traditional design principles and revolutionize the way we live, interact with our environment, and do business. Regarding potential enabling technologies, 6G will continue to develop towards even higher frequency ranges, wider bandwidths, and massive antenna arrays. In turn, this will enable sensing solutions with very fine range, Doppler, and angular resolutions, as well as localization to cm-level degree of accuracy. Besides, new materials, device types, and reconfigurable surfaces will allow network operators to reshape and control the electromagnetic response of the environment. At the same time, machine learning and artificial intelligence will leverage the unprecedented availability of data and computing resources to tackle the biggest and hardest problems in wireless communication systems. As a result, 6G will be truly intelligent wireless systems that will provide not only ubiquitous communication but also empower high accuracy localization and high-resolution sensing services. They will become the catalyst for this revolution by bringing about a unique new set of features and service capabilities, where localization and sensing will coexist with communication, continuously sharing the available resources in time, frequency, and space. This work concludes by highlighting foundational research challenges, as well as implications and opportunities related to privacy, security, and trust.",
        "DOI": "10.1109/ACCESS.2021.3053486",
        "paper_author": "De Lima C.",
        "affiliation_name": "Oulun Yliopisto",
        "affiliation_city": "Oulu",
        "affiliation_country": "Finland",
        "affiliation_id": "60012954",
        "affiliation_state": "North Ostrobothnia"
    },
    {
        "paper_title": "SecureBoost: A Lossless Federated Learning Framework",
        "publication": "IEEE Intelligent Systems",
        "citied_by": "355",
        "cover_date": "2021-01-01",
        "Abstract": "The protection of user privacy is an important concern in machine learning, as evidenced by the rolling out of the General Data Protection Regulation (GDPR) in the European Union (EU) in May 2018. The GDPR is designed to give users more control over their personal data, which motivates us to explore machine learning frameworks for data sharing that do not violate user privacy. To meet this goal, in this article, we propose a novel lossless privacy-preserving tree-boosting system known as SecureBoost in the setting of federated learning. SecureBoost first conducts entity alignment under a privacy-preserving protocol and then constructs boosting trees across multiple parties with a carefully designed encryption strategy. This federated learning system allows the learning process to be jointly conducted over multiple parties with common user samples but different feature sets, which corresponds to a vertically partitioned dataset. An advantage of SecureBoost is that it provides the same level of accuracy as the non -privacy-preserving approach while at the same time, reveals no information of each private data provider. We show that the SecureBoost framework is as accurate as other nonfederated gradient tree-boosting algorithms that require centralized data, and thus, it is highly scalable and practical for industrial applications such as credit risk analysis. To this end, we discuss information leakage during the protocol execution and propose ways to provably reduce it.",
        "DOI": "10.1109/MIS.2021.3082561",
        "paper_author": "Cheng K.",
        "affiliation_name": "University of California, Los Angeles",
        "affiliation_city": "Los Angeles",
        "affiliation_country": "United States",
        "affiliation_id": "60027550",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Fractal sorting matrix and its application on chaotic image encryption",
        "publication": "Information Sciences",
        "citied_by": "352",
        "cover_date": "2021-02-08",
        "Abstract": "This article creatively proposes a class of sorting matrices with fractal characteristics, named the fractal sorting matrix (FSM), and introduces its iterative calculation method. The FSM is irregular, self-similar and infinitely iterative. Notably, scrambling images or information based on this new cluster of matrices can effectively improve encryption algorithm security. Then, the article presents a new method of global pixel diffusion with two chaotic sequences, which offers good security and high encryption efficiency. Based on the FSM and global chaotic pixel diffusion, this paper constructs a more efficient and secure chaotic image encryption algorithm than other approaches. According to experimental comparison, the proposed algorithm is faster and has a higher pass rate associated with the local Shannon entropy. The data in the antidifferential attack test are closer to the theoretical values and smaller in data fluctuation, and the images obtained from the cropping and noise attacks are clearer. Therefore, the proposed algorithm shows better security and resistance to various attacks.",
        "DOI": "10.1016/j.ins.2020.09.055",
        "paper_author": "Xian Y.",
        "affiliation_name": "Dalian Maritime University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60029322",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "A comprehensive review study of cyber-attacks and cyber security; Emerging trends and recent developments",
        "publication": "Energy Reports",
        "citied_by": "345",
        "cover_date": "2021-11-01",
        "Abstract": "At present, most of the economic, commercial, cultural, social and governmental activities and interactions of countries, at all levels, including individuals, non-governmental organizations and government and governmental institutions, are carried out in cyberspace. Recently, many private companies and government organizations around the world are facing the problem of cyber-attacks and the danger of wireless communication technologies. Today's world is highly dependent on electronic technology, and protecting this data from cyber-attacks is a challenging issue. The purpose of cyber-attacks is to harm companies financially. In some other cases, cyber-attacks can have military or political purposes. Some of these damages are: PC viruses, knowledge breaks, data distribution service (DDS) and other assault vectors. To this end, various organizations use various solutions to prevent damage caused by cyber-attacks. Cyber security follows real-time information on the latest IT data. So far, various methods had been proposed by researchers around the world to prevent cyber-attacks or reduce the damage caused by them. Some of the methods are in the operational phase and others are in the study phase. The aim of this study is to survey and comprehensively review the standard advances presented in the field of cyber security and to investigate the challenges, weaknesses and strengths of the proposed methods. Different types of new descendant attacks are considered in details. Standard security frameworks are discussed with the history and early-generation cyber-security methods. In addition, emerging trends and recent developments of cyber security and security threats and challenges are presented. It is expected that the comprehensive review study presented for IT and cyber security researchers will be useful.",
        "DOI": "10.1016/j.egyr.2021.08.126",
        "paper_author": "Li Y.",
        "affiliation_name": "Zhengzhou Normal University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60102079",
        "affiliation_state": "Henan"
    },
    {
        "paper_title": "A new distributed architecture for evaluating AI-based security systems at the edge: Network TON_IoT datasets",
        "publication": "Sustainable Cities and Society",
        "citied_by": "343",
        "cover_date": "2021-09-01",
        "Abstract": "While there has been a significant interest in understanding the cyber threat landscape of Internet of Things (IoT) networks, and the design of Artificial Intelligence (AI)-based security approaches, there is a lack of distributed architecture led to generating heterogeneous datasets that contain the actual behaviors of real-world IoT networks and complex cyber threat scenarios to evaluate the credibility of the new systems. This paper presents a novel testbed architecture of IoT network which can be used to evaluate Artificial Intelligence (AI)-based security applications. The platform NSX vCloud NFV was employed to facilitate the execution of Software-Defined Network (SDN), Network Function Virtualization (NFV) and Service Orchestration (SO) to offer dynamic testbed networks, which allow the interaction of edge, fog and cloud tiers. While deploying the architecture, real-world normal and attack scenarios are executed to collect labeled datasets. The generated datasets are named ‘TON_IoT’, as they comprise heterogeneous data sources collected from telemetry datasets of IoT services, Windows and Linux-based datasets, and datasets of network traffic. The TON_IoT network dataset is validated using four machine learning-based intrusion detection algorithms of Gradient Boosting Machine, Random Forest, Naive Bayes, and Deep Neural Networks, revealing a high performance of detection accuracy using the set of training and testing. A comparative summary of the TON_IoT network dataset and other competing network datasets demonstrates its diverse legitimate and anomalous patterns that can be used to better validate new AI-based security solutions. The architecture and datasets can be publicly accessed from TON_IOT Datasets (2020).",
        "DOI": "10.1016/j.scs.2021.102994",
        "paper_author": "Moustafa N.",
        "affiliation_name": "University of New South Wales at Australian Defence Force Academy",
        "affiliation_city": "Canberra",
        "affiliation_country": "Australia",
        "affiliation_id": "60026708",
        "affiliation_state": "ACT"
    },
    {
        "paper_title": "Prediction of solar energy guided by pearson correlation using machine learning",
        "publication": "Energy",
        "citied_by": "337",
        "cover_date": "2021-06-01",
        "Abstract": "Solar energy forecasting represents a key element in increasing the competitiveness of solar power plants in the energy market and reducing the dependence on fossil fuels in economic and social development. This paper presents an approach for predicting solar energy, based on machine and deep learning techniques. The relevance of the studied models was evaluated for real-time and short-term solar energy forecasting to ensure optimized management and security requirements in this field while using an integral solution based on a single tool and an appropriate predictive model. The datasets we used in this study, represent data from 2016 to 2018 and are related to Errachidia which is a semi-desert climate province in Morocco. Pearson correlation coefficient was deployed to identify the most relevant meteorological inputs from which the models should learn. RF and ANN have provided high accuracies against LR and SVR, which have reported very significant errors. ANN has shown good performance for both real-time and short-term predictions. The key findings were compared with Pirapora in Brazil, which is a tropical climate region, to show the quality and reproducibility of the study.",
        "DOI": "10.1016/j.energy.2021.120109",
        "paper_author": "Jebli I.",
        "affiliation_name": "Ecole Mohammadia d'Ingenieurs, Mohammed V University in Rabat",
        "affiliation_city": "Rabat",
        "affiliation_country": "Morocco",
        "affiliation_id": "60011371",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A systematic review of IoT in healthcare: Applications, techniques, and trends",
        "publication": "Journal of Network and Computer Applications",
        "citied_by": "336",
        "cover_date": "2021-10-15",
        "Abstract": "Internet of Things (IoT) is an ever-expanding ecosystem that integrates software, hardware, physical objects, and computing devices to communicate, collect, and exchange data. The IoT provides a seamless platform to facilitate interactions between humans and a variety of physical and virtual things, including personalized healthcare domains. Lack of access to medical resources, growth of the elderly population with chronic diseases and their needs for remote monitoring, an increase in medical costs, and the desire for telemedicine in developing countries, make the IoT an interesting subject in healthcare systems. The IoT has a potential to decrease the strain on sanitary systems besides providing tailored health services to improve the quality of life. Therefore, this paper aims to identify, compare systematically, and classify existing investigations taxonomically in the Healthcare IoT (HIoT) systems by reviewing 146 articles between 2015 and 2020. Additionally, we present a comprehensive taxonomy in the HIoT, analyze the articles technically, and classify them into five categories, including sensor-based, resource-based, communication-based, application-based, and security-based approaches. Furthermore, the benefits and limitations of the selected methods, with a comprehensive comparison in terms of evaluation techniques, evaluation tools, and evaluation metrics, are included. Finally, based on the reviewed studies, power management, trust and privacy, fog computing, and resource management as leading open issues; tactile Internet, social networks, big data analytics, SDN/NFV, Internet of nano things, and blockchain as important future trends; and interoperability, real-testbed implementation, scalability, and mobility as challenges are worth more studying and researching in HIoT systems.",
        "DOI": "10.1016/j.jnca.2021.103164",
        "paper_author": "Haghi Kashani M.",
        "affiliation_name": "Islamic Azad University",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60031777",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "A Survey on Ethereum Systems Security: Vulnerabilities, Attacks, and Defenses",
        "publication": "ACM Computing Surveys",
        "citied_by": "333",
        "cover_date": "2021-05-31",
        "Abstract": "Blockchain technology is believed by many to be a game changer in many application domains. While the first generation of blockchain technology (i.e., Blockchain 1.0) is almost exclusively used for cryptocurrency, the second generation (i.e., Blockchain 2.0), as represented by Ethereum, is an open and decentralized platform enabling a new paradigm of computing - Decentralized Applications (DApps) running on top of blockchains. The rich applications and semantics of DApps inevitably introduce many security vulnerabilities, which have no counterparts in pure cryptocurrency systems like Bitcoin. Since Ethereum is a new, yet complex, system, it is imperative to have a systematic and comprehensive understanding on its security from a holistic perspective, which was previously unavailable in the literature. To the best of our knowledge, the present survey, which can also be used as a tutorial, fills this void. We systematize three aspects of Ethereum systems security: vulnerabilities, attacks, and defenses. We draw insights into vulnerability root causes, attack consequences, and defense capabilities, which shed light on future research directions.",
        "DOI": "10.1145/3391195",
        "paper_author": "Chen H.",
        "affiliation_name": "The University of Texas at San Antonio",
        "affiliation_city": "San Antonio",
        "affiliation_country": "United States",
        "affiliation_id": "60003212",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Blockchain for the Internet of Vehicles towards Intelligent Transportation Systems: A Survey",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "332",
        "cover_date": "2021-03-15",
        "Abstract": "Internet of Vehicles (IoV) is an emerging concept that is believed to help realize the vision of intelligent transportation systems (ITSs). IoV has become an important research area of impactful applications in recent years due to the rapid advancements in vehicular technologies, high throughput satellite communication, the Internet of Things, and cyber-physical systems. IoV enables the integration of smart vehicles with the Internet and system components attributing to their environments, such as public infrastructures, sensors, computing nodes, pedestrians, and other vehicles. By allowing the development of a common information exchange platform between vehicles and heterogeneous vehicular networks, this integration aims to create a better environment and public space for the people as well as to enhance safety for all road users. Being a participatory data exchange and storage, the underlying information exchange platform of IoV needs to be secure, transparent, and immutable in order to achieve the intended objectives of ITS. In this connection, the adoption of blockchain as a system platform for supporting the information exchange needs of IoV has been explored. Due to their decentralized and immutable nature, IoV applications enabled by blockchain are believed to have a number of desirable properties, such as decentralization, security, transparency, immutability, and automation. In this article, we present a contemporary survey on the latest advancement in blockchain for IoV. Particularly, we highlight the different application scenarios of IoV after carefully reviewing the recent literature. We also investigate several key challenges where blockchain is applied in IoV. Furthermore, we present the future opportunities and explore further research directions of IoV as a key enabler of ITS.",
        "DOI": "10.1109/JIOT.2020.3028368",
        "paper_author": "Mollah M.B.",
        "affiliation_name": "School of Computer Science and Engineering",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60078616",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The National COVID Cohort Collaborative (N3C): Rationale, design, infrastructure, and deployment",
        "publication": "Journal of the American Medical Informatics Association",
        "citied_by": "326",
        "cover_date": "2021-03-01",
        "Abstract": "Objective: Coronavirus disease 2019 (COVID-19) poses societal challenges that require expeditious data and knowledge sharing. Though organizational clinical data are abundant, these are largely inaccessible to outside researchers. Statistical, machine learning, and causal analyses are most successful with large-scale data beyond what is available in any given organization. Here, we introduce the National COVID Cohort Collaborative (N3C), an open science community focused on analyzing patient-level data from many centers. Materials and Methods: The Clinical and Translational Science Award Program and scientific community created N3C to overcome technical, regulatory, policy, and governance barriers to sharing and harmonizing individual-level clinical data. We developed solutions to extract, aggregate, and harmonize data across organizations and data models, and created a secure data enclave to enable efficient, transparent, and reproducible collaborative analytics. Results: Organized in inclusive workstreams, we created legal agreements and governance for organizations and researchers; data extraction scripts to identify and ingest positive, negative, and possible COVID-19 cases; a data quality assurance and harmonization pipeline to create a single harmonized dataset; population of the secure data enclave with data, machine learning, and statistical analytics tools; dissemination mechanisms; and a synthetic data pilot to democratize data access. Conclusions: The N3C has demonstrated that a multisite collaborative learning health network can overcome barriers to rapidly build a scalable infrastructure incorporating multiorganizational clinical data for COVID-19 analytics. We expect this effort to save lives by enabling rapid collaboration among clinicians, researchers, and data scientists to identify treatments and specialized care and thereby reduce the immediate and long-Term impacts of COVID-19.",
        "DOI": "10.1093/jamia/ocaa196",
        "paper_author": "Haendel M.A.",
        "affiliation_name": "Oregon Health &amp; Science University",
        "affiliation_city": "Portland",
        "affiliation_country": "United States",
        "affiliation_id": "60016733",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "Secure and Robust Machine Learning for Healthcare: A Survey",
        "publication": "IEEE Reviews in Biomedical Engineering",
        "citied_by": "324",
        "cover_date": "2021-01-01",
        "Abstract": "Recent years have witnessed widespread adoption of machine learning (ML)/deep learning (DL) techniques due to their superior performance for a variety of healthcare applications ranging from the prediction of cardiac arrest from one-dimensional heart signals to computer-aided diagnosis (CADx) using multi-dimensional medical images. Notwithstanding the impressive performance of ML/DL, there are still lingering doubts regarding the robustness of ML/DL in healthcare settings (which is traditionally considered quite challenging due to the myriad security and privacy issues involved), especially in light of recent results that have shown that ML/DL are vulnerable to adversarial attacks. In this paper, we present an overview of various application areas in healthcare that leverage such techniques from security and privacy point of view and present associated challenges. In addition, we present potential methods to ensure secure and privacy-preserving ML for healthcare applications. Finally, we provide insight into the current research challenges and promising directions for future research.",
        "DOI": "10.1109/RBME.2020.3013489",
        "paper_author": "Qayyum A.",
        "affiliation_name": "Information Technology University",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60105219",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Machine Learning for Anomaly Detection: A Systematic Review",
        "publication": "IEEE Access",
        "citied_by": "323",
        "cover_date": "2021-01-01",
        "Abstract": "Anomaly detection has been used for decades to identify and extract anomalous components from data. Many techniques have been used to detect anomalies. One of the increasingly significant techniques is Machine Learning (ML), which plays an important role in this area. In this research paper, we conduct a Systematic Literature Review (SLR) which analyzes ML models that detect anomalies in their application. Our review analyzes the models from four perspectives; the applications of anomaly detection, ML techniques, performance metrics for ML models, and the classification of anomaly detection. In our review, we have identified 290 research articles, written from 2000-2020, that discuss ML techniques for anomaly detection. After analyzing the selected research articles, we present 43 different applications of anomaly detection found in the selected research articles. Moreover, we identify 29 distinct ML models used in the identification of anomalies. Finally, we present 22 different datasets that are applied in experiments on anomaly detection, as well as many other general datasets. In addition, we observe that unsupervised anomaly detection has been adopted by researchers more than other classification anomaly detection systems. Detection of anomalies using ML models is a promising area of research, and there are a lot of ML models that have been implemented by researchers. Therefore, we provide researchers with recommendations and guidelines based on this review.",
        "DOI": "10.1109/ACCESS.2021.3083060",
        "paper_author": "Nassif A.B.",
        "affiliation_name": "University of Sharjah",
        "affiliation_city": "Sharjah",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60070813",
        "affiliation_state": "Sharjah"
    },
    {
        "paper_title": "Blockchain-based authentication and authorization for smart city applications",
        "publication": "Information Processing and Management",
        "citied_by": "321",
        "cover_date": "2021-03-01",
        "Abstract": "The platforms supporting the smart city applications are rarely implemented from scratch by a municipality and/or totally owned by a single company, but are more typically realized by integrating some existing ICT infrastructures thanks to a supporting platform, such as the well known FIWARE platform. Such a multi-tenant deployment model is required to lower the initial investment costs to implement large scale solutions for smart cities, but also imposes some key security obstacles. In fact, smart cities support critical applications demanding to protect the data and functionalities from malicious and unauthorized uses. Equipping the supporting platforms with proper means for access control is demanding, but these means are typically implemented according to a centralized approach, where a single server stores and makes available a set of identity attributes and authorization policies. Having a single root of trust is not suitable in a distributed and cooperating scenario of large scale smart cities due to their multi-tenant deployment. In fact, each of the integrated system has its own set of security policies, and the other systems need to be aware of these policy, in order to allow a seamless use of the same credentials across the overall infrastructure (realizing what is known as the single-sign-on). This imposes the problem of consistent and secure data replicas within a distributed system, which can be properly approached by using the blockchain technology. Therefore, this work proposes a novel solution for distributed management of identity and authorization policies by leveraging on the blockchain technology to hold a global view of the security policies within the system, and integrating it in the FIWARE platform. A detailed assessment is provided to evaluate the goodness of the proposed approach and to compare it with the existing solutions.",
        "DOI": "10.1016/j.ipm.2020.102468",
        "paper_author": "Esposito C.",
        "affiliation_name": "Università degli Studi di Salerno",
        "affiliation_city": "Salerno",
        "affiliation_country": "Italy",
        "affiliation_id": "60007061",
        "affiliation_state": "SA"
    },
    {
        "paper_title": "A Survey on Wearable Technology: History, State-of-the-Art and Current Challenges",
        "publication": "Computer Networks",
        "citied_by": "320",
        "cover_date": "2021-07-05",
        "Abstract": "Technology is continually undergoing a constituent development caused by the appearance of billions new interconnected “things” and their entrenchment in our daily lives. One of the underlying versatile technologies, namely wearables, is able to capture rich contextual information produced by such devices and use it to deliver a legitimately personalized experience. The main aim of this paper is to shed light on the history of wearable devices and provide a state-of-the-art review on the wearable market. Moreover, the paper provides an extensive and diverse classification of wearables, based on various factors, a discussion on wireless communication technologies, architectures, data processing aspects, and market status, as well as a variety of other actual information on wearable technology. Finally, the survey highlights the critical challenges and existing/future solutions.",
        "DOI": "10.1016/j.comnet.2021.108074",
        "paper_author": "Ometov A.",
        "affiliation_name": "Tampere University",
        "affiliation_city": "Tampere",
        "affiliation_country": "Finland",
        "affiliation_id": "60011170",
        "affiliation_state": "Pirkanmaa"
    },
    {
        "paper_title": "Privacy and artificial intelligence: challenges for protecting health information in a new era",
        "publication": "BMC Medical Ethics",
        "citied_by": "319",
        "cover_date": "2021-12-01",
        "Abstract": "Background: Advances in healthcare artificial intelligence (AI) are occurring rapidly and there is a growing discussion about managing its development. Many AI technologies end up owned and controlled by private entities. The nature of the implementation of AI could mean such corporations, clinics and public bodies will have a greater than typical role in obtaining, utilizing and protecting patient health information. This raises privacy issues relating to implementation and data security. Main body: The first set of concerns includes access, use and control of patient data in private hands. Some recent public–private partnerships for implementing AI have resulted in poor protection of privacy. As such, there have been calls for greater systemic oversight of big data health research. Appropriate safeguards must be in place to maintain privacy and patient agency. Private custodians of data can be impacted by competing goals and should be structurally encouraged to ensure data protection and to deter alternative use thereof. Another set of concerns relates to the external risk of privacy breaches through AI-driven methods. The ability to deidentify or anonymize patient health data may be compromised or even nullified in light of new algorithms that have successfully reidentified such data. This could increase the risk to patient data under private custodianship. Conclusions: We are currently in a familiar situation in which regulation and oversight risk falling behind the technologies they govern. Regulation should emphasize patient agency and consent, and should encourage increasingly sophisticated methods of data anonymization and protection.",
        "DOI": "10.1186/s12910-021-00687-3",
        "paper_author": "Murdoch B.",
        "affiliation_name": "University of Alberta",
        "affiliation_city": "Edmonton",
        "affiliation_country": "Canada",
        "affiliation_id": "60030835",
        "affiliation_state": "AB"
    },
    {
        "paper_title": "Variational LSTM Enhanced Anomaly Detection for Industrial Big Data",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "318",
        "cover_date": "2021-05-01",
        "Abstract": "With the increasing population of Industry 4.0, industrial big data (IBD) has become a hotly discussed topic in digital and intelligent industry field. The security problem existing in the signal processing on large scale of data stream is still a challenge issue in industrial internet of things, especially when dealing with the high-dimensional anomaly detection for intelligent industrial application. In this article, to mitigate the inconsistency between dimensionality reduction and feature retention in imbalanced IBD, we propose a variational long short-term memory (VLSTM) learning model for intelligent anomaly detection based on reconstructed feature representation. An encoder-decoder neural network associated with a variational reparameterization scheme is designed to learn the low-dimensional feature representation from high-dimensional raw data. Three loss functions are defined and quantified to constrain the reconstructed hidden variable into a more explicit and meaningful form. A lightweight estimation network is then fed with the refined feature representation to identify anomalies in IBD. Experiments using a public IBD dataset named UNSW-NB15 demonstrate that the proposed VLSTM model can efficiently cope with imbalance and high-dimensional issues, and significantly improve the accuracy and reduce the false rate in anomaly detection for IBD according to F1, area under curve (AUC), and false alarm rate (FAR).",
        "DOI": "10.1109/TII.2020.3022432",
        "paper_author": "Zhou X.",
        "affiliation_name": "Shiga University",
        "affiliation_city": "Hikone",
        "affiliation_country": "Japan",
        "affiliation_id": "60033365",
        "affiliation_state": "Shiga"
    },
    {
        "paper_title": "An Edge Traffic Flow Detection Scheme Based on Deep Learning in an Intelligent Transportation System",
        "publication": "IEEE Transactions on Intelligent Transportation Systems",
        "citied_by": "313",
        "cover_date": "2021-03-01",
        "Abstract": "An intelligent transportation system (ITS) plays an important role in public transport management, security and other issues. Traffic flow detection is an important part of the ITS. Based on the real-time acquisition of urban road traffic flow information, an ITS provides intelligent guidance for relieving traffic jams and reducing environmental pollution. The traffic flow detection in an ITS usually adopts the cloud computing mode. The edge of the network will transmit all the captured video to the cloud computing center. However, the increasing traffic monitoring has brought great challenges to the storage, communication and processing of traditional transportation systems based on cloud computing. To address this issue, a traffic flow detection scheme based on deep learning on the edge node is proposed in this article. First, we propose a vehicle detection algorithm based on the YOLOv3 (You Only Look Once) model trained with a great volume of traffic data. We pruned the model to ensure its efficiency on the edge equipment. After that, the DeepSORT (Deep Simple Online and Realtime Tracking) algorithm is optimized by retraining the feature extractor for multiobject vehicle tracking. Then, we propose a real-time vehicle tracking counter for vehicles that combines the vehicle detection and vehicle tracking algorithms to realize the detection of traffic flow. Finally, the vehicle detection network and multiple-object tracking network are migrated and deployed on the edge device Jetson TX2 platform, and we verify the correctness and efficiency of our framework. The test results indicate that our model can efficiently detect the traffic flow with an average processing speed of 37.9 FPS (frames per second) and an average accuracy of 92.0% on the edge device.",
        "DOI": "10.1109/TITS.2020.3025687",
        "paper_author": "Chen C.",
        "affiliation_name": "Xidian University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60025578",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Blockchain technology applications for Industry 4.0: A literature-based review",
        "publication": "Blockchain: Research and Applications",
        "citied_by": "307",
        "cover_date": "2021-12-01",
        "Abstract": "Industry 4.0 involves innovations with upcoming digital technologies, and blockchain is one of them. Blockchain can be incorporated to improve security, privacy, and data transparency both for small and large enterprises. Industry 4.0 is a synthesis of the new production methods that allow manufacturers to achieve their target more rapidly. Research has been conducted on various Industry 4.0 technologies like Artificial Intelligence (AI), Internet of Things (IoT), Big data, and Blockchain, and how they could create significant interruptions in recent years. These technologies provide various possibilities in the world of manufacturing and supply chain. Blockchain is a technology that has gained much recognition and can enhance the manufacturing and supply chain environment. Various fields now have fascinating insights into the advantages of blockchain. Several research articles on “Blockchain” and “Industry 4.0” from Google Scholar, Scopus, and other relevant sources are identified and reviewed for this study. This paper discusses the major potential of Blockchain in Industry 4.0. Various drivers, enablers, and associated capabilities of Blockchain technology for Industry 4.0 are discussed for insights. Different Industry 4.0 spheres/sub-domains for Blockchain technology realisation are also discussed. Finally, we have identified and studied fourteen significant applications of Blockchain in Industry 4.0. It is a range of new developments and hope for immense opportunities that are changing Industry 4.0. This technology would work to achieve amplified outcomes and work individually to enhance the process.",
        "DOI": "10.1016/j.bcra.2021.100027",
        "paper_author": "Javaid M.",
        "affiliation_name": "Jamia Millia Islamia",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60020458",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Dynamic Mode Decomposition and Its Variants",
        "publication": "Annual Review of Fluid Mechanics",
        "citied_by": "307",
        "cover_date": "2021-01-01",
        "Abstract": "Dynamic mode decomposition (DMD) is a factorization and dimensionality reduction technique for data sequences. In its most common form, it processes high-dimensional sequential measurements, extracts coherent structures, isolates dynamic behavior, and reduces complex evolution processes to their dominant features and essential components. The decomposition is intimately related to Koopman analysis and, since its introduction, has spawned various extensions, generalizations, and improvements. It has been applied to numerical and experimental data sequences taken from simple to complex fluid systems and has also had an impact beyond fluid dynamics in, for example, video surveillance, epidemiology, neurobiology, and financial engineering. This review focuses on the practical aspects of DMD and its variants, as well as on its usage and characteristics as a quantitative tool for the analysis of complex fluid processes.",
        "DOI": "10.1146/annurev-fluid-030121-015835",
        "paper_author": "Schmid P.J.",
        "affiliation_name": "Imperial College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60015150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A novel decentralized platform for peer-to-peer energy trading market with blockchain technology",
        "publication": "Applied Energy",
        "citied_by": "306",
        "cover_date": "2021-01-15",
        "Abstract": "Peer-to-Peer (P2P) energy trading, which allows energy consumers/producers to directly trade with each other, is one of the new paradigms driven by the decarbonization, decentralization, and digitalization of the energy supply chain. Additionally, the rise of blockchain technology suggests unprecedented socio-economic benefits for energy systems, especially when coupled with P2P energy trading. Despite such future prospects in energy systems, three key challenges might hinder the full integration of P2P energy trading and blockchain. First, it is quite complicated to design a decentralized P2P market that keeps a fair balance between economic efficiency and information privacy. Secondly, with the proliferation of storage devices, new P2P market designs are needed to account for their inter-temporal dependencies. Thirdly, a practical implementation of blockchain technology for P2P trading is required, which can facilitate efficient trading in a secured and fraud-resilient way, while eliminating any intermediaries’ costs. In this paper, we develop a new decentralized P2P energy trading platform to address all the aforementioned challenges. Our platform consists of two key layers: market and blockchain. The market layer features a parallel and short-term pool-structured auction and is cleared using a novel decentralized Ant-Colony Optimization method. This market arrangement guarantees a near-optimally efficient market solution, preserves players’ privacy, and allows inter-temporal market products trading. The blockchain layer offers a high level of automation, security, and fast real-time settlements through smart contract implementation. Finally, using real-world data, we simulate the functionality of the platform regarding energy trading, market clearing, smart contract operations, and blockchain-based settlements.",
        "DOI": "10.1016/j.apenergy.2020.116123",
        "paper_author": "Esmat A.",
        "affiliation_name": "Rotterdam School of Management, Erasmus University",
        "affiliation_city": "Rotterdam",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60070152",
        "affiliation_state": "Zuid-Holland"
    },
    {
        "paper_title": "Internet of Things (IoT): A Review of Its Enabling Technologies in Healthcare Applications, Standards Protocols, Security, and Market Opportunities",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "304",
        "cover_date": "2021-07-01",
        "Abstract": "The Internet of Things (IoT) is a methodology or a system that encompasses real-world things to interact and communicate with each other with the assistance of networking technologies. This article describes surveys on advances in IoT-based healthcare methods and reviews the state-of-the-art technologies in detail. Moreover, this review classifies an existing IoT-based healthcare network and represents a summary of all perspective networks. IoT healthcare protocols are analyzed in this context and provide a broad discussion on it. It also initiates a comprehensive survey on IoT healthcare applications and services. Extensive insights into IoT healthcare security, its requirements, challenges, and privacy issues are visualized in IoT surrounding healthcare. In this review, we analyze security and privacy features consisting of data protection, network architecture, Quality of Services (QoS), app development, and continuous monitoring of healthcare that are facing difficulties in many IoT-based healthcare architectures. To mitigate the security problems, an IoT-based security architectural model has been proposed in this review. Furthermore, this review discloses the market opportunity that will enhance the IoT healthcare market development. To conduct the survey, we searched through established journal and conference databases using specific keywords to find scholarly works. We applied a filtering mechanism to collect only papers that were relevant to our research works. The selected papers were then examined carefully to understand their contributions/research focus. Eventually, the paper reviews were analyzed to identify any existing research gaps and untouched areas of research and to discover possible features for sustainable IoT healthcare development.",
        "DOI": "10.1109/JIOT.2021.3062630",
        "paper_author": "Bhuiyan M.N.",
        "affiliation_name": "Noakhali Science and Technology University",
        "affiliation_city": "Noakhali",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60108743",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Security and Privacy for 6G: A Survey on Prospective Technologies and Challenges",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "295",
        "cover_date": "2021-01-01",
        "Abstract": "Sixth-generation (6G) mobile networks will have to cope with diverse threats on a space-air-ground integrated network environment, novel technologies, and an accessible user information explosion. However, for now, security and privacy issues for 6G remain largely in concept. This survey provides a systematic overview of security and privacy issues based on prospective technologies for 6G in the physical, connection, and service layers, as well as through lessons learned from the failures of existing security architectures and state-of-the-art defenses. Two key lessons learned are as follows. First, other than inheriting vulnerabilities from the previous generations, 6G has new threat vectors from new radio technologies, such as the exposed location of radio stripes in ultra-massive MIMO systems at Terahertz bands and attacks against pervasive intelligence. Second, physical layer protection, deep network slicing, quantum-safe communications, artificial intelligence (AI) security, platform-agnostic security, real-time adaptive security, and novel data protection mechanisms such as distributed ledgers and differential privacy are the top promising techniques to mitigate the attack magnitude and personal data breaches substantially.",
        "DOI": "10.1109/COMST.2021.3108618",
        "paper_author": "Nguyen V.L.",
        "affiliation_name": "National Chung Cheng University",
        "affiliation_city": "Min-Hsiung",
        "affiliation_country": "Taiwan",
        "affiliation_id": "60007954",
        "affiliation_state": "Chiayi"
    },
    {
        "paper_title": "Faculty’s and Students’ Perceptions of Online Learning During COVID-19",
        "publication": "Frontiers in Education",
        "citied_by": "292",
        "cover_date": "2021-05-12",
        "Abstract": "COVID-19 pandemic has disrupted teaching in a vriety of institutions. It has tested the readiness of academic institutions to deal with such abrupt crisis. Online learning has become the main method of instruction during the pandemic in Jordan. After 4 months of online education, two online surveys were distributed to investigate faculty’s and Students’ perception of the learning process that took place over that period of time with no face to face education. In this regard, the study aimed to identify both faculty’s and students’ perceptions of online learning, utilizing two surveys one distributed to 50 faculty members and another 280 students were selected randomly to explore the effectiveness, challenges, and advantages of online education in Jordan. The analysis showed that the common online platforms in Jordan were Zoom, Microsoft Teams offering online interactive classes, and WhatsApp in communication with students outside the class. The study found that both faculty and students agreed that online education is useful during the current pandemic. At the same time, its efficacy is less effective than face-to-face learning and teaching. Faculty and students indicated that online learning challenges lie in adapting to online education, especially for deaf and hard of hearing students, lack of interaction and motivation, technical and Internet issues, data privacy, and security. They also agreed on the advantages of online learning. The benefits were mainly self-learning, low costs, convenience, and flexibility. Even though online learning works as a temporary alternative due to COVID-19, it could not substitute face-to-face learning. The study recommends that blended learning would help in providing a rigorous learning environment.",
        "DOI": "10.3389/feduc.2021.638470",
        "paper_author": "Almahasees Z.",
        "affiliation_name": "Applied Science Private University",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60043655",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Comprehensive Survey on Machine Learning-Based Big Data Analytics for IoT-Enabled Smart Healthcare System",
        "publication": "Mobile Networks and Applications",
        "citied_by": "292",
        "cover_date": "2021-02-01",
        "Abstract": "The outbreak of chronic diseases such as COVID-19 has made a renewed call for providing urgent healthcare facilities to the citizens across the globe. The recent pandemic exposes the shortcomings of traditional healthcare system, i.e., hospitals and clinics alone are not capable to cope with this situation. One of the major technology that aids contemporary healthcare solutions is the smart and connected wearables. The advancement in Internet of Things (IoT) has enabled these wearables to collect data on an unprecedented scale. These wearables gather context-oriented information related to our physical, behavioural and psychological health. The big data generated by wearables and other healthcare devices of IoT is a challenging task to manage that can negatively affect the inference process at the decision centres. Applying big data analytics for mining information, extracting knowledge and making predictions/inferences has recently attracted significant attention. Machine learning is another area of research that has successfully been applied to solve various networking problems such as routing, traffic engineering, resource allocation, and security. Recently, we have seen a surge in the application of ML-based techniques for the improvement of various IoT applications. Although, big data analytics and machine learning are extensively researched, there is a lack of study that exclusively focus on the evolution of ML-based techniques for big data analysis in the IoT healthcare sector. In this paper, we have presented a comprehensive review on the application of machine learning techniques for big data analysis in the healthcare sector. Furthermore, strength and weaknesses of existing techniques along with various research challenges are highlighted. Our study will provide an insight for healthcare practitioners and government agencies to keep themselves well-equipped with the latest trends in ML-based big data analytics for smart healthcare.",
        "DOI": "10.1007/s11036-020-01700-6",
        "paper_author": "Li W.",
        "affiliation_name": "Huanghe Science &amp; Technology University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60022393",
        "affiliation_state": "Henan"
    },
    {
        "paper_title": "A Deep Blockchain Framework-Enabled Collaborative Intrusion Detection for Protecting IoT and Cloud Networks",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "287",
        "cover_date": "2021-06-15",
        "Abstract": "There has been significant research in incorporating both blockchain and intrusion detection to improve data privacy and detect existing and emerging cyberattacks, respectively. In these approaches, learning-based ensemble models can facilitate the identification of complex malicious events and concurrently ensure data privacy. Such models can also be used to provide additional security and privacy assurances during the live migration of virtual machines (VMs) in the cloud and to protect Internet-of-Things (IoT) networks. This would allow the secure transfer of VMs between data centers or cloud providers in real time. This article proposes a deep blockchain framework (DBF) designed to offer security-based distributed intrusion detection and privacy-based blockchain with smart contracts in IoT networks. The intrusion detection method is employed by a bidirectional long short-term memory (BiLSTM) deep learning algorithm to deal with sequential network data and is assessed using the data sets of UNSW-NB15 and BoT-IoT. The privacy-based blockchain and smart contract methods are developed using the Ethereum library to provide privacy to the distributed intrusion detection engines. The DBF framework is compared with peer privacy-preserving intrusion detection techniques, and the experimental outcomes reveal that DBF outperforms the other competing models. The framework has the potential to be used as a decision support system that can assist users and cloud providers in securely migrating their data in a timely and reliable manner.",
        "DOI": "10.1109/JIOT.2020.2996590",
        "paper_author": "Alkadi O.",
        "affiliation_name": "University of New South Wales at Australian Defence Force Academy",
        "affiliation_city": "Canberra",
        "affiliation_country": "Australia",
        "affiliation_id": "60026708",
        "affiliation_state": "ACT"
    },
    {
        "paper_title": "When Deep Reinforcement Learning Meets Federated Learning: Intelligent Multitimescale Resource Management for Multiaccess Edge Computing in 5G Ultradense Network",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "286",
        "cover_date": "2021-02-15",
        "Abstract": "Recently, smart cities, healthcare system, and smart vehicles have raised challenges on the capability and connectivity of state-of-the-art Internet-of-Things (IoT) devices, especially for the devices in hotspots area. Multiaccess edge computing (MEC) can enhance the ability of emerging resource-intensive IoT applications and has attracted much attention. However, due to the time-varying network environments, as well as the heterogeneous resources of network devices, it is hard to achieve stable, reliable, and real-time interactions between edge devices and their serving edge servers, especially in the 5G ultradense network (UDN) scenarios. Ultradense edge computing (UDEC) has the potential to fill this gap, especially in the 5G era, but it still faces challenges in its current solutions, such as the lack of: 1) efficient utilization of multiple 5G resources (e.g., computation, communication, storage, and service resources); 2) low overhead offloading decision making and resource allocation strategies; and 3) privacy and security protection schemes. Thus, we first propose an intelligent UDEC (I-UDEC) framework, which integrates blockchain and artificial intelligence (AI) into 5G UDEC networks. Then, in order to achieve real-time and low overhead computation offloading decisions and resource allocation strategies, we design a novel two-timescale deep reinforcement learning (2Ts-DRL) approach, consisting of a fast-timescale and a slow-timescale learning process, respectively. The primary objective is to minimize the total offloading delay and network resource usage by jointly optimizing computation offloading, resource allocation, and service caching placement. We also leverage federated learning (FL) to train the 2Ts-DRL model in a distributed manner, aiming to protect the edge devices' data privacy. Simulation results corroborate the effectiveness of both the 2Ts-DRL and FL in the I-UDEC framework and prove that our proposed algorithm can reduce task execution time up to 31.87%.",
        "DOI": "10.1109/JIOT.2020.3026589",
        "paper_author": "Yu S.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Blockchain technology applications in healthcare: An overview",
        "publication": "International Journal of Intelligent Networks",
        "citied_by": "285",
        "cover_date": "2021-01-01",
        "Abstract": "Blockchain is an emerging technology being applied for creating innovative solutions in various sectors, including healthcare. A Blockchain network is used in the healthcare system to preserve and exchange patient data through hospitals, diagnostic laboratories, pharmacy firms, and physicians. Blockchain applications can accurately identify severe mistakes and even dangerous ones in the medical field. Thus, it can improve the performance, security, and transparency of sharing medical data in the health care system. This technology is helpful to medical institutions to gain insight and enhance the analysis of medical records. In this paper, we studied Blockchain technology and its significant benefits in healthcare. Various Capabilities, Enablers, and Unified Work-Flow Process of Blockchain Technology to support healthcare globally are discussed diagrammatically. Finally, the paper identifies and debates fourteen significant applications of Blockchain for healthcare. Blockchain plays a decisive part in handling deception in clinical trials; here, the potential of this technology offer is to improve data efficiency for healthcare. It can help avoid the fear of data manipulation in healthcare and supports a unique data storage pattern at the highest level of security. It provides versatility, interconnection, accountability, and authentication for data access. For different purposes, health records must be kept safe and confidential. Blockchain helps for the decentralised protection of data in healthcare and avoids specific threats.",
        "DOI": "10.1016/j.ijin.2021.09.005",
        "paper_author": "Haleem A.",
        "affiliation_name": "Jamia Millia Islamia",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60020458",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Integrating the MCR and DOI models to construct an ecological security network for the urban agglomeration around Poyang Lake, China",
        "publication": "Science of the Total Environment",
        "citied_by": "285",
        "cover_date": "2021-02-01",
        "Abstract": "The development of urban agglomeration in aquatic areas is premised on ecological security. The construction of ecological security network is an effective measure to reduce ecological resistance and guarantee economic development. In this study, a comprehensive ecological security network (ESN) evaluation approach is developed by integrating the Minimum Cumulative Resistance (MCR) model and Duranton and Overman Index (DOI). Taking the urban agglomeration around Poyang Lake in 2015 as a case, the MCR model showed the ecological landscape pattern of discrete connection and large overall ecological resistance. The DOI model indicated that the industries of moderately polluted were global localization, while heavily polluted were small-scale localization and large-scale dispersion. Accordingly, the ESN consisting of 35 ecological sources, 34 ecological corridors, 57 artificial corridors, and 39 eco-economic strategic nodes can avoid the threat of industrial layout to the ecological landscape. The results of this study complemented the guidance of industrial agglomeration theory on the basis of “source-sink” theory. The dual evaluation approach of landscape ecology and economic agglomeration proposed in this study explores interdisciplinary data fusion of different scales, and also provides a reference for inter-municipal coordinated ecological management and restraining urban excessive expansion.",
        "DOI": "10.1016/j.scitotenv.2020.141868",
        "paper_author": "Dai L.",
        "affiliation_name": "Nanchang University",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60008332",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "Machine learning methods for cyber security intrusion detection: Datasets and comparative study",
        "publication": "Computer Networks",
        "citied_by": "282",
        "cover_date": "2021-04-07",
        "Abstract": "The increase in internet usage brings security problems with it. Malicious software can affect the operation of the systems and disrupt data confidentiality due to the security gaps in the systems. Intrusion Detection Systems (IDS) have been developed to detect and report attacks. In order to develop IDS systems, artificial intelligence-based approaches have been used more frequently. In this study, literature studies using CSE-CIC IDS-2018, UNSW-NB15, ISCX-2012, NSL-KDD and CIDDS-001 data sets, which are widely used to develop IDS systems, are reviewed in detail. In addition, max-min normalization was performed on these data sets and classification was made with support vector machine (SVM), K-Nearest neighbor (KNN), Decision Tree (DT) algorithms, which are among the classical machine learning approaches. As a result, more successful results have been obtained in some of the studies given in the literature. The study is thought to be useful for developing IDS systems on the basis of artificial intelligence with approaches such as machine learning.",
        "DOI": "10.1016/j.comnet.2021.107840",
        "paper_author": "Kilincer I.F.",
        "affiliation_name": "Firat Üniversitesi",
        "affiliation_city": "Elazig",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60004863",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Manipulating the Byzantine: Optimizing Model Poisoning Attacks and Defenses for Federated Learning",
        "publication": "28th Annual Network and Distributed System Security Symposium, NDSS 2021",
        "citied_by": "280",
        "cover_date": "2021-01-01",
        "Abstract": "Federated learning (FL) enables many data owners (e.g., mobile devices) to train a joint ML model (e.g., a next-word prediction classifier) without the need of sharing their private training data. However, FL is known to be susceptible to poisoning attacks by malicious participants (e.g., adversary-owned mobile devices) who aim at hampering the accuracy of the jointly trained model through sending malicious inputs during the federated training process. In this paper, we present a generic framework for model poisoning attacks on FL. We show that our framework leads to poisoning attacks that substantially outperform state-of-the-art model poisoning attacks by large margins. For instance, our attacks result in 1.5× to 60× higher reductions in the accuracy of FL models compared to previously discovered poisoning attacks. Our work demonstrates that existing Byzantine-robust FL algorithms are significantly more susceptible to model poisoning than previously thought. Motivated by this, we design a defense against FL poisoning, called divide-and-conquer (DnC). We demonstrate that DnC outperforms all existing Byzantine-robust FL algorithms in defeating model poisoning attacks, specifically, it is 2.5× to 12× more resilient in our experiments with different datasets and models.",
        "DOI": "10.14722/ndss.2021.24498",
        "paper_author": "Shejwalkar V.",
        "affiliation_name": "University of Massachusetts Amherst",
        "affiliation_city": "Amherst",
        "affiliation_country": "United States",
        "affiliation_id": "60014313",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Internet of Underwater Things and Big Marine Data Analytics - A Comprehensive Survey",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "280",
        "cover_date": "2021-04-01",
        "Abstract": "The Internet of Underwater Things (IoUT) is an emerging communication ecosystem developed for connecting underwater objects in maritime and underwater environments. The IoUT technology is intricately linked with intelligent boats and ships, smart shores and oceans, automatic marine transportations, positioning and navigation, underwater exploration, disaster prediction and prevention, as well as with intelligent monitoring and security. The IoUT has an influence at various scales ranging from a small scientific observatory, to a mid-sized harbor, and to covering global oceanic trade. The network architecture of IoUT is intrinsically heterogeneous and should be sufficiently resilient to operate in harsh environments. This creates major challenges in terms of underwater communications, whilst relying on limited energy resources. Additionally, the volume, velocity, and variety of data produced by sensors, hydrophones, and cameras in IoUT is enormous, giving rise to the concept of Big Marine Data (BMD), which has its own processing challenges. Hence, conventional data processing techniques will falter, and bespoke Machine Learning (ML) solutions have to be employed for automatically learning the specific BMD behavior and features facilitating knowledge extraction and decision support. The motivation of this article is to comprehensively survey the IoUT, BMD, and their synthesis. It also aims for exploring the nexus of BMD with ML. We set out from underwater data collection and then discuss the family of IoUT data communication techniques with an emphasis on the state-of-the-art research challenges. We then review the suite of ML solutions suitable for BMD handling and analytics. We treat the subject deductively from an educational perspective, critically appraising the material surveyed. Accordingly, the reader will become familiar with the pivotal issues of IoUT and BMD processing, whilst gaining an insight into the state-of-the-art applications, tools, and techniques. Finally, we analyze the architectural challenges of the IoUT, followed by proposing a range of promising direction for research and innovation in the broad areas of IoUT and BMD. Our hope is to inspire researchers, engineers, data scientists, and governmental bodies to further progress the field, to develop new tools and techniques, as well as to make informed decisions and set regulations related to the maritime and underwater environments around the world.",
        "DOI": "10.1109/COMST.2021.3053118",
        "paper_author": "Jahanbakht M.",
        "affiliation_name": "James Cook University",
        "affiliation_city": "Townsville",
        "affiliation_country": "Australia",
        "affiliation_id": "60019870",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "PPSF: A Privacy-Preserving and Secure Framework Using Blockchain-Based Machine-Learning for IoT-Driven Smart Cities",
        "publication": "IEEE Transactions on Network Science and Engineering",
        "citied_by": "273",
        "cover_date": "2021-07-01",
        "Abstract": "With the evolution of the Internet of Things (IoT), smart cities have become the mainstream of urbanization. IoT networks allow distributed smart devices to collect and process data within smart city infrastructure using an open channel, the Internet. Thus, challenges such as centralization, security, privacy (e.g., performing data poisoning and inference attacks), transparency, scalability, and verifiability limits faster adaptations of smart cities. Motivated by the aforementioned discussions, we present a Privacy-Preserving and Secure Framework (PPSF) for IoT-driven smart cities. The proposed PPSF is based on two key mechanisms: A two-level privacy scheme and an intrusion detection scheme. First, in a two-level privacy scheme, a blockchain module is designed to securely transmit the IoT data and Principal Component Analysis (PCA) technique is applied to transform raw IoT information into a new shape. In the intrusion detection scheme, a Gradient Boosting Anomaly Detector (GBAD) is applied for training and evaluating the proposed two-level privacy scheme based on two IoT network datasets, namely ToN-IoT and BoT-IoT. We also suggest a blockchain-InterPlanetary File System (IPFS) integrated Fog-Cloud architecture to deploy the proposed PPSF framework. Experimental results demonstrate the superiority of the PPSF framework over some recent approaches in blockchain and non-blockchain systems.",
        "DOI": "10.1109/TNSE.2021.3089435",
        "paper_author": "Kumar P.",
        "affiliation_name": "National Institute of Technology Raipur",
        "affiliation_city": "Raipur",
        "affiliation_country": "India",
        "affiliation_id": "60104578",
        "affiliation_state": "CG"
    },
    {
        "paper_title": "Cybersecurity for autonomous vehicles: Review of attacks and defense",
        "publication": "Computers and Security",
        "citied_by": "273",
        "cover_date": "2021-04-01",
        "Abstract": "As technology has evolved, cities have become increasingly smart. Smart mobility is a crucial element in smart cities, and autonomous vehicles are an essential part of smart mobility. However, vulnerabilities in autonomous vehicles can be damaging to quality of life and human safety. For this reason, many security researchers have studied attacks and defenses for autonomous vehicles. However, there has not been systematic research on attacks and defenses for autonomous vehicles. In this survey, we analyzed previously conducted attack and defense studies described in 151 papers from 2008 to 2019 for a systematic and comprehensive investigation of autonomous vehicles. We classified autonomous attacks into the three categories of autonomous control system, autonomous driving systems components, and vehicle-to-everything communications. Defense against such attacks was classified into security architecture, intrusion detection, and anomaly detection. Due to the development of big data and communication technologies, techniques for detecting abnormalities using artificial intelligence and machine learning are gradually being developed. Lastly, we provide implications based on our systemic survey that future research on autonomous attacks and defenses is strongly combined with artificial intelligence and major component of smart cities.",
        "DOI": "10.1016/j.cose.2020.102150",
        "paper_author": "Kim K.",
        "affiliation_name": "Korea University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60005273",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A survey on the adoption of blockchain in IoT: challenges and solutions",
        "publication": "Blockchain: Research and Applications",
        "citied_by": "266",
        "cover_date": "2021-06-01",
        "Abstract": "Conventional Internet of Things (IoT) ecosystems involve data streaming from sensors, through Fog devices to a centralized Cloud server. Issues that arise include privacy concerns due to third party management of Cloud servers, single points of failure, a bottleneck in data flows and difficulties in regularly updating firmware for millions of smart devices from a point of security and maintenance perspective. Blockchain technologies avoid trusted third parties and safeguard against a single point of failure and other issues. This has inspired researchers to investigate blockchain's adoption into IoT ecosystem. In this paper, recent state-of-the-arts advances in blockchain for IoT, blockchain for Cloud IoT and blockchain for Fog IoT in the context of eHealth, smart cities, intelligent transport and other applications are analyzed. Obstacles, research gaps and potential solutions are also presented.",
        "DOI": "10.1016/j.bcra.2021.100006",
        "paper_author": "Uddin M.A.",
        "affiliation_name": "Federation University Australia",
        "affiliation_city": "Ballarat",
        "affiliation_country": "Australia",
        "affiliation_id": "60010859",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Design and Development of a Deep Learning-Based Model for Anomaly Detection in IoT Networks",
        "publication": "IEEE Access",
        "citied_by": "265",
        "cover_date": "2021-01-01",
        "Abstract": "The growing development of IoT (Internet of Things) devices creates a large attack surface for cybercriminals to conduct potentially more destructive cyberattacks; as a result, the security industry has seen an exponential increase in cyber-attacks. Many of these attacks have effectively accomplished their malicious goals because intruders conduct cyber-attacks using novel and innovative techniques. An anomaly-based IDS (Intrusion Detection System) uses machine learning techniques to detect and classify attacks in IoT networks. In the presence of unpredictable network technologies and various intrusion methods, traditional machine learning techniques appear inefficient. In many research areas, deep learning methods have shown their ability to identify anomalies accurately. Convolutional neural networks are an excellent alternative for anomaly detection and classification due to their ability to automatically categorize main characteristics in input data and their effectiveness in performing faster computations. In this paper, we design and develop a novel anomaly-based intrusion detection model for IoT networks. First, a convolutional neural network model is used to create a multiclass classification model. The proposed model is then implemented using convolutional neural networks in 1D, 2D, and 3D. The proposed convolutional neural network model is validated using the BoT-IoT, IoT Network Intrusion, MQTT-IoT-IDS2020, and IoT-23 intrusion detection datasets. Transfer learning is used to implement binary and multiclass classification using a convolutional neural network multiclass pre-trained model. Our proposed binary and multiclass classification models have achieved high accuracy, precision, recall, and F1 score compared to existing deep learning implementations.",
        "DOI": "10.1109/ACCESS.2021.3094024",
        "paper_author": "Ullah I.",
        "affiliation_name": "Ontario Tech University",
        "affiliation_city": "Oshawa",
        "affiliation_country": "Canada",
        "affiliation_id": "60002146",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Blockchain-Enhanced Data Sharing with Traceable and Direct Revocation in IIoT",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "264",
        "cover_date": "2021-11-01",
        "Abstract": "The industrial Internet of Things (IIoT) supports recent developments in data management and information services, as well as services for smart factories. Nowadays, many mature IIoT cloud platforms are available to serve smart factories. However, due to the semicredibility nature of the IIoT cloud platforms, how to achieve secure storage, access control, information update and deletion for smart factory data, as well as the tracking and revocation of malicious users has become an urgent problem. To solve these problems, in this article, a blockchain-enhanced security access control scheme that supports traceability and revocability has been proposed in IIoT for smart factories. The blockchain first performs unified identity authentication, and stores all public keys, user attribute sets, and revocation list. The system administrator then generates system parameters and issues private keys to users. The domain administrator is responsible for formulating domain security and privacy-protection policies, and performing encryption operations. If the attributes meet the access policies and the user's ID is not in the revocation list, they can obtain the intermediate decryption parameters from the edge/cloud servers. Malicious users can be tracked and revoked during all stages if needed, which ensures the system security under the Decisional Bilinear Diffie-Hellman (DBDH) assumption and can resist multiple attacks. The evaluation has shown that the size of the public/private keys is smaller compared to other schemes, and the overhead time is less for public key generation, data encryption, and data decryption stages.",
        "DOI": "10.1109/TII.2021.3049141",
        "paper_author": "Yu K.",
        "affiliation_name": "Sichuan Normal University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60014556",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Efficient and Secure Routing Protocol Based on Artificial Intelligence Algorithms with UAV-Assisted for Vehicular Ad Hoc Networks in Intelligent Transportation Systems",
        "publication": "IEEE Transactions on Intelligent Transportation Systems",
        "citied_by": "264",
        "cover_date": "2021-07-01",
        "Abstract": "Vehicular Ad hoc Networks (VANETs) that are considered as a subset of Mobile Ad hoc Networks (MANETs) can be applied in the field of transportation especially in Intelligent Transportation Systems (ITS). The routing process in these networks is a challenging task due to rapid topology changes, high vehicle mobility and frequent disconnection of links. Therefore, developing an efficient routing protocol that satisfies restriction of delay and minimum overhead is faced with many difficulties and limitations. Also, the detection of malicious vehicles is a significant task in VANETs. To address these issues, using Unmanned Aerial Vehicles (UAVs) can be helpful to cope with these limitations. In this paper, operation of UAVs in ad hoc mode and their cooperation with vehicles in VANETs are studied to help in the process of routing and detection of malicious vehicles. A routing protocol named VRU is proposed that includes two distinct ways of routing of data: (1) delivering packets of data between vehicles with the help of UAVs using a protocol named VRU_vu, and (2) routing packet of data between UAVs using a protocol named VRU_u. The NS-2.35 simulator under Linux Ubuntu 12.04 is utilized in order to appraise the performance of VRU routing components in an urban scenario. Also, VanetMobiSim generator of mobility and MobiSim are used to produce the motions of vehicles and to produce the motions of UAVs, respectively. The performance analysis displays that VRU protocol can improve the packet delivery ratio by 16% and detection ratio by 7% compared to other reviewed routing protocol. Also, VRU protocol decreases end-to-end delay by an average of 13% and overhead by 40%.",
        "DOI": "10.1109/TITS.2020.3041746",
        "paper_author": "Fatemidokht H.",
        "affiliation_name": "Shahid Bahonar University of Kerman",
        "affiliation_city": "Kerman",
        "affiliation_country": "Iran",
        "affiliation_id": "60031268",
        "affiliation_state": "Kerman"
    },
    {
        "paper_title": "AI-Driven Cybersecurity: An Overview, Security Intelligence Modeling and Research Directions",
        "publication": "SN Computer Science",
        "citied_by": "263",
        "cover_date": "2021-05-01",
        "Abstract": "Artificial intelligence (AI) is one of the key technologies of the Fourth Industrial Revolution (or Industry 4.0), which can be used for the protection of Internet-connected systems from cyber threats, attacks, damage, or unauthorized access. To intelligently solve today’s various cybersecurity issues, popular AI techniques involving machine learning and deep learning methods, the concept of natural language processing, knowledge representation and reasoning, as well as the concept of knowledge or rule-based expert systems modeling can be used. Based on these AI methods, in this paper, we present a comprehensive view on “AI-driven Cybersecurity” that can play an important role for intelligent cybersecurity services and management. The security intelligence modeling based on such AI methods can make the cybersecurity computing process automated and intelligent than the conventional security systems. We also highlight several research directions within the scope of our study, which can help researchers do future research in the area. Overall, this paper’s ultimate objective is to serve as a reference point and guidelines for cybersecurity researchers as well as industry professionals in the area, especially from an intelligent computing or AI-based technical point of view.",
        "DOI": "10.1007/s42979-021-00557-0",
        "paper_author": "Sarker I.H.",
        "affiliation_name": "Swinburne University of Technology",
        "affiliation_city": "Hawthorn",
        "affiliation_country": "Australia",
        "affiliation_id": "60030804",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "IoT and Cloud Computing Issues, Challenges and Opportunities: A Review",
        "publication": "Qubahan Academic Journal",
        "citied_by": "261",
        "cover_date": "2021-03-01",
        "Abstract": "With the exponential growth of the Industrial Internet of Things (IIoT), multiple outlets constantly produce a vast volume of data. It is unwise to locally store all the raw data in the IIoT devices since the end devices' energy, and storage spaces are strictly constrained by Self-organization and microorganisms. IoT networks enable out-sourced data collection and cloud storage irrespective of the resource-constrained nature of the IoT. For the next segment of observations, there is a sequence of unfamiliar safeguards for IoT and cloud integration problems. Cloud computing delivery is highly efficient, storage is becoming more and more current, and some groups are now altering their data from in-house records Cloud Computing Vendors' hubs. Intensive IoT applications for workloads and data are subject to challenges while utilizing cloud computing tools. In this paper, we research IoT and cloud computing and address cloud-compatible problems and computing techniques to promote IoT programs' stable transition to the Cloud.",
        "DOI": "10.48161/qaj.v1n2a36",
        "paper_author": "Abdulkareem N.M.",
        "affiliation_name": "Duhok Polytechnic University",
        "affiliation_city": "Duhok",
        "affiliation_country": "Iraq",
        "affiliation_id": "60107829",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Siamese Neural Network Based Few-Shot Learning for Anomaly Detection in Industrial Cyber-Physical Systems",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "261",
        "cover_date": "2021-08-01",
        "Abstract": "With the increasing population of Industry 4.0, both AI and smart techniques have been applied and become hotly discussed topics in industrial cyber-physical systems (CPS). Intelligent anomaly detection for identifying cyber-physical attacks to guarantee the work efficiency and safety is still a challenging issue, especially when dealing with few labeled data for cyber-physical security protection. In this article, we propose a few-shot learning model with Siamese convolutional neural network (FSL-SCNN), to alleviate the over-fitting issue and enhance the accuracy for intelligent anomaly detection in industrial CPS. A Siamese CNN encoding network is constructed to measure distances of input samples based on their optimized feature representations. A robust cost function design including three specific losses is then proposed to enhance the efficiency of training process. An intelligent anomaly detection algorithm is developed finally. Experiment results based on a fully labeled public dataset and a few labeled dataset demonstrate that our proposed FSL-SCNN can significantly improve false alarm rate (FAR) and F1 scores when detecting intrusion signals for industrial CPS security protection.",
        "DOI": "10.1109/TII.2020.3047675",
        "paper_author": "Zhou X.",
        "affiliation_name": "Shiga University",
        "affiliation_city": "Hikone",
        "affiliation_country": "Japan",
        "affiliation_id": "60033365",
        "affiliation_state": "Shiga"
    },
    {
        "paper_title": "Privacy-preserving blockchain-based federated learning for traffic flow prediction",
        "publication": "Future Generation Computer Systems",
        "citied_by": "258",
        "cover_date": "2021-04-01",
        "Abstract": "As accurate and timely traffic flow information is extremely important for traffic management, traffic flow prediction has become a vital component of intelligent transportation systems. However, existing traffic flow prediction methods based on centralized machine learning need to gather raw data for model training, which involves serious privacy exposure risks. To address these problems, federated learning that shares model updates without exchanging raw data, has recently been introduced as an efficient solution for achieving privacy protection. However, the existing federated learning frameworks are based on a centralized model coordinator that still suffers from severe security challenges, such as a single point of failure. Thereby, a consortium blockchain-based federated learning framework is proposed to enable decentralized, reliable, and secure federated learning without a centralized model coordinator. In the proposed framework, the model updates from distributed vehicles are verified by miners to prevent unreliable model updates and are then stored on the blockchain. In addition, to further protect model privacy on the blockchain, a differential privacy method with a noise-adding mechanism is applied for the blockchain-based federated learning framework. Numerical results illustrate that the proposed schemes can effectively prevent data poisoning attacks and improve the privacy protection of model updates for secure and privacy-preserving traffic flow prediction.",
        "DOI": "10.1016/j.future.2020.12.003",
        "paper_author": "Qi Y.",
        "affiliation_name": "University of Electronic Science and Technology of China",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60005465",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Embedding Blockchain Technology into IoT for Security: A Survey",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "257",
        "cover_date": "2021-07-01",
        "Abstract": "In recent years, the Internet of Things (IoT) has made great progress. The interconnection between IoT and the Internet enables real-time information processing and transaction implementation through heterogeneous intelligent devices. But the security, the privacy, and the reliability of IoT are key challenges that limit its development. The features of the blockchain, such as decentralization, consensus mechanism, data encryption, and smart contracts, are suitable for building distributed IoT systems to prevent potential attacks and to reduce transaction costs. As a decentralized and transparent database platform, blockchain has the potential to raise the performance of IoT security to a higher level. This article systematically analyzes state of the art of IoT security based on the blockchain, paying special attention to the security features, issues, technologies, approaches, and related scenarios in blockchain-embedded IoT. The integration and interoperation of blockchain and IoT is an important and foreseeable development in the computational communication system.",
        "DOI": "10.1109/JIOT.2021.3060508",
        "paper_author": "Xu L.D.",
        "affiliation_name": "Old Dominion University",
        "affiliation_city": "Norfolk",
        "affiliation_country": "United States",
        "affiliation_id": "60007652",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "Recent Advances in the Internet-of-Medical-Things (IoMT) Systems Security",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "256",
        "cover_date": "2021-06-01",
        "Abstract": "The rapid evolutions in microcomputing, mini-hardware manufacturing, and machine-to-machine (M2M) communications have enabled novel Internet-of-Things (IoT) solutions to reshape many networking applications. Healthcare systems are among these applications that have been revolutionized with IoT, introducing an IoT branch known as the Internet-of-Medical Things (IoMT) systems. IoMT systems allow remote monitoring of patients with chronic diseases. Thus, it can provide timely patients' diagnostic that can save their life in case of emergencies. However, security in these critical systems is a major challenge facing their wide utilization. In this article, we present state-of-the-art techniques to secure IoMT systems' data during collection, transmission, and storage. We comprehensively overview IoMT systems' potential attacks, including physical and network attacks. Our findings reveal that most security techniques do not consider various types of attacks. Hence, we propose a security framework that combines several security techniques. The framework covers IoMT security requirements and can mitigate most of its known attacks.",
        "DOI": "10.1109/JIOT.2020.3045653",
        "paper_author": "Ghubaish A.",
        "affiliation_name": "McKelvey School of Engineering",
        "affiliation_city": "St. Louis",
        "affiliation_country": "United States",
        "affiliation_id": "60105336",
        "affiliation_state": "MO"
    },
    {
        "paper_title": "Security and privacy of electronic health records: Concerns and challenges",
        "publication": "Egyptian Informatics Journal",
        "citied_by": "255",
        "cover_date": "2021-07-01",
        "Abstract": "Electronic Medical Records (EMRs) can provide many benefits to physicians, patients and healthcare services if they are adopted by healthcare organizations. But concerns about privacy and security that relate to patient information can cause there to be relatively low EMR adoption by a number of health institutions. Safeguarding a huge quantity of health data that is sensitive at separate locations in different forms is one of the big challenges of EMR. A review is presented in this paper to identify the health organizations’ privacy and security concerns and to examine solutions that could address the various concerns that have been identified. It shows the IT security incidents that have taken place in healthcare settings. The review will enable researchers to understand these security and privacy concerns and solutions that are available.",
        "DOI": "10.1016/j.eij.2020.07.003",
        "paper_author": "Keshta I.",
        "affiliation_name": "Almaarefa University",
        "affiliation_city": "Riyadh",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60194974",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Triboelectric nanogenerator based self-powered sensor for artificial intelligence",
        "publication": "Nano Energy",
        "citied_by": "253",
        "cover_date": "2021-06-01",
        "Abstract": "Triboelectric nanogenerator based sensor has excellent material compatibility, low cost, and flexibility, which is a unique candidate technology for artificial intelligence. Triboelectric nanogenerators effectively provide critical infrastructure for new generation of sensing systems that collect information by large amounts of self-powered sensors. This review mainly discusses capability and prospect of triboelectric nanogenerators being applied to intelligent sports, security, touch control, and document management systems. The above fields have paid increasing attention in artificial intelligence technologies, such as machine learning, big data processing and cloud computing, demanding huge amount of sensors and complicated sensors network.",
        "DOI": "10.1016/j.nanoen.2021.105887",
        "paper_author": "Zhou Y.",
        "affiliation_name": "University of Electronic Science and Technology of China",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60005465",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Deep-Learning-Enhanced Multitarget Detection for End-Edge-Cloud Surveillance in Smart IoT",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "252",
        "cover_date": "2021-08-15",
        "Abstract": "Along with the rapid development of cloud computing, IoT, and AI technologies, cloud video surveillance (CVS) has become a hotly discussed topic, especially when facing the requirement of real-time analysis in smart applications. Object detection usually plays an important role for environment monitoring and activity tracking in surveillance system. The emerging edge-cloud computing paradigm provides us an opportunity to deal with the continuously generated huge amount of surveillance data in an on-site manner across IoT systems. However, the detection performance is still far away from satisfactions due to the complex surveilling environment. In this study, we focus on the multitarget detection for real-time surveillance in smart IoT systems. A newly designed deep neural network model called A-YONet, which is constructed by combining the advantages of YOLO and MTCNN, is proposed to be deployed in an end-edge-cloud surveillance system, in order to realize the lightweight training and feature learning with limited computing sources. An intelligent detection algorithm is then developed based on a preadjusting scheme of anchor box and a multilevel feature fusion mechanism. Experiments and evaluations using two data sets, including one public data set and one homemade data set obtained in a real surveillance system, demonstrate the effectiveness of our proposed method in enhancing training efficiency and detection precision, especially for multitarget detection in smart IoT application developments.",
        "DOI": "10.1109/JIOT.2021.3077449",
        "paper_author": "Zhou X.",
        "affiliation_name": "Shiga University",
        "affiliation_city": "Hikone",
        "affiliation_country": "Japan",
        "affiliation_id": "60033365",
        "affiliation_state": "Shiga"
    },
    {
        "paper_title": "Underground hydrogen storage: Influencing parameters and future outlook",
        "publication": "Advances in Colloid and Interface Science",
        "citied_by": "251",
        "cover_date": "2021-08-01",
        "Abstract": "Underground hydrogen storage (UHS) is a promising technology with which large quantities of H2 can potentially be stored in the subsurface safely, economically and efficiently. As UHS is a relatively new technology, we critically reviewed all available data related to solid properties, fluid properties and solid-fluid interactions relevant to UHS. We also provide clear conclusions, and highlight research gaps. This review therefore advances fundamental understanding of UHS at multiple physical scales and provides key guidance for UHS project operations at reservoir scale",
        "DOI": "10.1016/j.cis.2021.102473",
        "paper_author": "Pan B.",
        "affiliation_name": "University of Calgary",
        "affiliation_city": "Calgary",
        "affiliation_country": "Canada",
        "affiliation_id": "60002306",
        "affiliation_state": "AB"
    },
    {
        "paper_title": "Data Science and Analytics: An Overview from Data-Driven Smart Computing, Decision-Making and Applications Perspective",
        "publication": "SN Computer Science",
        "citied_by": "250",
        "cover_date": "2021-09-01",
        "Abstract": "The digital world has a wealth of data, such as internet of things (IoT) data, business data, health data, mobile data, urban data, security data, and many more, in the current age of the Fourth Industrial Revolution (Industry 4.0 or 4IR). Extracting knowledge or useful insights from these data can be used for smart decision-making in various applications domains. In the area of data science, advanced analytics methods including machine learning modeling can provide actionable insights or deeper knowledge about data, which makes the computing process automatic and smart. In this paper, we present a comprehensive view on “Data Science” including various types of advanced analytics methods that can be applied to enhance the intelligence and capabilities of an application through smart decision-making in different scenarios. We also discuss and summarize ten potential real-world application domains including business, healthcare, cybersecurity, urban and rural data science, and so on by taking into account data-driven smart computing and decision making. Based on this, we finally highlight the challenges and potential research directions within the scope of our study. Overall, this paper aims to serve as a reference point on data science and advanced analytics to the researchers and decision-makers as well as application developers, particularly from the data-driven solution point of view for real-world problems.",
        "DOI": "10.1007/s42979-021-00765-8",
        "paper_author": "Sarker I.H.",
        "affiliation_name": "Swinburne University of Technology",
        "affiliation_city": "Hawthorn",
        "affiliation_country": "Australia",
        "affiliation_id": "60030804",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Survey on Multi-Access Edge Computing Security and Privacy",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "250",
        "cover_date": "2021-04-01",
        "Abstract": "The European Telecommunications Standards Institute (ETSI) has introduced the paradigm of Multi-Access Edge Computing (MEC) to enable efficient and fast data processing in mobile networks. Among other technological requirements, security and privacy are significant factors in the realization of MEC deployments. In this paper, we analyse the security and privacy of the MEC system. We introduce a thorough investigation of the identification and the analysis of threat vectors in the ETSI standardized MEC architecture. Furthermore, we analyse the vulnerabilities leading to the identified threat vectors and propose potential security solutions to overcome these vulnerabilities. The privacy issues of MEC are also highlighted, and clear objectives for preserving privacy are defined. Finally, we present future directives to enhance the security and privacy of MEC services.",
        "DOI": "10.1109/COMST.2021.3062546",
        "paper_author": "Ranaweera P.",
        "affiliation_name": "University College Dublin",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60005141",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "Sustainable industrial and operation engineering trends and challenges Toward Industry 4.0: a data driven analysis",
        "publication": "Journal of Industrial and Production Engineering",
        "citied_by": "249",
        "cover_date": "2021-01-01",
        "Abstract": "This study supplies contributions to the existing literature with a state-of-the-art bibliometric review of sustainable industrial and operation engineering as the field moves toward Industry 4.0, and guidance for future studies and practical achievements. Although industrial and operation engineering is being promoted forward to sustainability, the systematization of the knowledge that forms firms’ manufacturing and operations and encompasses their wide concepts and abundant complementary elements is still absent. This study aims to analyze contemporary sustainable industrial and operations engineering in Industry 4.0 context. The bibliometric analysis and fuzzy Delphi method are proposed. Resulting in a total of 30 indicators that are criticized and clustered into eight study groups, including lean manufacturing in Industry 4.0, cyber-physical production system, big data-driven and smart communications, safety and security, artificial intelligence for sustainability, the circular economy in a digital environment, business intelligence and virtual reality, and environmental sustainability.",
        "DOI": "10.1080/21681015.2021.1950227",
        "paper_author": "Tseng M.L.",
        "affiliation_name": "Asia University",
        "affiliation_city": "Taichung",
        "affiliation_country": "Taiwan",
        "affiliation_id": "60072429",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Secure and energy-efficient smart building architecture with emerging technology IoT",
        "publication": "Computer Communications",
        "citied_by": "249",
        "cover_date": "2021-08-01",
        "Abstract": "With the advent of the Internet-of-Things (IoT), it is considered to be one of the latest innovations that offer interesting opportunities for different vertical industries. One of the most relevant IoT technology areas is smart construction. IoT operates in several sectors on a daily basis; implementation includes smart building, smart grids, smart cities, smart houses, physical defense, e-health, asset, and transportation management, but it is not restricted to this. Support from smart IoT buildings is an IoT-level, connected, and cost-effective system. Commercial space has major requirements in terms of comfort, accessibility, security, and energy management. Such requirements can be served organically by IoT-based systems. As the supply of energy has been exhausted and energy demand has risen, there has been a growing focus on energy usage and the maintenance of buildings. With the use of evolving IoT technology, we present a secure and energy-efficient smart building architecture. Every device is known by its unique address, and one of the key web transfer protocols is the Constrained Application Protocol (CoAP). It is an application layer protocol that does not use protected channels for data transfer. Automatic key management, confidentiality, authentication, and data integrity are all features of the Datagram Transport Layer Protection (DTLS). To achieve energy efficiency, we propose a smart construction architecture that, through IoT, manages the performance of all technological systems. The results of the simulation show that the energy consumption is lowered by about 30.86% with the use of the CoAP in the smart building, which is less than the Message Queuing Telemetry Transport case (MQTT). This paper also aims to observe how to integrate the DTLS protocol with the Secure Hash Algorithm (SHA-256) using optimizations from the Certificate Authority (CA) to improve security.",
        "DOI": "10.1016/j.comcom.2021.06.003",
        "paper_author": "Kumar A.",
        "affiliation_name": "Maharishi Markandeshwar (Deemed to be University), Mullana",
        "affiliation_city": "Ambala",
        "affiliation_country": "India",
        "affiliation_id": "60094525",
        "affiliation_state": "HR"
    },
    {
        "paper_title": "Hydrogen Wettability of Sandstone Reservoirs: Implications for Hydrogen Geo-Storage",
        "publication": "Geophysical Research Letters",
        "citied_by": "249",
        "cover_date": "2021-02-16",
        "Abstract": "Hydrogen is currently assessed as a future clean fuel in a hydrogen economy. However, one key problem with implementing a full-scale hydrogen economy is hydrogen storage (as hydrogen is highly compressible and volatile). One solution for this problem is hydrogen geo-storage, where compressed hydrogen is injected into geological formations, and the hydrogen can be withdrawn again at any time. However, there is a serious lack of data for realistic geologic conditions, including for hydrogen-rock wettability, which is proven to determine injectivities, withdrawal rates, storage capacities, and containment security. We thus measured this parameter at various geo-storage conditions. For a realistic storage scenario in a deep sandstone aquifer, we found that the rock (quartz) was weakly water-wet or intermediate-wet. Increasing pressure, temperature, and organic surface concentration increased hydrogen wettability. This study, thus, provides fundamental data and aids in the industrial-scale implementation of a future hydrogen economy.",
        "DOI": "10.1029/2020GL090814",
        "paper_author": "Iglauer S.",
        "affiliation_name": "Edith Cowan University",
        "affiliation_city": "Perth",
        "affiliation_country": "Australia",
        "affiliation_id": "60105210",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Secure blockchain enabled Cyber–physical systems in healthcare using deep belief network with ResNet model",
        "publication": "Journal of Parallel and Distributed Computing",
        "citied_by": "248",
        "cover_date": "2021-07-01",
        "Abstract": "Cyber–physical system (CPS) is the incorporation of physical processes with processing and data transmission. Cybersecurity is a primary and challenging issue in healthcare due to the legal and ethical perspective of the patient's medical data. Therefore, the design of CPS model for healthcare applications requires special attention for ensuring data security. To resolve this issue, this paper proposes a secure intrusion, detection with blockchain based data transmission with classification model for CPS in healthcare sector. The presented model performs data acquisition process using sensor devices and intrusion detection takes place using deep belief network (DBN) model. In addition, the presented model uses a multiple share creation (MSC) model for the generation of multiple shares of the captured image, and thereby achieves privacy and security. Besides, the blockchain technology is applied for secure data transmission to the cloud server, which executes the residual network (ResNet) based classification model to identify the presence of the disease. The experimental validation of the presented model takes place using NSL-KDD 2015, CIDDS-001 and ISIC dataset. The simulation outcome pointed out the effective outcome of the presented model.",
        "DOI": "10.1016/j.jpdc.2021.03.011",
        "paper_author": "Nguyen G.N.",
        "affiliation_name": "Duy Tan University",
        "affiliation_city": "Da Nang",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60111656",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Multifunctional metasurfaces enabled by simultaneous and independent control of phase and amplitude for orthogonal polarization states",
        "publication": "Light: Science and Applications",
        "citied_by": "247",
        "cover_date": "2021-12-01",
        "Abstract": "Monochromatic light can be characterized by its three fundamental properties: amplitude, phase, and polarization. In this work, we propose a versatile, transmission-mode all-dielectric metasurface platform that can independently manipulate the phase and amplitude for two orthogonal states of polarization in the visible frequency range. For proof-of-concept experimental demonstration, various single-layer metasurfaces composed of subwavelength-spaced titanium-dioxide nanopillars are designed, fabricated, and characterized to exhibit the ability of polarization-switchable multidimensional light-field manipulation, including polarization-switchable grayscale nanoprinting, nonuniform cylindrical lensing, and complex-amplitude holography. We envision the metasurface platform demonstrated here to open new possibilities toward creating compact multifunctional optical devices for applications in polarization optics, information encoding, optical data storage, and security.",
        "DOI": "10.1038/s41377-021-00552-3",
        "paper_author": "Liu M.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "The 10-m crop type maps in Northeast China during 2017–2019",
        "publication": "Scientific Data",
        "citied_by": "246",
        "cover_date": "2021-12-01",
        "Abstract": "Northeast China is the leading grain production region in China where one-fifth of the national grain is produced; however, consistent and reliable crop maps are still unavailable, impeding crop management decisions for regional and national food security. Here, we produced annual 10-m crop maps of the major crops (maize, soybean, and rice) in Northeast China from 2017 to 2019, by using (1) a hierarchical mapping strategy (cropland mapping followed by crop classification), (2) agro-climate zone-specific random forest classifiers, (3) interpolated and smoothed 10-day Sentinel-2 time series data, and (4) optimized features from spectral, temporal, and texture characteristics of the land surface. The resultant maps have high overall accuracies (OA) spanning from 0.81 to 0.86 based on abundant ground truth data. The satellite estimates agreed well with the statistical data for most of the municipalities (R2 ≥ 0.83, p < 0.01). This is the first effort on regional annual crop mapping in China at the 10-m resolution, which permits assessing the performance of the soybean rejuvenation plan and crop rotation practice in China.",
        "DOI": "10.1038/s41597-021-00827-9",
        "paper_author": "You N.",
        "affiliation_name": "Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60031150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Mechanisms Regulating the Dynamics of Photosynthesis Under Abiotic Stresses",
        "publication": "Frontiers in Plant Science",
        "citied_by": "245",
        "cover_date": "2021-01-28",
        "Abstract": "Photosynthesis sustains plant life on earth and is indispensable for plant growth and development. Factors such as unfavorable environmental conditions, stress regulatory networks, and plant biochemical processes limits the photosynthetic efficiency of plants and thereby threaten food security worldwide. Although numerous physiological approaches have been used to assess the performance of key photosynthetic components and their stress responses, though, these approaches are not extensive enough and do not favor strategic improvement of photosynthesis under abiotic stresses. The decline in photosynthetic capacity of plants due to these stresses is directly associated with reduction in yield. Therefore, a detailed information of the plant responses and better understanding of the photosynthetic machinery could help in developing new crop plants with higher yield even under stressed environments. Interestingly, cracking of signaling and metabolic pathways, identification of some key regulatory elements, characterization of potential genes, and phytohormone responses to abiotic factors have advanced our knowledge related to photosynthesis. However, our understanding of dynamic modulation of photosynthesis under dramatically fluctuating natural environments remains limited. Here, we provide a detailed overview of the research conducted on photosynthesis to date, and highlight the abiotic stress factors (heat, salinity, drought, high light, and heavy metal) that limit the performance of the photosynthetic machinery. Further, we reviewed the role of transcription factor genes and various enzymes involved in the process of photosynthesis under abiotic stresses. Finally, we discussed the recent progress in the field of biodegradable compounds, such as chitosan and humic acid, and the effect of melatonin (bio-stimulant) on photosynthetic activity. Based on our gathered researched data set, the logical concept of photosynthetic regulation under abiotic stresses along with improvement strategies will expand and surely accelerate the development of stress tolerance mechanisms, wider adaptability, higher survival rate, and yield potential of plant species.",
        "DOI": "10.3389/fpls.2020.615942",
        "paper_author": "Muhammad I.",
        "affiliation_name": "Northwest A&amp;F University",
        "affiliation_city": "Yangling",
        "affiliation_country": "China",
        "affiliation_id": "60031041",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "A Survey on Security and Privacy Issues in Edge-Computing-Assisted Internet of Things",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "245",
        "cover_date": "2021-03-15",
        "Abstract": "Internet of Things (IoT) is an innovative paradigm envisioned to provide massive applications that are now part of our daily lives. Millions of smart devices are deployed within complex networks to provide vibrant functionalities, including communications, monitoring, and controlling of critical infrastructures. However, this massive growth of IoT devices and the corresponding huge data traffic generated at the edge of the network created additional burdens on the state-of-The-Art centralized cloud computing paradigm due to the bandwidth and resource scarcity. Hence, edge computing (EC) is emerging as an innovative strategy that brings data processing and storage near to the end users, leading to what is called the EC-Assisted IoT. Although this paradigm provides unique features and enhanced Quality of Service (QoS), it also introduces huge risks in data security and privacy aspects. This article conducts a comprehensive survey on security and privacy issues in the context of EC-Assisted IoT. In particular, we first present an overview of EC-Assisted IoT, including definitions, applications, architecture, advantages, and challenges. Second, we define security and privacy in the context of EC-Assisted IoT. Then, we extensively discuss the major classifications of attacks in EC-Assisted IoT and provide possible solutions and countermeasures along with the related research efforts. After that, we further classify some security and privacy issues as discussed in the literature based on security services and based on security objectives and functions. Finally, several open challenges and future research directions for secure EC-Assisted IoT paradigm are also extensively provided.",
        "DOI": "10.1109/JIOT.2020.3015432",
        "paper_author": "Alwarafy A.",
        "affiliation_name": "Hamad Bin Khalifa University, College of Science and Engineering",
        "affiliation_city": "Doha",
        "affiliation_country": "Qatar",
        "affiliation_id": "60113885",
        "affiliation_state": "Ad-Dawhah"
    },
    {
        "paper_title": "Increasing impact of warm droughts on northern ecosystem productivity over recent decades",
        "publication": "Nature Climate Change",
        "citied_by": "243",
        "cover_date": "2021-09-01",
        "Abstract": "Climate extremes such as droughts and heatwaves have a large impact on terrestrial carbon uptake by reducing gross primary production (GPP). While the evidence for increasing frequency and intensity of climate extremes over the last decades is growing, potential systematic adverse shifts in GPP have not been assessed. Using observationally-constrained and process-based model data, we estimate that particularly northern midlatitude ecosystems experienced a +10.6% increase in negative GPP extremes in the period 2000–2016 compared to 1982–1998. We attribute this increase predominantly to a greater impact of warm droughts, in particular over northern temperate grasslands (+95.0% corresponding mean increase) and croplands (+84.0%), in and after the peak growing season. These results highlight the growing vulnerability of ecosystem productivity to warm droughts, implying increased adverse impacts of these climate extremes on terrestrial carbon sinks as well as a rising pressure on global food security.",
        "DOI": "10.1038/s41558-021-01112-8",
        "paper_author": "Gampe D.",
        "affiliation_name": "Universität Augsburg",
        "affiliation_city": "Augsburg",
        "affiliation_country": "Germany",
        "affiliation_id": "60016060",
        "affiliation_state": "Bayern"
    },
    {
        "paper_title": "Cultivated land protection and rational use in China",
        "publication": "Land Use Policy",
        "citied_by": "241",
        "cover_date": "2021-07-01",
        "Abstract": "Cultivated land protection is an important way to ensure food security, social stability and sustainable development. As one of the main causes of cultivated land loss, the spatio-temporal pattern of illegal cultivated land use and driving forces have not been systematically investigated. This study first reviewed the evolution of China's cultivated land protection policy in the past four decades, then used spatial analysis technology to explore the spatio-temporal patterns of China's illegal cultivated land use, and finally applied an econometric model to assess the impact of population growth, economic development and rising housing prices on illegal cultivated land use at the national and regional levels based on the balanced provincial panel data from 1999 to 2017. The results show that in the past 40 years, China has attached great importance to the protection of cultivated land, and established a relatively perfect cultivated land protection system. The quantity of cultivated land in China kept a dynamic balance on the whole, but the quality of cultivated land has dropped sharply, and regional human-land conflicts has become prominent. The driving forces of cultivated land loss in China varied across regions. Illegal use of cultivated land was also one of the important driving forces of cultivated land reduction in China. The number of illegal land use cases and the area appropriated have experienced a process of first increase and then decrease over the past two decades. The accumulated cases and area of illegal farmland use in the eastern region were larger than that in the central and western regions, but both showed a rapid downward trend over the past two decades, demonstrating that the illegal use of cultivated land in eastern China has been controlled to a certain extent. Population growth and land urbanization have a significant positive impact on illegal cultivated land use area in China and its three regions, while economic development has not driven but curbed illegal land use. The rise of commercial housing prices has no significant impact on illegal farmland use in rural China. We proposed measures to further control the illegal use of cultivated land, and believed that it is necessary and urgent to stop illegal occupation of cultivated land from the source",
        "DOI": "10.1016/j.landusepol.2021.105454",
        "paper_author": "Zhou Y.",
        "affiliation_name": "Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60031150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A survey on sliding mode control for networked control systems",
        "publication": "International Journal of Systems Science",
        "citied_by": "241",
        "cover_date": "2021-01-01",
        "Abstract": "In the framework of the networked control systems (NCSs), the components are connected with each other over a shared band-limited network. The merits of NCSs include easy extensibility, resource sharing, high reliability and so forth. However, the insertion of the communication network brings many challenges, such as network-induced phenomena and cyber-security, which should be handled properly. On the other hand, the sliding mode control (SMC) has become an effective scheme for the synthesis of NCSs due to its strong robustness and SMC has wide applications in NCSs. In this paper, some recent advances on SMC for NCSs are reviewed. In particular, some new SMC schemes for NCSs subject to time-delay, packet losses, quantisation and uncertainty/disturbance are summarised firstly. Subsequently, the problem of SMC for NCSs under scheduling protocols is discussed, where different communication protocols are introduced for the energy saving purpose during the synthesis of NCSs. Next, some recent results on SMC for NCSs with actuator/sensor fault and cyber-attack are recalled. Finally, the conclusion is provided and the potential research challenges on SMC for NCSs are pointed out.",
        "DOI": "10.1080/00207721.2021.1885082",
        "paper_author": "Hu J.",
        "affiliation_name": "Harbin University of Science and Technology",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "60024758",
        "affiliation_state": "Heilongjiang"
    },
    {
        "paper_title": "Telehealth utilization during the Covid-19 pandemic: A systematic review",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "240",
        "cover_date": "2021-11-01",
        "Abstract": "During the coronavirus disease (COVID-19) pandemic, different technologies, including telehealth, are maximised to mitigate the risks and consequences of the disease. Telehealth has been widely utilised because of its usability and safety in providing healthcare services during the COVID-19 pandemic. However, a systematic literature review which provides extensive evidence on the impact of COVID-19 through telehealth and which covers multiple directions in a large-scale research remains lacking. This study aims to review telehealth literature comprehensively since the pandemic started. It also aims to map the research landscape into a coherent taxonomy and characterise this emerging field in terms of motivations, open challenges and recommendations. Articles related to telehealth during the COVID-19 pandemic were systematically searched in the WOS, IEEE, Science Direct, Springer and Scopus databases. The final set included (n = 86) articles discussing telehealth applications with respect to (i) control (n = 25), (ii) technology (n = 14) and (iii) medical procedure (n = 47). Since the beginning of the pandemic, telehealth has been presented in diverse cases. However, it still warrants further attention. Regardless of category, the articles focused on the challenges which hinder the maximisation of telehealth in such times and how to address them. With the rapid increase in the utilization of telehealth in different specialised hospitals and clinics, a potential framework which reflects the authors’ implications of the future application and opportunities of telehealth has been established. This article improves our understanding and reveals the full potential of telehealth during these difficult times and beyond.",
        "DOI": "10.1016/j.compbiomed.2021.104878",
        "paper_author": "Garfan S.",
        "affiliation_name": "Universiti Pendidikan Sultan Idris",
        "affiliation_city": "Tanjong Malim",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60103633",
        "affiliation_state": "Perak"
    },
    {
        "paper_title": "A blockchain-based approach for drug traceability in healthcare supply chain",
        "publication": "IEEE Access",
        "citied_by": "240",
        "cover_date": "2021-01-01",
        "Abstract": "Healthcare supply chains are complex structures spanning across multiple organizational and geographical boundaries, providing critical backbone to services vital for everyday life. The inherent complexity of such systems can introduce impurities including inaccurate information, lack of transparency and limited data provenance. Counterfeit drugs is one consequence of such limitations within existing supply chains which not only has serious adverse impact on human health but also causes severe economic loss to the healthcare industry. Consequently, existing studies have emphasized the need for a robust, end-to-end track and trace system for pharmaceutical supply chains. Therein, an end-to-end product tracking system across the pharmaceutical supply chain is paramount to ensuring product safety and eliminating counterfeits. Most existing track and trace systems are centralized leading to data privacy, transparency and authenticity issues in healthcare supply chains. In this article, we present an Ethereum blockchain-based approach leveraging smart contracts and decentralized off-chain storage for efficient product traceability in the healthcare supply chain. The smart contract guarantees data provenance, eliminates the need for intermediaries and provides a secure, immutable history of transactions to all stakeholders. We present the system architecture and detailed algorithms that govern the working principles of our proposed solution. We perform testing and validation, and present cost and security analysis of the system to evaluate its effectiveness to enhance traceability within pharmaceutical supply chains.",
        "DOI": "10.1109/ACCESS.2021.3049920",
        "paper_author": "Musamih A.",
        "affiliation_name": "Khalifa University of Science and Technology",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60104134",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "An effective intrusion detection approach using SVM with naïve Bayes feature embedding",
        "publication": "Computers and Security",
        "citied_by": "239",
        "cover_date": "2021-04-01",
        "Abstract": "Network security has become increasingly important in recent decades, while intrusion detection system plays a critical role in protecting it. Various machine learning techniques have been applied to intrusion detection, among which SVM has been considered as an effective method. However, existing studies rarely take the data quality into consideration, which is essential for constructing a well-performed intrusion detection system beyond machine learning techniques. In this paper, we propose an effective intrusion detection framework based on SVM with naïve Bayes feature embedding. Specifically, the naïve Bayes feature transformation technique is implemented on the original features to generate new data with high quality; then, an SVM classifier is trained using the transformed data to build the intrusion detection model. Experiments on multiple datasets in intrusion detection domain validate that the proposed detection method can achieve good and robust performances, with 93.75% accuracy on UNSW-NB15 dataset, 98.92% accuracy on CICIDS2017 dataset, 99.35% accuracy on NSL-KDD dataset and 98.58% accuracy on Kyoto 2006+ dataset. Furthermore, our method possesses huge advantages in terms of accuracy, detection rate and false alarm rate when compared to other methods.",
        "DOI": "10.1016/j.cose.2020.102158",
        "paper_author": "Gu J.",
        "affiliation_name": "Peking University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014966",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A predictive machine learning application in agriculture: Cassava disease detection and classification with imbalanced dataset using convolutional neural networks",
        "publication": "Egyptian Informatics Journal",
        "citied_by": "238",
        "cover_date": "2021-03-01",
        "Abstract": "This work is inspired by Kaggle competition which was part of the Fine-Grained Visual Categorization workshop at CVPR 2019 (Conference on Computer Vision and Pattern Recognition) we participated in. It aimed at detecting cassava diseases using 5 fine-grained cassava leaf disease categories with 10,000, labeled images collected during a regular survey in Uganda. Traditionally, this detection is done mostly through physical inspection and supervision of cassava plants in the garden by farmers or agricultural extension workers from NAADS (National Agricultural Advisory Services) and then reported to NARO (National Agricultural Advisory Services) for further analysis. However, this can be tiresome, capital intensive, and lacks the ability to detect cassava infection timely to help farmers apply preventive techniques to the non-infected cassava plants in order to improve on yields which subsequently increases African food basket leading to food security which fights famine. Using the dataset provided to train CNNs (Convolutional Neural Networks) to achieve high accuracy was very challenging due to two reasons: the dataset was small in size and has high-class imbalance being heavily biased towards CMD (Cassava Mosaic Disease) and CBB (Cassava Brown Streak Virus Disease) classes. Class imbalance is problematic in machine learning and exists in many domains. Note that, not all world data is balanced, in fact, most of the time you will not be extremely lucky to get a perfectly balanced real-world dataset, in recent years, a lot of research has been done for two-class problems such as fraudulent credit card and tumor detection among others. Interestingly, class imbalance in multi-class image datasets has received little attention. This paper, therefore, focused on techniques to achieve an accuracy score of over 93% with class weight, SMOTE (Synthetic Minority Over-sampling Technique) and focal loss with deep convolutional neural networks from scratch. The goal was to counter high-class imbalance so that the model can accurately predict underrepresented classes.",
        "DOI": "10.1016/j.eij.2020.02.007",
        "paper_author": "Sambasivam G.",
        "affiliation_name": "ISBAT University",
        "affiliation_city": "Kampala",
        "affiliation_country": "Uganda",
        "affiliation_id": "60273487",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Lightweight Cryptography Algorithms for Resource-Constrained IoT Devices: A Review, Comparison and Research Opportunities",
        "publication": "IEEE Access",
        "citied_by": "237",
        "cover_date": "2021-01-01",
        "Abstract": "IoT is becoming more common and popular due to its wide range of applications in various domains. They collect data from the real environment and transfer it over the networks. There are many challenges while deploying IoT in a real-world, varying from tiny sensors to servers. Security is considered as the number one challenge in IoT deployments, as most of the IoT devices are physically accessible in the real world and many of them are limited in resources (such as energy, memory, processing power and even physical space). In this paper, we are focusing on these resource-constrained IoT devices (such as RFID tags, sensors, smart cards, etc.) as securing them in such circumstances is a challenging task. The communication from such devices can be secured by a mean of lightweight cryptography, a lighter version of cryptography. More than fifty lightweight cryptography (plain encryption) algorithms are available in the market with a focus on a specific application(s), and another 57 algorithms have been submitted by the researchers to the NIST competition recently. To provide a holistic view of the area, in this paper, we have compared the existing algorithms in terms of implementation cost, hardware and software performances and attack resistance properties. Also, we have discussed the demand and a direction for new research in the area of lightweight cryptography to optimize balance amongst cost, performance and security.",
        "DOI": "10.1109/ACCESS.2021.3052867",
        "paper_author": "Thakor V.A.",
        "affiliation_name": "Teesside University",
        "affiliation_city": "Middlesbrough",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60025655",
        "affiliation_state": "North Yorkshire"
    },
    {
        "paper_title": "A survey of autonomous vehicles: Enabling communication technologies and challenges",
        "publication": "Sensors (Switzerland)",
        "citied_by": "237",
        "cover_date": "2021-02-01",
        "Abstract": "The Department of Transport in the United Kingdom recorded 25,080 motor vehicle fatalities in 2019. This situation stresses the need for an intelligent transport system (ITS) that improves road safety and security by avoiding human errors with the use of autonomous vehicles (AVs). There-fore, this survey discusses the current development of two main components of an ITS: (1) gathering of AVs surrounding data using sensors; and (2) enabling vehicular communication technologies. First, the paper discusses various sensors and their role in AVs. Then, various communication technologies for AVs to facilitate vehicle to everything (V2X) communication are discussed. Based on the transmission range, these technologies are grouped into three main categories: long-range, medium-range and short-range. The short-range group presents the development of Bluetooth, ZigBee and ultra-wide band communication for AVs. The medium-range examines the properties of dedicated short-range communications (DSRC). Finally, the long-range group presents the cellular-vehicle to everything (C-V2X) and 5G-new radio (5G-NR). An important characteristic which differentiates each category and its suitable application is latency. This research presents a comprehensive study of AV technologies and identifies the main advantages, disadvantages, and challenges.",
        "DOI": "10.3390/s21030706",
        "paper_author": "Ahangar M.N.",
        "affiliation_name": "University of Huddersfield",
        "affiliation_city": "Huddersfield",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60032343",
        "affiliation_state": "West Yorkshire"
    },
    {
        "paper_title": "A survey of IoT applications in blockchain systems: Architecture, consensus, and traffic modeling",
        "publication": "ACM Computing Surveys",
        "citied_by": "235",
        "cover_date": "2021-01-31",
        "Abstract": "Blockchain technology can be extensively applied in diverse services, including online micro-payments, supply chain tracking, digital forensics, health-care record sharing, and insurance payments. Extending the technology to the Internet of things (IoT), we can obtain a verifiable and traceable IoT network. Emerging research in IoT applications exploits blockchain technology to record transaction data, optimize current system performance, or construct next-generation systems, which can provide additional security, automatic transaction management, decentralized platforms, offline-to-online data verification, and so on. In this article, we conduct a systematic survey of the key components of IoT blockchain and examine a number of popular blockchain applications. In particular, we first give an architecture overview of popular IoT-blockchain systems by analyzing their network structures and protocols. Then, we discuss variant consensus protocols for IoT blockchains, and make comparisons among different consensus algorithms. Finally, we analyze the traffic model for P2P and blockchain systems and provide several metrics. We also provide a suitable traffic model for IoT-blockchain systems to illustrate network traffic distribution.",
        "DOI": "10.1145/3372136",
        "paper_author": "Lao L.",
        "affiliation_name": "The Hong Kong Polytechnic University",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008928",
        "affiliation_state": "Hong Kong"
    },
    {
        "paper_title": "A Multicloud-Model-Based Many-Objective Intelligent Algorithm for Efficient Task Scheduling in Internet of Things",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "234",
        "cover_date": "2021-06-15",
        "Abstract": "Internet of Things (IoT) is a huge network and establishes ubiquitous connections between smart devices and objects. The flourishing of IoT leads to an unprecedented data explosion, traditional data storing or processing techniques have the problem of low efficiency, and if the data are used maliciously, the security loss may be further caused. Multicloud is a high-performance secure computing platform, which combines multiple cloud providers for data processing, and the distributed multicloud platform ensures the security of data to some extent. Based on multicloud and task scheduling in IoT, this article constructs a many-objective distributed scheduling model, which includes six objectives of total time, cost, cloud throughput, energy consumption, resource utilization, and balancing load. Furthermore, this article presents a many-objective intelligent algorithm with sine function to implement the model, which considers the variation tendency of diversity strategy in the population is similar to the sine function. The experimental results demonstrate excellent scheduling efficiency and hence enhancing the security. This work provides a new idea for addressing the difficult problem of data processing in IoT.",
        "DOI": "10.1109/JIOT.2020.3040019",
        "paper_author": "Cai X.",
        "affiliation_name": "Taiyuan University of Science and Technology",
        "affiliation_city": "Taiyuan",
        "affiliation_country": "China",
        "affiliation_id": "60103975",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "PA-CRT: Chinese Remainder Theorem Based Conditional Privacy-Preserving Authentication Scheme in Vehicular Ad-Hoc Networks",
        "publication": "IEEE Transactions on Dependable and Secure Computing",
        "citied_by": "234",
        "cover_date": "2021-03-01",
        "Abstract": "Existing security and identity-based vehicular communication protocols used in Vehicular Ad-hoc Networks (VANETs) to achieve conditional privacy-preserving mostly rely on an ideal hardware device called tamper-proof device (TPD) equipped in vehicles. Achieving fast authentication during the message verification process is usually challenging in such strategies and further they suffer performance constraints from resulting overheads. To address such challenges, this paper proposes a novel Chinese remainder theorem (CRT)-based conditional privacy-preserving authentication scheme for securing vehicular authentication. The proposed protocol only requires realistic TPDs, and eliminates the need for pre-loading the master key onto the vehicle's TPDs. Chinese remainder theorem can dynamically assist the trusted authorities (TAs) whilst generating and broadcasting new group keys to the vehicles in the network. The proposed scheme solves the leakage problem during side channel attacks, and ensures higher level of security for the entire system. In addition, the proposed scheme avoids using the bilinear pairing operation and map-To-point hash operation during the authentication process, which helps achieving faster verification even under increasing number of signature. Moreover, the security analysis shows that our proposed scheme is secure under the random oracle model and the performance analysis shows that our proposed scheme is efficient in reducing computation and communication overheads.",
        "DOI": "10.1109/TDSC.2019.2904274",
        "paper_author": "Zhang J.",
        "affiliation_name": "Anhui University",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60001455",
        "affiliation_state": "Anhui"
    },
    {
        "paper_title": "Applications, Deployments, and Integration of Internet of Drones (IoD): A Review",
        "publication": "IEEE Sensors Journal",
        "citied_by": "232",
        "cover_date": "2021-11-15",
        "Abstract": "The Internet of Drones (IoD) has become a hot research topic in academia, industry, and management in current years due to its wide potential applications, such as aerial photography, civilian, and military. This paper presents a comprehensive survey of IoD and its applications, deployments, and integration. We focused in this review on two main sides; IoD Applications include smart cities surveillance, cloud and fog frameworks, unmanned aerial vehicles, wireless sensor networks, networks, mobile computing, and business paradigms; integration of IoD includes privacy protection, security authentication, neural network, blockchain, and optimization based-method. A discussion highlights the hot research topics and problems to help researchers interested in this area in their future works. The keywords that have been used in this paper are Internet of Drones.",
        "DOI": "10.1109/JSEN.2021.3114266",
        "paper_author": "Abualigah L.",
        "affiliation_name": "Amman Arab University",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60087691",
        "affiliation_state": "Amman"
    },
    {
        "paper_title": "Risk management in sustainable smart cities governance: A TOE framework",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "232",
        "cover_date": "2021-06-01",
        "Abstract": "Sustainable smart cities are confronted by technological, organisational and external risks, making their governance difficult and susceptible to manipulation. Based on a comprehensive literature review of 796 systematically retrieved articles, the current study proposes a multilayered technology-organisation-environment (TOE-based) risk management framework for sustainable smart city governance. A total of 56 risks are identified and grouped into TOE categories. There are 17 technological risks, including IoT networks, public internet management and user safety concerns, with a 38.7% contribution to smart city governance risks. With a 15.6% share, there are 11 organisational risks, including user data security and cloud management. There are 28 external risks with a contribution of 46.7% to the smart city governance and consist of smart city's environment, governance, integration and security risks. A multilayered TOE-based risk management framework is proposed to identify and manage the risks associated with smart city governance in the current study. The framework links smart citizens to each other through the smart city governance team and the integrated TOE layers. The iterative risk management process of identification, analysis, evaluation, monitoring and response planning is carried out in the TOE layers, both at the external layer levels and internal management levels. The proposed framework operationalises the risk management process for smart city governance by presenting the collection of pertinent risks and their thematic TOE categorisation. The criticality of the identified risks in line with the study's rankings can help researchers and practitioners understand the top risks of smart city governance. These risks present investment opportunities for city governance bodies to develop critical and effective responses as well as provide safety, security and enhanced privacy for citizens.",
        "DOI": "10.1016/j.techfore.2021.120743",
        "paper_author": "Ullah F.",
        "affiliation_name": "University of New South Wales (UNSW Sydney)",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "117489887",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Adversarial Attacks against Network Intrusion Detection in IoT Systems",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "229",
        "cover_date": "2021-07-01",
        "Abstract": "Deep learning (DL) has gained popularity in network intrusion detection, due to its strong capability of recognizing subtle differences between normal and malicious network activities. Although a variety of methods have been designed to leverage DL models for security protection, whether these systems are vulnerable to adversarial examples (AEs) is unknown. In this article, we design a novel adversarial attack against DL-based network intrusion detection systems (NIDSs) in the Internet-of-Things environment, with only black-box accesses to the DL model in such NIDS. We introduce two techniques: 1) model extraction is adopted to replicate the black-box model with a small amount of training data and 2) a saliency map is then used to disclose the impact of each packet attribute on the detection results, and the most critical features. This enables us to efficiently generate AEs using conventional methods. With these tehniques, we successfully compromise one state-of-the-art NIDS, Kitsune: the adversary only needs to modify less than 0.005% of bytes in the malicious packets to achieve an average 94.31% attack success rate.",
        "DOI": "10.1109/JIOT.2020.3048038",
        "paper_author": "Qiu H.",
        "affiliation_name": "Télécom Paris",
        "affiliation_city": "Palaiseau",
        "affiliation_country": "France",
        "affiliation_id": "60029116",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "Smart logistics based on the internet of things technology: an overview",
        "publication": "International Journal of Logistics Research and Applications",
        "citied_by": "228",
        "cover_date": "2021-01-01",
        "Abstract": "Smart logistics is an effective way to meet the challenges of fast-changing customer expectations, take opportunities brought by new technologies, and facilitate new business models. This review paper systematically summarises the recent research and applications of smart logistics based on the internet of things (IoT), including smart freight transportation, warehousing, and delivery. A bibliometric analysis based on publications between 2008 and 2019 reveals main technologies and impacts of the research and applications of IoT-based smart logistics and their industrial and geographic distributions. The content analysis demonstrates the role and impact of IoT on smart logistics, reveals challenges of IoT-based smart logistics, and provides research needs for the development of smart logistics. The current challenges include technical problems of radio frequency identification and wireless sensor networks, limited extension and technical capacity of IoT,standardisation issues of IoT, data acquisition and processing issues of IoT, and security and privacy concerns on IoT. There is a strong research need to address the key technical issues of IoT, promote various IoT technologies in logistics practice, and jointly develop advanced information and communications technologies and management systems.",
        "DOI": "10.1080/13675567.2020.1757053",
        "paper_author": "Ding Y.",
        "affiliation_name": "Zhejiang University of Technology",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60026282",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Blockchain-Secured Smart Manufacturing in Industry 4.0: A Survey",
        "publication": "IEEE Transactions on Systems, Man, and Cybernetics: Systems",
        "citied_by": "227",
        "cover_date": "2021-01-01",
        "Abstract": "Blockchain is a new generation of secure information technology that is fueling business and industrial innovation. Many studies on key enabling technologies for resource organization and system operation of blockchain-secured smart manufacturing in Industry 4.0 had been conducted. However, the progression and promotion of these blockchain applications have been fundamentally impeded by various issues in scalability, flexibility, and cybersecurity. This survey discusses how blockchain systems can overcome potential cybersecurity barriers to achieving intelligence in Industry 4.0. In this regard, eight cybersecurity issues (CIs) are identified in manufacturing systems. Ten metrics for implementing blockchain applications in the manufacturing system are devised while surveying research in blockchain-secured smart manufacturing. This study reveals how these CIs have been studied in the literature. Based on insights obtained from this analysis, future research directions for blockchain-secured smart manufacturing are presented, which potentially guides research on urgent cybersecurity concerns for achieving intelligence in Industry 4.0.",
        "DOI": "10.1109/TSMC.2020.3040789",
        "paper_author": "Leng J.",
        "affiliation_name": "Guangdong University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60007155",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "A Hierarchical Blockchain-Enabled Federated Learning Algorithm for Knowledge Sharing in Internet of Vehicles",
        "publication": "IEEE Transactions on Intelligent Transportation Systems",
        "citied_by": "226",
        "cover_date": "2021-07-01",
        "Abstract": "Internet of Vehicles (IoVs) is highly characterized by collaborative environment data sensing, computing and processing. Emerging big data and Artificial Intelligence (AI) technologies show significant advantages and efficiency for knowledge sharing among intelligent vehicles. However, it is challenging to guarantee the security and privacy of knowledge during the sharing process. Moreover, conventional AI-based algorithms cannot work properly in distributed vehicular networks. In this paper, a hierarchical blockchain framework and a hierarchical federated learning algorithm are proposed for knowledge sharing, by which vehicles learn environmental data through machine learning methods and share the learning knowledge with each others. The proposed hierarchical blockchain framework is feasible for the large scale vehicular networks. The hierarchical federated learning algorithm is designed to meet the distributed pattern and privacy requirement of IoVs. Knowledge sharing is then modeled as a trading market process to stimulate sharing behaviours, and the trading process is formulated as a multi-leader and multi-player game. Simulation results show that the proposed hierarchical algorithm can improve the sharing efficiency and learning quality. Furthermore, the blockchain-enabled framework is able to deal with certain malicious attacks effectively.",
        "DOI": "10.1109/TITS.2020.3002712",
        "paper_author": "Chai H.",
        "affiliation_name": "University of Electronic Science and Technology of China",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60005465",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "A Survey of Android Malware Detection with Deep Neural Models",
        "publication": "ACM Computing Surveys",
        "citied_by": "224",
        "cover_date": "2021-11-30",
        "Abstract": "Deep Learning (DL) is a disruptive technology that has changed the landscape of cyber security research. Deep learning models have many advantages over traditional Machine Learning (ML) models, particularly when there is a large amount of data available. Android malware detection or classification qualifies as a big data problem because of the fast booming number of Android malware, the obfuscation of Android malware, and the potential protection of huge values of data assets stored on the Android devices. It seems a natural choice to apply DL on Android malware detection. However, there exist challenges for researchers and practitioners, such as choice of DL architecture, feature extraction and processing, performance evaluation, and even gathering adequate data of high quality. In this survey, we aim to address the challenges by systematically reviewing the latest progress in DL-based Android malware detection and classification. We organize the literature according to the DL architecture, including FCN, CNN, RNN, DBN, AE, and hybrid models. The goal is to reveal the research frontier, with the focus on representing code semantics for Android malware detection. We also discuss the challenges in this emerging field and provide our view of future research opportunities and directions.",
        "DOI": "10.1145/3417978",
        "paper_author": "Qiu J.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    }
]