[
    {
        "paper_title": "Backdoor Learning: A Survey",
        "publication": "IEEE Transactions on Neural Networks and Learning Systems",
        "citied_by": "175",
        "cover_date": "2024-01-01",
        "Abstract": "Backdoor attack intends to embed hidden backdoors into deep neural networks (DNNs), so that the attacked models perform well on benign samples, whereas their predictions will be maliciously changed if the hidden backdoor is activated by attacker-specified triggers. This threat could happen when the training process is not fully controlled, such as training on third-party datasets or adopting third-party models, which poses a new and realistic threat. Although backdoor learning is an emerging and rapidly growing research area, there is still no comprehensive and timely review of it. In this article, we present the first comprehensive survey of this realm. We summarize and categorize existing backdoor attacks and defenses based on their characteristics, and provide a unified framework for analyzing poisoning-based backdoor attacks. Besides, we also analyze the relation between backdoor attacks and relevant fields (i.e., adversarial attacks and data poisoning), and summarize widely adopted benchmark datasets. Finally, we briefly outline certain future research directions relying upon reviewed works. A curated list of backdoor-related resources is also available at https://github.com/THUYimingLi/backdoor-learning-resources.",
        "DOI": "10.1109/TNNLS.2022.3182979",
        "paper_author": "Li Y.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Survey on Large Language Model (LLM) Security and Privacy: The Good, The Bad, and The Ugly",
        "publication": "High-Confidence Computing",
        "citied_by": "173",
        "cover_date": "2024-06-01",
        "Abstract": "Large Language Models (LLMs), such as ChatGPT and Bard, have revolutionized natural language understanding and generation. They possess deep language comprehension, human-like text generation capabilities, contextual awareness, and robust problem-solving skills, making them invaluable in various domains (e.g., search engines, customer support, translation). In the meantime, LLMs have also gained traction in the security community, revealing security vulnerabilities and showcasing their potential in security-related tasks. This paper explores the intersection of LLMs with security and privacy. Specifically, we investigate how LLMs positively impact security and privacy, potential risks and threats associated with their use, and inherent vulnerabilities within LLMs. Through a comprehensive literature review, the paper categorizes the papers into “The Good” (beneficial LLM applications), “The Bad” (offensive applications), and “The Ugly” (vulnerabilities of LLMs and their defenses). We have some interesting findings. For example, LLMs have proven to enhance code security (code vulnerability detection) and data privacy (data confidentiality protection), outperforming traditional methods. However, they can also be harnessed for various attacks (particularly user-level attacks) due to their human-like reasoning abilities. We have identified areas that require further research efforts. For example, Research on model and parameter extraction attacks is limited and often theoretical, hindered by LLM parameter scale and confidentiality. Safe instruction tuning, a recent development, requires more exploration. We hope that our work can shed light on the LLMs’ potential to both bolster and jeopardize cybersecurity.",
        "DOI": "10.1016/j.hcc.2024.100211",
        "paper_author": "Yao Y.",
        "affiliation_name": "College of Computing &amp; Informatics",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60139958",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Advancements in Computing: Emerging Trends in Computational Science with Next-Generation Computing",
        "publication": "International Journal of Intelligent Systems and Applications in Engineering",
        "citied_by": "125",
        "cover_date": "2024-01-01",
        "Abstract": "This research investigates how new digital scie­nces merge with cutting edge computing. We're exploring the big impact of quantum computing, AI, high performance computing, and edge computing across various fields. We see them blending with other fresh advances in digital science. We talk about quantum computing's challenges like security and operation. Quantum computing could make solving tough problems way faster. We also look at how important AI, including machine learning and deep learning, is for sorting data and making predictions. The study digs into the growth of mighty supercomputers and exascale computing. We're interested in how they manage many tasks at once, use less power, and stay secure. Security and privacy concerns are brought up in relation to the real-time analytics offered by edge computing in IoT applications. This paper highlights the need for interdisciplinary collaboration, education, scalability, efficient data management, and workforce development in the context of cybersecurity in computational science, while also highlighting the fundamental importance of cybersecurity, the changing threat landscape, and best practices. The study elucidates the potential of these tendencies and their ethical and security dimensions, providing direction for future research and highlighting the inextricable link between computational science, innovation, and security in the modern digital era.",
        "DOI": "NA",
        "paper_author": "Ajani S.N.",
        "affiliation_name": "Shri Ramdeobaba College of Engineering and Management, Nagpur",
        "affiliation_city": "Nagpur",
        "affiliation_country": "India",
        "affiliation_id": "60056514",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "Unleashing the Power of Edge-Cloud Generative AI in Mobile Networks: A Survey of AIGC Services",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "115",
        "cover_date": "2024-01-01",
        "Abstract": "Artificial Intelligence-Generated Content (AIGC) is an automated method for generating, manipulating, and modifying valuable and diverse data using AI algorithms creatively. This survey paper focuses on the deployment of AIGC applications, e.g., ChatGPT and Dall-E, at mobile edge networks, namely mobile AIGC networks, that provide personalized and customized AIGC services in real time while maintaining user privacy. We begin by introducing the background and fundamentals of generative models and the lifecycle of AIGC services at mobile AIGC networks, which includes data collection, training, fine-tuning, inference, and product management. We then discuss the collaborative cloud-edge-mobile infrastructure and technologies required to support AIGC services and enable users to access AIGC at mobile edge networks. Furthermore, we explore AIGC-driven creative applications and use cases for mobile AIGC networks. Additionally, we discuss the implementation, security, and privacy challenges of deploying mobile AIGC networks. Finally, we highlight some future research directions and open issues for the full realization of mobile AIGC networks.",
        "DOI": "10.1109/COMST.2024.3353265",
        "paper_author": "Xu M.",
        "affiliation_name": "School of Computer Science and Engineering",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60078616",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Cryptanalysis of an image encryption algorithm using quantum chaotic map and DNA coding",
        "publication": "Expert Systems with Applications",
        "citied_by": "111",
        "cover_date": "2024-03-01",
        "Abstract": "Recently, an image encryption algorithm using Quantum Chaotic Map and DNA Coding (QCMDC-IEA) has been reported. It consists of two main components: pixel-level permutation and DNA domain substitution. To support its ability to withstand various attacks, several security analyses and experimental simulations were presented. However, after careful cryptanalysis, we found that QCMDC-IEA has inherent fatal security problems. Although formally using complex chaos and DNA encoding, the chaos-based sequences used for encryption in QCMDC-IEA are independent of a plain image such that it suffers from the defect of the existence of an equivalent key. Moreover, the lack of confusion and diffusion in DNA domain encryption makes it vulnerable to cryptographic attacks. DNA domain encryption is then essentially a 2-bit data substitution process, so it can be equivalently simplified. On this basis, we propose an attack method to crack QCMDC-IEA, which first obtains an equivalent permutation key by differential cryptanalysis, and then eliminates the DNA domain substitution based on a chosen-plaintext attack using only four special plain images and their corresponding cipher images, and finally recovers the original plain images. Our attack method takes full advantage of the security defects in QCMDC-IEA and achieves complete decipherment with low complexity, thus better revealing its intrinsic security mechanism. To improve the security performance, some security enhancement suggestions are recommended for similar cryptosystems. Both theoretical analysis and experimental simulation results show that the proposed cryptographic attack method is effective and feasible for QCMDC-IEA with low attack complexity. Therefore, the cryptanalysis work in this paper can provide some theoretical hints for improving the security of a class of image encryption algorithms based on DNA coding and chaos.",
        "DOI": "10.1016/j.eswa.2023.121514",
        "paper_author": "Wen H.",
        "affiliation_name": "University of Electronic Science and Technology of China",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60005465",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Distributed Deep Learning Model for Intelligent Video Surveillance Systems with Edge Computing",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "109",
        "cover_date": "2024-01-01",
        "Abstract": "In this paper, we propose a Distributed Intelligent Video Surveillance (DIVS) system using Deep Learning (DL) algorithms and deploy it in an edge computing environment. We establish a multi-layer edge computing architecture and a distributed DL training model for the DIVS system. The DIVS system can migrate computing workloads from the network center to network edges to reduce huge network communication overhead and provide low-latency and accurate video analysis solutions. We implement the proposed DIVS system and address the problems of parallel training, model synchronization, and workload balancing. Task-level parallel and model-level parallel training methods are proposed to further accelerate the video analysis process. In addition, we propose a model parameter updating method to achieve model synchronization of the global DL model in a distributed EC environment. Moreover, a dynamic data migration approach is proposed to address the imbalance of workload and computational power of edge nodes. Experimental results showed that the EC architecture can provide elastic and scalable computing power, and the proposed DIVS system can efficiently handle video surveillance and analysis tasks.",
        "DOI": "10.1109/TII.2019.2909473",
        "paper_author": "Chen J.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "A fully integrated wearable ultrasound system to monitor deep tissues in moving subjects",
        "publication": "Nature Biotechnology",
        "citied_by": "108",
        "cover_date": "2024-03-01",
        "Abstract": "Recent advances in wearable ultrasound technologies have demonstrated the potential for hands-free data acquisition, but technical barriers remain as these probes require wire connections, can lose track of moving targets and create data-interpretation challenges. Here we report a fully integrated autonomous wearable ultrasonic-system-on-patch (USoP). A miniaturized flexible control circuit is designed to interface with an ultrasound transducer array for signal pre-conditioning and wireless data communication. Machine learning is used to track moving tissue targets and assist the data interpretation. We demonstrate that the USoP allows continuous tracking of physiological signals from tissues as deep as 164 mm. On mobile subjects, the USoP can continuously monitor physiological signals, including central blood pressure, heart rate and cardiac output, for as long as 12 h. This result enables continuous autonomous surveillance of deep tissue signals toward the internet-of-medical-things.",
        "DOI": "10.1038/s41587-023-01800-0",
        "paper_author": "Lin M.",
        "affiliation_name": "Aiiso Yufeng Li Family Department of Chemical and Nano Engineering",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60121662",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Novel multiple color images encryption and decryption scheme based on a bit-level extension algorithm",
        "publication": "Expert Systems with Applications",
        "citied_by": "102",
        "cover_date": "2024-03-15",
        "Abstract": "Digital images play a crucial role in modern communication, but the accompanying privacy concerns have become increasingly prominent. In this context, image encryption technology has emerged as a vital means to safeguard the security of digital image information. Over the past few years, a number of effective image encryption schemes have been developed. However, the amalgamation of bit-level encryption techniques with compression algorithms remains underexplored. To leverage the advantages of these two technologies in terms of security and practicality, a novel multiple color images encryption and decryption scheme is devised based on a bit-level extension algorithm. Firstly, four color images are compressed by the discrete wavelet transform (DWT) to reduce transmission and storage consumption. Secondly, to carry out the bit-level scrambling and diffusion operations on pixels with fractional parts in the DWT domain and maintain the decryption image quality as much as possible, a bit-level extension algorithm is developed. Finally, three rounds of scrambling and diffusion operations based on the bit-level extension algorithm are conducted to enhance the randomness of the ciphertext image and conceal the plaintext information. To reinforce the resistance of the presented image encryption and decryption scheme towards the chosen-plaintext and the differential attacks, secret keys are produced with the hash function SHA-512. The presented scheme undergoes a comprehensive analysis including decryption quality, key security, and resistance to the statistical and the differential attacks. The results are: average PSNR = 31.2631 dB, key space reaches 2472, correlation coefficients are almost 0, average entropy = 7.9985 bits, average NPCR = 99.6089%, and average UACI = 33.4658%. Moreover, experimental simulations demonstrate that our solution exhibits a degree of resilience to noise interference and data loss. In summary, our presented multiple color images encryption and decryption scheme based on a bit-level extension algorithm is effective and reliable.",
        "DOI": "10.1016/j.eswa.2023.122052",
        "paper_author": "Zhou N.R.",
        "affiliation_name": "Shanghai University of Engineering Science",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60032504",
        "affiliation_state": "Shanghai"
    },
    {
        "paper_title": "Insights into Internet of Medical Things (IoMT): Data fusion, security issues and potential solutions",
        "publication": "Information Fusion",
        "citied_by": "92",
        "cover_date": "2024-02-01",
        "Abstract": "The Internet of Medical Things (IoMT) has created a wide range of opportunities for knowledge exchange in numerous industries. The opportunities include patient empowerment, healthcare collaboration, medical education and training, remote monitoring and telemedicine, customized treatment plans, data sharing for innovation, continuous medical learning, supply chain management, public health initiatives, wearable health devices, and quality improvement initiatives. However, the adoption of IoMT faces numerous challenges regarding interoperability, data privacy, security, regulatory, and infrastructure costs. This paper aims to address the implications of data fusion in IoMT, as well as the associated security challenges and their potential solutions, which are lacking in the literature. Data collected from IoMT devices has a direct impact on the accuracy of predictions because of its quality, quantity, and relevance. With an accuracy of 99.53 % to 99.99 %, the Epilepsy seizure detector-based Naive Bayes (ESDNB) algorithm is found to be the most effective for detecting epileptic seizures in IoMT networks. However, the way data are stored must also undergo a major revolution, and all phases—collection, protection, and storage—need to be improved. The standardization of architecture and security measures may improve the detection of security threats and compromises. Methods to detect malware in cross platforms is also an avenue for future research that can effectively tackle the heterogeneity of the IoMT systems. Cryptography and blockchain technology have shown to be promising ways to increase the security of an IoMT-based system. The findings of this review will assist a wide variety of stakeholders in the healthcare ecosystem.",
        "DOI": "10.1016/j.inffus.2023.102060",
        "paper_author": "Ahmed S.F.",
        "affiliation_name": "Asian University for Women",
        "affiliation_city": "Chittagong",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60138980",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Deepfake detection using deep learning methods: A systematic and comprehensive review",
        "publication": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery",
        "citied_by": "84",
        "cover_date": "2024-03-01",
        "Abstract": "Deep Learning (DL) has been effectively utilized in various complicated challenges in healthcare, industry, and academia for various purposes, including thyroid diagnosis, lung nodule recognition, computer vision, large data analytics, and human-level control. Nevertheless, developments in digital technology have been used to produce software that poses a threat to democracy, national security, and confidentiality. Deepfake is one of those DL-powered apps that has lately surfaced. So, deepfake systems can create fake images primarily by replacement of scenes or images, movies, and sounds that humans cannot tell apart from real ones. Various technologies have brought the capacity to change a synthetic speech, image, or video to our fingers. Furthermore, video and image frauds are now so convincing that it is hard to distinguish between false and authentic content with the naked eye. It might result in various issues and ranging from deceiving public opinion to using doctored evidence in a court. For such considerations, it is critical to have technologies that can assist us in discerning reality. This study gives a complete assessment of the literature on deepfake detection strategies using DL-based algorithms. We categorize deepfake detection methods in this work based on their applications, which include video detection, image detection, audio detection, and hybrid multimedia detection. The objective of this paper is to give the reader a better knowledge of (1) how deepfakes are generated and identified, (2) the latest developments and breakthroughs in this realm, (3) weaknesses of existing security methods, and (4) areas requiring more investigation and consideration. The results suggest that the Conventional Neural Networks (CNN) methodology is the most often employed DL method in publications. According to research, the majority of the articles are on the subject of video deepfake detection. The majority of the articles focused on enhancing only one parameter, with the accuracy parameter receiving the most attention. This article is categorized under: Technologies > Machine Learning Algorithmic Development > Multimedia Application Areas > Science and Technology.",
        "DOI": "10.1002/widm.1520",
        "paper_author": "Heidari A.",
        "affiliation_name": "Haliç Üniversitesi",
        "affiliation_city": "Istanbul",
        "affiliation_country": "Turkey",
        "affiliation_id": "60032276",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Generative AI in healthcare: an implementation science informed translational path on application, integration and governance",
        "publication": "Implementation Science",
        "citied_by": "76",
        "cover_date": "2024-12-01",
        "Abstract": "Background: Artificial intelligence (AI), particularly generative AI, has emerged as a transformative tool in healthcare, with the potential to revolutionize clinical decision-making and improve health outcomes. Generative AI, capable of generating new data such as text and images, holds promise in enhancing patient care, revolutionizing disease diagnosis and expanding treatment options. However, the utility and impact of generative AI in healthcare remain poorly understood, with concerns around ethical and medico-legal implications, integration into healthcare service delivery and workforce utilisation. Also, there is not a clear pathway to implement and integrate generative AI in healthcare delivery. Methods: This article aims to provide a comprehensive overview of the use of generative AI in healthcare, focusing on the utility of the technology in healthcare and its translational application highlighting the need for careful planning, execution and management of expectations in adopting generative AI in clinical medicine. Key considerations include factors such as data privacy, security and the irreplaceable role of clinicians’ expertise. Frameworks like the technology acceptance model (TAM) and the Non-Adoption, Abandonment, Scale-up, Spread and Sustainability (NASSS) model are considered to promote responsible integration. These frameworks allow anticipating and proactively addressing barriers to adoption, facilitating stakeholder participation and responsibly transitioning care systems to harness generative AI’s potential. Results: Generative AI has the potential to transform healthcare through automated systems, enhanced clinical decision-making and democratization of expertise with diagnostic support tools providing timely, personalized suggestions. Generative AI applications across billing, diagnosis, treatment and research can also make healthcare delivery more efficient, equitable and effective. However, integration of generative AI necessitates meticulous change management and risk mitigation strategies. Technological capabilities alone cannot shift complex care ecosystems overnight; rather, structured adoption programs grounded in implementation science are imperative. Conclusions: It is strongly argued in this article that generative AI can usher in tremendous healthcare progress, if introduced responsibly. Strategic adoption based on implementation science, incremental deployment and balanced messaging around opportunities versus limitations helps promote safe, ethical generative AI integration. Extensive real-world piloting and iteration aligned to clinical priorities should drive development. With conscientious governance centred on human wellbeing over technological novelty, generative AI can enhance accessibility, affordability and quality of care. As these models continue advancing rapidly, ongoing reassessment and transparent communication around their strengths and weaknesses remain vital to restoring trust, realizing positive potential and, most importantly, improving patient outcomes.",
        "DOI": "10.1186/s13012-024-01357-9",
        "paper_author": "Reddy S.",
        "affiliation_name": "Deakin School of Medicine",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "113849681",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "How does climate change affect food security? Evidence from China",
        "publication": "Environmental Impact Assessment Review",
        "citied_by": "76",
        "cover_date": "2024-01-01",
        "Abstract": "The trend of global warming has sparked a growing concern about the impact of climate change on food security. China is a vast country with different climate situations in each region. This study examines the impact of climate change on food security in China using panel data from 31 provinces and cities (1984–2020). Results show that climate change significantly affects food security, bringing more uncertainty risks. Agricultural policies can mitigate this impact by reducing production costs and improving farmers' risk resistance and motivation. Regional heterogeneity exists, with climate change having significant moderating effects on food security in non-food-producing regions and rainfall having significant effects in north and central regions. Relevant policy implications are suggested for strengthening climate change resilience, improving system design, and coordinating regional agricultural production.",
        "DOI": "10.1016/j.eiar.2023.107324",
        "paper_author": "Lee C.C.",
        "affiliation_name": "Nanchang University",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60008332",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "A review of IoT applications in healthcare",
        "publication": "Neurocomputing",
        "citied_by": "73",
        "cover_date": "2024-01-14",
        "Abstract": "Integrating Internet of Things (IoT) technologies in the healthcare industry represents a transformative shift with tangible benefits. This paper provides a detailed examination of IoT adoption in healthcare, focusing on specific sensor types and communication methods. It underscores successful real-world applications, including remote patient monitoring, individualized treatment strategies, and streamlined healthcare delivery. Furthermore, it delves into the intricate challenges to realizing the full potential of IoT in healthcare. This includes addressing data security concerns, ensuring seamless interoperability, and optimizing the use of IoT-generated data. The paper seeks to inspire practitioners and researchers by highlighting the practical implications of IoT in healthcare, emphasizing the ways IoT can enhance patient care, resource allocation, and overall healthcare efficiency.",
        "DOI": "10.1016/j.neucom.2023.127017",
        "paper_author": "Li C.",
        "affiliation_name": "Yunnan Normal University",
        "affiliation_city": "Chenggong",
        "affiliation_country": "China",
        "affiliation_id": "60019218",
        "affiliation_state": "Yunnan"
    },
    {
        "paper_title": "Blockchain and artificial intelligence for 5G-enabled Internet of Things: Challenges, opportunities, and solutions",
        "publication": "Transactions on Emerging Telecommunications Technologies",
        "citied_by": "73",
        "cover_date": "2024-04-01",
        "Abstract": "Internet of Things (IoT) has revolutionized the digital world by connecting billions of electronic devices over the internet. IoT devices play an essential role in the modern era when conventional devices become more autonomous and smart. On the one hand, high-speed data transfer is a major issue where the 5G-enabled environment plays an important role. On the other hand, these IoT devices transfer the data by using protocols based on centralized architecture and may cause several security issues for the data. Merging artificial intelligence to 5G wireless systems solves several issues such as autonomous robots, self-driving vehicles, virtual reality, and engender security problems. Building trust among the network users without trusting third party authorities is the system's primary concern. Blockchain emerged as a key technology based on a distributed ledger to maintain the network's event logs. Blockchain provides a secure, decentralized, and trustless environment for IoT devices. However, integrating IoT and blockchain also has several challenges; for example, major challenge is low throughput. Currently, the ethereum blockchain network can process approximately 12 to 15 transactions per second, while IoT devices require relatively higher throughput. Therefore, blockchains are incapable of providing functionality for a 5G-enabled IoT based network. The limiting factor of throughput in the blockchain is their network. The slow propagation of transactions and blocks in the P2P network does not allow miners and verifiers to fastly mine and verify new blocks, respectively. Therefore, network scalability is the major issue of IoT based blockchains. In this work, we solved the network scalability issue using blockchain distributed network while to increase the throughput of blockchain, this article uses the Raft consensus algorithm. Another most important issue with IoT networks is privacy. Unfortunately, the blockchain distributed ledgers are public and sensitive information is available on the network for everyone are private, but in such cases, third party editing is not possible without revealing the original contents. To solve privacy issues, we used zkLedger as a solution that is based on zero knowledge-based cryptography.",
        "DOI": "10.1002/ett.4329",
        "paper_author": "Dhar Dwivedi A.",
        "affiliation_name": "Technical University of Denmark",
        "affiliation_city": "Lyngby",
        "affiliation_country": "Denmark",
        "affiliation_id": "60011373",
        "affiliation_state": "Hovedstaden"
    },
    {
        "paper_title": "Smart cities: the role of Internet of Things and machine learning in realizing a data-centric smart environment",
        "publication": "Complex and Intelligent Systems",
        "citied_by": "71",
        "cover_date": "2024-02-01",
        "Abstract": "This paper explores the concept of smart cities and the role of the Internet of Things (IoT) and machine learning (ML) in realizing a data-centric smart environment. Smart cities leverage technology and data to improve the quality of life for citizens and enhance the efficiency of urban services. IoT and machine learning have emerged as key technologies for enabling smart city solutions that rely on large-scale data collection, analysis, and decision-making. This paper presents an overview of smart cities’ various applications and discusses the challenges associated with implementing IoT and machine learning in urban environments. The paper also compares different case studies of successful smart city implementations utilizing IoT and machine learning technologies. The findings suggest that these technologies have the potential to transform urban environments and enable the creation of more livable, sustainable, and efficient cities. However, significant challenges remain regarding data privacy, security, and ethical considerations, which must be addressed to realize the full potential of smart cities.",
        "DOI": "10.1007/s40747-023-01175-4",
        "paper_author": "Ullah A.",
        "affiliation_name": "Beijing University of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022281",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Blockchain-Based Scheme for Secure Data Offloading in Healthcare with Deep Reinforcement Learning",
        "publication": "IEEE/ACM Transactions on Networking",
        "citied_by": "70",
        "cover_date": "2024-02-01",
        "Abstract": "With the widespread popularity of the Internet of Things and various intelligent medical devices, the amount of medical data is rising sharply, and thus medical data processing has become increasingly challenging. Mobile edge computing technology allows computing power to be allocated at the edge closer to users, which enables efficient data offloading for healthcare systems. However, existing studies on medical data offloading seldom guarantee effective data privacy and security. Moreover, the research equipping data offloading architectures with Blockchain neglect the delay and energy consumption costs incurred in using Blockchain technology for medical data offloading. Therefore, in this paper, we propose a data offloading scheme for healthcare based on Blockchain technology, which achieves optimal medical resource allocation and simultaneously minimizes the cost of offloading tasks. Specifically, we design a smart contract to ensure secure data offloading. And, we formulate the cost problem as a Markov Decision Process, solved by a policy search-based deep reinforcement learning (Asynchronous Advantage Actor-Critic) scheme, where we jointly consider offloading decisions, allocation of computing resources and radio transmission bandwidth, and Blockchain data security audits. The security of our smart-contract-based mechanism is theoretically and empirically proved, while extensive experimental results also show that our solution can obtain superior performance gains with lower cost than other baselines.",
        "DOI": "10.1109/TNET.2023.3274631",
        "paper_author": "He Q.",
        "affiliation_name": "College of Medicine and Biological Information Engineering, Northeastern University",
        "affiliation_city": "Shenyang",
        "affiliation_country": "China",
        "affiliation_id": "60118698",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Enhancing Economic Security through Digital Transformation in Investment Processes: Theoretical Perspectives and Methodological Approaches Integrating Environmental Sustainability",
        "publication": "Natural and Engineering Sciences",
        "citied_by": "67",
        "cover_date": "2024-01-01",
        "Abstract": "This article delves into the role of digital transformation in bolstering economic security within investment processes, emphasizing the integration of environmental sustainability. It discusses theoretical perspectives and methodological approaches that illuminate how digital technologies can enhance investment practices while ensuring environmental responsibility. The authors emphasize that leveraging digital transformation can not only mitigate risks and vulnerabilities but also bolster efficiency and transparency in investment decision-making while promoting sustainable practices. Through a review of pertinent literature, the article scrutinizes the advantages of digitalization in realms such as data analytics, automation, and artificial intelligence, highlighting the dual benefits of economic security and environmental stewardship. The findings enrich the existing knowledge base on economic security and underscore the significance of embracing digital transformation infused with environmental sustainability in the investment arena. This article furnishes valuable insights for policymakers, practitioners, and researchers navigating the evolving landscape of investment processes in an increasingly digitized and environmentally conscious world.",
        "DOI": "10.28978/nesciences.1469858",
        "paper_author": "Kalinin O.",
        "affiliation_name": "Mykolas Romeris University",
        "affiliation_city": "Vilnius",
        "affiliation_country": "Lithuania",
        "affiliation_id": "60061999",
        "affiliation_state": "Vilnius"
    },
    {
        "paper_title": "Generative AI in Medical Practice: In-Depth Exploration of Privacy and Security Challenges",
        "publication": "Journal of Medical Internet Research",
        "citied_by": "65",
        "cover_date": "2024-01-01",
        "Abstract": "As advances in artificial intelligence (AI) continue to transform and revolutionize the field of medicine, understanding the potential uses of generative AI in health care becomes increasingly important. Generative AI, including models such as generative adversarial networks and large language models, shows promise in transforming medical diagnostics, research, treatment planning, and patient care. However, these data-intensive systems pose new threats to protected health information. This Viewpoint paper aims to explore various categories of generative AI in health care, including medical diagnostics, drug discovery, virtual health assistants, medical research, and clinical decision support, while identifying security and privacy threats within each phase of the life cycle of such systems (ie, data collection, model development, and implementation phases). The objectives of this study were to analyze the current state of generative AI in health care, identify opportunities and privacy and security challenges posed by integrating these technologies into existing health care infrastructure, and propose strategies for mitigating security and privacy risks. This study highlights the importance of addressing the security and privacy threats associated with generative AI in health care to ensure the safe and effective use of these systems. The findings of this study can inform the development of future generative AI systems in health care and help health care organizations better understand the potential benefits and risks associated with these systems. By examining the use cases and benefits of generative AI across diverse domains within health care, this paper contributes to theoretical discussions surrounding AI ethics, security vulnerabilities, and data privacy regulations. In addition, this study provides practical insights for stakeholders looking to adopt generative AI solutions within their organizations.",
        "DOI": "10.2196/53008",
        "paper_author": "Chen Y.",
        "affiliation_name": "Florida International University College of Business",
        "affiliation_city": "Miami",
        "affiliation_country": "United States",
        "affiliation_id": "60122601",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "Blockchain and federated learning-based intrusion detection approaches for edge-enabled industrial IoT networks: a survey",
        "publication": "Ad Hoc Networks",
        "citied_by": "65",
        "cover_date": "2024-01-01",
        "Abstract": "The industrial internet of things (IIoT) is an evolutionary extension of the traditional Internet of Things (IoT) into processes and machines for applications in the industrial sector. The IIoT systems generate a large amount of private and sensitive data i.e., stored and processed somewhere on the cloud-edge continuum. The IIoT devices, and the IIoT networks are subject to security mechanisms such as intelligent Intrusion Detection and Prevention Systems (IDS/IPS) systems, that can detect and respond unseen malicious network attacks. The adoption of centralized machine learning methods for IDS has become impractical due to the high computational cost and privacy concerns associated with storing large amounts of data on a single server along the cloud-edge continuum. The combination of federated learning and Blockchain has emerged as a promising advancement in addressing the challenge. Federated learning distributes learning to individual IIoT devices without compromising data privacy, while Blockchain enhances privacy and security. Many academic and industrial efforts outline IDS mechanisms using machine learning, deep learning, federated learning, and Blockchain technologies. The utilization of federated learning-based IDS has become increasingly popular and is now being applied to various tasks including IDS/IPS systems. However, existing intrusion detection systems (IDSs) survey are limited to the scope of classical machine learning and deep learning. To address this limitation, we analyze the IIoT literature that integrates Blockchain and federated learning to enhance IDSs and improve its threat detection capabilities. This survey explores the role of Blockchain and federated learning in addressing security and privacy issues, particularly those associated with IDS/IPS in IIoT networks. Insights on the possibilities of machine learning, federated learning, and Blockchain in supporting IDS to monitor IIoT network traffic for anomaly detection are discussed in detail through state of the art. Furthermore, we provide a set of recommendation based on our literature for the effective implementation of a Blockchain and federated learning-based network intrusion detection system. Finally, we summarize the study and highlight challenges as future research directions for Blockchain and Federated Learning-based technologies for cybersecurity and intrusion detection in IIoT.",
        "DOI": "10.1016/j.adhoc.2023.103320",
        "paper_author": "Ali S.",
        "affiliation_name": "University of Science and Technology of China",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60019118",
        "affiliation_state": "Anhui"
    },
    {
        "paper_title": "Adventures in data analysis: a systematic review of Deep Learning techniques for pattern recognition in cyber-physical-social systems",
        "publication": "Multimedia Tools and Applications",
        "citied_by": "65",
        "cover_date": "2024-03-01",
        "Abstract": "Machine Learning (ML) and Deep Learning (DL) have achieved high success in many textual, auditory, medical imaging, and visual recognition patterns. Concerning the importance of ML/DL in recognizing patterns due to its high accuracy, many researchers argued for many solutions for improving pattern recognition performance using ML/DL methods. Due to the importance of the required intelligent pattern recognition of machines needed in image processing and the outstanding role of big data in generating state-of-the-art modern and classical approaches to pattern recognition, we conducted a thorough Systematic Literature Review (SLR) about DL approaches for big data pattern recognition. Therefore, we have discussed different research issues and possible paths in which the abovementioned techniques might help materialize the pattern recognition notion. Similarly, we have classified 60 of the most cutting-edge articles put forward pattern recognition issues into ten categories based on the DL/ML method used: Convolutional Neural Network (CNN), Recurrent Neural Network (RNN), Generative Adversarial Network (GAN), Autoencoder (AE), Ensemble Learning (EL), Reinforcement Learning (RL), Random Forest (RF), Multilayer Perception (MLP), Long-Short Term Memory (LSTM), and hybrid methods. SLR method has been used to investigate each one in terms of influential properties such as the main idea, advantages, disadvantages, strategies, simulation environment, datasets, and security issues. The results indicate most of the articles were published in 2021. Moreover, some important parameters such as accuracy, adaptability, fault tolerance, security, scalability, and flexibility were involved in these investigations.",
        "DOI": "10.1007/s11042-023-16382-x",
        "paper_author": "Amiri Z.",
        "affiliation_name": "Islamic Azad University, Tabriz Branch",
        "affiliation_city": "Tabriz",
        "affiliation_country": "Iran",
        "affiliation_id": "60022609",
        "affiliation_state": "East Azarbaijan Province"
    },
    {
        "paper_title": "Investigating antecedents of mobile payment systems’ decision-making: a mediated model",
        "publication": "Global Knowledge, Memory and Communication",
        "citied_by": "64",
        "cover_date": "2024-01-09",
        "Abstract": "Purpose: The increase in mobile telephone penetration has offered new opportunities for technology to improve payment operations all over the world. Little research has examined the issues related to the decision-making (DM) of mobile payment systems usage in the Jordanian context. The purpose of this study is to examine the factors that may have an influence on the adoption of mobile payment systems. This study has empirically tested the expanded unified theory of acceptance and use of technology (UTAUT2) together with awareness (AW), trust (TR), security (SE) and privacy (PR) as independent variables to explain the mobile payment system adoption in Jordan. Design/methodology/approach: In total, 270 employees participated in a field survey questionnaire from the public sector in Amman city, the capital city of Jordan. Data were analyzed through a quantitative approach of partial least squares–structural equation modeling. Findings: The results mainly showed that the determinants of DM to use mobile payment system are price value, social influence, performance expectancy, AW and TR. All of these determinants explained 60.2% of the variation of DM. In total, 72.2% has been explained as the TR to use m-payment system by SE and PR. Furthermore, the results revealed that TR mediates the association between SE as well as PR and the DM to use mobile payment system. Originality/value: Interestingly, these new variables were found to be important and contribute to the UTAUT2 model. Consequently, the decision-makers in the Central Bank of Jordan should consider all these factors when re-upgrading a Jordan Mobile Payment system in the near future.",
        "DOI": "10.1108/GKMC-10-2021-0171",
        "paper_author": "Al-Okaily M.",
        "affiliation_name": "Jadara University",
        "affiliation_city": "Irbid",
        "affiliation_country": "Jordan",
        "affiliation_id": "60139033",
        "affiliation_state": "Irbid"
    },
    {
        "paper_title": "Robust human locomotion and localization activity recognition over multisensory",
        "publication": "Frontiers in Physiology",
        "citied_by": "63",
        "cover_date": "2024-01-01",
        "Abstract": "Human activity recognition (HAR) plays a pivotal role in various domains, including healthcare, sports, robotics, and security. With the growing popularity of wearable devices, particularly Inertial Measurement Units (IMUs) and Ambient sensors, researchers and engineers have sought to take advantage of these advances to accurately and efficiently detect and classify human activities. This research paper presents an advanced methodology for human activity and localization recognition, utilizing smartphone IMU, Ambient, GPS, and Audio sensor data from two public benchmark datasets: the Opportunity dataset and the Extrasensory dataset. The Opportunity dataset was collected from 12 subjects participating in a range of daily activities, and it captures data from various body-worn and object-associated sensors. The Extrasensory dataset features data from 60 participants, including thousands of data samples from smartphone and smartwatch sensors, labeled with a wide array of human activities. Our study incorporates novel feature extraction techniques for signal, GPS, and audio sensor data. Specifically, for localization, GPS, audio, and IMU sensors are utilized, while IMU and Ambient sensors are employed for locomotion activity recognition. To achieve accurate activity classification, state-of-the-art deep learning techniques, such as convolutional neural networks (CNN) and long short-term memory (LSTM), have been explored. For indoor/outdoor activities, CNNs are applied, while LSTMs are utilized for locomotion activity recognition. The proposed system has been evaluated using the k-fold cross-validation method, achieving accuracy rates of 97% and 89% for locomotion activity over the Opportunity and Extrasensory datasets, respectively, and 96% for indoor/outdoor activity over the Extrasensory dataset. These results highlight the efficiency of our methodology in accurately detecting various human activities, showing its potential for real-world applications. Moreover, the research paper introduces a hybrid system that combines machine learning and deep learning features, enhancing activity recognition performance by leveraging the strengths of both approaches.",
        "DOI": "10.3389/fphys.2024.1344887",
        "paper_author": "Khan D.",
        "affiliation_name": "Air University Islamabad",
        "affiliation_city": "Islamabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60070604",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Explainable artificial intelligence for intrusion detection in IoT networks: A deep learning based approach",
        "publication": "Expert Systems with Applications",
        "citied_by": "62",
        "cover_date": "2024-03-15",
        "Abstract": "The Internet of Things (IoT) is currently seeing tremendous growth due to new technologies and big data. Research in the field of IoT security is an emerging topic. IoT networks are becoming more vulnerable to new assaults as a result of the growth in devices and the production of massive data. In order to recognize the attacks, an intrusion detection system is required. In this work, we suggested a Deep Learning (DL) model for intrusion detection to categorize various attacks in the dataset. We used a filter-based approach to pick out the most important aspects and limit the number of features, and we built two different deep-learning models for intrusion detection. For model training and testing, we used two publicly accessible datasets, NSL-KDD and UNSW-NB 15. First, we applied the dataset on the Deep neural network (DNN) model and then the same dataset on Convolution Neural Network (CNN) model. For both datasets, the DL model had a better accuracy rate. Because DL models are opaque and challenging to comprehend, we applied the idea of explainable Artificial Intelligence (AI) to provide a model explanation. To increase confidence in the DNN model, we applied the explainable AI (XAI) Local Interpretable Model-agnostic Explanations (LIME ) method, and for better understanding, we also applied Shapley Additive Explanations (SHAP).",
        "DOI": "10.1016/j.eswa.2023.121751",
        "paper_author": "Sharma B.",
        "affiliation_name": "Manipal University Jaipur",
        "affiliation_city": "Jaipur",
        "affiliation_country": "India",
        "affiliation_id": "60108737",
        "affiliation_state": "RJ"
    },
    {
        "paper_title": "Blockchain-assisted secured data management framework for health information analysis based on Internet of Medical Things",
        "publication": "Personal and Ubiquitous Computing",
        "citied_by": "61",
        "cover_date": "2024-02-01",
        "Abstract": "The Internet of Medical Things (IoMT) is a kind of associated smart-medical device infrastructure with applications, health services, and systems. These medical devices and applications are linked via the Internet to healthcare systems. The privacy and security for patient data, scalability, and data accessibility are the most complex IoT challenges (particularly in IoMT) and need to be considered. Blockchain can disrupt the current modes of patient data access, exchange, accumulation, control, and contribution. Hence, in this study, blockchain-assisted secure data management framework (BSDMF) has been suggested for health information based on the Internet of Medical Things to securely exchange patient data and enhance scalability and data accessibility healthcare environment. The proposed BSDMF provides secure data management between personal servers and implantable medical devices and between cloud servers and personal servers. The IoMT-based security framework utilizes blockchain to guarantee data transmission security and data management between linked nodes. The experimental results show that the suggested BSDMF method achieves a high accuracy ratio of 97.2%, a precision ratio of 97.9%, an average trust value of 98.3%, and less response time of 11.2%, and a latency ratio of 15.6% when compared to other popular methods.",
        "DOI": "10.1007/s00779-021-01583-8",
        "paper_author": "Abbas A.",
        "affiliation_name": "University of Central Punjab",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60103839",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Potential sources of sensor data anomalies for autonomous vehicles: An overview from road vehicle safety perspective",
        "publication": "Expert Systems with Applications",
        "citied_by": "60",
        "cover_date": "2024-02-01",
        "Abstract": "Outstanding steps towards intelligent transportation systems with autonomous vehicles have been taken in the past few years. Nevertheless, the safety issue in autonomous vehicles is critical and remains to be fully solved. Sensor data provide information about the internal status of the system and the impact of its external environment, where the occurrence of sensor data anomalies indicates the existence of potential safety risks. Therefore, in this work, a taxonomy for potential sensor data anomaly sources from the perspective of road vehicle safety is proposed, motivated by the lack of a unified comprehensive taxonomy of sensor data anomaly identification for autonomous vehicles. In this context, sources are divided into; 1) fault or failure of the components or subsystems; 2) failure of the adaptability to the external environment; 3) cyber-attacks; and 4) faults or design deficiencies of sensors. Based on the taxonomy proposed, related works, and in particular, countermeasures for the four potential sources of sensor data anomalies in autonomous vehicles are then reviewed. In the context of providing a comprehensive discussion, other taxonomies of potential sources causing sensor data anomalies for autonomous vehicles and the issue of interpretability of sensor data anomalies are also discussed, providing insight into the strengths of the proposed taxonomy.",
        "DOI": "10.1016/j.eswa.2023.121358",
        "paper_author": "Zhao X.",
        "affiliation_name": "Chang'an University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60028891",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Artificial intelligence-powered decentralized framework for Internet of Things in Healthcare 4.0",
        "publication": "Transactions on Emerging Telecommunications Technologies",
        "citied_by": "59",
        "cover_date": "2024-04-01",
        "Abstract": "Remote patient monitoring and data management have gained much popularity in recent years because of their enhanced access to low-cost healthcare services. A cloud-based healthcare system provides numerous solutions for collecting patient data and offers on-demand well-managed reports to patients and healthcare providers. However, it equally suffers from single-point failure, security, privacy, and non-transparency issues with the data, impacting the continuity of the system. To resolve such concerns, this article proposes an artificial intelligence (AI)-enabled decentralized healthcare framework that accesses and authenticates Internet of Things (IoT) devices and create trust and transparency in patient healthcare records (PHR). The mechanism is based on the AI-enabled smart contracts and the conceptualization of the public blockchain network. Alongside this, the framework identifies the malicious IoT nodes in the system. The experimental analyses are performed on the real-time test environment, and significant improvements are suggested in terms of device energy consumption, data request time, throughput, average latency, and transaction fee.",
        "DOI": "10.1002/ett.4245",
        "paper_author": "Puri V.",
        "affiliation_name": "Duy Tan University",
        "affiliation_city": "Da Nang",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60111656",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Event-triggered prescribed performance adaptive secure control for nonlinear cyber physical systems under denial-of-service attacks",
        "publication": "Communications in Nonlinear Science and Numerical Simulation",
        "citied_by": "57",
        "cover_date": "2024-04-01",
        "Abstract": "For a class of nonlinear cyber physical systems (CPSs) under intermittent denial-of-service attacks (DoS), this paper investigates a novel adaptive security control scheme. A switched fuzzy observer is designed to estimate unmeasurable states. In addition, the relative threshold-based event-triggered approach is introduced to reduce the released data, and the dynamic surface control technique is used to remove the ‘explosion of terms’ problem. Meanwhile, an observer-based adaptive event-triggered prescribed performance controller is constructed, which ensures that all closed-loop signals remain bounded and system output approaches a designed performance bound within a predefined finite time. Simultaneously, the Zeno behavior can be thoroughly eliminated. Finally, a numerical simulation is used to demonstrate the validity of the results.",
        "DOI": "10.1016/j.cnsns.2023.107793",
        "paper_author": "Gao Z.",
        "affiliation_name": "Bohai University",
        "affiliation_city": "Jinzhou",
        "affiliation_country": "China",
        "affiliation_id": "60007305",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Secure hierarchical fog computing-based architecture for industry 5.0 using an attribute-based encryption scheme",
        "publication": "Expert Systems with Applications",
        "citied_by": "56",
        "cover_date": "2024-01-01",
        "Abstract": "Industry 5.0 is an emerging phase in the industrial field where humans and the latest technologies work together to bring revolutionary changes to work processes. It is the future of the upcoming generation for smart city development. Operations and designing of smart systems for Industrial Internet of Things (IIoT) devices include various types of decision-making at different levels of domains. Highly complex systems have a huge number of variables and decision-making requirements which also needs real-time data gathering from IIoT devices. Fog computing performs a key role by locating IIoT devices close to its proximity and reducing the processing time in comparison to cloud computing for smart systems. It makes smart systems work in a secure, flexible and time-sensitive manner. The presence of sensors makes data-intensive analysis challenging in these systems but fog computing handles it all. Along with other challenges, security is also one of the concerns that can affect the overall system if compromised. The main objective of this article is to introduce hierarchical fog computing-based architecture for smart energy-supplying systems as a part of Industry 5.0. This architecture will be able to support a large number of infrastructural components and provide services efficiently. In this article, validation of the amount of data transmitted by IIoT devices to the cloud per second is done for three different cases: 1. The proposed four-layer fog computing architecture, 2. Fog architecture with only layer three layers with the rest of the computing on the cloud, 3. A traditional system with cloud computing. The proposed approach is validated over state of art approaches in terms of accuracy. Moreover, the security of the architecture is provided using the Attribute-based encryption (ABE) scheme, which ensures data confidentiality with minimum overhead.",
        "DOI": "10.1016/j.eswa.2023.121180",
        "paper_author": "Shruti ",
        "affiliation_name": "Goswami Ganesh Dutta S.D. College",
        "affiliation_city": "Chandigarh",
        "affiliation_country": "India",
        "affiliation_id": "60097679",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Enabling privacy and security in Cloud of Things: Architecture, applications, security &amp; privacy challenges",
        "publication": "Applied Computing and Informatics",
        "citied_by": "56",
        "cover_date": "2024-01-05",
        "Abstract": "The Cloud of Things (IoT) that refers to the integration of the Cloud Computing (CC) and the Internet of Things (IoT), has dramatically changed the way treatments are done in the ubiquitous computing world. This integration has become imperative because the important amount of data generated by IoT devices needs the CC as a storage and processing infrastructure. Unfortunately, security issues in CoT remain more critical since users and IoT devices continue to share computing as well as networking resources remotely. Moreover, preserving data privacy in such an environment is also a critical concern. Therefore, the CoT is continuously growing up security and privacy issues. This paper focused on security and privacy considerations by analyzing some potential challenges and risks that need to be resolved. To achieve that, the CoT architecture and existing applications have been investigated. Furthermore, a number of security as well as privacy concerns and issues as well as open challenges, are discussed in this work.",
        "DOI": "10.1016/j.aci.2019.11.005",
        "paper_author": "Abba Ari A.A.",
        "affiliation_name": "Laboratoire d’informatique Parallélisme Réseaux Algorithmes Distribués",
        "affiliation_city": "Versailles",
        "affiliation_country": "France",
        "affiliation_id": "60111070",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "Balancing Privacy and Progress: A Review of Privacy Challenges, Systemic Oversight, and Patient Perceptions in AI-Driven Healthcare",
        "publication": "Applied Sciences (Switzerland)",
        "citied_by": "55",
        "cover_date": "2024-01-01",
        "Abstract": "Integrating Artificial Intelligence (AI) in healthcare represents a transformative shift with substantial potential for enhancing patient care. This paper critically examines this integration, confronting significant ethical, legal, and technological challenges, particularly in patient privacy, decision-making autonomy, and data integrity. A structured exploration of these issues focuses on Differential Privacy as a critical method for preserving patient confidentiality in AI-driven healthcare systems. We analyze the balance between privacy preservation and the practical utility of healthcare data, emphasizing the effectiveness of encryption, Differential Privacy, and mixed-model approaches. The paper navigates the complex ethical and legal frameworks essential for AI integration in healthcare. We comprehensively examine patient rights and the nuances of informed consent, along with the challenges of harmonizing advanced technologies like blockchain with the General Data Protection Regulation (GDPR). The issue of algorithmic bias in healthcare is also explored, underscoring the urgent need for effective bias detection and mitigation strategies to build patient trust. The evolving roles of decentralized data sharing, regulatory frameworks, and patient agency are discussed in depth. Advocating for an interdisciplinary, multi-stakeholder approach and responsive governance, the paper aims to align healthcare AI with ethical principles, prioritize patient-centered outcomes, and steer AI towards responsible and equitable enhancements in patient care.",
        "DOI": "10.3390/app14020675",
        "paper_author": "Williamson S.M.",
        "affiliation_name": "University of North Texas",
        "affiliation_city": "Denton",
        "affiliation_country": "United States",
        "affiliation_id": "60024438",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Multi-hop graph pooling adversarial network for cross-domain remaining useful life prediction: A distributed federated learning perspective",
        "publication": "Reliability Engineering and System Safety",
        "citied_by": "55",
        "cover_date": "2024-04-01",
        "Abstract": "Accurate remaining useful life (RUL) prediction has gained increasing attention in modern maintenance management. Considering the data privacy requirements of distributed multi-client collaborative training and the phenomenon of domain drift, how to accomplish the RUL prediction for distributed federation under cross-domain conditions needs in-depth research. In this context, the paper constructs a multi-hop graph pooling adversarial network based on distributed federated learning (MHGPAN-DFL) for the RUL prediction. In particular, this paper designs a multi-hop graph pooling adversarial network, which can decrease domain differences through adversarial transfer while achieving global modeling for input data. Furthermore, this paper designs a predictive model consistency strategy based on distributed federated learning. It dynamically assigns model weights to promote the generalization ability based on ensuring the privacy and security of local data in each client. This study confirms the efficacy of the proposed approach adopting the NASA aircraft turbofan engine dataset, and the bearing degradation dataset provided by Xi'an Jiaotong University.",
        "DOI": "10.1016/j.ress.2024.109950",
        "paper_author": "Zhang J.",
        "affiliation_name": "Harbin Institute of Technology",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "60019616",
        "affiliation_state": "Heilongjiang"
    },
    {
        "paper_title": "A Systematic Review and Meta-Analysis of Artificial Intelligence Tools in Medicine and Healthcare: Applications, Considerations, Limitations, Motivation and Challenges",
        "publication": "Diagnostics",
        "citied_by": "55",
        "cover_date": "2024-01-01",
        "Abstract": "Artificial intelligence (AI) has emerged as a transformative force in various sectors, including medicine and healthcare. Large language models like ChatGPT showcase AI’s potential by generating human-like text through prompts. ChatGPT’s adaptability holds promise for reshaping medical practices, improving patient care, and enhancing interactions among healthcare professionals, patients, and data. In pandemic management, ChatGPT rapidly disseminates vital information. It serves as a virtual assistant in surgical consultations, aids dental practices, simplifies medical education, and aids in disease diagnosis. A total of 82 papers were categorised into eight major areas, which are G1: treatment and medicine, G2: buildings and equipment, G3: parts of the human body and areas of the disease, G4: patients, G5: citizens, G6: cellular imaging, radiology, pulse and medical images, G7: doctors and nurses, and G8: tools, devices and administration. Balancing AI’s role with human judgment remains a challenge. A systematic literature review using the PRISMA approach explored AI’s transformative potential in healthcare, highlighting ChatGPT’s versatile applications, limitations, motivation, and challenges. In conclusion, ChatGPT’s diverse medical applications demonstrate its potential for innovation, serving as a valuable resource for students, academics, and researchers in healthcare. Additionally, this study serves as a guide, assisting students, academics, and researchers in the field of medicine and healthcare alike.",
        "DOI": "10.3390/diagnostics14010109",
        "paper_author": "Younis H.A.",
        "affiliation_name": "University of Basrah",
        "affiliation_city": "Basra",
        "affiliation_country": "Iraq",
        "affiliation_id": "60071174",
        "affiliation_state": "Basra"
    },
    {
        "paper_title": "M-MultiSVM: An efficient feature selection assisted network intrusion detection system using machine learning",
        "publication": "Computers and Security",
        "citied_by": "55",
        "cover_date": "2024-02-01",
        "Abstract": "The intrusions are increasing daily, so there is a huge amount of privacy violations, financial loss, illegal transferring of information, etc. Various forms of intrusion occur in networks, such as menacing networks, computer resources and network information. Each type of intrusion focuses on specified tasks, whereas the hackers may focus on stealing confidential data, industrial secrets and personal information, which is then leaked to others for illegal gains. Due to the false detection of attacks in the security and changing environmental fields, limitations like data lagging on actual attacks and sustaining financial harms occur. To resolve this, automatic abnormality detection systems are required to secure the required computing ability and to analyze the attacks. Hence, an efficient automated intrusion detection system using machine learning methodology is proposed in this research paper. Initially, the data are gathered from CSE-CIC-IDS 2018 and UNSW-NB15 datasets. The acquired data are pre-processed using Null value handling and Min-Max normalization. Null value handling is used to remove missing values and irrelevant parameters. Min-Max normalization adjusted the unnormalized data in the pre-processing stage. After pre-processing, the class imbalance problem is reduced by using the Advanced Synthetic Minority Oversampling Technique (ASmoT). ASmoT aims to balance the class and reduce imbalance class problems and overfitting issues. The next phase is feature extraction, which is performed by Modified Singular Value Decomposition (M-SvD). M-SvD extracts essential features such as basic features, content features and traffic features from the input. The extracted features are optimized by the Opposition-based Northern Goshawk Optimization algorithm (ONgO). These optimal features are able to produce optimal output. After feature selection, the different types of attacks are classified by a hybrid machine learning model called Mud Ring assisted multilayer support vector machine (M-MultiSVM) and finally, the hyperparameters are tuned by the Mud Ring optimization algorithm. Thus, the proposed M-MultiSVM model can efficiently detect intrusion in the network. The performance metrics show that the proposed system achieved 99.89 % accuracy by using the CSE-CIC-IDS 2018 dataset; also, the proposed system achieved 97.535 % accuracy by using the UNSW-NB15 dataset.",
        "DOI": "10.1016/j.cose.2023.103587",
        "paper_author": "Turukmane A.V.",
        "affiliation_name": "VIT-AP University",
        "affiliation_city": "Amaravati",
        "affiliation_country": "India",
        "affiliation_id": "60119614",
        "affiliation_state": "AP"
    },
    {
        "paper_title": "Challenges and barriers of using large language models (LLM) such as ChatGPT for diagnostic medicine with a focus on digital pathology – a recent scoping review",
        "publication": "Diagnostic Pathology",
        "citied_by": "54",
        "cover_date": "2024-12-01",
        "Abstract": "Background: The integration of large language models (LLMs) like ChatGPT in diagnostic medicine, with a focus on digital pathology, has garnered significant attention. However, understanding the challenges and barriers associated with the use of LLMs in this context is crucial for their successful implementation. Methods: A scoping review was conducted to explore the challenges and barriers of using LLMs, in diagnostic medicine with a focus on digital pathology. A comprehensive search was conducted using electronic databases, including PubMed and Google Scholar, for relevant articles published within the past four years. The selected articles were critically analyzed to identify and summarize the challenges and barriers reported in the literature. Results: The scoping review identified several challenges and barriers associated with the use of LLMs in diagnostic medicine. These included limitations in contextual understanding and interpretability, biases in training data, ethical considerations, impact on healthcare professionals, and regulatory concerns. Contextual understanding and interpretability challenges arise due to the lack of true understanding of medical concepts and lack of these models being explicitly trained on medical records selected by trained professionals, and the black-box nature of LLMs. Biases in training data pose a risk of perpetuating disparities and inaccuracies in diagnoses. Ethical considerations include patient privacy, data security, and responsible AI use. The integration of LLMs may impact healthcare professionals’ autonomy and decision-making abilities. Regulatory concerns surround the need for guidelines and frameworks to ensure safe and ethical implementation. Conclusion: The scoping review highlights the challenges and barriers of using LLMs in diagnostic medicine with a focus on digital pathology. Understanding these challenges is essential for addressing the limitations and developing strategies to overcome barriers. It is critical for health professionals to be involved in the selection of data and fine tuning of the models. Further research, validation, and collaboration between AI developers, healthcare professionals, and regulatory bodies are necessary to ensure the responsible and effective integration of LLMs in diagnostic medicine.",
        "DOI": "10.1186/s13000-024-01464-7",
        "paper_author": "Ullah E.",
        "affiliation_name": "Anatomical Pathology",
        "affiliation_city": "Auckland",
        "affiliation_country": "New Zealand",
        "affiliation_id": "101961216",
        "affiliation_state": "AUK"
    },
    {
        "paper_title": "Machine learning-based network intrusion detection for big and imbalanced data using oversampling, stacking feature embedding and feature extraction",
        "publication": "Journal of Big Data",
        "citied_by": "54",
        "cover_date": "2024-12-01",
        "Abstract": "Cybersecurity has emerged as a critical global concern. Intrusion Detection Systems (IDS) play a critical role in protecting interconnected networks by detecting malicious actors and activities. Machine Learning (ML)-based behavior analysis within the IDS has considerable potential for detecting dynamic cyber threats, identifying abnormalities, and identifying malicious conduct within the network. However, as the number of data grows, dimension reduction becomes an increasingly difficult task when training ML models. Addressing this, our paper introduces a novel ML-based network intrusion detection model that uses Random Oversampling (RO) to address data imbalance and Stacking Feature Embedding based on clustering results, as well as Principal Component Analysis (PCA) for dimension reduction and is specifically designed for large and imbalanced datasets. This model’s performance is carefully evaluated using three cutting-edge benchmark datasets: UNSW-NB15, CIC-IDS-2017, and CIC-IDS-2018. On the UNSW-NB15 dataset, our trials show that the RF and ET models achieve accuracy rates of 99.59% and 99.95%, respectively. Furthermore, using the CIC-IDS2017 dataset, DT, RF, and ET models reach 99.99% accuracy, while DT and RF models obtain 99.94% accuracy on CIC-IDS2018. These performance results continuously outperform the state-of-art, indicating significant progress in the field of network intrusion detection. This achievement demonstrates the efficacy of the suggested methodology, which can be used practically to accurately monitor and identify network traffic intrusions, thereby blocking possible threats.",
        "DOI": "10.1186/s40537-024-00886-w",
        "paper_author": "Talukder M.A.",
        "affiliation_name": "Jagannath University, Bangladesh",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60111554",
        "affiliation_state": "Dhaka"
    },
    {
        "paper_title": "Federated Learning for Medical Applications: A Taxonomy, Current Trends, Challenges, and Future Research Directions",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "54",
        "cover_date": "2024-03-01",
        "Abstract": "With the advent of the Internet of Things (IoT), artificial intelligence (AI), machine learning (ML), and deep learning (DL) algorithms, the landscape of data-driven medical applications has emerged as a promising avenue for designing robust and scalable diagnostic and prognostic models from medical data. This has gained a lot of attention from both academia and industry, leading to significant improvements in healthcare quality. However, the adoption of AI-driven medical applications still faces tough challenges, including meeting security, privacy, and Quality-of-Service (QoS) standards. Recent developments in federated learning (FL) have made it possible to train complex machine-learned models in a distributed manner and have become an active research domain, particularly processing the medical data at the edge of the network in a decentralized way to preserve privacy and address security concerns. To this end, in this article, we explore the present and future of FL technology in medical applications where data sharing is a significant challenge. We delve into the current research trends and their outcomes, unraveling the complexities of designing reliable and scalable FL models. This article outlines the fundamental statistical issues in FL, tackles device-related problems, addresses security challenges, and navigates the complexity of privacy concerns, all while highlighting its transformative potential in the medical field. Our study primarily focuses on medical applications of FL, particularly in the context of global cancer diagnosis. We highlight the potential of FL to enable computer-aided diagnosis tools that address this challenge with greater effectiveness than traditional data-driven methods. Recent literature has shown that FL models are robust and generalize well to new data, which is essential for medical applications. We hope that this comprehensive review will serve as a checkpoint for the field, summarizing the current state of the art and identifying open problems and future research directions.",
        "DOI": "10.1109/JIOT.2023.3329061",
        "paper_author": "Rauniyar A.",
        "affiliation_name": "SINTEF Digital",
        "affiliation_city": "Trondheim",
        "affiliation_country": "Norway",
        "affiliation_id": "60108239",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Exploring the Nexus between Fintech, natural resources, urbanization, and environment sustainability in China: A QARDL study",
        "publication": "Resources Policy",
        "citied_by": "53",
        "cover_date": "2024-02-01",
        "Abstract": "The climate crisis is increasing fast to leave an everlasting impact on China and its operations. China faces the prospect of one region facing extreme flooding while another region grapples with scorching heat and drought. There has been a substantial rise in typhoons and storms. The food security of the nation has taken a hit, and the country has seen its rice production fall by about 8%. This issue is concerning for not only China but the whole world, as a huge number of countries depend on China for food supplies. This research studied the role of Fintech, Natural Resources and Urbanization on environmental sustainability in China by considering the data from 2000 to 2020, using the sophisticated and resilient Qunatile-based ARDL approach. The findings suggest that the use of Fintech can help to achieve green growth while the use of Natural resources can have a detrimental impact on environmental sustainability. Similarly, urbanization leads to increased human activity, which would increase the level of CO2 emissions and result in deforestation, which deteriorates the ecological balance of a country. China is recommended to introduce a carbon tax to ensure that firms find it costly to use unsustainable sources of energy. The funds raised from carbon taxes can be used to finance green projects. Fintech can be used to facilitate the green economy by allowing green loans and green finances to ensure green growth in China.",
        "DOI": "10.1016/j.resourpol.2023.104557",
        "paper_author": "Liu K.",
        "affiliation_name": "Shihezi University",
        "affiliation_city": "Shihezi",
        "affiliation_country": "China",
        "affiliation_id": "60030922",
        "affiliation_state": "Xinjiang"
    },
    {
        "paper_title": "Overcoming Data Limitations: A Few-Shot Specific Emitter Identification Method Using Self-Supervised Learning and Adversarial Augmentation",
        "publication": "IEEE Transactions on Information Forensics and Security",
        "citied_by": "53",
        "cover_date": "2024-01-01",
        "Abstract": "Specific emitter identification (SEI) based on radio frequency fingerprinting (RFF) is a physical layer authentication method in the field of wireless network security. RFFs are unique features embedded in the electromagnetic waves, which come from the hard imperfections in the wireless devices. Deep learning has been applied to many SEI tasks due to its powerful feature extraction capabilities. However, the success of most methods hinges on massive and labeled samples, and few methods focus on a realistic scenario, where few samples are available and labeled. In this paper, to overcome data limitations, we propose a few-shot SEI (FS-SEI) method based on self-supervised learning and adversarial augmentation (SA2SEI). Specifically, to overcome the limitation of label dependence for auxiliary dataset, a novelty adversarial augmentation (Adv-Aug)-powered self-supervised learning is designed to pre-train a RFF extractor using unlabeled auxiliary dataset. Subsequently, to overcome the limitation of sample dependence, knowledge transfer is introduced to fine-tune the extractor and a classifier with target dataset including few samples (5-30 samples per emitter in this paper) and corresponding labels. In addition, auxiliary dataset and target dataset are come from different emitters. An open-source large-scale real-world automatic-dependent surveillance-broadcast (ADS-B) dataset and a Wi-Fi dataset are used to evaluate the proposed SA2SEI method. The simulation results show that the proposed method can extract more discriminative RFF features and obtain higher identification performance in the FS-SEI. Specifically, when there are only 5 samples per Wi-Fi device, it can achieve 83.40% identification accuracy, in which 38.63% identification accuracy improvement comes from the Adv-Aug of pre-training process. The codes are available at https://github.com/LIUC-000/SA2SEI.",
        "DOI": "10.1109/TIFS.2023.3324394",
        "paper_author": "Liu C.",
        "affiliation_name": "School of Communications and Information Engineering",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60278898",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "IDS-INT: Intrusion detection system using transformer-based transfer learning for imbalanced network traffic",
        "publication": "Digital Communications and Networks",
        "citied_by": "52",
        "cover_date": "2024-02-01",
        "Abstract": "A network intrusion detection system is critical for cyber security against illegitimate attacks. In terms of feature perspectives, network traffic may include a variety of elements such as attack reference, attack type, a sub-category of attack, host information, malicious scripts, etc. In terms of network perspectives, network traffic may contain an imbalanced number of harmful attacks when compared to normal traffic. It is challenging to identify a specific attack due to complex features and data imbalance issues. To address these issues, this paper proposes an Intrusion Detection System using transformer-based transfer learning for Imbalanced Network Traffic (IDS-INT). IDS-INT uses transformer-based transfer learning to learn feature interactions in both network feature representation and imbalanced data. First, detailed information about each type of attack is gathered from network interaction descriptions, which include network nodes, attack type, reference, host information, etc. Second, the transformer-based transfer learning approach is developed to learn detailed feature representation using their semantic anchors. Third, the Synthetic Minority Oversampling Technique (SMOTE) is implemented to balance abnormal traffic and detect minority attacks. Fourth, the Convolution Neural Network (CNN) model is designed to extract deep features from the balanced network traffic. Finally, the hybrid approach of the CNN-Long Short-Term Memory (CNN-LSTM) model is developed to detect different types of attacks from the deep features. Detailed experiments are conducted to test the proposed approach using three standard datasets, i.e., UNSW-NB15, CIC-IDS2017, and NSL-KDD. An explainable AI approach is implemented to interpret the proposed method and develop a trustable model.",
        "DOI": "10.1016/j.dcan.2023.03.008",
        "paper_author": "Ullah F.",
        "affiliation_name": "Northwestern Polytechnical University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60003977",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "A comprehensive survey on image encryption: Taxonomy, challenges, and future directions",
        "publication": "Chaos, Solitons and Fractals",
        "citied_by": "52",
        "cover_date": "2024-01-01",
        "Abstract": "Image encryption is a critical component of modern data security, ensuring the confidentiality, integrity, and privacy of sensitive visual content. In this paper, we present a comprehensive survey on image encryption, exploring various encryption algorithms, their strengths, weaknesses, and real-world applications. We begin by providing a background on image encryption, highlighting its importance in safeguarding image data from unauthorized access and tampering. We discuss symmetric, asymmetric, and hybrid encryption techniques, analyzing their suitability for different scenarios. Evaluation metrics for assessing encryption algorithms are discussed, emphasizing the importance of selecting appropriate metrics to measure security and performance. Additionally, we explore the challenges faced in image encryption, such as key management and computational complexity. The survey also delves into potential future directions in image encryption, including robustness against cryptanalysis, quantum image encryption, and multimedia encryption. Furthermore, we discuss the importance of image encryption in various industries, such as military, healthcare, finance, journalism, and intellectual property protection. Real-world use cases are presented, highlighting scenarios where image encryption is crucial for maintaining confidentiality, integrity, and privacy. Finally, we conclude by summarizing the survey findings and identifying potential areas for further research and improvement in image encryption. This comprehensive survey serves as a valuable resource for researchers, practitioners, and decision-makers in the field of image security, facilitating the development of more secure and efficient image encryption solutions to meet the increasing demand for data protection and privacy in the digital age.",
        "DOI": "10.1016/j.chaos.2023.114361",
        "paper_author": "SaberiKamarposhti M.",
        "affiliation_name": "Multimedia University",
        "affiliation_city": "Cyberjaya",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60012005",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Secure and privacy-preserving intrusion detection in wireless sensor networks: Federated learning with SCNN-Bi-LSTM for enhanced reliability",
        "publication": "Ad Hoc Networks",
        "citied_by": "51",
        "cover_date": "2024-03-15",
        "Abstract": "As the digital landscape expands rapidly due to technological advancements, cybersecurity concerns have become more prevalent. Intrusion Detection Systems (IDSs), which are crucial for identifying unusual network traffic indicative of malicious activity, have become a necessity. These systems can be either hardware or software-based. However, traditional IDS models often fail to adequately protect data privacy and detect complex, unique breaches, particularly within Wireless Sensor Networks (WSNs). To address these limitations, this paper proposes a novel Stacked Convolutional Neural Network and Bidirectional Long Short Term Memory (SCNN-Bi-LSTM) model for intrusion detection in WSNs. This model leverages Federated Learning (FL) to enhance intrusion detection performance and safeguard privacy. The FL-based SCNN-Bi-LSTM model is unique in its approach, allowing multiple sensor nodes to collaboratively train a central global model without revealing private data, thereby alleviating privacy concerns. The deep learning methodology of the SCNN-Bi-LSTM model effectively identifies sophisticated and previously unknown cyber threats by meticulously examining both local and temporal linkages in network patterns. The model has been specifically designed to detect and categorize different types of Denial of Service (DoS) attacks using specialized WSN-DS and CIC-IDS-2017 datasets. Compared to traditional Artificial Deep Neural Network (ADNN) models, our proposed FL-SCNN-Bi-LSTM model demonstrated superior detection rates for complex and unknown attacks, significantly improving IDS performance. The model achieved a notable classification accuracy of approximately 99.9% precision and recall on both datasets, substantially reducing false positives and negatives. Our research underscores the potential of federated learning and deep learning in enhancing the security and privacy of WSNs. The proposed FL-SCNN-Bi-LSTM architecture not only facilitates the identification of complex cyber threats but also exemplifies how deep learning techniques can be employed to bolster intrusion detection systems while preserving user data privacy.",
        "DOI": "10.1016/j.adhoc.2024.103407",
        "paper_author": "Bukhari S.M.S.",
        "affiliation_name": "Capital University of Science &amp; Technology",
        "affiliation_city": "Islamabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60039637",
        "affiliation_state": "Islamabad"
    },
    {
        "paper_title": "Autonomous port management based AGV path planning and optimization via an ensemble reinforcement learning framework",
        "publication": "Ocean and Coastal Management",
        "citied_by": "50",
        "cover_date": "2024-05-01",
        "Abstract": "The rapid development of shipping trade pushes automated container terminals toward the direction of intelligence, safety and efficiency. In particular, the formulation of AGV scheduling tasks and the safety and stability of transportation path is an important part of port operation and management, and it is one of the basic tasks to build an intelligent port. Existing research mainly focuses on collaborative operation between port equipment and path optimization under environmental perception, while there is relatively little research on optimization of path smoothness and safety. Therefore, we propose a path optimization model based on the artificial potential field and twin delayed deep deterministic policy gradient (APF-TD3) framework for the port environment. Firstly, we obtain the scheduling task plan of a single AGV by enumeration. Secondly, according to the artificial potential field (APF) algorithm to generate repulsion for obstacles in the harbor and attraction for container storage at the target point with the position information of the AGV as the input data of the reinforcement learning algorithm is inputted into the twin delayed deep deterministic policy gradient algorithm (TD3). Then TD3 selects the optimal action strategy for the AGV according to the input AGV state information and the designed reward mechanism as well as executes the action. Through repeated execution, the optimal action for the next step is selected at each point to generate a path with start and end points. We validate the model by simulating the scale of containerized cargo in the port i.e. small scale, medium scale and large scale scenes. The experimental results show that the method has the shortest path length of 27.519 m, 270.847 m, and 496.389 m compared to artificial potential field and deep deterministic policy gradient (APF-DDPG), APF, and rapidly-exploring random tree (RRT) algorithms, which also have significant advantages in terms of path security and path smoothness. This framework could respond to the scheduling and transportation tasks of single AGV in different environmental layouts and guarantee the smoothness and safety of the path based on the optimization of the path, which promotes the efficient operation and management of ports.",
        "DOI": "10.1016/j.ocecoaman.2024.107087",
        "paper_author": "Chen X.",
        "affiliation_name": "Shanghai Maritime University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025785",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of climate change and production technology heterogeneity on China's agricultural total factor productivity and production efficiency",
        "publication": "Science of the Total Environment",
        "citied_by": "50",
        "cover_date": "2024-01-10",
        "Abstract": "Sustainable agricultural production efficiency is important for global food security, environmental conservation, economic development, human Health, and social equity. However, Climate change has had a significant impact on global agricultural productivity. To this end, investigating climate change's effect on agricultural production efficiency is critical for the food security of any particular country or region, and China is not distinct. Further, the influencing factor of agricultural total factor productivity (technology or technical efficiency) and regional heterogeneity in agricultural production technologies of China are worth exploring for sustainable agricultural growth. To this end, this study employed the DEA-Malmquist Productivity Index to gauge the total factor productivity change (TFPC) in 31 provinces and administrative units of China from 2000 to 2021. Additional inputs of climate factors were added to the estimation process to explore the impact of climate change on TFPC for different periods and regions. The meta-frontier analysis estimates the agriculture production technology gap among nine regions of China. Results revealed that climate factors could overestimate China's average total factor agricultural productivity over the study period. Among 8 out of 9 regions in China witnessed the diverse effects of climate factors; however, it positively impacted agricultural TFPC in the Qinghai Tibet Plateau. Sichuan Basin and surrounding regions performed best, ranked top in China with an average growth rate of 22.3 % in TFPC. Decomposing the TFPC into efficiency and technological change, the study found that the influence of climate on technological change is greater than compared to efficiency change. Northeast China Plain and Sichuan Basin and surrounding regions have superior agriculture production technology with a TGR score 1. Mann-Whitney U and Kruskal-Wallis test proved the statistically significant difference among agricultural productivity scores estimated with and without climate factors and production technology gaps among nine regions of China.",
        "DOI": "10.1016/j.scitotenv.2023.168027",
        "paper_author": "Shah W.U.H.",
        "affiliation_name": "Zhejiang Shuren University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60082197",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Mutil-medical image encryption by a new spatiotemporal chaos model and DNA new computing for information security",
        "publication": "Expert Systems with Applications",
        "citied_by": "50",
        "cover_date": "2024-01-01",
        "Abstract": "Medical images are closely related to the patient's condition. We put forward the model of Sin-Arcsin-Arnold Multi-Dynamic random nonadjacent Coupled Map Lattice (SAMCML) and found that it has good chaotic properties, so we used it to design an encryption scheme for protecting medical multi-images. First, we randomly change the three bits of binary information in medical images, then the binary information before and after blurring is spliced into new pixels. We let them combine with SHA-512 to design and generate random keys. Convert the three binary bits before the blurred pixel into 0–7, then encode the image with DNA technology (Deoxyribonucleic acid technology). We designed 3D-Fisher, which realized random cross-plane scrambling. Then, new DNA operations and asymmetric DNA coding and decoding rules are designed to achieve high-quality diffusion, thus obtaining multiple ciphertext images with different sizes. Finally, the bit-plane information before blurring is used to generate new pixels. They are filled into images with a smaller size, and multiple ciphertext images with the same size are obtained. The NPCR, UACI, and entropy of this algorithm are very close to the ideal values. Compared with other algorithms, it still has some advantages in data and can be applied to medical scenes.",
        "DOI": "10.1016/j.eswa.2023.121090",
        "paper_author": "Liu H.",
        "affiliation_name": "Dalian Maritime University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60029322",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "The Integration of Artificial Intelligence into Clinical Practice",
        "publication": "Applied Biosciences",
        "citied_by": "49",
        "cover_date": "2024-03-01",
        "Abstract": "The purpose of this literature review is to provide a fundamental synopsis of current research pertaining to artificial intelligence (AI) within the domain of clinical practice. Artificial intelligence has revolutionized the field of medicine and healthcare by providing innovative solutions to complex problems. One of the most important benefits of AI in clinical practice is its ability to investigate extensive volumes of data with efficiency and precision. This has led to the development of various applications that have improved patient outcomes and reduced the workload of healthcare professionals. AI can support doctors in making more accurate diagnoses and developing personalized treatment plans. Successful examples of AI applications are outlined for a series of medical specialties like cardiology, surgery, gastroenterology, pneumology, nephrology, urology, dermatology, orthopedics, neurology, gynecology, ophthalmology, pediatrics, hematology, and critically ill patients, as well as diagnostic methods. Special reference is made to legal and ethical considerations like accuracy, informed consent, privacy issues, data security, regulatory framework, product liability, explainability, and transparency. Finally, this review closes by critically appraising AI use in clinical practice and its future perspectives. However, it is also important to approach its development and implementation cautiously to ensure ethical considerations are met.",
        "DOI": "10.3390/applbiosci3010002",
        "paper_author": "Karalis V.D.",
        "affiliation_name": "National &amp; Kapodistrian University of Athens, School of Health Sciences",
        "affiliation_city": "Athens",
        "affiliation_country": "Greece",
        "affiliation_id": "60014758",
        "affiliation_state": "Attica"
    },
    {
        "paper_title": "A comparative analysis of various machine learning methods for anomaly detection in cyber attacks on IoT networks",
        "publication": "Internet of Things (Netherlands)",
        "citied_by": "49",
        "cover_date": "2024-07-01",
        "Abstract": "This study explores the growing challenges of cybersecurity in the context of rapidly adopted Internet of Things (IoT) technologies, which have become increasingly susceptible to cyber threats. The widespread utilisation of IoT systems intensifies the complex interactions between devices and amplifies the traffic of data, creating various opportunities for cyber adversaries. Consequently, detecting and mitigating cyberattacks targeting IoT systems has emerged as a critical imperative in the field of cybersecurity. The primary objective of this study is to employ various machine learning methods to detect cyber anomalies within IoT systems and subsequently compare the efficacy of these methods. Comparative analysis encompasses various machine learning techniques, including Support Vector Machine (SVM), Artificial Neural Network (ANN), Decision Tree (DT), Logistic Regression (LR), and k-Nearest Neighbours (k-NN). This technical evaluation aims to provide a nuanced perspective on the contributions of these methods to the classification of cyber attacks in IoT systems. Performance analysis of these methods serves as valuable information for cybersecurity experts, offering guidance in the development of robust protection strategies for the IoT ecosystem. As IoT security continues to gain prominence, the findings of this study are poised to contribute significantly to the refinement of cybersecurity practices and the fortification of IoT environments against potential threats. In this study, we use different machine learning methods to detect anomalies in cyber attacks on IoT systems and compare the performance of these methods. The result shows that the neural network performed better than the other models.",
        "DOI": "10.1016/j.iot.2024.101162",
        "paper_author": "Inuwa M.M.",
        "affiliation_name": "Federal University Dutse",
        "affiliation_city": "Dutse",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60105028",
        "affiliation_state": "Jigawa"
    },
    {
        "paper_title": "Impact of Artificial Intelligence and Cyber Security as Advanced Technologies on Bitcoin Industries",
        "publication": "International Journal of Intelligent Systems and Applications in Engineering",
        "citied_by": "49",
        "cover_date": "2024-01-01",
        "Abstract": "This review article investigates the relationship between Bitcoin and artificial intelligence (AI), as well as any potential consequences on the Bitcoin market. Also included are any implications for the future of the cryptocurrency. The literature review focuses on the existing research on the relationships between artificial intelligence technology and Bitcoin, and it provides an overview of both of these businesses. This research investigates the potential impacts that AI might have on the Bitcoin industry, including improved user experiences, better levels of transactional security, and enhanced operational efficiencies. The paper also analyses the challenges that occur from applying AI to the Bitcoin industry in terms of the rules and regulations, data security and privacy, and trust that exist in the sector. In recent years, cryptocurrencies have emerged as a dominant form of digital money, and the financial system itself has evolved into an increasingly important component in this space. In order to reduce the amount of risk that is associated with investing, certain approaches that are based on artificial intelligence are required to predict price and trend, as well as to design portfolios and identify fraudulent activity. Along with recent research on AI-based strategies for cryptocurrencies, the most well-known cryptocurrency, Bitcoin, is explored in this article. The articles that were determined to be the most relevant were assessed, and this page addresses the bulk of those publications. This contains research on Bitcoin and other cryptocurrencies, as well as techniques of machine learning such as SVM, ANN, LSTM, and GRU.",
        "DOI": "NA",
        "paper_author": "Deepak A.",
        "affiliation_name": "Saveetha School of Engineering",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60109336",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Experts and intelligent systems for smart homes’ Transformation to Sustainable Smart Cities: A comprehensive review",
        "publication": "Expert Systems with Applications",
        "citied_by": "49",
        "cover_date": "2024-03-15",
        "Abstract": "In this constantly evolving landscape of urbanization, the relationship between technology and automation, in regards to sustainability, holds immense significance. The intricate strands of human intelligence are seamlessly interwoven with the fabric of technological progress, giving rise to exquisite patterns of synergy and collaborative innovation. Automation is just another step in this process which started with the industrial revolution and now has paved way towards urbanization. Smart homes or home automation is a subset of Internet of Things (IoT) based automation that has added into the comfort, ease, and quality of our living standards and is now being integrated to form the concept of Smart Cities. In the past decade, various techniques and processes of smart home automation have been proposed and implemented. To extend and translate the existing methods into new one, the understanding of the former is imperative to the research procedure. This review stands as a comprehensive exploration, diving into the pivotal role of intelligent systems and expert knowledge in driving the transformation of smart homes into sustainable smart cities. By meticulously analyzing and aggregating an array of contemporary techniques used in smart homes, this paper offers profound contributions to the intersection of urban evolution and technological innovation. The review's holistic approach not only facilitates a deep understanding of smart homes’ contributions but also charts a course for innovative strategies in city planning, infrastructure, and technological integration. In bridging the gap between technology and sustainable urban development, this exploration underscores the transformative power of leveraging smart home techniques to lay the foundation for harmonious and forward-thinking smart cities. The technologies cover a wide range of methodologies and intelligent systems used for communication, security and management in an urban infrastructure. The paper focuses on analysis of the technology to provide an outlook into achieving the goal of sustainable smart cities and deal with challenges like scalability and big data computation. Our comprehensive analysis yields a holistic set of technology comparisons and illuminates the promising future prospects within this domain. The information is highly insightful in creating a bigger picture for adopting state of the art technologies like Federated Learning (FL), Digital Twin and Embedded Edge computing in better planning and infrastructure management in smart cities. These findings offer reliable and potent methods to chart not only the course of research but also to enhance these technologies for the betterment of mankind's convenience and advancement.",
        "DOI": "10.1016/j.eswa.2023.122380",
        "paper_author": "Huda N.U.",
        "affiliation_name": "National University of Computer and Emerging Sciences Chiniot-Faisalabad",
        "affiliation_city": "Chiniot",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60279539",
        "affiliation_state": "Punjab"
    },
    {
        "paper_title": "ESG and crowdfunding platforms",
        "publication": "Journal of Business Venturing",
        "citied_by": "49",
        "cover_date": "2024-01-01",
        "Abstract": "We hypothesize that environmental, social, and governance (ESG) goals enable crowdfunding platforms to attract more investors and thus survive longer. Using data on the population of 508 security-based platforms established in the 38 OECD countries between 2007 and 2020, we document that platforms with higher levels of ESG selection criteria are more likely to survive over time. The importance of ESG criteria is more pronounced for platforms operating in countries with lower power distance. In decomposing ESG, we find that governance is the most significant component of the three, while environmental criteria have increased in importance for platform survival in recent years.",
        "DOI": "10.1016/j.jbusvent.2023.106362",
        "paper_author": "Cumming D.",
        "affiliation_name": "Florida Atlantic University",
        "affiliation_city": "Boca Raton",
        "affiliation_country": "United States",
        "affiliation_id": "60017606",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "BFOD: Blockchain-Based Privacy Protection and Security Sharing Scheme of Flight Operation Data",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "49",
        "cover_date": "2024-01-15",
        "Abstract": "With the rapid growth of flight operation data, how to alleviate the contradiction between data sharing and privacy protection of civil aviation corporations has become a challenging problem. Therefore, a blockchain-based flight operation data sharing scheme, named BFOD is designed to achieve the privacy protection and secure sharing of flight operation data. In BFOD, physical entities of airlines, airports and air traffic control are divided into data owners, data requesters and authorization institutes according to the business logic. First, the authorization institute grants a hash anonymous identity and different levels of access right for each civil aviation corporation. When the data are accessed, a hash anonymous identity is designed to verify the access right of the data requester, which protects identity privacy. Then, zero-knowledge succinct noninteractive argument of knowledge (zk-SNARKs) is employed to verify whether the flight operation data meets the specific requirements raised by the data requester without disclosing data privacy. Finally, a proxy re-encryption is used to improve the sharing efficiency of flight operation data. In addition, a grouped practical Byzantine fault tolerant (PBFT) algorithm is proposed to reduce consensus latency. The theoretical analysis and experimental results show that the consensus latency of the grouped PBFT algorithm reduces 91.4% under the number of consensus node $\\text{N}=$ 100, and the BFOD meets data confidentiality, availability and privacy protection, which is feasible and efficient.",
        "DOI": "10.1109/JIOT.2023.3296460",
        "paper_author": "Li X.",
        "affiliation_name": "Civil Aviation University of China",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60028512",
        "affiliation_state": "Tianjin"
    },
    {
        "paper_title": "Using artificial intelligence in academic writing and research: An essential productivity tool",
        "publication": "Computer Methods and Programs in Biomedicine Update",
        "citied_by": "48",
        "cover_date": "2024-01-01",
        "Abstract": "Background: Academic writing is an essential component of research, characterized by structured expression of ideas, data-driven arguments, and logical reasoning. However, it poses challenges such as handling vast amounts of information and complex ideas. The integration of Artificial Intelligence (AI) into academic writing has become increasingly important, offering solutions to these challenges. This review aims to explore specific domains where AI significantly supports academic writing. Methods: A systematic review of literature from databases like PubMed, Embase, and Google Scholar, published since 2019, was conducted. Studies were included based on relevance to AI's application in academic writing and research, focusing on writing assistance, grammar improvement, structure optimization, and other related aspects. Results: The search identified 24 studies through which six core domains were identified where AI helps academic writing and research: 1) facilitating idea generation and research design, 2) improving content and structuring, 3) supporting literature review and synthesis, 4) enhancing data management and analysis, 5) supporting editing, review, and publishing, and 6) assisting in communication, outreach, and ethical compliance. ChatGPT has shown substantial potential in these areas, though challenges like maintaining academic integrity and balancing AI use with human insight remain. Conclusion and recommendations: AI significantly revolutionises academic writing and research across various domains. Recommendations include broader integration of AI tools in research workflows, emphasizing ethical and transparent use, providing adequate training for researchers, and maintaining a balance between AI utility and human insight. Ongoing research and development are essential to address emerging challenges and ethical considerations in AI's application in academia.",
        "DOI": "10.1016/j.cmpbup.2024.100145",
        "paper_author": "Khalifa M.",
        "affiliation_name": "Education Centre of Australia",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "100509241",
        "affiliation_state": "NS"
    },
    {
        "paper_title": "A systematic analysis of failures in protecting personal health data: A scoping review",
        "publication": "International Journal of Information Management",
        "citied_by": "48",
        "cover_date": "2024-02-01",
        "Abstract": "Personal health data breaches pose significant challenges to healthcare providers and clients. This study systematically analyzes 5470 records and reviews 120 articles on this theoretically and practically important topic. It summarizes the existing literature and develops an integrative model with eleven propositions explaining the multifaceted nature of health data breaches, their facilitators, and their impacts. We report on the gaps in the current literature and discuss six promising avenues of future research, including specific suggestions for multi-level analysis, use of novel methods, contributions to information systems theory, stakeholder analysis, under-explored themes, and boundary-breaching opportunities. Beyond these findings, our study offers implications for key stakeholders in healthcare settings. This study equips practitioners and researchers with a valuable model for evidence-based data breach risk management and offers guidance for future investigations, enhancing our collective understanding of personal health data breaches within healthcare.",
        "DOI": "10.1016/j.ijinfomgt.2023.102719",
        "paper_author": "Pool J.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Digital economy empowers sustainable agriculture: Implications for farmers’ adoption of ecological agricultural technologies",
        "publication": "Ecological Indicators",
        "citied_by": "47",
        "cover_date": "2024-02-01",
        "Abstract": "Adopting ecological agricultural technologies (EATs) is an effective way to guarantee food security and protect the environment. With the advancement of the digital village strategy, the continuous integration of the digital economy with the rural economy has gradually become an emerging driving force for sustainable agriculture. However, few studies have examined the impact of farmers’ participation in the digital economy in different links of the agricultural industry chain on EATs adoption from a micro perspective. Using data from 2,825 grain farmers from the 2020 China Rural Revitalization Survey, this paper applies the treatment effect model and the mediating effect model to empirically analyze the impact and mechanism of participation in the digital economy on farmers’ EATs adoption from an ecological effect perspective. This paper characterizes farmers’ participation in the digital economy in terms of digital production, digital sales, and digital finance. The results show that participation in the digital economy significantly promotes farmers’ EATs adoption. The sub-dimensional test found that participation in digital production, digital sales, and digital finance significantly promotes farmers’ EATs adoption. The above findings remain robust after a series of robustness tests, such as changing the estimation method and replacing the dependent variable. Mechanism analysis shows that participation in the digital economy, especially digital sales and digital finance, could promote farmers’ EATs adoption by increasing the demand for agricultural machinery services, improving information availability, and enhancing food safety cognition; participation in the digital production could promote farmers’ EATs adoption by increasing the demand for agricultural machinery services. Results of heterogeneity analysis show that the promotion effect of participation in the digital economy on EATs adoption is more substantial among farmers with higher digital literacy and larger cultivated land scales. The findings of this paper provide insights for China and other countries to effectively use digital technology to promote sustainable agriculture under the pressure of achieving sustainable development goals.",
        "DOI": "10.1016/j.ecolind.2024.111723",
        "paper_author": "Yang C.",
        "affiliation_name": "Nanjing Forestry University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60025665",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Federated Learning for Computational Offloading and Resource Management of Vehicular Edge Computing in 6G-V2X Network",
        "publication": "IEEE Transactions on Consumer Electronics",
        "citied_by": "47",
        "cover_date": "2024-02-01",
        "Abstract": "The Sixth Generation network (6G) can support autonomous driving along with various vehicular applications like Vehicular Edge Computing (VEC), a distributed computing architecture for connected autonomous vehicles. Computational offloading and resource management of Vehicular Edge Computing can help sort out some issues, such as high communication costs, privacy protection, an excessively long training process, etc., by proposing an efficient training model of the Federated Learning for computational offloading and resource management in a vehicular environment. Two research issues are highlighted in this paper. One problem is related to the current offloading system: the smart structure and operating system. Consistent access to cloud computing services, regardless of the installed operating system or used hardware, is still challenging. Another issue is related to security and privacy. Security and privacy are two important features that should be maintained in cloud data centers and data transmission during offloading and resource management. In this survey paper, a system is going to be proposed which will give a partial solution for these issues. The proposed solution, which is found while conducting this review, offers a system that can train a model and help update the edge devices' information. The entire edge cloud system can provide updated information for edge devices and can solve the difficulties of getting some key information necessary for model-related optimization. This also can enhance the effectiveness of the frameworks of the 6G-V2X network for communication.",
        "DOI": "10.1109/TCE.2024.3357530",
        "paper_author": "Hasan M.K.",
        "affiliation_name": "Universiti Kebangsaan Malaysia",
        "affiliation_city": "Bangi",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60001821",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Unusual Thermal Quenching of Photoluminescence from an Organic–Inorganic Hybrid [MnBr<inf>4</inf>]<sup>2−</sup>-based Halide Mediated by Crystalline–Crystalline Phase Transition",
        "publication": "Angewandte Chemie - International Edition",
        "citied_by": "47",
        "cover_date": "2024-01-08",
        "Abstract": "The ability to generate and manipulate photoluminescence (PL) behavior has been of primary importance for applications in information security. Excavating novel optical effects to create more possibilities for information encoding has become a continuous challenge. Herein, we present an unprecedented PL temporary quenching that highly couples with thermodynamic phase transition in a hybrid crystal (DMML)2MnBr4 (DMML=N,N-dimethylmorpholinium). Such unusual PL behavior originates from the anomalous variation of [MnBr4]2− tetrahedrons that leads to non-radiation recombination near the phase transition temperature of 340 K. Remarkably, the suitable detectable temperature, narrow response window, high sensitivity, and good cyclability of this PL temporary quenching will endow encryption applications with high concealment, operational flexibility, durability, and commercial popularization. Profited from these attributes, a fire-new optical encryption model is devised to demonstrate high confidential information security. This unprecedented optical effect would provide new insights and paradigms for the development of luminescent materials to enlighten future information encryption.",
        "DOI": "10.1002/anie.202313590",
        "paper_author": "Lun M.M.",
        "affiliation_name": "Southeast University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60005244",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Sparse Bayesian Learning-Based 3-D Radio Environment Map Construction-Sampling Optimization, Scenario-Dependent Dictionary Construction, and Sparse Recovery",
        "publication": "IEEE Transactions on Cognitive Communications and Networking",
        "citied_by": "47",
        "cover_date": "2024-02-01",
        "Abstract": "The radio environment map (REM), which can visualize the information of invisible electromagnetic spectrum, is vital for monitoring, management, and security of spectrum resources in cognitive radio (CR) networks. In view of a limited number of spectrum sensors and constrained sampling time, this paper presents a new three-dimensional (3D) REM construction scheme based on sparse Bayesian learning (SBL). Firstly, we construct a scenario-dependent channel dictionary matrix by considering the propagation characteristic of the interested scenario. To improve sampling efficiency, a maximum mutual information (MMI)-based optimization algorithm is developed for the layout of sampling sensors. Then, a maximum and minimum distance (MMD) clustering-based SBL algorithm is proposed to recover the spectrum data at the unsampled positions and construct the whole 3D REM. We finally use the simulation data of the campus scenario to construct the 3D REMs and compare the proposed method with the state-of-the-art. The recovery performance and the impact of different parameters on the constructed REMs are also analyzed. Numerical results show that the proposed scheme can reduce the required spectrum data and has higher accuracy under the low sampling rate.",
        "DOI": "10.1109/TCCN.2023.3319539",
        "paper_author": "Wang J.",
        "affiliation_name": "Nanjing University of Aeronautics and Astronautics",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60021666",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Blockchain-Empowered Distributed Multicamera Multitarget Tracking in Edge Computing",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "47",
        "cover_date": "2024-01-01",
        "Abstract": "The rapid increase in the volume of video data generated from edges in the Industrial Internet of Things, opens up new possibilities for enhancing the application of video service. Multicamera multiobject tracking (MCMT) has always been a fundamental task in video surveillance or traffic control. However, the traditional MCMT methods are limited by the communication bottleneck and computation resources of the centralized curator, and suffer from security and privacy issues. In this article, we first design multicamera multihypothesis tracking (MC-MHT) framework to achieve real-time tracking performance among edge cameras. The complex association of objects is described by multiskip trees. The tracking task is well distributed to each camera. Then, we integrate multicamera tracking chain into MC-MHT to ensure security and trust. The state transition of targets in multicamera is illustrated from the perspective of blockchain transactions. The transactions are validated by an integrated tracking consensus to counter Byzantine behavior. Numerical results derived from real-world scenarios and CAMPUS dataset show that the proposed method achieves real-time performance (24-36 FPs) and 79.0-82.4 MOTA indicator, as well as reduces identity switch errors about 71% under Byzantine attack.",
        "DOI": "10.1109/TII.2023.3261890",
        "paper_author": "Wang S.",
        "affiliation_name": "Beihang University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60013789",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Usage and impact of the internet-of-things-based smart home technology: a quality-of-life perspective",
        "publication": "Universal Access in the Information Society",
        "citied_by": "47",
        "cover_date": "2024-03-01",
        "Abstract": "The aim of this paper is to explore the usage and impact of the Internet-of-Things-based Smart Home Technology (IoT-SHT) in Malaysia. Face-to-face interviews were conducted with a total of eleven IoT-SHT users who had a minimum of 2-year usage experience. The semi-structured interview consisted of six questions which were compartmentalised into two sections. Common themes were identified through constant comparison of the inductive data in the coding process. The in-depth interview uncovered six uses of IoT-SHT. Mainly, it was used for real-time remote control, surveillance, sensing, home automation, entertainment, and family communication. It seems clear that the IoT-SHT helped people to save time, changed their lives, improved security, safety, environment condition, fun, convenience, and comfort within the home ground. It also facilitated better health tracking, family care, and energy conservation. Psychologically, the IoT-SHT also enhanced one’s image, offered better companionship, and improved the sense of belongingness, and closeness within the family. This study fills the research gap by providing insights into how the IoT-SHT was used, thereby benefiting users in Malaysia. With the arrival of industrial revolution 4.0, a comprehensive knowledge on the usage of IoT is pertinent. The findings of this study may also serve as a foundation for future research in IoT-SHT adoption. Practically, this study accelerates IoT-SHT diffusion by providing insights to vendors in designing better IoT products and services, based on the popular usages and impactful benefits.",
        "DOI": "10.1007/s10209-022-00937-0",
        "paper_author": "Rock L.Y.",
        "affiliation_name": "Universiti Malaya",
        "affiliation_city": "Kuala Lumpur",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60029157",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "What makes consumers trust and adopt fintech? An empirical investigation in China",
        "publication": "Electronic Commerce Research",
        "citied_by": "47",
        "cover_date": "2024-03-01",
        "Abstract": "Building upon the information systems success model (ISSM) and the theory of reasoned action (TRA), we suggest a set of hypotheses related to fintech services consumer adoption, and we use survey data from a sample of consumers in China’s fintech industries to test this framework. We demonstrate three main dimensions of quality in the context of fintech services—i.e., system, information, and service quality—and we find that both consumers’ perceived security and privacy are positively related to consumers’ trust in such services, which in turn encourages the formation of both positive attitudes toward those fintech services and intentions to use. This study sheds new light into fintech services by indicating that, to fully understand the relationships between improving the quality of fintech service, user security and privacy protection, and consumers’ behavioral attitudes and intentions, managers in fintech firms must actively assess the extent to which consumers trust their fintech services, and they must also be able to deal with the challenges posed by consumers’ behavioral uncertainty by implementing an effective trust-enhanced strategy. Through the integration of ISSM and TRA, our findings contribute to an emerging stream of fintech research and extend the literature on trust by providing novel evidence that building strong trust-based relationships with consumers can be particularly beneficial to fintech firms when they want to create positive attitudes in the minds of consumers and thus motivate them to adopt the services.",
        "DOI": "10.1007/s10660-021-09527-3",
        "paper_author": "Roh T.",
        "affiliation_name": "Soonchunhyang University",
        "affiliation_city": "Asan",
        "affiliation_country": "South Korea",
        "affiliation_id": "60025615",
        "affiliation_state": "Chungcheongnam-do"
    },
    {
        "paper_title": "The Impact of Adversarial Attacks on Federated Learning: A Survey",
        "publication": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
        "citied_by": "46",
        "cover_date": "2024-05-01",
        "Abstract": "Federated learning (FL) has emerged as a powerful machine learning technique that enables the development of models from decentralized data sources. However, the decentralized nature of FL makes it vulnerable to adversarial attacks. In this survey, we provide a comprehensive overview of the impact of malicious attacks on FL by covering various aspects such as attack budget, visibility, and generalizability, among others. Previous surveys have primarily focused on the multiple types of attacks and defenses but failed to consider the impact of these attacks in terms of their budget, visibility, and generalizability. This survey aims to fill this gap by providing a comprehensive understanding of the attacks' effect by identifying FL attacks with low budgets, low visibility, and high impact. Additionally, we address the recent advancements in the field of adversarial defenses in FL and highlight the challenges in securing FL. The contribution of this survey is threefold: first, it provides a comprehensive and up-to-date overview of the current state of FL attacks and defenses. Second, it highlights the critical importance of considering the impact, budget, and visibility of FL attacks. Finally, we provide ten case studies and potential future directions towards improving the security and privacy of FL systems.",
        "DOI": "10.1109/TPAMI.2023.3322785",
        "paper_author": "Kumar K.N.",
        "affiliation_name": "Indian Institute of Technology Hyderabad",
        "affiliation_city": "Sangareddy",
        "affiliation_country": "India",
        "affiliation_id": "60103917",
        "affiliation_state": "TS"
    },
    {
        "paper_title": "Revolutionizing Cyber Threat Detection with Large Language Models: A Privacy-Preserving BERT-Based Lightweight Model for IoT/IIoT Devices",
        "publication": "IEEE Access",
        "citied_by": "46",
        "cover_date": "2024-01-01",
        "Abstract": "The field of Natural Language Processing (NLP) is currently undergoing a revolutionary transformation driven by the power of pre-trained Large Language Models (LLMs) based on groundbreaking Transformer architectures. As the frequency and diversity of cybersecurity attacks continue to rise, the importance of incident detection has significantly increased. IoT devices are expanding rapidly, resulting in a growing need for efficient techniques to autonomously identify network-based attacks in IoT networks with both high precision and minimal computational requirements. This paper presents SecurityBERT, a novel architecture that leverages the Bidirectional Encoder Representations from Transformers (BERT) model for cyber threat detection in IoT networks. During the training of SecurityBERT, we incorporated a novel privacy-preserving encoding technique called Privacy-Preserving Fixed-Length Encoding (PPFLE). We effectively represented network traffic data in a structured format by combining PPFLE with the Byte-level Byte-Pair Encoder (BBPE) Tokenizer. Our research demonstrates that SecurityBERT outperforms traditional Machine Learning (ML) and Deep Learning (DL) methods, such as Convolutional Neural Networks (CNNs) or Recurrent Neural Networks (RNNs), in cyber threat detection. Employing the Edge-IIoTset cybersecurity dataset, our experimental analysis shows that SecurityBERT achieved an impressive 98.2% overall accuracy in identifying fourteen distinct attack types, surpassing previous records set by hybrid solutions such as GAN-Transformer-based architectures and CNN-LSTM models. With an inference time of less than 0.15 seconds on an average CPU and a compact model size of just 16.7MB, SecurityBERT is ideally suited for real-life traffic analysis and a suitable choice for deployment on resource-constrained IoT devices.",
        "DOI": "10.1109/ACCESS.2024.3363469",
        "paper_author": "Ferrag M.A.",
        "affiliation_name": "Technology Innovation Institute",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60272404",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Identifying emotions from facial expressions using a deep convolutional neural network-based approach",
        "publication": "Multimedia Tools and Applications",
        "citied_by": "46",
        "cover_date": "2024-02-01",
        "Abstract": "Sentiment identification on facial expression is an interesting study domain with applications in various disciplines, including security, health, and human-machine interfaces. The main goal of sentiment analysis is to decide an individual’s perspective on a topic or the document’s overall contextual polarity. In nonverbal communication, sentiment analysis plays a vital role in an individual’s feelings, reflecting on the faces. Researchers in this area are interested in improving models and methods and extracting various characteristics to provide a better computer prediction of sentiments. Sentiment polarities are mainly classified as positive, negative, and neutral. Many sentiment analysis approaches exist, but deep learning architectures can handle extensive data and provide better performances. We presented a solution based on the CNN (Convolutional Neural Network) model for handling this problem. This work uses the extended Cohn Kanade (CK+) and FER-2013 datasets for facial expression recognition study. Several existing architectures are used to evaluate the efficiency of the proposed model. Extensive experiments are carried out on both CK+ and FER-2013 data sets, and our framework outperforms state-of-the-art techniques. According to obtained results, the CNN3 model gives 79% and 95% accuracy for FER-2013 and CK+ datasets, respectively.",
        "DOI": "10.1007/s11042-023-16174-3",
        "paper_author": "Meena G.",
        "affiliation_name": "Central University of Rajasthan",
        "affiliation_city": "Ajmer",
        "affiliation_country": "India",
        "affiliation_id": "60107394",
        "affiliation_state": "RJ"
    },
    {
        "paper_title": "Leveraging zero knowledge proofs for blockchain-based identity sharing: A survey of advancements, challenges and opportunities",
        "publication": "Journal of Information Security and Applications",
        "citied_by": "45",
        "cover_date": "2024-02-01",
        "Abstract": "Identity sharing systems, regardless of their architectural models, share common vulnerabilities. These systems compel users to divulge personal information and furnish proof of identity for accessing services, leaving them susceptible to data breaches that can culminate in identity theft and jeopardize online data security. While blockchain technology offers a potential remedy, delivering enhanced security, immutability, and traceability, it simultaneously raises pertinent concerns surrounding privacy and transparency. The integration of zero-knowledge proof (ZKP) technology has emerged as a promising solution, particularly in enhancing privacy within the transparent blockchain ecosystem. Our paper conducts an exhaustive survey of the existing literature, with a particular focus on the assimilation of ZKP technology into blockchain for the secure sharing of user identities. We undertake a critical evaluation of the advancements achieved in this domain, pinpoint the formidable challenges that must be confronted, and uncover nascent opportunities for further exploration. Our contribution transcends the realms of mere summarization and analysis; we go a step further by offering recommendations drawn from real-world case studies and delineating future research directions.",
        "DOI": "10.1016/j.jisa.2023.103678",
        "paper_author": "Diro A.",
        "affiliation_name": "RMIT University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60011362",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Crop monitoring by multimodal remote sensing: A review",
        "publication": "Remote Sensing Applications: Society and Environment",
        "citied_by": "45",
        "cover_date": "2024-01-01",
        "Abstract": "Effective approaches to achieve food safety and security can prevent catastrophic situations. Therefore, it is required to monitor agricultural crops on a regular basis. This can be easily achieved by capturing data from various remote sensing (RS) devices followed by processing them. Most RS devices are useful in monitoring crops and analysing different stages of plant growth successfully. However, individual devices have some limitations. To overcome this, multimodal remote sensing (MRS) methods have been gradually gaining popularity. In the multimodal approach, data from more than one modality are used together to obtain a better outcome. This is because, different modalities of data when used together can complement each other to achieve the same objective by combining their strengths and reducing their limitations, simultaneously. MRS methods have been found to be particularly useful for crop monitoring as they allow for the integration of data from multiple sources, resulting in a more comprehensive understanding of plant growth and development. By using MRS methods, it is possible to obtain a more accurate and detailed analysis of crop conditions, leading to improved decision-making and ultimately, better crop yields. In this paper, we will explore how MRS methods have been successfully utilised in crop monitoring and how the data obtained from these methods can provide valuable insights into the health and development of plants.",
        "DOI": "10.1016/j.rsase.2023.101093",
        "paper_author": "Karmakar P.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Federated Learning for Connected and Automated Vehicles: A Survey of Existing Approaches and Challenges",
        "publication": "IEEE Transactions on Intelligent Vehicles",
        "citied_by": "45",
        "cover_date": "2024-01-01",
        "Abstract": "Machine learning (ML) is widely used for key tasks in Connected and Automated Vehicles (CAV), including perception, planning, and control. However, its reliance on vehicular data for model training presents significant challenges related to in-vehicle user privacy and communication overhead generated by massive data volumes. Federated learning (FL) is a decentralized ML approach that enables multiple vehicles to collaboratively develop models, broadening learning from various driving environments, enhancing overall performance, and simultaneously securing local vehicle data privacy and security. This survey paper presents a review of the advancements made in the application of FL for CAV (FL4CAV). First, centralized and decentralized frameworks of FL are analyzed, highlighting their key characteristics and methodologies. Second, diverse data sources, models, and data security techniques relevant to FL in CAVs are reviewed, emphasizing their significance in ensuring privacy and confidentiality. Third, specific applications of FL are explored, providing insight into the base models and datasets employed for each application. Finally, existing challenges for FL4CAV are listed and potential directions for future investigation to further enhance the effectiveness and efficiency of FL in the context of CAV are discussed.",
        "DOI": "10.1109/TIV.2023.3332675",
        "paper_author": "Chellapandi V.P.",
        "affiliation_name": "Purdue University",
        "affiliation_city": "West Lafayette",
        "affiliation_country": "United States",
        "affiliation_id": "60009254",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Exploiting Flexible and Secure Cryptographic Technique for Multidimensional Image Based on Graph Data Structure and Three-Input Majority Gate",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "45",
        "cover_date": "2024-03-01",
        "Abstract": "The emergence of the Industrial Internet of Things (IIoT) has greatly improved the efficiency of manufacturing, but it also faces significant security challenges during the operational phase. In this work, a chaos-based image cryptosystem is investigated for IIoT based on graph data structure (GDS) and three-input majority gate (TIMG) to meet the increasing demand for flexible and secure image processing. Some internal relationships between graph and image are first constructed through a flexible adjacency matrix and then the GDS is generalized for image operation to address security defects in classical diffusion structure in image cryptosystem, such as sequential diffusion path and fixed pattern diffusion operators. Technically, a nonsequential diffusion path is established by breadth-first-search traversing the vertices between interblock and intrablock. Then, a multifunctional calculator is designed for a typical diffusive nonlinear primitive based on the logical operator relation of TIMG. In addition, a class discrete maps with fractional-order is provided to enhance the flexibility of multitype key stream selection. Experimental results and analysis for the gray, color, and 3-D images fully demonstrate that a flexible and superior security cryptosystem can be implemented from GDS and TLMG techniques.",
        "DOI": "10.1109/TII.2023.3281659",
        "paper_author": "Sha Y.",
        "affiliation_name": "Dalian Polytechnic University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60069704",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Blockchain application in modern logistics information sharing: a review and case study analysis",
        "publication": "Production Planning and Control",
        "citied_by": "45",
        "cover_date": "2024-01-01",
        "Abstract": "In the traditional logistics industry, asymmetric information, issues with goods’ authenticity, and insufficient security can hinder business transactions, which induces high operating costs and is time-consuming. With its decentralisation, transparency, high security, and resistance to tampering, blockchain technology can effectively solve these issues. In this study, we designed a two-stage analysis scheme to identify and summarise how blockchain has been applied in modern logistics information sharing and its challenges. The latent Dirichlet allocation topic model was employed with 2465 selected studies to summarise the application scenarios. These data were used to create a blockchain integration framework to determine the optimal use of blockchain in modern logistics information sharing. Six key areas were identified: supply chain finance, logistics tracking, logistics collaboration, process optimisation, data security management, and logistics business mode innovation. Then, three typical real-world cases were analysed, and managerial recommendations to boost blockchain adoption in this industry are proposed.",
        "DOI": "10.1080/09537287.2022.2058997",
        "paper_author": "Xu X.",
        "affiliation_name": "China University of Petroleum (East China)",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60105111",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Bayesian decision model based reliable route formation in internet of things",
        "publication": "Indonesian Journal of Electrical Engineering and Computer Science",
        "citied_by": "44",
        "cover_date": "2024-06-01",
        "Abstract": "Security provisioning has become an important issue in wireless multimedia networks because of their crucial task of supporting several services. This paper presents Bayesian decision model based reliable route formation in internet of things (BDMI). The main objective of the BDMI approach is to distinguish unreliable sensor nodes and transmit the data efficiently. Active and passive attack recognition methods identify unreliable node sensor nodes. Remaining energy, node degree, and packet transmission rate parameters to observe their node possibilities for recognizing the passive unreliable nodes. In active recognition, the base station (BS) confirms every sensor node identity, remaining energy, supportive node rate, node location, and link efficiency parameters to detect active unreliable sensor nodes. The Bayesian decision model (BDM) efficiently isolates an unreliable sensor node in the multimedia network. Simulation outcomes illustrate that the BDMI approach can efficiently enhance unreliable node detection and minimize the packet loss ratio in the network.",
        "DOI": "10.11591/ijeecs.v34.i3.pp1665-1673",
        "paper_author": "Kumar M.J.",
        "affiliation_name": "Vellore Institute of Technology",
        "affiliation_city": "Vellore",
        "affiliation_country": "India",
        "affiliation_id": "60010618",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Ship imaging trajectory extraction via an aggregated you only look once (YOLO) model",
        "publication": "Engineering Applications of Artificial Intelligence",
        "citied_by": "44",
        "cover_date": "2024-04-01",
        "Abstract": "Maritime traffic community has paid a huge amount of focuses to establish maritime intelligent transportation infrastructure for the purpose of enhancing maritime traffic safety and efficiency. Maritime surveillance video is considered as a type of fundamental data sources for establishing intelligent maritime transportation infrastructure towards smart ship era. To that end, the study proposes an aggregated deep learning model-supported ship imaging trajectory extraction framework. The proposed framework starts by detecting ships from maritime images via a novel You Only Look Once (YOLO) model. More specifically, the proposed ship trajectory extraction framework obtains ship positions in a frame-by-frame manner via the proposed poly-YOLO module. Then, the proposed model maps ship positions in neighboring consecutive maritime images via an Enhanced Deep Sort (EDS) module. Experimental results suggest that the proposed ship trajectory extraction model achieves satisfactory performance due to that the average values of index multiple-object tracking accuracy (MOTa), recall rate (Rid) and index aggregated detection accuracy (Aggid) are larger than 89% (which outperform the comparison algorithms). The study can help varied maritime traffic participants obtain accurate on-site traffic situations in the smart ship era.",
        "DOI": "10.1016/j.engappai.2023.107742",
        "paper_author": "Chen X.",
        "affiliation_name": "Shanghai Maritime University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025785",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "From machine learning to deep learning: Advances of the recent data-driven paradigm shift in medicine and healthcare",
        "publication": "Current Research in Biotechnology",
        "citied_by": "43",
        "cover_date": "2024-01-01",
        "Abstract": "The medicine and healthcare sector has been evolving and advancing very fast. The advancement has been initiated and shaped by the applications of data-driven, robust, and efficient machine learning (ML) to deep learning (DL) technologies. ML in the medical sector is developing quickly, causing rapid progress, reshaping medicine, and improving clinician and patient experiences. ML technologies evolved into data-hungry DL approaches, which are more robust and efficient in dealing with medical data. This article reviews some critical data-driven aspects of machine intelligence in the medical field. In this direction, the article illustrated the recent progress of data-driven medical science using ML to DL in two categories: firstly, the recent development of data science in medicine with the use of ML to DL and, secondly, the chabot technologies in healthcare and medicine, particularly on ChatGPT. Here, we discuss the progress of ML, DL, and the transition requirements from ML to DL. To discuss the advancement in data science, we illustrate prospective studies of medical image data, newly evolved DL interpretation data from EMR or EHR, big data in personalized medicine, and dataset shifts in artificial intelligence (AI). Simultaneously, the article illustrated recently developed DL-enabled ChatGPT technology. Finally, we summarize the broad role of ML and DL in medicine and the significant challenges for implementing recent ML to DL technologies in healthcare. The overview of the data-driven paradigm shift in medicine using ML to DL technologies in the article will benefit researchers immensely.",
        "DOI": "10.1016/j.crbiot.2023.100164",
        "paper_author": "Chakraborty C.",
        "affiliation_name": "Adamas University",
        "affiliation_city": "Kolkata",
        "affiliation_country": "India",
        "affiliation_id": "60272396",
        "affiliation_state": "WB"
    },
    {
        "paper_title": "Unleashing the power of internet of things and blockchain: A comprehensive analysis and future directions",
        "publication": "Internet of Things and Cyber-Physical Systems",
        "citied_by": "43",
        "cover_date": "2024-01-01",
        "Abstract": "As the fusion of the Internet of Things (IoT) and blockchain technology advances, it is increasingly shaping diverse fields. The potential of this convergence to fortify security, enhance privacy, and streamline operations has ignited considerable academic interest, resulting in an impressive body of literature. However, there is a noticeable scarcity of studies employing Latent Dirichlet Allocation (LDA) to dissect and categorize this field. This review paper endeavours to bridge this gap by meticulously analysing a dataset of 4455 journal articles drawn solely from the Scopus database, cantered around IoT and blockchain applications. Utilizing LDA, we have extracted 14 distinct topics from the collection, offering a broad view of the research themes in this interdisciplinary domain. Our exploration underscores an upswing in research pertaining to IoT and blockchain, emphasizing the rising prominence of this technological amalgamation. Among the most recurrent themes are IoT and blockchain integration in supply chain management and blockchain in healthcare data management and security, indicating the significant potential of this convergence to transform supply chains and secure healthcare data. Meanwhile, the less frequently discussed topics include access control and management in blockchain-based IoT systems and energy efficiency in wireless sensor networks using blockchain and IoT. To the best of our knowledge, this paper is the first to apply LDA in the context of IoT and blockchain research, providing unique perspectives on the existing literature. Moreover, our findings pave the way for proposed future research directions, stimulating further investigation into the less explored aspects and sustaining the growth of this dynamic field.",
        "DOI": "10.1016/j.iotcps.2023.06.003",
        "paper_author": "Rejeb A.",
        "affiliation_name": "Università degli Studi di Roma \"Tor Vergata\"",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60027509",
        "affiliation_state": "RM"
    },
    {
        "paper_title": "Integrating Full-Color 2D Optical Waveguide and Heterojunction Engineering in Halide Microsheets for Multichannel Photonic Logical Gates",
        "publication": "Advanced Science",
        "citied_by": "42",
        "cover_date": "2024-05-08",
        "Abstract": "Ensuring information security has emerged as a paramount concern in contemporary human society. Substantial advancements in this regard can be achieved by leveraging photonic signals as the primary information carriers, utilizing photonic logical gates capable of wavelength tunability across various time and spatial domains. However, the challenge remains in the rational design of materials possessing space-time-color multiple-resolution capabilities. In this work, a facile approach is proposed for crafting metal-organic halides (MOHs) that offer space-time-color resolution. These MOHs integrate time-resolved room temperature phosphorescence and color-resolved excitation wavelength dependencies with both space-resolved ex situ optical waveguides and in situ heterojunctions. Capitalizing on these multifaceted properties, MOHs-based two-dimensional (2D) optical waveguides and heterojunctions exhibit the ability to tune full-color emissions across the spectra from blue to red, operating within different spatial and temporal scales. Therefore, this work introduces an effective methodology for engineering space-time-color resolved MOH microstructures, holding significant promise for the development of high-density photonic logical devices.",
        "DOI": "10.1002/advs.202310262",
        "paper_author": "Xing C.",
        "affiliation_name": "Beijing Normal University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60023237",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Optimizing IoT intrusion detection system: feature selection versus feature extraction in machine learning",
        "publication": "Journal of Big Data",
        "citied_by": "42",
        "cover_date": "2024-12-01",
        "Abstract": "Internet of Things (IoT) devices are widely used but also vulnerable to cyberattacks that can cause security issues. To protect against this, machine learning approaches have been developed for network intrusion detection in IoT. These often use feature reduction techniques like feature selection or extraction before feeding data to models. This helps make detection efficient for real-time needs. This paper thoroughly compares feature extraction and selection for IoT network intrusion detection in machine learning-based attack classification framework. It looks at performance metrics like accuracy, f1-score, and runtime, etc. on the heterogenous IoT dataset named Network TON-IoT using binary and multiclass classification. Overall, feature extraction gives better detection performance than feature selection as the number of features is small. Moreover, extraction shows less feature reduction compared with that of selection, and is less sensitive to changes in the number of features. However, feature selection achieves less model training and inference time compared with its counterpart. Also, more space to improve the accuracy for selection than extraction when the number of features changes. This holds for both binary and multiclass classification. The study provides guidelines for selecting appropriate intrusion detection methods for particular scenarios. Before, the TON-IoT heterogeneous IoT dataset comparison and recommendations were overlooked. Overall, the research presents a thorough comparison of feature reduction techniques for machine learning-driven intrusion detection in IoT networks.",
        "DOI": "10.1186/s40537-024-00892-y",
        "paper_author": "Li J.",
        "affiliation_name": "Universiti Teknologi Malaysia",
        "affiliation_city": "Johor Bahru",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60021005",
        "affiliation_state": "Johor"
    },
    {
        "paper_title": "A lightweight smart contracts framework for blockchain-based secure communication in smart grid applications",
        "publication": "IET Generation, Transmission and Distribution",
        "citied_by": "42",
        "cover_date": "2024-02-01",
        "Abstract": "Energy is a crucial need in today's world for powering homes, businesses, transportation, and industrial processes. Fossil fuels, such as oil, coal, and natural gas, have been the primary sources of energy for decades. However, there is growing recognition of the negative environmental impact of fossil fuels and the need to transition to cleaner and more sustainable sources of energy. Distributed Energy Resources (Formula presented.), such as wind and solar offer several benefits including, reducing energy costs, increasing resiliency, and decreasing carbon emissions. However, the integration of ((Formula presented.)) into the grid requires advanced communication and secure control strategies to ensure a stable and reliable grid operations. In this regard, a blockchain-based industrial wireless sensor network (Formula presented.) can provide secure and resilience data transmission to facilitate intelligent integration, monitoring, and control of (Formula presented.) in the smart grid. In this research, a smart contracts framework in Solana (Formula presented.) called Advanced Solana Blockchain ((Formula presented.)) is proposed for (Formula presented.) in the smart grid. The proposed (Formula presented.) scheme enables resilient and secure real-time control and monitoring of (Formula presented.) in smart grids. The performance evaluations and security analysis illustrated that this (Formula presented.) scheme is secure, reliable, and suitable in terms of lightweight data sharing between (Formula presented.) in smart grids.",
        "DOI": "10.1049/gtd2.13103",
        "paper_author": "Faheem M.",
        "affiliation_name": "Vaasan Yliopisto",
        "affiliation_city": "Vaasa",
        "affiliation_country": "Finland",
        "affiliation_id": "60007154",
        "affiliation_state": "Ostrobothnia"
    },
    {
        "paper_title": "A blockchain-enabled privacy-preserving authentication management protocol for Internet of Medical Things",
        "publication": "Expert Systems with Applications",
        "citied_by": "42",
        "cover_date": "2024-03-01",
        "Abstract": "Over the last decade, with the increasing popularity and usage of the internet of things worldwide, Internet of Medical Things (IoMT) has emerged as a key technology of the modern era. IoMT uses Artificial Intelligence, 5G, big data, edge computing, and blockchain to provide users with electronic medical services. However, it may face several security threats and attacks over an insecure public network. Therefore, to protect sensitive medical data in IoMT, it is necessary to design a secure and efficient authentication protocol. In this study, we propose a privacy-preserving authentication management protocol based on blockchain. The protocol uses a blockchain to store identities and related parameters to assist communication entities in authentication. In addition, the protocol adopts a three-factor authentication method and introduces Chebyshev chaotic map to ensure the security of user login and authentication. Formal security proof and analysis using the random oracle model and Burrows-Abadi-Needham logic show that the proposed protocol is secure. Moreover, we use informal security analysis to demonstrate that the protocol can resist various security attacks. The functional comparison shows that the protocol has high security. Through performance analysis and comparison with other protocols, the proposed protocol can increase computation overhead, communication overhead, and storage overhead by up to 39.8%, 93.6%, and 86.7%,respectively.",
        "DOI": "10.1016/j.eswa.2023.121329",
        "paper_author": "Miao J.",
        "affiliation_name": "University of Science and Technology Beijing",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60018273",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "State of the science and recommendations for using wearable technology in sleep and circadian research",
        "publication": "Sleep",
        "citied_by": "41",
        "cover_date": "2024-04-01",
        "Abstract": "Wearable sleep-tracking technology is of growing use in the sleep and circadian fields, including for applications across other disciplines, inclusive of a variety of disease states. Patients increasingly present sleep data derived from their wearable devices to their providers and the ever-increasing availability of commercial devices and new-generation research/clinical tools has led to the wide adoption of wearables in research, which has become even more relevant given the discontinuation of the Philips Respironics Actiwatch. Standards for evaluating the performance of wearable sleep-tracking devices have been introduced and the available evidence suggests that consumer-grade devices exceed the performance of traditional actigraphy in assessing sleep as defined by polysomnogram. However, clear limitations exist, for example, the misclassification of wakefulness during the sleep period, problems with sleep tracking outside of the main sleep bout or nighttime period, artifacts, and unclear translation of performance to individuals with certain characteristics or comorbidities. This is of particular relevance when person-specific factors (like skin color or obesity) negatively impact sensor performance with the potential downstream impact of augmenting already existing healthcare disparities. However, wearable sleep-tracking technology holds great promise for our field, given features distinct from traditional actigraphy such as measurement of autonomic parameters, estimation of circadian features, and the potential to integrate other self-reported, objective, and passively recorded health indicators. Scientists face numerous decision points and barriers when incorporating traditional actigraphy, consumer-grade multi-sensor devices, or contemporary research/clinical-grade sleep trackers into their research. Considerations include wearable device capabilities and performance, target population and goals of the study, wearable device outputs and availability of raw and aggregate data, and data extraction, processing, and analysis. Given the difficulties in the implementation and utilization of wearable sleep-tracking technology in real-world research and clinical settings, the following State of the Science review requested by the Sleep Research Society aims to address the following questions. What data can wearable sleep-tracking devices provide? How accurate are these data? What should be taken into account when incorporating wearable sleep-tracking devices into research? These outstanding questions and surrounding considerations motivated this work, outlining practical recommendations for using wearable technology in sleep and circadian research.",
        "DOI": "10.1093/sleep/zsad325",
        "paper_author": "de Zambotti M.",
        "affiliation_name": "SRI International",
        "affiliation_city": "Menlo Park",
        "affiliation_country": "United States",
        "affiliation_id": "60000461",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Energy transition: Connotations, mechanisms and effects",
        "publication": "Energy Strategy Reviews",
        "citied_by": "41",
        "cover_date": "2024-03-01",
        "Abstract": "Currently, the research agenda of energy transition is gaining momentum. This paper conducts a comprehensive review of this body of research by presenting a framework that describes the connotations, mechanisms, and effects of energy transitions. The study concludes that the energy transition will lead to the reconstruction of energy system elements beyond the energy sector, with the dual connotations of explicit transition and implicit transition. The explicit transition is usually captured by statistic data and information, for instance, energy utilization type, structure, form, transportation mode, and spatial pattern. The implicit transition involves shifts in energy security, geopolitical structure, energy power, energy justice, and energy governance, which receives relatively less attention in current literature. The energy transition is a highly socialized process, driven by many intertwined factors such as technological innovation, market mechanisms, policy arrangements, and sociocultural factors, triggering profound socio-economic and ecological effects. Looking ahead, it is urgent to pay attention to the multi-scale effects of energy transition, avoid the risks brought by energy transition, and ultimately achieve just energy transition. This paper provides a novel perspective and contributes to the literature on theoretical understanding and advancement of energy transition.",
        "DOI": "10.1016/j.esr.2024.101320",
        "paper_author": "Yang Y.",
        "affiliation_name": "Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60031150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Hybrid Privacy Preserving Federated Learning Against Irregular Users in Next-Generation Internet of Things",
        "publication": "Journal of Systems Architecture",
        "citied_by": "41",
        "cover_date": "2024-03-01",
        "Abstract": "While federated learning (FL) is a well-known privacy-preserving (PP) solution, recent studies demonstrate that it still has privacy problems and vulnerabilities, particularly in the context of the Next Generation Internet-of-Things (NG-IoT). Attackers on the server can potentially retrieve sensitive information such as data tabs and memberships. Additionally, current FL studies often overlook critical FL issues such as user dropout and low-quality data, which are prevalent in NG-IoT environments. In this article, we propose a privacy-preserving federated model in hybrid terms based on synchronous + asynchronous manner. This federated model removes the fundamental issues of FL-enabled NG-IoT environments while applying Two-Trapdoor Homomorphic Encryption (TTHE) to ensure the privacy and confidentiality of all components in the proposed model. Furthermore, our server protocol removes the effect of irregular users. In this regard, to control the impact of user dropout, we developed the hybrid LEGATO algorithm, which is asynchronous. To tackle users with low-quality data, we utilize the data-sharing method. Security analysis of the proposed model guarantees correctness, auditing, and PP in a federated setup. Also, in the performance evaluation, we achieved a high level of functionality and accuracy compared to peer works, while system overheads are shown to be lower.",
        "DOI": "10.1016/j.sysarc.2024.103088",
        "paper_author": "Yazdinejad A.",
        "affiliation_name": "University of Guelph",
        "affiliation_city": "Guelph",
        "affiliation_country": "Canada",
        "affiliation_id": "60015881",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Blockchain-Based Smart Contract Model for Securing Healthcare Transactions by Using Consumer Electronics and Mobile-Edge Computing",
        "publication": "IEEE Transactions on Consumer Electronics",
        "citied_by": "41",
        "cover_date": "2024-02-01",
        "Abstract": "Blockchain technology has been an emerging solution to various problems in the healthcare sector. Its applications in the healthcare sector range from securing patient data to increasing transparency in the pharmaceutical supply chain. Here, consumer electronic devices are used to collect and process healthcare data before uploading them to a blockchain network. Many schemes have been already developed using blockchain technology, Mobile Edge Computing (MEC), and consumer electronic devices to exchange Electronic Medical Records (EMR) efficiently. However, they face many critical concerns like data security, automation, and scalability. A novel blockchain-based EMR sharing scheme is proposed in this work to solve these problems. It protects the system during the entire Health Information Exchange (HIE) process between the patient and doctor. Here, consumer electronic devices and MEC are used to generate and upload EMRs and diagnosis reports. The proposed scheme utilizes Advanced Encryption Standard (AES), Rivest Shamir and Adleman (RSA), Edwards-curve Digital Signature Algorithm (EdDSA), Elliptic Curve Digital Signature Algorithm (ECDSA) techniques, and Inter-Planetary File System (IPFS) to securely store EMRs, so that they cannot be tampered with and are always available to authorized users. Experimental results of the proposed scheme show its efficiency compared to other existing well-known schemes.",
        "DOI": "10.1109/TCE.2024.3357115",
        "paper_author": "Datta S.",
        "affiliation_name": "National Institute of Technology, Agartala",
        "affiliation_city": "Agartala",
        "affiliation_country": "India",
        "affiliation_id": "60104582",
        "affiliation_state": "TR"
    },
    {
        "paper_title": "A comprehensive review of AI-enhanced smart grid integration for hydrogen energy: Advances, challenges, and future prospects",
        "publication": "International Journal of Hydrogen Energy",
        "citied_by": "41",
        "cover_date": "2024-05-20",
        "Abstract": "The convergence of hydrogen energy with artificial intelligence (AI) in smart infrastructure has significant potential to revolutionise the worldwide energy sector. This article thoroughly examines the progress, difficulties, and potential breakthroughs in the integration of AI technology with smart grids to enhance the use of hydrogen energy. The study focuses on utilising AI technologies such as deep learning and machine learning to optimise the processes of generating, distributing, and utilising energy. The discoveries stemming from this investigation facilitate prognostic maintenance, instantaneous decision-making, and effective demand-side management, augmenting the durability and eco-friendliness of energy systems. Nevertheless, this auspicious panorama is surrounded by significant obstacles. Significant issues develop regarding data privacy and security when sensitive information is sent over AI-powered grid systems. Interoperability difficulties necessitate standardising the communication protocols to enable smooth data flow. Additionally, further research is essential to tackle the technological limitations of AI in grid management. This article presents a forward-thinking viewpoint on the incorporation of AI-enhanced smart grid technologies, with a focus on future expectations. Autonomous energy management systems offer improved flexibility, proactive maintenance, and flexible energy distribution. Simultaneously, the combination of Edge AI and decentralisation facilitates the establishment of energy generating and storage facilities at local levels. This helps to make immediate decisions, minimises delays, and improves the durability of the power grid. The report emphasises the pivotal importance of governmental and regulatory factors in directing these advancements. The foundation for a safe and flexible power system is established by data privacy legislation, grid modernisation initiatives, and incentives for hydrogen energy. The essay promotes energy market reforms, technological neutrality, and measures that improve grid resilience as a means of achieving environmental sustainability. The integration of hydrogen energy into smart infrastructure is facilitated by AI, and strategic planning and collaborative design are crucial for achieving a resilient, sustainable, and efficient energy future. This article provides a strategic plan for efficiently handling complexities, leveraging advantageous situations, and collaboratively building an energy industry that is adaptable, productive, and environmentally aware.",
        "DOI": "10.1016/j.ijhydene.2024.01.129",
        "paper_author": "SaberiKamarposhti M.",
        "affiliation_name": "Multimedia University",
        "affiliation_city": "Cyberjaya",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60012005",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Stochastic Gradient Descent Intrusions Detection for Wireless Sensor Network Attack Detection System Using Machine Learning",
        "publication": "IEEE Access",
        "citied_by": "41",
        "cover_date": "2024-01-01",
        "Abstract": "Communication in cyber-physical systems relies heavily on Wireless Sensor Networks (WSNs), which have numerous uses including ambient monitoring, object recognition, and data transmission. However, they are vulnerable to cyberattacks because they are connected to the IoT. In order to combat the difficulties associated with WSN intrusion detection, this research employs machine learning techniques, notably the Gaussian Nave Bayes (GNB) and Stochastic Gradient Descent (SGD) algorithms. The effectiveness of recommendation systems is improved with the introduction of context awareness. To lessen the burden on the computer, we first do a principal component analysis and singular value decomposition on the raw traffic data. On the WSN-DS dataset, the suggested SG-IDS model achieved a 96% accuracy rate, outperforming state-of-the-art algorithms with higher rates of 98% accuracy, 96% recall, and 97% F1 measurement. In an evaluation of an IoMT dataset, the SG-IDS performed admirably, with an accuracy of 0.87 and a precision of 1.00 in intrusion detection tasks.",
        "DOI": "10.1109/ACCESS.2023.3349248",
        "paper_author": "Saleh H.M.",
        "affiliation_name": "University of Anbar",
        "affiliation_city": "Ramadi",
        "affiliation_country": "Iraq",
        "affiliation_id": "60071163",
        "affiliation_state": "Al Anbar"
    },
    {
        "paper_title": "Firefly algorithm based WSN-IoT security enhancement with machine learning for intrusion detection",
        "publication": "Scientific Reports",
        "citied_by": "41",
        "cover_date": "2024-12-01",
        "Abstract": "A Wireless Sensor Network (WSN) aided by the Internet of Things (IoT) is a collaborative system of WSN systems and IoT networks are work to exchange, gather, and handle data. The primary objective of this collaboration is to enhance data analysis and automation to facilitate improved decision-making. Securing IoT with the assistance of WSN necessitates the implementation of protective measures to confirm the safety and reliability of the interconnected WSN and IoT components. This research significantly advances the current state of the art in IoT and WSN security by synergistically harnessing the potential of machine learning and the Firefly Algorithm. The contributions of this work are twofold: firstly, the proposed FA-ML technique exhibits an exceptional capability to enhance intrusion detection accuracy within the WSN-IoT landscape. Secondly, the amalgamation of the Firefly Algorithm and machine learning introduces a novel dimension to the domain of security-oriented optimization techniques. The implications of this research resonate across various sectors, ranging from critical infrastructure protection to industrial automation and beyond, where safeguarding the integrity of interconnected systems are of paramount importance. The amalgamation of cutting-edge machine learning and bio-inspired algorithms marks a pivotal step forward in crafting robust and intelligent security measures for the evolving landscape of IoT-driven technologies. For intrusion detection in the WSN-IoT, the FA-ML method employs a support vector machine (SVM) machine model for classification with parameter tuning accomplished using a Grey Wolf Optimizer (GWO) algorithm. The experimental evaluation is simulated using NSL-KDD Dataset, revealing the remarkable enhancement of the FA-ML technique, achieving a maximum accuracy of 99.34%. In comparison, the KNN-PSO and XGBoost models achieved lower accuracies of 96.42% and 95.36%, respectively. The findings validate the potential of the FA-ML technique as an active security solution for WSN-IoT systems, harnessing the power of machine learning and the Firefly Algorithm to bolster intrusion detection capabilities.",
        "DOI": "10.1038/s41598-023-50554-x",
        "paper_author": "Karthikeyan M.",
        "affiliation_name": "Chennai Institute of Technology",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60114413",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Evaluation of blockchain implementation solutions in the sustainable supply chain: A novel hybrid decision approach based on Z-numbers",
        "publication": "Expert Systems with Applications",
        "citied_by": "41",
        "cover_date": "2024-01-01",
        "Abstract": "Nowadays, because of the increase in global competition and the need to pay attention to sustainable issues, achieve a competitive advantage, reduce costs, and improve Supply Chain (SC) network management, the use of blockchain and its integration have become necessary in the network. The use of Blockchain Technology (BT) leads to transparency, controllability, security, flexibility, visibility, reduction of costs, efficient processes, and achieving sustainable development goals in the SC network. To successfully implement BT in SC, it is necessary to identify and evaluate the operational solutions to solve the challenges and obstacles of BT. Therefore, this study aims to identify and evaluate BT implementation solutions to achieve sustainability in the SC. The novelties and contributions of this research include identifying blockchain solutions to achieve sustainable development goals in the SC, proposing a new application for the agricultural products SC to utilize blockchain, and presenting a novel hybrid decision procedure including the Step-wise Weight Assessment Ratio Analysis (SWARA) and the Combined Compromise Solution (CoCoSo) using on Z-numbers for evaluating solutions. The proposed approach can deal with ambiguity in the complex environment of the decision due to the consideration of reliability and uncertainty in the data, reducing the number of pairwise comparisons, low inconsistency rate, reducing the complexity of calculations, ease of implementation, no limit in the number of criteria, no dependence on predetermined scales, and providing compromise solutions based on different opinions of experts. To examine the results, sensitivity analysis, and validation were performed. The findings showed that for the successful implementation of blockchain in the agricultural SC, the infrastructure of this technology must be created and integrated with all levels of the SC, and using BT must be provided through the use of sustainable methods. By developing areas of cooperation and participation through the creation of facilitating rules between different partners in the SC, collective investments can be made in the development of the infrastructure.",
        "DOI": "10.1016/j.eswa.2023.121123",
        "paper_author": "Hosseini Dehshiri S.J.",
        "affiliation_name": "Allameh Tabataba'i University",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60024529",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Corporate digital responsibility (CDR) in the age of AI: implications for interactive marketing",
        "publication": "Journal of Research in Interactive Marketing",
        "citied_by": "41",
        "cover_date": "2024-01-30",
        "Abstract": "Purpose: Despite all the recent achievements in the field of interactive marketing and artificial intelligence (AI), it is important to consider the ethical implications of these technologies. This paper explains the concept of corporate digital responsibility (CDR) and how it is affected by new advances in AI. Design/methodology/approach: The authors build on the work of Wirtz et al., (2023) and derive several managerial implications for the challenges that AI poses to CDR. CDR refers to a service company's ethical and fair use of data and technology within its digital service ecosystem. It involves establishing standards, protecting customer privacy, conducting external audits and striving for an equitable power dynamic between service firms and their partners. Findings: Despite the risks involved, many companies are not prioritizing good CDR practices. Financial benefits from the collection and use of consumer data, improved customer experience through AI-driven customization and personalization, cost reduction through service automation and the trade-offs between organizational goals and CDR practices can prevent companies from prioritizing good CDR practices. Originality/value: This is one of the first articles in the service domain to take the concept of CDR and apply it to recent developments in generative AI. Research limitations/implications: The emergence of powerful AI tools presents opportunities and challenges. Research opportunities include responsible business restructuring, responsible service automation to ensure fairness and human oversight, addressing dehumanization of service delivery, responsible customer profiling to address privacy and discrimination concerns and preventing AI misuse.",
        "DOI": "10.1108/JRIM-06-2023-0176",
        "paper_author": "Kunz W.H.",
        "affiliation_name": "University of Massachusetts Boston",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60024063",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Federated Multiagent Deep Reinforcement Learning Approach via Physics-Informed Reward for Multimicrogrid Energy Management",
        "publication": "IEEE Transactions on Neural Networks and Learning Systems",
        "citied_by": "41",
        "cover_date": "2024-05-01",
        "Abstract": "The utilization of large-scale distributed renewable energy (RE) promotes the development of the multimicrogrid (MMG), which raises the need of developing an effective energy management method to minimize economic costs and keep self energy sufficiency. The multiagent deep reinforcement learning (MADRL) has been widely used for the energy management problem because of its real-time scheduling ability. However, its training requires massive energy operation data of microgrids (MGs), while gathering these data from different MGs would threaten their privacy and data security. Therefore, this article tackles this practical yet challenging issue by proposing a federated MADRL (F-MADRL) algorithm via the physics-informed reward. In this algorithm, the federated learning (FL) mechanism is introduced to train the F-MADRL algorithm, thus ensures the privacy and the security of data. In addition, a decentralized MMG model is built, and the energy of each participated MG is managed by an agent, which aims to minimize economic costs and keep self energy sufficiency according to the physics-informed reward. At first, MGs individually execute the self-training based on local energy operation data to train their local agent models. Then, these local models are periodically uploaded to a server and their parameters are aggregated to build a global agent, which will be broadcasted to MGs and replace their local agents. In this way, the experience of each MG agent can be shared and the energy operation data are not explicitly transmitted, thus protecting the privacy and ensuring data security. Finally, experiments are conducted on Oak Ridge National Laboratory distributed energy control communication laboratory MG (ORNL-MG) test system, and the comparisons are carried out to verify the effectiveness of introducing the FL mechanism and the outperformance of our proposed F-MADRL.",
        "DOI": "10.1109/TNNLS.2022.3232630",
        "paper_author": "Li Y.",
        "affiliation_name": "Huazhong University of Science and Technology",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60025761",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "IoT-enabled remote patient monitoring for chronic disease management and cost savings: Transforming healthcare",
        "publication": "Advances in Explainable AI Applications for Smart Cities",
        "citied_by": "40",
        "cover_date": "2024-01-18",
        "Abstract": "The integration of internet of things (IoT) technology in healthcare has revolutionized chronic disease management and healthcare cost reduction. IoT-enabled remote patient monitoring systems provide real-time insights into patients' health parameters, enabling informed decisions and patient participation. The central hub of these systems provides accurate, up-to-date patient data, enabling timely alerts for chronic diseases. Electronic health records (EHR) offer comprehensive historical health data while ensuring privacy and security. However, challenges like data security, scalability, and interoperability remain. The healthcare industry must improve security measures, standardize interoperability, and adopt advanced analytics, artificial intelligence, and wearable technology for personalized, data-driven, and cost-effective care.",
        "DOI": "10.4018/978-1-6684-6361-1.ch014",
        "paper_author": "Malathi J.",
        "affiliation_name": "Sri Sairam Engineering College",
        "affiliation_city": "Dhanbad",
        "affiliation_country": "India",
        "affiliation_id": "115135162",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Tailored Fabrication of Full-Color Ultrastable Room-Temperature Phosphorescence Carbon Dots Composites with Unexpected Thermally Activated Delayed Fluorescence",
        "publication": "Advanced Materials",
        "citied_by": "40",
        "cover_date": "2024-07-04",
        "Abstract": "The development of single-system materials that exhibit both multicolor room-temperature phosphorescence (RTP) and thermally activated delayed fluorescence (TADF) with tunable after glow colors and channels is challenging. In this study, four metal-free carbon dots (CDs) are developed through structural tailoring, and panchromatic high-brightness RTP is achieved via strong chemical encapsulation in urea. The maximum lifetime and quantum yield reaches 2141 ms and 56.55%, respectively. Moreover, CDs-IV@urea, prepared via coreshell interaction engineering, exhibits a dual afterglow of red RTP and green TADF. The degree of conjugation and functional groups of precursors affects the binding interactions of the nitrogen cladding on CDs, which in turn stabilizes triplet energy levels and affects the energy gap between S1 and T1 (ΔEST) to induce multicolor RTP. The enhanced wrapping interaction lowers the ΔEST, promoting reverse intersystem crossing, which leads to phosphorescence and TADF. This strong coreshell interaction fully stabilizes the triplet state, thus stabilizing the material in water, even in extreme environments such as strong acids and oxidants. These afterglow materials are tested in multicolor, time, and temperature multiencryption as well as in multicolor in vivo bioimaging. Hence, these materials have promising practical applications in information security as well as biomedical diagnosis and treatment.",
        "DOI": "10.1002/adma.202401220",
        "paper_author": "Ai L.",
        "affiliation_name": "Zhengzhou University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60018554",
        "affiliation_state": "Henan"
    },
    {
        "paper_title": "AI-enhanced blockchain technology: A review of advancements and opportunities",
        "publication": "Journal of Network and Computer Applications",
        "citied_by": "40",
        "cover_date": "2024-05-01",
        "Abstract": "Blockchain technology has rapidly gained popularity, permeating various fields due to its inherent features of security, transparency, and decentralization. Blockchain-based applications, spanning from financial transactions to supply chain management, have revolutionized numerous industries. Concurrently, Artificial Intelligence (AI) techniques have emerged as a powerful tool for efficiently solving complex problems. The integration of AI into blockchain applications has shown promise in addressing key challenges such as security, consensus, scalability, and interoperability. While existing literature offers several surveys on the intersection of AI and blockchain, our work takes a distinct perspective by focusing on how AI solutions can enhance and optimize blockchain technology and its applications. Our goal is to provide a comprehensive literature overview of the methods that have been employed to improve blockchain technology through AI, encompassing machine learning, deep learning, natural language processing and reinforcement learning. Our contribution highlights AI's potential to enhance blockchain, improving efficiency, security, and reliability of blockchain-based applications. By exploring AI's role in consensus, smart contracts, and data privacy, it advances theory and practical applications, fostering innovation across sectors for a more secure and efficient digital future.",
        "DOI": "10.1016/j.jnca.2024.103858",
        "paper_author": "Ressi D.",
        "affiliation_name": "Università Ca' Foscari Venezia",
        "affiliation_city": "Venice",
        "affiliation_country": "Italy",
        "affiliation_id": "60013494",
        "affiliation_state": "VE"
    },
    {
        "paper_title": "Blockchain-Based Federated Learning Technique for Privacy Preservation and Security of Smart Electronic Health Records",
        "publication": "IEEE Transactions on Consumer Electronics",
        "citied_by": "40",
        "cover_date": "2024-02-01",
        "Abstract": "This study introduces a blockchain-based lightweight encryption strategy with federated learning to address the scalability and trust concerns of electronic health records (EHR). After implementing lightweight encryption, the EHR data is stored in a decentralized cloud system. The importance of protecting the privacy and security of distant patients' health records is explored. Now that stakeholders have a secure portal and cloud data is inaccessible, assaults on electronic healthcare records should decrease. The study guarantees full encryption throughout the whole conversation with federated learning. Deprived of the essential for a trusted third party, the system sets up active smart contracts at runtime between the sensor and the data user to facilitate the transfer of EHR data. To ensure that the data is private between the owner and user during the contract's execution, it employs a very effective proxy re-encryption mechanism with federated learning. To examine the performance of the proposed system, it has been built and deployed on an Ethereum-based testbed. It is observed that the PSNR and MSE of the proposed model are 39 (1.07×) and 229.6 (1.02×) respectively. The entropy of the image is assessed to be 7.8 for the proposed model. This is also compared with existing algorithms and proved to be a secured model.",
        "DOI": "10.1109/TCE.2023.3315415",
        "paper_author": "Guduri M.",
        "affiliation_name": "School of Computing &amp; Informatics",
        "affiliation_city": "Lafayette",
        "affiliation_country": "United States",
        "affiliation_id": "60280594",
        "affiliation_state": "LA"
    },
    {
        "paper_title": "Secure Federated Learning with Fully Homomorphic Encryption for IoT Communications",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "40",
        "cover_date": "2024-02-01",
        "Abstract": "The emergence of the Internet of Things (IoT) has revolutionized people's daily lives, providing superior quality services in cognitive cities, healthcare, and smart buildings. However, smart buildings use heterogeneous networks. The massive number of interconnected IoT devices increases the possibility of IoT attacks, emphasizing the necessity of secure and privacy-preserving solutions. Federated learning (FL) has recently emerged as a promising machine learning (ML) paradigm for IoT networks to address these concerns. In FL, multiple devices collaborate to learn a global model without sharing their raw data. However, FL still faces privacy and security concerns due to the transmission of sensitive data (i.e., model parameters) over insecure communication channels. These concerns can be addressed using fully homomorphic encryption (FHE), a powerful cryptographic technique that enables computations on encrypted data without requiring them to be decrypted first. In this study, we propose a secure FL approach in IoT-enabled smart cities that combines FHE and FL to provide secure data and maintain privacy in distributed environments. We present four different FL-based FHE approaches in which data are encrypted and transmitted over a secure medium. The proposed approaches achieved high accuracy, recall, precision, and F-scores, in addition to providing strong privacy and security safeguards. Furthermore, the proposed approaches effectively reduced communication overhead and latency compared to the baseline approach. These approaches yielded improvements ranging from 80.15% to 89.98% in minimizing communication overhead. Additionally, one of the approaches achieved a remarkable latency reduction of 70.38%. The implementation of these security models is nontrivial, and the code is publicly available at https://github.com/Artifitialleap-MBZUAI/Secure-Federated-Learning-with-Fully-Homomorphic-Encryption-for-IoT-Communications.",
        "DOI": "10.1109/JIOT.2023.3302065",
        "paper_author": "Hijazi N.M.",
        "affiliation_name": "Mohamed Bin Zayed University of Artificial Intelligence",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60195969",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "An Explainable and Resilient Intrusion Detection System for Industry 5.0",
        "publication": "IEEE Transactions on Consumer Electronics",
        "citied_by": "40",
        "cover_date": "2024-02-01",
        "Abstract": "Industry 5.0 is a emerging transformative model that aims to develop a hyperconnected, automated, and data-driven industrial ecosystem. This digital transformation will boost productivity and efficiency throughout the production process but will be more prone to new sophisticated cyber-attacks. Deep learning-based Intrusion Detection Systems (IDS) have the potential to recognize intrusions with high accuracy. However, these models are complex and are treated as a black box by developers and security analysts due to the inability to interpret the decisions made by these models. Motivated by the challenges, this paper presents an explainable and resilient IDS for Industry 5.0. The proposed IDS is designed by combining bidirectional long short-term memory networks (BiLSTM), a bidirectional-gated recurrent unit (Bi-GRU), fully connected layers and a softmax classifier to enhance the intrusion detection process in Industry 5.0. We employ the SHapley Additive exPlanations (SHAP) mechanism to interpret and understand the features that contributed the most in the decision of the proposed cyber-resilient IDS. The evaluation of the proposed model using the explainability can ensure that the model is working as expected. The experimental results based on the CICDDoS2019 dataset confirms the superiority of the proposed IDS over some recent approaches.",
        "DOI": "10.1109/TCE.2023.3283704",
        "paper_author": "Javeed D.",
        "affiliation_name": "Software College of Northeastern University",
        "affiliation_city": "Shenyang",
        "affiliation_country": "China",
        "affiliation_id": "60118699",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Robust and Privacy-Preserving Decentralized Deep Federated Learning Training: Focusing on Digital Healthcare Applications",
        "publication": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
        "citied_by": "40",
        "cover_date": "2024-01-01",
        "Abstract": "Federated learning of deep neural networks has emerged as an evolving paradigm for distributed machine learning, gaining widespread attention due to its ability to update parameters without collecting raw data from users, especially in digital healthcare applications. However, the traditional centralized architecture of federated learning suffers from several problems (e.g., single point of failure, communication bottlenecks, etc.), especially malicious servers inferring gradients and causing gradient leakage. To tackle the above issues, we propose a robust and privacy-preserving decentralized deep federated learning (RPDFL) training scheme. Specifically, we design a novel ring FL structure and a Ring-Allreduce-based data sharing scheme to improve the communication efficiency in RPDFL training. Furthermore, we improve the process of distributing parameters of the Chinese residual theorem to update the execution process of the threshold secret sharing, supporting healthcare edge to drop out during the training process without causing data leakage, and ensuring the robustness of the RPDFL training under the Ring-Allreduce-based data sharing scheme. Security analysis indicates that RPDFL is provable secure. Experiment results show that RPDFL is significantly superior to standard FL methods in terms of model accuracy and convergence, and is suitable for digital healthcare applications.",
        "DOI": "10.1109/TCBB.2023.3243932",
        "paper_author": "Tian Y.",
        "affiliation_name": "Guizhou University",
        "affiliation_city": "Guiyang",
        "affiliation_country": "China",
        "affiliation_id": "60005027",
        "affiliation_state": "Guizhou"
    },
    {
        "paper_title": "Mitigating the risk of specific supply chain disruptions through blockchain technology",
        "publication": "Supply Chain Forum",
        "citied_by": "40",
        "cover_date": "2024-01-01",
        "Abstract": "Research extends in all directions regarding the usage of blockchain technology in operations, logistics, and supply chain management. However, little is known about the role of blockchain in mitigating the risk of specific supply chain disruptions. Therefore, this paper investigates which disruptions in the supply chain can be mitigated through blockchain as well as how these issues can be alleviated. By utilising data collected from a systematic literature review, we find that blockchain mitigates disruptions that are related to specific supply and demand risks: behavioural uncertainties, poor information security, fraud and counterfeit risks, data loss and human errors, operational risks, transactional risks, foodborne illness risks, and information asymmetries. Blockchain is useful in these areas because, as a distributed ledger technology, it integrates the supply chain’s communication systems with a unified platform that improves information-sharing and processing capabilities. Our study represents a step towards improved understanding of blockchain’s positive impact in supply chain and information management-related fields.",
        "DOI": "10.1080/16258312.2022.2090273",
        "paper_author": "Alkhudary R.",
        "affiliation_name": "Laboratoire de Recherche en Sciences de Gestion Panthéon-Assas (LARGEPA)",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60276179",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "Feature extraction for machine learning-based intrusion detection in IoT networks",
        "publication": "Digital Communications and Networks",
        "citied_by": "39",
        "cover_date": "2024-02-01",
        "Abstract": "A large number of network security breaches in IoT networks have demonstrated the unreliability of current Network Intrusion Detection Systems (NIDSs). Consequently, network interruptions and loss of sensitive data have occurred, which led to an active research area for improving NIDS technologies. In an analysis of related works, it was observed that most researchers aim to obtain better classification results by using a set of untried combinations of Feature Reduction (FR) and Machine Learning (ML) techniques on NIDS datasets. However, these datasets are different in feature sets, attack types, and network design. Therefore, this paper aims to discover whether these techniques can be generalised across various datasets. Six ML models are utilised: a Deep Feed Forward (DFF), Convolutional Neural Network (CNN), Recurrent Neural Network (RNN), Decision Tree (DT), Logistic Regression (LR), and Naive Bayes (NB). The accuracy of three Feature Extraction (FE) algorithms is detected; Principal Component Analysis (PCA), Auto-encoder (AE), and Linear Discriminant Analysis (LDA), are evaluated using three benchmark datasets: UNSW-NB15, ToN-IoT and CSE-CIC-IDS2018. Although PCA and AE algorithms have been widely used, the determination of their optimal number of extracted dimensions has been overlooked. The results indicate that no clear FE method or ML model can achieve the best scores for all datasets. The optimal number of extracted dimensions has been identified for each dataset, and LDA degrades the performance of the ML models on two datasets. The variance is used to analyse the extracted dimensions of LDA and PCA. Finally, this paper concludes that the choice of datasets significantly alters the performance of the applied techniques. We believe that a universal (benchmark) feature set is needed to facilitate further advancement and progress of research in this field.",
        "DOI": "10.1016/j.dcan.2022.08.012",
        "paper_author": "Sarhan M.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "A Comprehensive Survey: Evaluating the Efficiency of Artificial Intelligence and Machine Learning Techniques on Cyber Security Solutions",
        "publication": "IEEE Access",
        "citied_by": "39",
        "cover_date": "2024-01-01",
        "Abstract": "Given the continually rising frequency of cyberattacks, the adoption of artificial intelligence methods, particularly Machine Learning (ML), Deep Learning (DL), and Reinforcement Learning (RL), has become essential in the realm of cybersecurity. These techniques have proven to be effective in detecting and mitigating cyberattacks, which can cause significant harm to individuals, organizations, and even countries. Machine learning algorithms use statistical methods to identify patterns and anomalies in large datasets, enabling security analysts to detect previously unknown threats. Deep learning, a subfield of ML, has shown great potential in improving the accuracy and efficiency of cybersecurity systems, particularly in image and speech recognition. On the other hand, RL is again a subfield of machine learning that trains algorithms to learn through trial and error, making it particularly effective in dynamic environments. We also evaluated the usage of ChatGPT-like AI tools in cyber-related problem domains on both sides, positive and negative. This article provides an overview of how ML, DL, and RL are applied in cybersecurity, including their usage in malware detection, intrusion detection, vulnerability assessment, and other areas. The paper also specifies several research questions to provide a more comprehensive framework to investigate the efficiency of AI and ML models in the cybersecurity domain. The state-of-the-art studies using ML, DL, and RL models are evaluated in each Section based on the main idea, techniques, and important findings. It also discusses these techniques' challenges and limitations, including data quality, interpretability, and adversarial attacks. Overall, the use of ML, DL, and RL in cybersecurity holds great promise for improving the effectiveness of security systems and enhancing our ability to protect against cyberattacks. Therefore, it is essential to continue developing and refining these techniques to address the ever-evolving nature of cyber threats. Besides, some promising solutions that rely on machine learning, deep learning, and reinforcement learning are susceptible to adversarial attacks, underscoring the importance of factoring in this vulnerability when devising countermeasures against sophisticated cyber threats. We also concluded that ChatGPT can be a valuable tool for cybersecurity, but it should be noted that ChatGPT-like tools can also be manipulated to threaten the integrity, confidentiality, and availability of data.",
        "DOI": "10.1109/ACCESS.2024.3355547",
        "paper_author": "Ozkan-Okay M.",
        "affiliation_name": "Ankara Üniversitesi",
        "affiliation_city": "Ankara",
        "affiliation_country": "Turkey",
        "affiliation_id": "60012603",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Blockchain technology for energy-aware mobile crowd sensing approaches in Internet of Things",
        "publication": "Transactions on Emerging Telecommunications Technologies",
        "citied_by": "39",
        "cover_date": "2024-04-01",
        "Abstract": "Today, Blockchain technology is emerging to support high secured performance computing. To improve privacy and security factors of allocate, storage, and manage resources in edge computing, blockchain technology can be used to guarantee safe data transmission and communications in Internet of Things (IoT). Due to heterogeneity of resources to cover a range number of IoT applications, resource allocation has a key role for increasing performance of the IoT systems in edge computing. Also, a blockchain-based resource allocation model can support Quality of Service (QoS) for IoT applications to ensure a high secured communication environment in edge computing. This paper reviews different existing green energy strategies based on blockchain technology in mobile crowd sensing. Mobile crowd sensing refers to all computational aspects related to smart city, smart home-care, smart grid, smart transportations, smart medical systems, smart industry, manufacturing, and smart farming in IoT environments. This review aims to classify principles and technical aspects of green energy strategies based on blockchain technology in mobile crowd sensing with respect to technical aspects, applied algorithms, evaluation factors, and evaluation environments. Based on Systematic Literature Review (SLR), we selected 37 high potential and key relevant research studies to consider in this review. Based on analytical results, 35% of them were considered as private-based blockchain methods, 33% of them were applied to the public-based blockchain methods, 24% of them were considered as consortium-based blockchain methods, and 8% of them were as hybrid-based blockchain methods.",
        "DOI": "10.1002/ett.4217",
        "paper_author": "Sisi Z.",
        "affiliation_name": "Industrial &amp; Commercial Bank of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60023524",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Exploring the factors affecting the adoption AI techniques in higher education: insights from teachers' perspectives on ChatGPT",
        "publication": "Journal of Research in Innovative Teaching and Learning",
        "citied_by": "38",
        "cover_date": "2024-01-01",
        "Abstract": "Purpose: ChatGPT, an artificial intelligence (AI)-powered chatbot, has gained substantial attention in the academic world for its potential to transform the education industry. While ChatGPT offers numerous benefits, concerns have also been raised regarding its impact on the quality of education. This study aims to bridge the gap in research by exploring teachers' perspectives on the adoption of ChatGPT, with a focus on identifying factors that motivate and inhibit them to adopt ChatGPT for educational purposes. Design/methodology/approach: This research has employed a interpretative phenomenological analysis (IPA) qualitative approach. Through in-depth interviews among the teachers, data will be collected to identify the motivating and inhibiting factors that impact teachers' willingness to adopt ChatGPT. The data was collected from 34 teachers working across 10 branches of the University of Technology and Applied Sciences (UTAS) in Oman. Findings: The analysis revealed four themes under motivating factors that encourage teachers to adopt ChatGPT for their educational purpose. These include Theme 1: Exploration of innovative education technologies, Theme 2: Personalization teaching and learning, Theme 3: Time-saving and Theme 4: Professional development. On the other hand, inhibiting factors includes five themes which includes Theme 1: Reliability and accuracy concerns, Theme 2: Reduced human interaction, Theme 3: Privacy and data security, Theme 4: lack of institutional support and Theme 5: Overreliance on ChatGPT. Practical implications: This study contributes to the understanding of teachers' perspectives on the adoption of ChatGPT in education. By understanding teachers' perspectives, policymakers can design appropriate policies and service providers can customize their offerings to meet teachers' requirements. The study's findings will be valuable for higher education institutions (HEIs) in formulating policies to ensure the appropriate and effective utilization of ChatGPT. The study will provide suggestions to ChatGPT service providers, enabling them to focus on motivating factors and address inhibiting factors, thereby facilitating the seamless adoption of ChatGPT among teachers. Originality/value: In comparison to previous studies, this study goes beyond merely discussing the possible benefits and limitations of ChatGPT in education. This research significantly contributes to the understanding of ChatGPT adoption among teachers by identifying specific motivating and inhibiting factors that influence teachers to adopt ChatGPT for educational purposes. The research enables to gain important new insights that were not previously found, giving a fresh dimension to the existing literature.",
        "DOI": "10.1108/JRIT-09-2023-0129",
        "paper_author": "Al-Mughairi H.",
        "affiliation_name": "University of Technology and Applied Sciences Ibra",
        "affiliation_city": "Ibra",
        "affiliation_country": "Oman",
        "affiliation_id": "60118527",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "DeepRice: A deep learning and deep feature based classification of Rice leaf disease subtypes",
        "publication": "Artificial Intelligence in Agriculture",
        "citied_by": "38",
        "cover_date": "2024-03-01",
        "Abstract": "Rice stands as a crucial staple food globally, with its enduring sustainability hinging on the prompt detection of rice leaf diseases. Hence, efficiently detecting diseases when they have already occurred holds paramount importance for solving the cost of manual visual identification and chemical testing. In the recent past, the identification of leaf pathologies in crops predominantly relies on manual methods using specialized equipment, which proves to be time-consuming and inefficient. This study offers a remedy by harnessing Deep Learning (DL) and transfer learning techniques to accurately identify and classify rice leaf diseases. A comprehensive dataset comprising 5932 self-generated images of rice leaves was assembled along with the benchmark datasets, categorized into 9 classes irrespective of the extent of disease spread across the leaves. These classes encompass diverse states including healthy leaves, mild and severe blight, mild and severe tungro, mild and severe blast, as well as mild and severe brown spot. Following meticulous manual labelling and dataset segmentation, which was validated by horticulture experts, data augmentation strategies were implemented to amplify the number of images. The datasets were subjected to evaluation using the proposed tailored Convolutional Neural Networks models. Their performance are scrutinized in conjunction with alternative transfer learning approaches like VGG16, Xception, ResNet50, DenseNet121, Inception ResnetV2, and Inception V3. The effectiveness of the proposed custom VGG16 model was gauged by its capacity to generalize to unseen images, yielding an exceptional accuracy of 99.94%, surpassing the benchmarks set by existing state-of-the-art models. Further, the layer wise feature extraction is also visualized as the interpretable AI.",
        "DOI": "10.1016/j.aiia.2023.11.001",
        "paper_author": "Ritharson P.I.",
        "affiliation_name": "Karunya Institute of Technology and Sciences",
        "affiliation_city": "Coimbatore",
        "affiliation_country": "India",
        "affiliation_id": "60100082",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "DTL-IDS: An optimized Intrusion Detection Framework using Deep Transfer Learning and Genetic Algorithm",
        "publication": "Journal of Network and Computer Applications",
        "citied_by": "38",
        "cover_date": "2024-01-01",
        "Abstract": "In the dynamic field of the Industrial Internet of Things (IIoT), the networks are increasingly vulnerable to a diverse range of cyberattacks. This vulnerability necessitates the development of advanced intrusion detection systems (IDSs). Addressing this need, our research contributes to the existing cybersecurity literature by introducing an optimized Intrusion Detection System based on Deep Transfer Learning (DTL), specifically tailored for heterogeneous IIoT networks. Our framework employs a tri-layer architectural approach that synergistically integrates Convolutional Neural Networks (CNNs), Genetic Algorithms (GA), and bootstrap aggregation ensemble techniques. The methodology is executed in three critical stages: First, we convert a state-of-the-art cybersecurity dataset, Edge_IIoTset, into image data, thereby facilitating CNN-based analytics. Second, GA is utilized to fine-tune the hyperparameters of each base learning model, enhancing the model's adaptability and performance. Finally, the outputs of the top-performing models are amalgamated using ensemble techniques, bolstering the robustness of the IDS. Through rigorous evaluation protocols, our framework demonstrated exceptional performance, reliably achieving a 100% attack detection accuracy rate. This result establishes our framework as highly effective against 14 distinct types of cyberattacks. The findings bear significant implications for the ongoing development of secure, efficient, and adaptive IDS solutions in the complex landscape of IIoT networks.",
        "DOI": "10.1016/j.jnca.2023.103784",
        "paper_author": "Latif S.",
        "affiliation_name": "Prince Sultan University",
        "affiliation_city": "Riyadh",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60015723",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Privacy in electronic health records: a systematic mapping study",
        "publication": "Journal of Public Health (Germany)",
        "citied_by": "38",
        "cover_date": "2024-03-01",
        "Abstract": "Main: Electronic health record (EHR) applications are digital versions of paper-based patient health information. Traditionally, medical records are made on paper. However, nowadays, advances in information and communication technology have made it possible to change medical records from paper to EHR. Therefore, preserving user data privacy is extremely important in healthcare environments. The main challenges are providing ways to make EHR systems increasingly capable of ensuring data privacy and at the same time not compromising the performance and interoperability of these systems. Subject and methods: This systematic mapping study intends to investigate the current research on security and privacy requirements in EHR systems and identify potential research gaps in the literature. The main challenges are providing ways to make EHR systems increasingly capable of ensuring data privacy, and at the same time, not compromising the performance and interoperability of these systems. Our research was carried out in the Scopus database, the largest database of abstracts and citations in the literature with peer review. Results: We have collected 848 articles related to the area. After disambiguation and filtering, we selected 30 articles for analysis. The result of such an analysis provides a comprehensive view of current research. Conclusions: We can highlight some relevant research possibilities. First, we noticed a growing interest in privacy in EHR research in the last 6 years. Second, blockchain has been used in many EHR systems as a solution to achieve data privacy. However, it is a challenge to maintain traceability by recording metadata that can be mapped to private data of the users applying a particular mapping function that can be hosted outside the blockchain. Finally, the lack of a systematic approach between EHR solutions and existing laws or policies leads to better strategies for developing a certification process for EHR systems.",
        "DOI": "10.1007/s10389-022-01795-z",
        "paper_author": "Tertulino R.",
        "affiliation_name": "Instituto Federal de Educação, Ciência e Tecnologia do Rio Grande do Norte (IFRN)",
        "affiliation_city": "Natal",
        "affiliation_country": "Brazil",
        "affiliation_id": "60069354",
        "affiliation_state": "RN"
    }
]