[
    {
        "paper_title": "Edge Artificial Intelligence for 6G: Vision, Enabling Technologies, and Applications",
        "publication": "IEEE Journal on Selected Areas in Communications",
        "citied_by": "464",
        "cover_date": "2022-01-01",
        "Abstract": "The thriving of artificial intelligence (AI) applications is driving the further evolution of wireless networks. It has been envisioned that 6G will be transformative and will revolutionize the evolution of wireless from 'connected things' to 'connected intelligence'. However, state-of-the-art deep learning and big data analytics based AI systems require tremendous computation and communication resources, causing significant latency, energy consumption, network congestion, and privacy leakage in both of the training and inference processes. By embedding model training and inference capabilities into the network edge, edge AI stands out as a disruptive technology for 6G to seamlessly integrate sensing, communication, computation, and intelligence, thereby improving the efficiency, effectiveness, privacy, and security of 6G networks. In this paper, we shall provide our vision for scalable and trustworthy edge AI systems with integrated design of wireless communication strategies and decentralized machine learning models. New design principles of wireless networks, service-driven resource allocation optimization methods, as well as a holistic end-to-end system architecture to support edge AI will be described. Standardization, software and hardware platforms, and application scenarios are also discussed to facilitate the industrialization and commercialization of edge AI systems.",
        "DOI": "10.1109/JSAC.2021.3126076",
        "paper_author": "Letaief K.B.",
        "affiliation_name": "Hong Kong University of Science and Technology",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008592",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Detection and Tracking Meet Drones Challenge",
        "publication": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
        "citied_by": "435",
        "cover_date": "2022-11-01",
        "Abstract": "Drones, or general UAVs, equipped with cameras have been fast deployed with a wide range of applications, including agriculture, aerial photography, and surveillance. Consequently, automatic understanding of visual data collected from drones becomes highly demanding, bringing computer vision and drones more and more closely. To promote and track the developments of object detection and tracking algorithms, we have organized three challenge workshops in conjunction with ECCV 2018, ICCV 2019 and ECCV 2020, attracting more than 100 teams around the world. We provide a large-scale drone captured dataset, VisDrone, which includes four tracks, i.e., (1) image object detection, (2) video object detection, (3) single object tracking, and (4) multi-object tracking. In this paper, we first present a thorough review of object detection and tracking datasets and benchmarks, and discuss the challenges of collecting large-scale drone-based object detection and tracking datasets with fully manual annotations. After that, we describe our VisDrone dataset, which is captured over various urban/suburban areas of 14 different cities across China from North to South. Being the largest such dataset ever published, VisDrone enables extensive evaluation and investigation of visual analysis algorithms for the drone platform. We provide a detailed analysis of the current state of the field of large-scale object detection and tracking on drones, and conclude the challenge as well as propose future directions. We expect the benchmark largely boost the research and development in video analysis on drone platforms. All the datasets and experimental results can be downloaded from https://github.com/VisDrone/VisDrone-Dataset.",
        "DOI": "10.1109/TPAMI.2021.3119563",
        "paper_author": "Zhu P.",
        "affiliation_name": "Tianjin University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60019533",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital Twins: A Survey on Enabling Technologies, Challenges, Trends and Future Prospects",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "426",
        "cover_date": "2022-01-01",
        "Abstract": "Digital Twin (DT) is an emerging technology surrounded by many promises, and potentials to reshape the future of industries and society overall. A DT is a system-of-systems which goes far beyond the traditional computer-based simulations and analysis. It is a replication of all the elements, processes, dynamics, and firmware of a physical system into a digital counterpart. The two systems (physical and digital) exist side by side, sharing all the inputs and operations using real-time data communications and information transfer. With the incorporation of Internet of Things (IoT), Artificial Intelligence (AI), 3D models, next generation mobile communications (5G/6G), Augmented Reality (AR), Virtual Reality (VR), distributed computing, Transfer Learning (TL), and electronic sensors, the digital/virtual counterpart of the real-world system is able to provide seamless monitoring, analysis, evaluation and predictions. The DT offers a platform for the testing and analysing of complex systems, which would be impossible in traditional simulations and modular evaluations. However, the development of this technology faces many challenges including the complexities in effective communication and data accumulation, data unavailability to train Machine Learning (ML) models, lack of processing power to support high fidelity twins, the high need for interdisciplinary collaboration, and the absence of standardized development methodologies and validation measures. Being in the early stages of development, DTs lack sufficient documentation. In this context, this survey paper aims to cover the important aspects in realization of the technology. The key enabling technologies, challenges and prospects of DTs are highlighted. The paper provides a deep insight into the technology, lists design goals and objectives, highlights design challenges and limitations across industries, discusses research and commercial developments, provides its applications and use cases, offers case studies in industry, infrastructure and healthcare, lists main service providers and stakeholders, and covers developments to date, as well as viable research dimensions for future developments in DTs.",
        "DOI": "10.1109/COMST.2022.3208773",
        "paper_author": "Mihai S.",
        "affiliation_name": "Middlesex University",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60014105",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Edge-IIoTset: A New Comprehensive Realistic Cyber Security Dataset of IoT and IIoT Applications for Centralized and Federated Learning",
        "publication": "IEEE Access",
        "citied_by": "422",
        "cover_date": "2022-01-01",
        "Abstract": "In this paper, we propose a new comprehensive realistic cyber security dataset of IoT and IIoT applications, called Edge-IIoTset, which can be used by machine learning-based intrusion detection systems in two different modes, namely, centralized and federated learning. Specifically, the dataset has been generated using a purpose-built IoT/IIoT testbed with a large representative set of devices, sensors, protocols and cloud/edge configurations. The IoT data are generated from various IoT devices (more than 10 types) such as Low-cost digital sensors for sensing temperature and humidity, Ultrasonic sensor, Water level detection sensor, pH Sensor Meter, Soil Moisture sensor, Heart Rate Sensor, Flame Sensor, etc.). Furthermore, we identify and analyze fourteen attacks related to IoT and IIoT connectivity protocols, which are categorized into five threats, including, DoS/DDoS attacks, Information gathering, Man in the middle attacks, Injection attacks, and Malware attacks. In addition, we extract features obtained from different sources, including alerts, system resources, logs, network traffic, and propose new 61 features with high correlations from 1176 found features. After processing and analyzing the proposed realistic cyber security dataset, we provide a primary exploratory data analysis and evaluate the performance of machine learning approaches (i.e., traditional machine learning as well as deep learning) in both centralized and federated learning modes. The Edge-IIoTset dataset can be publicly accessed from http://ieee-dataport.org/8939.",
        "DOI": "10.1109/ACCESS.2022.3165809",
        "paper_author": "Ferrag M.A.",
        "affiliation_name": "Université 8 Mai 1945 Guelma",
        "affiliation_city": "Guelma",
        "affiliation_country": "Algeria",
        "affiliation_id": "60069303",
        "affiliation_state": "Guelma Province"
    },
    {
        "paper_title": "Applications of Wireless Sensor Networks and Internet of Things Frameworks in the Industry Revolution 4.0: A Systematic Literature Review",
        "publication": "Sensors",
        "citied_by": "410",
        "cover_date": "2022-03-01",
        "Abstract": "The 21st century has seen rapid changes in technology, industry, and social patterns. Most industries have moved towards automation, and human intervention has decreased, which has led to a revolution in industries, named the fourth industrial revolution (Industry 4.0). Industry 4.0 or the fourth industrial revolution (IR 4.0) relies heavily on the Internet of Things (IoT) and wireless sensor networks (WSN). IoT and WSN are used in various control systems, including environmental monitoring, home automation, and chemical/biological attack detection. IoT devices and applications are used to process extracted data from WSN devices and transmit them to remote locations. This systematic literature review offers a wide range of information on Industry 4.0, finds research gaps, and recommends future directions. Seven research questions are addressed in this article: (i) What are the contributions of WSN in IR 4.0? (ii) What are the contributions of IoT in IR 4.0? (iii) What are the types of WSN coverage areas for IR 4.0? (iv) What are the major types of network intruders in WSN and IoT systems? (v) What are the prominent network security attacks in WSN and IoT? (vi) What are the significant issues in IoT and WSN frameworks? and (vii) What are the limitations and research gaps in the existing work? This study mainly focuses on research solutions and new techniques to automate Industry 4.0. In this research, we analyzed over 130 articles from 2014 until 2021. This paper covers several aspects of Industry 4.0, from the designing phase to security needs, from the deployment stage to the classification of the network, the difficulties, challenges, and future directions.",
        "DOI": "10.3390/s22062087",
        "paper_author": "Majid M.",
        "affiliation_name": "University of Management and Technology Lahore",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60070625",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Review the state-of-the-art technologies of semantic segmentation based on deep learning",
        "publication": "Neurocomputing",
        "citied_by": "402",
        "cover_date": "2022-07-07",
        "Abstract": "The goal of semantic segmentation is to segment the input image according to semantic information and predict the semantic category of each pixel from a given label set. With the gradual intellectualization of modern life, more and more applications need to infer relevant semantic information from images for subsequent processing, such as augmented reality, autonomous driving, video surveillance, etc. This paper reviews the state-of-the-art technologies of semantic segmentation based on deep learning. Because semantic segmentation requires a large number of pixel-level annotations, in order to reduce the fine-grained requirements of annotation and reduce the economic and time cost of manual annotation, this paper studies the works on weakly-supervised semantic segmentation. In order to enhance the generalization ability and robustness of the segmentation model, this paper investigates the works on domain adaptation in semantic segmentation. Many types of sensors are usually equipped in some practical applications, such as autonomous driving and medical image analysis. In order to mine the association between multi-modal data and improve the accuracy of the segmentation model, this paper investigates the works based on multi-modal data fusion semantic segmentation. The real-time performance of the model needs to be considered in practical application. This paper analyzes the key factors affecting the real-time performance of the segmentation model and investigates the works on real-time semantic segmentation. Finally, this paper summarizes the challenges and promising research directions of semantic segmentation tasks based on deep learning.",
        "DOI": "10.1016/j.neucom.2022.01.005",
        "paper_author": "Mo Y.",
        "affiliation_name": "Tongji University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60073652",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Federated-Learning-Based Anomaly Detection for IoT Security Attacks",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "393",
        "cover_date": "2022-02-15",
        "Abstract": "The Internet of Things (IoT) is made up of billions of physical devices connected to the Internet via networks that perform tasks independently with less human intervention. Such brilliant automation of mundane tasks requires a considerable amount of user data in digital format, which, in turn, makes IoT networks an open source of personally identifiable information data for malicious attackers to steal, manipulate, and perform nefarious activities. A huge interest has been developed over the past years in applying machine learning (ML)-assisted approaches in the IoT security space. However, the assumption in many current works is that big training data are widely available and transferable to the main server because data are born at the edge and are generated continuously by IoT devices. This is to say that classic ML works on the legacy set of entire data located on a central server, which makes it the least preferred option for domains with privacy concerns on user data. To address this issue, we propose the federated-learning (FL)-based anomaly detection approach to proactively recognize intrusion in IoT networks using decentralized on-device data. Our approach uses federated training rounds on gated recurrent units (GRUs) models and keeps the data intact on local IoT devices by sharing only the learned weights with the central server of FL. Also, the approach's ensembler part aggregates the updates from multiple sources to optimize the global ML model's accuracy. Our experimental results demonstrate that our approach outperforms the classic/centralized machine learning (non-FL) versions in securing the privacy of user data and provides an optimal accuracy rate in attack detection.",
        "DOI": "10.1109/JIOT.2021.3077803",
        "paper_author": "Mothukuri V.",
        "affiliation_name": "Kennesaw State University",
        "affiliation_city": "Kennesaw",
        "affiliation_country": "United States",
        "affiliation_id": "60019740",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "Recent advancements and challenges of Internet of Things in smart agriculture: A survey",
        "publication": "Future Generation Computer Systems",
        "citied_by": "387",
        "cover_date": "2022-01-01",
        "Abstract": "The Internet of Things (IoT) is an evolving paradigm that seeks to connect different smart physical components for multi-domain modernization. To automatically manage and track agricultural lands with minimal human intervention, numerous IoT-based frameworks have been introduced. This paper presents a rigorous discussion on the major components, new technologies, security issues, challenges and future trends involved in the agriculture domain. An in-depth report on recent advancements has been covered in this paper. The goal of this survey is to help potential researchers detect relevant IoT problems and, based on the application requirements, adopt suitable technologies. Furthermore, the significance of IoT and Data Analytics for smart agriculture has been highlighted.",
        "DOI": "10.1016/j.future.2021.08.006",
        "paper_author": "Sinha B.B.",
        "affiliation_name": "Indian Institute of Information Technology Dharwad",
        "affiliation_city": "Dharwad",
        "affiliation_country": "India",
        "affiliation_id": "60283025",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Cellular, Wide-Area, and Non-Terrestrial IoT: A Survey on 5G Advances and the Road Toward 6G",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "372",
        "cover_date": "2022-01-01",
        "Abstract": "The next wave of wireless technologies is proliferating in connecting things among themselves as well as to humans. In the era of the Internet of Things (IoT), billions of sensors, machines, vehicles, drones, and robots will be connected, making the world around us smarter. The IoT will encompass devices that must wirelessly communicate a diverse set of data gathered from the environment for myriad new applications. The ultimate goal is to extract insights from this data and develop solutions that improve quality of life and generate new revenue. Providing large-scale, long-lasting, reliable, and near real-time connectivity is the major challenge in enabling a smart connected world. This paper provides a comprehensive survey on existing and emerging communication solutions for serving IoT applications in the context of cellular, wide-area, as well as non-terrestrial networks. Specifically, wireless technology enhancements for providing IoT access in the fifth-generation (5G) and beyond cellular networks, and communication networks over the unlicensed spectrum are presented. Aligned with the main key performance indicators of 5G and beyond 5G networks, we investigate solutions and standards that enable energy efficiency, reliability, low latency, and scalability (connection density) of current and future IoT networks. The solutions include grant-free access and channel coding for short-packet communications, non-orthogonal multiple access, and on-device intelligence. Further, a vision of new paradigm shifts in communication networks in the 2030s is provided, and the integration of the associated new technologies like artificial intelligence, non-terrestrial networks, and new spectra is elaborated. In particular, the potential of using emerging deep learning and federated learning techniques for enhancing the efficiency and security of IoT communication are discussed, and their promises and challenges are introduced. Finally, future research directions toward beyond 5G IoT networks are pointed out.",
        "DOI": "10.1109/COMST.2022.3151028",
        "paper_author": "Vaezi M.",
        "affiliation_name": "Villanova University College of Engineering",
        "affiliation_city": "Villanova",
        "affiliation_country": "United States",
        "affiliation_id": "60279531",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Explainable artificial intelligence: a comprehensive review",
        "publication": "Artificial Intelligence Review",
        "citied_by": "370",
        "cover_date": "2022-06-01",
        "Abstract": "Thanks to the exponential growth in computing power and vast amounts of data, artificial intelligence (AI) has witnessed remarkable developments in recent years, enabling it to be ubiquitously adopted in our daily lives. Even though AI-powered systems have brought competitive advantages, the black-box nature makes them lack transparency and prevents them from explaining their decisions. This issue has motivated the introduction of explainable artificial intelligence (XAI), which promotes AI algorithms that can show their internal process and explain how they made decisions. The number of XAI research has increased significantly in recent years, but there lacks a unified and comprehensive review of the latest XAI progress. This review aims to bridge the gap by discovering the critical perspectives of the rapidly growing body of research associated with XAI. After offering the readers a solid XAI background, we analyze and review various XAI methods, which are grouped into (i) pre-modeling explainability, (ii) interpretable model, and (iii) post-modeling explainability. We also pay attention to the current methods that dedicate to interpret and analyze deep learning methods. In addition, we systematically discuss various XAI challenges, such as the trade-off between the performance and the explainability, evaluation methods, security, and policy. Finally, we show the standard approaches that are leveraged to deal with the mentioned challenges.",
        "DOI": "10.1007/s10462-021-10088-y",
        "paper_author": "Minh D.",
        "affiliation_name": "FPT University",
        "affiliation_city": "Hanoi",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60117455",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial Intelligence for Remote Sensing Data Analysis: A review of challenges and opportunities",
        "publication": "IEEE Geoscience and Remote Sensing Magazine",
        "citied_by": "354",
        "cover_date": "2022-06-01",
        "Abstract": "Artificial intelligence (AI) plays a growing role in remote sensing (RS). Applications of AI, particularly machine learning algorithms, range from initial image processing to high-level data understanding and knowledge discovery. AI techniques have emerged as a powerful strategy for analyzing RS data and led to remarkable breakthroughs in all RS fields. Given this period of breathtaking evolution, this work aims to provide a comprehensive review of the recent achievements of AI algorithms and applications in RS data analysis. The review includes more than 270 research papers, covering the following major aspects of AI innovation for RS: machine learning, computational intelligence, AI explicability, data mining, natural language processing (NLP), and AI security. We conclude this review by identifying promising directions for future research.",
        "DOI": "10.1109/MGRS.2022.3145854",
        "paper_author": "Zhang L.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Security-Based Fuzzy Control for Nonlinear Networked Control Systems With DoS Attacks via a Resilient Event-Triggered Scheme",
        "publication": "IEEE Transactions on Fuzzy Systems",
        "citied_by": "341",
        "cover_date": "2022-10-01",
        "Abstract": "This article studies the issue of resilient event-triggered (RET)-based security controller design for nonlinear networked control systems (NCSs) described by interval type-2 (IT2) fuzzy models subject to nonperiodic denial of service (DoS) attacks. Under the nonperiodic DoS attacks, the state error caused by the packets loss phenomenon is transformed into an uncertain variable in the designed event-triggered condition. Then, an RET strategy based on the uncertain event-triggered variable is firstly proposed for the nonlinear NCSs. The existing results that utilized the hybrid triggered scheme have the defect of complex control structure, and most of the security compensation methods for handling the impacts caused by DoS attacks need to transmit some compensation data when the DoS attacks disappear, which may lead to large performance loss of the systems. Different from these existing results, the proposed RET strategy can transmit the necessary packets to the controller under nonperiodic DoS attacks to reduce the performance loss of the systems and a new security controller subject to the RET scheme and mismatched membership functions is designed to simplify the network control structure under DoS attacks. Finally, some simulation results are utilized to testify the advantages of the presented approach.",
        "DOI": "10.1109/TFUZZ.2022.3148875",
        "paper_author": "Pan Y.",
        "affiliation_name": "Bohai University",
        "affiliation_city": "Jinzhou",
        "affiliation_country": "China",
        "affiliation_id": "60007305",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Memristive technologies for data storage, computation, encryption, and radio-frequency communication",
        "publication": "Science",
        "citied_by": "323",
        "cover_date": "2022-06-03",
        "Abstract": "Memristive devices, which combine a resistor with memory functions such that voltage pulses can change their resistance (and hence their memory state) in a nonvolatile manner, are beginning to be implemented in integrated circuits for memory applications. However, memristive devices could have applications in many other technologies, such as non–von Neumann in-memory computing in crossbar arrays, random number generation for data security, and radio-frequency switches for mobile communications. Progress toward the integration of memristive devices in commercial solid-state electronic circuits and other potential applications will depend on performance and reliability challenges that still need to be addressed, as described here.",
        "DOI": "10.1126/science.abj9979",
        "paper_author": "Lanza M.",
        "affiliation_name": "King Abdullah University of Science and Technology",
        "affiliation_city": "Thuwal",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60092945",
        "affiliation_state": "Makkah"
    },
    {
        "paper_title": "Digital-Twin-Enabled 6G: Vision, Architectural Trends, and Future Directions",
        "publication": "IEEE Communications Magazine",
        "citied_by": "323",
        "cover_date": "2022-01-01",
        "Abstract": "Internet of Everything (IoE) applications such as haptics, human-computer interaction, and extended reality, using the sixth-generation (6G) of wireless systems have diverse requirements in terms of latency, reliability, data rate, and user-defined performance metrics. Therefore, enabling IoE applications over 6G requires a new framework that can be used to manage, operate, and optimize the 6G wireless system and its underlying IoE services. Such a new framework for 6G can be based on digital twins. Digital twins use a virtual representation of the 6G physical system along with the associated algorithms (e.g., machine learning, optimization), communication technologies (e.g., millimeter-wave and terahertz communication), computing systems (e.g., edge computing and cloud computing), as well as privacy and security-related technologists (e.g., blockchain). First, we present the key design requirements for enabling 6G through the use of a digital twin. Next, the architectural components and trends such as edge-based twins, cloud-based-twins, and edge-cloud-based twins are presented. Furthermore, we provide a comparative description of various twins. Finally, we outline and recommend guidelines for several future research directions.",
        "DOI": "10.1109/MCOM.001.21143",
        "paper_author": "Khan L.U.",
        "affiliation_name": "Kyung Hee University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60001873",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Human Action Recognition and Prediction: A Survey",
        "publication": "International Journal of Computer Vision",
        "citied_by": "316",
        "cover_date": "2022-05-01",
        "Abstract": "Derived from rapid advances in computer vision and machine learning, video analysis tasks have been moving from inferring the present state to predicting the future state. Vision-based action recognition and prediction from videos are such tasks, where action recognition is to infer human actions (present state) based upon complete action executions, and action prediction to predict human actions (future state) based upon incomplete action executions. These two tasks have become particularly prevalent topics recently because of their explosively emerging real-world applications, such as visual surveillance, autonomous driving vehicle, entertainment, and video retrieval, etc. Many attempts have been devoted in the last a few decades in order to build a robust and effective framework for action recognition and prediction. In this paper, we survey the complete state-of-the-art techniques in action recognition and prediction. Existing models, popular algorithms, technical difficulties, popular action databases, evaluation protocols, and promising future directions are also provided with systematic discussions.",
        "DOI": "10.1007/s11263-022-01594-9",
        "paper_author": "Kong Y.",
        "affiliation_name": "Golisano College of Computing and Information Sciences",
        "affiliation_city": "Rochester",
        "affiliation_country": "United States",
        "affiliation_id": "60148707",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "A review of the application of machine learning in water quality evaluation",
        "publication": "Eco-Environment and Health",
        "citied_by": "311",
        "cover_date": "2022-06-01",
        "Abstract": "With the rapid increase in the volume of data on the aquatic environment, machine learning has become an important tool for data analysis, classification, and prediction. Unlike traditional models used in water-related research, data-driven models based on machine learning can efficiently solve more complex nonlinear problems. In water environment research, models and conclusions derived from machine learning have been applied to the construction, monitoring, simulation, evaluation, and optimization of various water treatment and management systems. Additionally, machine learning can provide solutions for water pollution control, water quality improvement, and watershed ecosystem security management. In this review, we describe the cases in which machine learning algorithms have been applied to evaluate the water quality in different water environments, such as surface water, groundwater, drinking water, sewage, and seawater. Furthermore, we propose possible future applications of machine learning approaches to water environments.",
        "DOI": "10.1016/j.eehl.2022.06.001",
        "paper_author": "Zhu M.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "A survey on blockchain for big data: Approaches, opportunities, and future directions",
        "publication": "Future Generation Computer Systems",
        "citied_by": "303",
        "cover_date": "2022-06-01",
        "Abstract": "Big data has generated strong interest in various scientific and engineering domains over the last few years. Despite many advantages and applications, there are many challenges in big data to be tackled for better quality of service, e.g., big data analytics, big data management, and big data privacy and security. Blockchain with its decentralization and security nature has the great potential to improve big data services and applications. In this article, we provide a comprehensive survey on blockchain for big data, focusing on up-to-date approaches, opportunities, and future directions. First, we present a brief overview of blockchain and big data as well as the motivation behind their integration. Next, we survey various blockchain services for big data, including blockchain for secure big data acquisition, data storage, data analytics, and data privacy preservation. Then, we review the state-of-the-art studies on the use of blockchain for big data applications in different domains such as smart city, smart healthcare, smart transportation, and smart grid. For a better understanding, some representative blockchain-big data projects are also presented and analyzed. Finally, challenges and future directions are discussed to further drive research in this promising area.",
        "DOI": "10.1016/j.future.2022.01.017",
        "paper_author": "Deepa N.",
        "affiliation_name": "Vellore Institute of Technology",
        "affiliation_city": "Vellore",
        "affiliation_country": "India",
        "affiliation_id": "60010618",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Recent Advances on Federated Learning for Cybersecurity and Cybersecurity for Federated Learning for Internet of Things",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "297",
        "cover_date": "2022-06-01",
        "Abstract": "Decentralized paradigm in the field of cybersecurity and machine learning (ML) for the emerging Internet of Things (IoT) has gained a lot of attention from the government, academia, and industries in recent years. Federated cybersecurity (FC) is regarded as a revolutionary concept to make the IoT safer and more efficient in the future. This emerging concept has the potential of detecting security threats, taking countermeasures, and limiting the spreading of threats over the IoT network system efficiently. An objective of cybersecurity is achieved by forming the federation of the learned and shared model on top of various participants. Federated learning (FL), which is regarded as a privacy-aware ML model, is particularly useful to secure the vulnerable IoT environment. In this article, we start with background and comparison of centralized learning, distributed on-site learning, and FL, which is then followed by a survey of the application of FL to cybersecurity for IoT. This survey primarily focuses on the security aspect but it also discusses several approaches that address the performance issues (e.g., accuracy, latency, resource constraint, and others) associated with FL, which may impact the security and overall performance of the IoT. To anticipate the future evolution of this new paradigm, we discuss the main ongoing research efforts, challenges, and research trends in this area. With this article, readers can have a more thorough understanding of FL for cybersecurity as well as cybersecurity for FL, different security attacks, and countermeasures.",
        "DOI": "10.1109/JIOT.2022.3150363",
        "paper_author": "Ghimire B.",
        "affiliation_name": "College of Engineering and Architecture",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60145711",
        "affiliation_state": "DC"
    },
    {
        "paper_title": "Jamming Attacks and Anti-Jamming Strategies in Wireless Networks: A Comprehensive Survey",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "296",
        "cover_date": "2022-01-01",
        "Abstract": "Wireless networks are a key component of the telecommunications infrastructure in our society, and wireless services become increasingly important as the applications of wireless devices have penetrated every aspect of our lives. Although wireless technologies have significantly advanced in the past decades, most wireless networks are still vulnerable to radio jamming attacks due to the openness nature of wireless channels, and the progress in the design of jamming-resistant wireless networking systems remains limited. This stagnation can be attributed to the lack of practical physical-layer wireless technologies that can efficiently decode data packets in the presence of jamming attacks. This article surveys existing jamming attacks and anti-jamming strategies in wireless local area networks (WLANs), cellular networks, cognitive radio networks (CRNs), ZigBee networks, Bluetooth networks, vehicular networks, LoRa networks, RFID networks, GPS system, millimeter-wave (mmWave) and learning-assisted wireless systems, with the objective of offering a comprehensive knowledge landscape of existing jamming and anti-jamming strategies and therefore stimulating more research efforts to secure wireless networks against jamming attacks. Different from prior survey papers, this article conducts a comprehensive, in-depth review on jamming and anti-jamming strategies, casting insights on the design of jamming-resilient wireless networking systems. An outlook on promising anti-jamming techniques is offered at the end of this article to delineate important research directions.",
        "DOI": "10.1109/COMST.2022.3159185",
        "paper_author": "Pirayesh H.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "East Lansing",
        "affiliation_country": "United States",
        "affiliation_id": "60146411",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "CFLOW-AD: Real-Time Unsupervised Anomaly Detection with Localization via Conditional Normalizing Flows",
        "publication": "Proceedings - 2022 IEEE/CVF Winter Conference on Applications of Computer Vision, WACV 2022",
        "citied_by": "296",
        "cover_date": "2022-01-01",
        "Abstract": "Unsupervised anomaly detection with localization has many practical applications when labeling is infeasible and, moreover, when anomaly examples are completely missing in the train data. While recently proposed models for such data setup achieve high accuracy metrics, their complexity is a limiting factor for real-time processing. In this paper, we propose a real-time model and analytically derive its relationship to prior methods. Our CFLOW-AD model is based on a conditional normalizing flow frame- work adopted for anomaly detection with localization. In particular, CFLOW-AD consists of a discriminatively pretrained encoder followed by a multi-scale generative de- coders where the latter explicitly estimate likelihood of the encoded features. Our approach results in a computationally and memory-efficient model: CFLOW-AD is faster and smaller by a factor of 10× than prior state-of-the-art with the same input setting. Our experiments on the MVTec dataset show that CFLOW-AD outperforms previous methods by 0.36% AUROC in detection task, by 1.12% AUROC and 2.5% AUPRO in localization task, respectively. We open-source our code with fully reproducible experiments1.",
        "DOI": "10.1109/WACV51458.2022.00188",
        "paper_author": "Gudovskiy D.",
        "affiliation_name": "Panasonic AI Lab",
        "affiliation_city": "Mountain View",
        "affiliation_country": "United States",
        "affiliation_id": "126037843",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Federated learning review: Fundamentals, enabling technologies, and future applications",
        "publication": "Information Processing and Management",
        "citied_by": "289",
        "cover_date": "2022-11-01",
        "Abstract": "Federated Learning (FL) has been foundational in improving the performance of a wide range of applications since it was first introduced by Google. Some of the most prominent and commonly used FL-powered applications are Android's Gboard for predictive text and Google Assistant. FL can be defined as a setting that makes on-device, collaborative Machine Learning possible. A wide range of literature has studied FL technical considerations, frameworks, and limitations with several works presenting a survey of the prominent literature on FL. However, prior surveys have focused on technical considerations and challenges of FL, and there has been a limitation in more recent work that presents a comprehensive overview of the status and future trends of FL in applications and markets. In this survey, we introduce the basic fundamentals of FL, describing its underlying technologies, architectures, system challenges, and privacy-preserving methods. More importantly, the contribution of this work is in scoping a wide variety of FL current applications and future trends in technology and markets today. We present a classification and clustering of literature progress in FL in application to technologies including Artificial Intelligence, Internet of Things, blockchain, Natural Language Processing, autonomous vehicles, and resource allocation, as well as in application to market use cases in domains of Data Science, healthcare, education, and industry. We discuss future open directions and challenges in FL within recommendation engines, autonomous vehicles, IoT, battery management, privacy, fairness, personalization, and the role of FL for governments and public sectors. By presenting a comprehensive review of the status and prospects of FL, this work serves as a reference point for researchers and practitioners to explore FL applications under a wide range of domains.",
        "DOI": "10.1016/j.ipm.2022.103061",
        "paper_author": "Banabilah S.",
        "affiliation_name": "Duquesne University",
        "affiliation_city": "Pittsburgh",
        "affiliation_country": "United States",
        "affiliation_id": "60012641",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Deep Learning Based Attack Detection for Cyber-Physical System Cybersecurity: A Survey",
        "publication": "IEEE/CAA Journal of Automatica Sinica",
        "citied_by": "281",
        "cover_date": "2022-03-01",
        "Abstract": "With the booming of cyber attacks and cyber criminals against cyber-physical systems (CPSs), detecting these attacks remains challenging. It might be the worst of times, but it might be the best of times because of opportunities brought by machine learning (ML), in particular deep learning (DL). In general, DL delivers superior performance to ML because of its layered setting and its effective algorithm for extract useful information from training data. DL models are adopted quickly to cyber attacks against CPS systems. In this survey, a holistic view of recently proposed DL solutions is provided to cyber attack detection in the CPS context. A six-step DL driven methodology is provided to summarize and analyze the surveyed literature for applying DL methods to detect cyber attacks against CPS systems. The methodology includes CPS scenario analysis, cyber attack identification, ML problem formulation, DL model customization, data acquisition for training, and performance evaluation. The reviewed works indicate great potential to detect cyber attacks against CPS through DL modules. Moreover, excellent performance is achieved partly because of several high-quality datasets that are readily available for public use. Furthermore, challenges, opportunities, and research trends are pointed out for future research.",
        "DOI": "10.1109/JAS.2021.1004261",
        "paper_author": "Zhang J.",
        "affiliation_name": "Swinburne University of Technology",
        "affiliation_city": "Hawthorn",
        "affiliation_country": "Australia",
        "affiliation_id": "60030804",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Learning Graph Structures With Transformer for Multivariate Time-Series Anomaly Detection in IoT",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "279",
        "cover_date": "2022-06-15",
        "Abstract": "Many real-world Internet of Things (IoT) systems, which include a variety of Internet-connected sensory devices, produce substantial amounts of multivariate time-series data. Meanwhile, vital IoT infrastructures, such as smart power grids and water distribution networks are frequently targeted by cyberattacks, making anomaly detection an important study topic. Modeling such relatedness is, nevertheless, unavoidable for any efficient and effective anomaly detection system, given the intricate topological and nonlinear connections that are originally unknown among sensors. Furthermore, detecting anomalies in multivariate time series is difficult due to their temporal dependency and stochasticity. This article presented GTA, a new framework for multivariate time-series anomaly detection that involves automatically learning a graph structure, graph convolution, and modeling temporal dependency using a transformer-based architecture. The connection learning policy, which is based on the Gumbel-softmax sampling approach to learn bidirected links among sensors directly, is at the heart of the learning graph structure. To describe the anomaly information flow between network nodes, we introduced a new graph convolution called influence propagation convolution. In addition, to tackle the quadratic complexity barrier, we suggested a multibranch attention mechanism to replace the original multihead self-attention method. Extensive experiments on four publicly available anomaly detection benchmarks further demonstrate the superiority of our approach over alternative state of the arts.",
        "DOI": "10.1109/JIOT.2021.3100509",
        "paper_author": "Chen Z.",
        "affiliation_name": "School of Engineering and Applied Science",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60141924",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Machine learning in medical applications: A review of state-of-the-art methods",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "274",
        "cover_date": "2022-06-01",
        "Abstract": "Applications of machine learning (ML) methods have been used extensively to solve various complex challenges in recent years in various application areas, such as medical, financial, environmental, marketing, security, and industrial applications. ML methods are characterized by their ability to examine many data and discover exciting relationships, provide interpretation, and identify patterns. ML can help enhance the reliability, performance, predictability, and accuracy of diagnostic systems for many diseases. This survey provides a comprehensive review of the use of ML in the medical field highlighting standard technologies and how they affect medical diagnosis. Five major medical applications are deeply discussed, focusing on adapting the ML models to solve the problems in cancer, medical chemistry, brain, medical imaging, and wearable sensors. Finally, this survey provides valuable references and guidance for researchers, practitioners, and decision-makers framing future research and development directions.",
        "DOI": "10.1016/j.compbiomed.2022.105458",
        "paper_author": "Shehab M.",
        "affiliation_name": "The World Islamic Sciences and Education University",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60108351",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Agricultural land systems importance for supporting food security and sustainable development goals: A systematic review",
        "publication": "Science of the Total Environment",
        "citied_by": "274",
        "cover_date": "2022-02-01",
        "Abstract": "Agriculture provides the largest share of food supplies and ensures a critical number of ecosystem services (e.g., food provisioning). Therefore, agriculture is vital for food security and supports the Sustainable Development Goal (SDGs) 2 (SDG 2 - zero hunger) as others SDG's. Several studies have been published in different world areas with different research directions focused on increasing food and nutritional security from an agricultural land system perspective. The heterogeneity of the agricultural research studies calls for an interdisciplinary and comprehensive systematization of the different research directions and the plethora of approaches, scales of analysis, and reference data used. Thus, this work aims to systematically review the contributions of the different agricultural research studies by systematizing the main research fields and present a synthesis of the diversity and scope of research and knowledge. From an initial search of 1151 articles, 260 meet the criteria to be used in the review. Our analysis revealed that most articles were published between 2015 and 2019 (59%), and most of the case studies were carried out in Asia (36%) and Africa (20%). The number of studies carried out in the other continents was lower. In the last 30 years, most of the research was centred in six main research fields: land-use changes (28%), agricultural efficiency (27%), climate change (16%), farmer's motivation (12%), urban and peri-urban agriculture (11%), and land suitability (7%). Overall, the research fields identified are directly or indirectly linked to 11 of the 17 SDGs. There are essential differences in the number of articles among research fields, and future efforts are needed in the ones that are less represented to support food security and the SDGs.",
        "DOI": "10.1016/j.scitotenv.2021.150718",
        "paper_author": "Viana C.M.",
        "affiliation_name": "Instituto de Geografia e Ordenamento do Território da Universidade de Lisboa",
        "affiliation_city": "Lisbon",
        "affiliation_country": "Portugal",
        "affiliation_id": "60106182",
        "affiliation_state": "Lisbon"
    },
    {
        "paper_title": "Blockchain for healthcare data management: opportunities, challenges, and future recommendations",
        "publication": "Neural Computing and Applications",
        "citied_by": "270",
        "cover_date": "2022-07-01",
        "Abstract": "Today's healthcare data management systems are facing key challenges in terms of data transparency, traceability, immutability, audit, data provenance, flexible access, trust, privacy, and security. Also, a large portion of existing healthcare systems leveraged for managing data are centralized that pose potential risks of single point of failures in case of natural disasters. Blockchain is an emerging and disruptive decentralized technology that has the potential to significantly revolutionize, reshape, and transform the way data are being handled in healthcare industries. In this paper, we discuss how leveraging blockchain for healthcare data management systems can lead to stimulate innovations and bring major improvements. We present the key blockchain features and characteristics. We discuss the premier advantages of adopting blockchain technology along with opportunities for healthcare industries. We present recent on-going projects and case studies to show the practicality of blockchain technology for various healthcare applications. We identify and discuss important open research challenges hindering the successful adoption of blockchain in the healthcare sector. Finally, we outline several future research directions.",
        "DOI": "10.1007/s00521-020-05519-w",
        "paper_author": "Yaqoob I.",
        "affiliation_name": "Khalifa University of Science and Technology",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60104134",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "IoT-Enabled Smart Agriculture: Architecture, Applications, and Challenges",
        "publication": "Applied Sciences (Switzerland)",
        "citied_by": "269",
        "cover_date": "2022-04-01",
        "Abstract": "The growth of the global population coupled with a decline in natural resources, farmland, and the increase in unpredictable environmental conditions leads to food security is becoming a major concern for all nations worldwide. These problems are motivators that are driving the agricultural industry to transition to smart agriculture with the application of the Internet of Things (IoT) and big data solutions to improve operational efficiency and productivity. The IoT integrates a series of existing state-of-the-art solutions and technologies, such as wireless sensor networks, cognitive radio ad hoc networks, cloud computing, big data, and end-user applications. This study presents a survey of IoT solutions and demonstrates how IoT can be integrated into the smart agriculture sector. To achieve this objective, we discuss the vision of IoT-enabled smart agriculture ecosystems by evaluating their architecture (IoT devices, communication technologies, big data storage, and processing), their applications, and research timeline. In addition, we discuss trends and opportunities of IoT applications for smart agriculture and also indicate the open issues and challenges of IoT application in smart agriculture. We hope that the findings of this study will constitute important guidelines in research and promotion of IoT solutions aiming to improve the productivity and quality of the agriculture sector as well as facilitating the transition towards a future sustainable environment with an agroecological approach.",
        "DOI": "10.3390/app12073396",
        "paper_author": "Quy V.K.",
        "affiliation_name": "Hung Yen University of Technology and Education",
        "affiliation_city": "Hung Yen",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "126489362",
        "affiliation_state": "Hung Yen Province"
    },
    {
        "paper_title": "Digital mapping of GlobalSoilMap soil properties at a broad scale: A review",
        "publication": "Geoderma",
        "citied_by": "265",
        "cover_date": "2022-03-01",
        "Abstract": "Soils are essential for supporting food production and providing ecosystem services but are under pressure due to population growth, higher food demand, and land use competition. Because of the effort to ensure the sustainable use of soil resources, demand for current, updatable soil information capable of supporting decisions across scales is increasing. Digital soil mapping (DSM) addresses the drawbacks of conventional soil mapping and has been increasingly used for delivering soil information in a time- and cost-efficient manner with higher spatial resolution, better map accuracy, and quantified uncertainty estimates. We reviewed 244 articles published between January 2003 and July 2021 and then summarised the progress in broad-scale (spatial extent >10,000 km2) DSM, focusing on the 12 mandatory soil properties for GlobalSoilMap. We observed that DSM publications continued to increase exponentially; however, the majority (74.6%) focused on applications rather than methodology development. China, France, Australia, and the United States were the most active countries, and Africa and South America lacked country-based DSM products. Approximately 78% of articles focused on mapping soil organic matter/carbon content and soil organic carbon stocks because of their significant role in food security and climate regulation. Half the articles focused on soil information in topsoil only (<30 cm), and studies on deep soil (100–200 cm) were less represented (21.7%). Relief, organisms, and climate were the three most frequently used environmental covariates in DSM. Nonlinear models (i.e. machine learning) have been increasingly used in DSM for their capacity to manage complex interactions between soil information and environmental covariates. Soil pH was the best predicted soil property (average R2 of 0.60, 0.63, and 0.56 at 0–30, 30–100, and 100–200 cm). Other relatively well-predicted soil properties were clay, silt, sand, soil organic carbon (SOC), soil organic matter (SOM), SOC stocks, and bulk density, and coarse fragments and soil depth were poorly predicted (R2 < 0.28). In addition, decreasing model performance with deeper depth intervals was found for most soil properties. Further research should pursue rescuing legacy data, sampling new data guided by well-designed sampling schemas, collecting representative environmental covariates, improving the performance and interpretability of advanced spatial predictive models, relating performance indicators such as accuracy and precision to cost-benefit and risk assessment analysis for improving decision support; moving from static DSM to dynamic DSM; and providing high-quality, fine-resolution digital soil maps to address global challenges related to soil resources.",
        "DOI": "10.1016/j.geoderma.2021.115567",
        "paper_author": "Chen S.",
        "affiliation_name": "Unité Info&amp;Sols",
        "affiliation_city": "Orleans",
        "affiliation_country": "France",
        "affiliation_id": "60280688",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital Twins: State of the art theory and practice, challenges, and open research questions",
        "publication": "Journal of Industrial Information Integration",
        "citied_by": "258",
        "cover_date": "2022-11-01",
        "Abstract": "Digital Twin was introduced over a decade ago, as an innovative all-encompassing tool, with perceived benefits including real-time monitoring, simulation, optimisation and accurate forecasting. However, the theoretical framework and practical implementations of digital twin (DT) are yet to fully achieve this vision at scale. Although an increasing number of successful implementations exist in research and industrial works, sufficient implementation details are not publicly available, making it difficult to fully assess their components and effectiveness, to draw comparisons, identify successful solutions, share lessons, and thus to jointly advance and benefit from the DT methodology. This work first presents a review of relevant DT research and industrial works, focusing on the key DT features, current approaches in different domains, and successful DT implementations, to infer the key DT components and properties, and to identify current limitations and reasons behind the delay in the widespread implementation and adoption of digital twin. This work identifies that the major reasons for this delay are: the fact the DT is still a fast evolving concept; the lack of a universal DT reference framework, e.g. DT standards are scarce and still evolving; problem- and domain-dependence; security concerns over shared data; lack of DT performance metrics; and reliance of digital twin on other fast-evolving technologies. Advancements in machine learning, Internet of Things (IoT) and big data have led to significant improvements in DT features such as real-time monitoring and accurate forecasting. Despite this progress and individual company-based efforts, certain research and implementation gaps exist in the field, which have so far prevented the widespread adoption of the DT concept and technology; these gaps are also discussed in this work. Based on reviews of past work and the identified gaps, this work then defines a conceptualisation of DT which includes its components and properties; these also validate the uniqueness of DT as a concept, when compared to similar concepts such as simulation, autonomous systems and optimisation. Real-life case studies are used to showcase the application of the conceptualisation. This work discusses the state-of-the-art in DT, addresses relevant and timely DT questions, and identifies novel research questions, thus contributing to a better understanding of the DT paradigm and advancing the theory and practice of DT and its allied technologies.",
        "DOI": "10.1016/j.jii.2022.100383",
        "paper_author": "Sharma A.",
        "affiliation_name": "University of Oxford",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026851",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "Deep Learning Based Vulnerability Detection: Are We There Yet?",
        "publication": "IEEE Transactions on Software Engineering",
        "citied_by": "257",
        "cover_date": "2022-09-01",
        "Abstract": "Automated detection of software vulnerabilities is a fundamental problem in software security. Existing program analysis techniques either suffer from high false positives or false negatives. Recent progress in Deep Learning (DL) has resulted in a surge of interest in applying DL for automated vulnerability detection. Several recent studies have demonstrated promising results achieving an accuracy of up to 95 percent at detecting vulnerabilities. In this paper, we ask, 'how well do the state-of-the-art DL-based techniques perform in a real-world vulnerability prediction scenario?' To our surprise, we find that their performance drops by more than 50 percent. A systematic investigation of what causes such precipitous performance drop reveals that existing DL-based vulnerability prediction approaches suffer from challenges with the training data (e.g., data duplication, unrealistic distribution of vulnerable classes, etc.) and with the model choices (e.g., simple token-based models). As a result, these approaches often do not learn features related to the actual cause of the vulnerabilities. Instead, they learn unrelated artifacts from the dataset (e.g., specific variable/function names, etc.). Leveraging these empirical findings, we demonstrate how a more principled approach to data collection and model design, based on realistic settings of vulnerability prediction, can lead to better solutions. The resulting tools perform significantly better than the studied baseline-up to 33.57 percent boost in precision and 128.38 percent boost in recall compared to the best performing model in the literature. Overall, this paper elucidates existing DL-based vulnerability prediction systems' potential issues and draws a roadmap for future DL-based vulnerability prediction research.",
        "DOI": "10.1109/TSE.2021.3087402",
        "paper_author": "Chakraborty S.",
        "affiliation_name": "Columbia University",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60030162",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Historical Redlining Is Associated with Present-Day Air Pollution Disparities in U.S. Cities",
        "publication": "Environmental Science and Technology Letters",
        "citied_by": "249",
        "cover_date": "2022-04-12",
        "Abstract": "Communities of color in the United States are systematically exposed to higher levels of air pollution. We explore here how redlining, a discriminatory mortgage appraisal practice from the 1930s by the federal Home Owners' Loan Corporation (HOLC), relates to present-day intraurban air pollution disparities in 202 U.S. cities. In each city, we integrated three sources of data: (1) detailed HOLC security maps of investment risk grades [A (\"best\"), B, C, and D (\"hazardous\", i.e., redlined)], (2) year-2010 estimates of NO2and PM2.5air pollution levels, and (3) demographic information from the 2010 U.S. census. We find that pollution levels have a consistent and nearly monotonic association with HOLC grade, with especially pronounced (>50%) increments in NO2levels between the most (grade A) and least (grade D) preferentially graded neighborhoods. On a national basis, intraurban disparities for NO2and PM2.5are substantially larger by historical HOLC grade than they are by race and ethnicity. However, within each HOLC grade, racial and ethnic air pollution exposure disparities persist, indicating that redlining was only one of the many racially discriminatory policies that impacted communities. Our findings illustrate how redlining, a nearly 80-year-old racially discriminatory policy, continues to shape systemic environmental exposure disparities in the United States.",
        "DOI": "10.1021/acs.estlett.1c01012",
        "paper_author": "Lane H.M.",
        "affiliation_name": "Department of Civil and Environmental Engineering",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60121457",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "A Survey on the Convergence of Edge Computing and AI for UAVs: Opportunities and Challenges",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "244",
        "cover_date": "2022-09-01",
        "Abstract": "The latest 5G mobile networks have enabled many exciting Internet of Things (IoT) applications that employ unmanned aerial vehicles (UAVs/drones). The success of most UAV-based IoT applications is heavily dependent on artificial intelligence (AI) technologies, for instance, computer vision and path planning. These AI methods must process data and provide decisions while ensuring low latency and low energy consumption. However, the existing cloud-based AI paradigm finds it difficult to meet these strict UAV requirements. Edge AI, which runs AI on-device or on edge servers close to users, can be suitable for improving UAV-based IoT services. This article provides a comprehensive analysis of the impact of edge AI on key UAV technical aspects (i.e., autonomous navigation, formation control, power management, security and privacy, computer vision, and communication) and applications (i.e., delivery systems, civil infrastructure inspection, precision agriculture, search and rescue (SAR) operations, acting as aerial wireless base stations (BSs), and drone light shows). As guidance for researchers and practitioners, this article also explores UAV-based edge AI implementation challenges, lessons learned, and future research directions.",
        "DOI": "10.1109/JIOT.2022.3176400",
        "paper_author": "McEnroe P.",
        "affiliation_name": "University College Dublin",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60005141",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "Generative Adversarial Networks: A Survey Toward Private and Secure Applications",
        "publication": "ACM Computing Surveys",
        "citied_by": "240",
        "cover_date": "2022-07-31",
        "Abstract": "Generative Adversarial Networks (GANs) have promoted a variety of applications in computer vision and natural language processing, among others, due to its generative model's compelling ability to generate realistic examples plausibly drawn from an existing distribution of samples. GAN not only provides impressive performance on data generation-based tasks but also stimulates fertilization for privacy and security oriented research because of its game theoretic optimization strategy. Unfortunately, there are no comprehensive surveys on GAN in privacy and security, which motivates this survey to summarize systematically. The existing works are classified into proper categories based on privacy and security functions, and this survey conducts a comprehensive analysis of their advantages and drawbacks. Considering that GAN in privacy and security is still at a very initial stage and has imposed unique challenges that are yet to be well addressed, this article also sheds light on some potential privacy and security applications with GAN and elaborates on some future research directions.",
        "DOI": "10.1145/3459992",
        "paper_author": "Cai Z.",
        "affiliation_name": "Georgia State University",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60012387",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "Potential of Internet of Medical Things (IoMT) applications in building a smart healthcare system: A systematic review",
        "publication": "Journal of Oral Biology and Craniofacial Research",
        "citied_by": "233",
        "cover_date": "2022-03-01",
        "Abstract": "Sudden spurting of Corona virus disease (COVID-19) has put the whole healthcare system on high alert. Internet of Medical Things (IoMT) has eased the situation to a great extent, also COVID-19 has motivated scientists to make new ‘Smart’ healthcare system focusing towards early diagnosis, prevention of spread, education and treatment and facilitate living in the new normal. This review aims to identify the role of IoMT applications in improving healthcare system and to analyze the status of research demonstrating effectiveness of IoMT benefits to the patient and healthcare system along with a brief insight into technologies supplementing IoMT and challenges faced in developing a smart healthcare system. An internet-based search in PUBMED, Google Scholar and IEEE Library for english language publications using relevant terms resulted in 987 articles. After screening title, abstract, and content related to IoMT in healthcare and excluding duplicate articles, 135 articles published in journal with impact factor ≥1 were eligible for inclusion. Also relevant articles from the references of the selected articles were considered. The habituation of IoMT and related technology has resolved several difficulties using remote monitoring, telemedicine, robotics, sensors etc. However mass adoption seems challenging due to factors like privacy and security of data, management of large amount of data, scalability and upgradation etc. Although ample knowledge has been compiled and exchanged, this structured systematic review will help the healthcare practitioners, policymakers/decision makers, scientists and researchers to gauge the applicability of IoMT in healthcare more efficiently.",
        "DOI": "10.1016/j.jobcr.2021.11.010",
        "paper_author": "Dwivedi R.",
        "affiliation_name": "King George's Medical University",
        "affiliation_city": "Lucknow",
        "affiliation_country": "India",
        "affiliation_id": "60021599",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "A framework for privacy-preservation of IoT healthcare data using Federated Learning and blockchain technology",
        "publication": "Future Generation Computer Systems",
        "citied_by": "233",
        "cover_date": "2022-04-01",
        "Abstract": "With the dramatically increasing deployment of IoT (Internet-of-Things) and communication, data has always been a major priority to achieve intelligent healthcare in a smart city. For the modern environment, valuable assets are user IoT data. The privacy policy is even the biggest necessity to secure user's data in a deep-rooted fundamental infrastructure of network and advanced applications, including smart healthcare. Federated learning acts as a special machine learning technique for privacy-preserving and offers to contextualize data in a smart city. This article proposes Blockchain and Federated Learning-enabled Secure Architecture for Privacy-Preserving in Smart Healthcare, where Blockchain-based IoT cloud platforms are used for security and privacy. Federated Learning technology is adopted for scalable machine learning applications like healthcare. Furthermore, users can obtain a well-trained machine learning model without sending personal data to the cloud. Moreover, it also discussed the applications of federated learning for a distributed secure environment in a smart city.",
        "DOI": "10.1016/j.future.2021.11.028",
        "paper_author": "Singh S.",
        "affiliation_name": "Dongguk University, Seoul",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60009387",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "DL-IDS: a deep learning–based intrusion detection framework for securing IoT",
        "publication": "Transactions on Emerging Telecommunications Technologies",
        "citied_by": "233",
        "cover_date": "2022-03-01",
        "Abstract": "The Internet of Things (IoT) is comprised of numerous devices connected through wired or wireless networks, including sensors and actuators. Recently, the number of IoT applications has increased dramatically, including smart homes, vehicular ad hoc network (VANETs), health care, smart cities, and wearables. As reported in IHS Markit (see https://technology.ihs.com), the number of connected devices is projected to jump from approximately 27 billion in 2017 to 125 billion in 2030, an average annual increment of 12%. Security is a critical issue in today's IoT field because of the nature of the architecture, the types of devices, different methods of communication (mainly wireless), and the volume of data being transmitted over the network. Security becomes even more important as the number of devices connected to the IoT increases. To overcome the challenges of securing IoT devices, we propose a new deep learning–based intrusion detection system (DL-IDS) to detect security threats in IoT environments. There are many IDSs in the literature, but they lack optimal features learning and data set management, which are significant issues that affect the accuracy of attack detection. Our proposed module combines the spider monkey optimization (SMO) algorithm and the stacked-deep polynomial network (SDPN) to achieve optimal detection recognition; SMO selects the optimal features in the data sets and SDPN classifies the data as normal or anomalies. The types of anomalies detected by DL-IDS include denial of service (DoS), user-to-root (U2R) attack, probe attack, and remote-to-local (R2L) attack. Extensive analysis indicates that the proposed DL-IDS achieves better performance in terms of accuracy, precision, recall, and F-score.",
        "DOI": "10.1002/ett.3803",
        "paper_author": "Otoum Y.",
        "affiliation_name": "University of Ottawa",
        "affiliation_city": "Ottawa",
        "affiliation_country": "Canada",
        "affiliation_id": "60028897",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "MTH-IDS: A Multitiered Hybrid Intrusion Detection System for Internet of Vehicles",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "231",
        "cover_date": "2022-01-01",
        "Abstract": "Modern vehicles, including connected vehicles and autonomous vehicles, nowadays involve many electronic control units connected through intravehicle networks (IVNs) to implement various functionalities and perform actions. Modern vehicles are also connected to external networks through vehicle-to-everything technologies, enabling their communications with other vehicles, infrastructures, and smart devices. However, the improving functionality and connectivity of modern vehicles also increase their vulnerabilities to cyber-attacks targeting both intravehicle and external networks due to the large attack surfaces. To secure vehicular networks, many researchers have focused on developing intrusion detection systems (IDSs) that capitalize on machine learning methods to detect malicious cyber-attacks. In this article, the vulnerabilities of intravehicle and external networks are discussed, and a multitiered hybrid IDS that incorporates a signature-based IDS and an anomaly-based IDS is proposed to detect both known and unknown attacks on vehicular networks. Experimental results illustrate that the proposed system can detect various types of known attacks with 99.99% accuracy on the CAN-intrusion-dataset representing the IVN data and 99.88% accuracy on the CICIDS2017 data set illustrating the external vehicular network data. For the zero-day attack detection, the proposed system achieves high F1-scores of 0.963 and 0.800 on the above two data sets, respectively. The average processing time of each data packet on a vehicle-level machine is less than 0.6 ms, which shows the feasibility of implementing the proposed system in real-time vehicle systems. This emphasizes the effectiveness and efficiency of the proposed IDS.",
        "DOI": "10.1109/JIOT.2021.3084796",
        "paper_author": "Yang L.",
        "affiliation_name": "Western University",
        "affiliation_city": "London",
        "affiliation_country": "Canada",
        "affiliation_id": "60010884",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Federated learning for malware detection in IoT devices",
        "publication": "Computer Networks",
        "citied_by": "230",
        "cover_date": "2022-02-26",
        "Abstract": "Billions of IoT devices lacking proper security mechanisms have been manufactured and deployed for the last years, and more will come with the development of Beyond 5G technologies. Their vulnerability to malware has motivated the need for efficient techniques to detect infected IoT devices inside networks. With data privacy and integrity becoming a major concern in recent years, increasing with the arrival of 5G and Beyond networks, new technologies such as federated learning and blockchain emerged. They allow training machine learning models with decentralized data while preserving its privacy by design. This work investigates the possibilities enabled by federated learning concerning IoT malware detection and studies security issues inherent to this new learning paradigm. In this context, a framework that uses federated learning to detect malware affecting IoT devices is presented. N-BaIoT, a dataset modeling network traffic of several real IoT devices while affected by malware, has been used to evaluate the proposed framework. Both supervised and unsupervised federated models (multi-layer perceptron and autoencoder) able to detect malware affecting seen and unseen IoT devices of N-BaIoT have been trained and evaluated. Furthermore, their performance has been compared to two traditional approaches. The first one lets each participant locally train a model using only its own data, while the second consists of making the participants share their data with a central entity in charge of training a global model. This comparison has shown that the use of more diverse and large data, as done in the federated and centralized methods, has a considerable positive impact on the model performance. Besides, the federated models, while preserving the participant's privacy, show similar results as the centralized ones. As an additional contribution and to measure the robustness of the federated approach, an adversarial setup with several malicious participants poisoning the federated model has been considered. The baseline model aggregation averaging step used in most federated learning algorithms appears highly vulnerable to different attacks, even with a single adversary. The performance of other model aggregation functions acting as countermeasures is thus evaluated under the same attack scenarios. These functions provide a significant improvement against malicious participants, but more efforts are still needed to make federated approaches robust.",
        "DOI": "10.1016/j.comnet.2021.108693",
        "paper_author": "Rey V.",
        "affiliation_name": "École Polytechnique Fédérale de Lausanne",
        "affiliation_city": "Lausanne",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60028186",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Blockchain technology in healthcare: Challenges and opportunities",
        "publication": "International Journal of Healthcare Management",
        "citied_by": "230",
        "cover_date": "2022-01-01",
        "Abstract": "Patients and healthcare practitioners are faced with the challenge of accessing, managing, integrating, and sharing health records securely. Patients should be able to manage their health records anywhere in the world, keep track of medical background, give access to data, and share those with any healthcare professional securely. Direct access to data for patients and a more robust data-sharing infrastructure could better prepare the healthcare system to manage public health threats during the emergence of deadly disease outbreak such as COVID-19. Current technologies in use by the healthcare industry do not adequately address these requirements due to limitations related to privacy, security, and full ecosystem interoperability. This paper conducted a literature review to find out the pivotal roles blockchain technology play in solving some of the most critical and challenging issues facing the healthcare industry. This paper identifies challenges and opportunities for implementing blockchain technology in healthcare and summarizes health-related blockchain products and key players offering solutions across different applications. In doing this, our research extends and complements existing blockchain research in healthcare.",
        "DOI": "10.1080/20479700.2020.1843887",
        "paper_author": "Attaran M.",
        "affiliation_name": "California State University, Bakersfield",
        "affiliation_city": "Bakersfield",
        "affiliation_country": "United States",
        "affiliation_id": "60023113",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Blockchain-Enabled Federated Learning Data Protection Aggregation Scheme With Differential Privacy and Homomorphic Encryption in IIoT",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "227",
        "cover_date": "2022-06-01",
        "Abstract": "With rapid growth in data volume generated from different industrial devices in IoT, the protection for sensitive and private data in data sharing has become crucial. At present, federated learning for data security has arisen, and it can solve the security concerns on data sharing by model sharing on Internet of mutual distrust. However, the hackers still launch attack aiming at the security vulnerabilities (e.g., model extraction attack and model reverse attack) in federated learning. In this article, to address the above problems, we first design an application model of blockchain-enabled federated learning in Industrial Internet of Things (IIoT), and formulate our data protection aggregation scheme based on the above model. Then, we give the distributed K-means clustering based on differential privacy and homomorphic encryption, and the distributed random forest with differential privacy and the distributed AdaBoost with homomorphic encryption methods, which enable multiple data protection in data sharing and model sharing. Finally, we integrate the methods with blockchain and federated learning, and provide the complete security analysis. Extensive experimental results show that our aggregation scheme and working mechanism have the better performance in the selected indicators.",
        "DOI": "10.1109/TII.2021.3085960",
        "paper_author": "Jia B.",
        "affiliation_name": "University of Electronic Science and Technology of China",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60005465",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Dos and Don'ts of Machine Learning in Computer Security",
        "publication": "Proceedings of the 31st USENIX Security Symposium, Security 2022",
        "citied_by": "226",
        "cover_date": "2022-01-01",
        "Abstract": "With the growing processing power of computing systems and the increasing availability of massive datasets, machine learning algorithms have led to major breakthroughs in many different areas. This development has influenced computer security, spawning a series of work on learning-based security systems, such as for malware detection, vulnerability discovery, and binary code analysis. Despite great potential, machine learning in security is prone to subtle pitfalls that undermine its performance and render learning-based systems potentially unsuitable for security tasks and practical deployment. In this paper, we look at this problem with critical eyes. First, we identify common pitfalls in the design, implementation, and evaluation of learning-based security systems. We conduct a study of 30 papers from top-tier security conferences within the past 10 years, confirming that these pitfalls are widespread in the current security literature. In an empirical analysis, we further demonstrate how individual pitfalls can lead to unrealistic performance and interpretations, obstructing the understanding of the security problem at hand. As a remedy, we propose actionable recommendations to support researchers in avoiding or mitigating the pitfalls where possible. Furthermore, we identify open problems when applying machine learning in security and provide directions for further research.",
        "DOI": "NA",
        "paper_author": "Arp D.",
        "affiliation_name": "Technische Universität Berlin",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60011604",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Cyber Security Awareness, Knowledge and Behavior: A Comparative Study",
        "publication": "Journal of Computer Information Systems",
        "citied_by": "226",
        "cover_date": "2022-01-01",
        "Abstract": "Cyber-attacks represent a potential threat to information security. As rates of data usage and internet consumption continue to increase, cyber awareness turned to be increasingly urgent. This study focuses on the relationships between cyber security awareness, knowledge and behavior with protection tools among individuals in general and across four countries: Israel, Slovenia, Poland and Turkey in particular. Results show that internet users possess adequate cyber threat awareness but apply only minimal protective measures usually relatively common and simple ones. The study findings also show that higher cyber knowledge is connected to the level of cyber awareness, beyond the differences in respondent country or gender. In addition, awareness is also connected to protection tools, but not to information they were willing to disclose. Lastly, findings exhibit differences between the explored countries that affect the interaction between awareness, knowledge, and behaviors. Results, implications, and recommendations for effective based cyber security training programs are presented and discussed.",
        "DOI": "10.1080/08874417.2020.1712269",
        "paper_author": "Zwilling M.",
        "affiliation_name": "Ariel University",
        "affiliation_city": "Ariel",
        "affiliation_country": "Israel",
        "affiliation_id": "60080064",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Detection of False Data Injection Attacks in Smart Grid: A Secure Federated Deep Learning Approach",
        "publication": "IEEE Transactions on Smart Grid",
        "citied_by": "223",
        "cover_date": "2022-11-01",
        "Abstract": "As an important cyber-physical system (CPS), smart grid is highly vulnerable to cyber attacks. Amongst various types of attacks, false data injection attack (FDIA) proves to be one of the top-priority cyber-related issues and has received increasing attention in recent years. However, so far little attention has been paid to privacy preservation issues in the detection of FDIAs in smart grids. Inspired by federated learning, a FDIA detection method based on secure federated deep learning is proposed in this paper by combining Transformer, federated learning and Paillier cryptosystem. The Transformer, as a detector deployed in edge nodes, delves deep into the connection between individual electrical quantities by using its multi-head self-attention mechanism. By using federated learning framework, our approach utilizes the data from all nodes to collaboratively train a detection model while preserving data privacy by keeping the data locally during training. To improve the security of federated learning, a secure federated learning scheme is designed by combing Paillier cryptosystem with federated learning. Through extensive experiments on the IEEE 14-bus and 118-bus test systems, the effectiveness and superiority of the proposed method are verified.",
        "DOI": "10.1109/TSG.2022.3204796",
        "paper_author": "Li Y.",
        "affiliation_name": "Northeast Electric Power University",
        "affiliation_city": "Jilin",
        "affiliation_country": "China",
        "affiliation_id": "60073562",
        "affiliation_state": "Jilin"
    },
    {
        "paper_title": "Global Trends in Wheat Production, Consumption and Trade",
        "publication": "Wheat Improvement: Food Security in a Changing Climate",
        "citied_by": "222",
        "cover_date": "2022-01-01",
        "Abstract": "Since its domestication around 10,000 years ago, wheat has played a crucial role in global food security. Wheat now supplies a fifth of food calories and protein to the world’s population. It is the most widely cultivated crop in the world, cultivated on 217 million ha annually. This chapter assesses available data on wheat production, consumption, and international trade to examine the global supply and demand conditions for wheat over the past quarter century and future implications. There is continued urgency to enhance wheat productivity to ensure global food security given continued global population growth and growing popularity of wheat based processed foods in the Global South. To enhance productivity while staying within planetary boundaries, there is a need for substantive investments in research and development, particularly in support of wheat’s role in agri-food systems in the Global South.",
        "DOI": "10.1007/978-3-030-90673-3_4",
        "paper_author": "Erenstein O.",
        "affiliation_name": "Centro Internacional de Mejoramiento de Maiz y Trigo",
        "affiliation_city": "Texcoco",
        "affiliation_country": "Mexico",
        "affiliation_id": "60015079",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Review on deep learning applications in frequency analysis and control of modern power system",
        "publication": "International Journal of Electrical Power and Energy Systems",
        "citied_by": "222",
        "cover_date": "2022-03-01",
        "Abstract": "The penetration of renewable energy resources (RES) generation and the interconnection of regional power grids in wide area and large scale have led the modern power system to exhibit more and more complex dynamic features, such as time-varying nonlinearity, uncertainty, data diversity, and local observability. The increasing complexity of power system's dynamic characteristics makes the traditional analysis and control methods inefficient, even invalid. As a new technology path of Machine Learning, Deep learning (DL) has distinct advantages in solving complex problems such as power system frequency analysis and control due to its powerful ability of data analysis, prediction, and classification. This paper reviews the history, state of art and the future of the DL's application in power system frequency analysis and control. Firstly, the basic principle and research progress of DL, the training methods, typical structures, and application peculiarity of DL were introduced. Secondly, the application status of DL in frequency situation awareness, frequency security and stability assessment, and frequency regulation and control were summarized, and the adaptability of DL application to each kind of issue was discussed. Finally, the development trend of DL and its application in power system frequency were prospected.",
        "DOI": "10.1016/j.ijepes.2021.107744",
        "paper_author": "Zhang Y.",
        "affiliation_name": "Shandong University",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60031031",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "World energy trilemma and transformative energy developments as determinants of economic growth amid environmental sustainability",
        "publication": "Energy Economics",
        "citied_by": "220",
        "cover_date": "2022-04-01",
        "Abstract": "Energy is at the heart of many United Nations Sustainable Development Goals. Countries should balance the three core dimensions of the world energy trilemma: energy affordability and access, energy security, and environmental sustainability to build a solid basis for prosperity and competitiveness. We investigate the impact of world energy trilemma and transformative energy developments on economic growth and environmental sustainability of the top ten and near bottom ten selected countries of SDGs index 2021, using investment in non-financial assets and energy use as moderator variables, from 1990 to 2016. We have developed a comprehensive empirical analysis and applied advanced econometric methodologies. Westerlund's panel co-integration suggests long-run relationships within the variables. Our long-run dynamic panel-data estimation, random-effects panel generalized least square regressions, and robust corrected standard error linear regressions findings indicate world energy trilemma and transformative energy developments simultaneously improve economic growth and environmental sustainability. However, investment in non-financial assets and energy use improves economic growth at the expense of environmental sustainability. This suggests that countries should improve energy policy coherence and integrate energy policy actions by balancing the crucial world energy trilemma dimensions to help develop a well-calibrated energy system.",
        "DOI": "10.1016/j.eneco.2022.105884",
        "paper_author": "Khan I.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A fast and efficient multiple images encryption based on single-channel encryption and chaotic system",
        "publication": "Nonlinear Dynamics",
        "citied_by": "219",
        "cover_date": "2022-03-01",
        "Abstract": "A multiple-image encryption algorithm based on single-channel scrambling, diffusion and chaotic system is presented in this paper. The initial values of the chaotic system are associated with the pixel values of each set of encrypted images as the key for each set of image encryption. The pseudo-random sequences and matrixes generated by the chaotic system are obtained by the corresponding keys, and then, the whole set of images are fused across-image and transferred from the RGB channel to the HSV channel after fusion. For single-channel encryption, select one of the HSV channels is extracted and encryption operations of scrambling and diffusion are performed. The index sequences generated by the chaotic sequences with zero frequency shifting rearrange the pixel positions of the encrypted channel. Combining data splitting, stack storage, and chaotic matrixes, the diffusion operation is achieved. Analyses of the performance show that the algorithm has both excellent encryption speed and security performance.",
        "DOI": "10.1007/s11071-021-07192-7",
        "paper_author": "Gao X.",
        "affiliation_name": "Dalian Polytechnic University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60069704",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Security, Privacy and Risks Within Smart Cities: Literature Review and Development of a Smart City Interaction Framework",
        "publication": "Information Systems Frontiers",
        "citied_by": "219",
        "cover_date": "2022-04-01",
        "Abstract": "The complex and interdependent nature of smart cities raises significant political, technical, and socioeconomic challenges for designers, integrators and organisations involved in administrating these new entities. An increasing number of studies focus on the security, privacy and risks within smart cities, highlighting the threats relating to information security and challenges for smart city infrastructure in the management and processing of personal data. This study analyses many of these challenges, offers a valuable synthesis of the relevant key literature, and develops a smart city interaction framework. The study is organised around a number of key themes within smart cities research: privacy and security of mobile devices and services; smart city infrastructure, power systems, healthcare, frameworks, algorithms and protocols to improve security and privacy, operational threats for smart cities, use and adoption of smart services by citizens, use of blockchain and use of social media. This comprehensive review provides a useful perspective on many of the key issues and offers key direction for future studies. The findings of this study can provide an informative research framework and reference point for academics and practitioners.",
        "DOI": "10.1007/s10796-020-10044-1",
        "paper_author": "Ismagilova E.",
        "affiliation_name": "University of Bradford School of Management",
        "affiliation_city": "Bradford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60171157",
        "affiliation_state": "West Yorkshire"
    },
    {
        "paper_title": "Development of metaverse for intelligent healthcare",
        "publication": "Nature Machine Intelligence",
        "citied_by": "218",
        "cover_date": "2022-11-01",
        "Abstract": "The metaverse integrates physical and virtual realities, enabling humans and their avatars to interact in an environment supported by technologies such as high-speed internet, virtual reality, augmented reality, mixed and extended reality, blockchain, digital twins and artificial intelligence (AI), all enriched by effectively unlimited data. The metaverse recently emerged as social media and entertainment platforms, but extension to healthcare could have a profound impact on clinical practice and human health. As a group of academic, industrial, clinical and regulatory researchers, we identify unique opportunities for metaverse approaches in the healthcare domain. A metaverse of ‘medical technology and AI’ (MeTAI) can facilitate the development, prototyping, evaluation, regulation, translation and refinement of AI-based medical practice, especially medical imaging-guided diagnosis and therapy. Here, we present metaverse use cases, including virtual comparative scanning, raw data sharing, augmented regulatory science and metaversed medical intervention. We discuss relevant issues on the ecosystem of the MeTAI metaverse including privacy, security and disparity. We also identify specific action items for coordinated efforts to build the MeTAI metaverse for improved healthcare quality, accessibility, cost-effectiveness and patient satisfaction.",
        "DOI": "10.1038/s42256-022-00549-6",
        "paper_author": "Wang G.",
        "affiliation_name": "Rensselaer Polytechnic Institute",
        "affiliation_city": "Troy",
        "affiliation_country": "United States",
        "affiliation_id": "60025534",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Recent Progress in Smart Polymeric Gel-Based Information Storage for Anti-Counterfeiting",
        "publication": "Advanced Materials",
        "citied_by": "209",
        "cover_date": "2022-10-01",
        "Abstract": "Information security protection has a tremendous impact on human life, social stability and national security, leading to the rapid development of anti-counterfeiting materials and related techniques. However, the traditional stored information on hard or dry media is often static and lacks functions, which makes it challenging to deal with increasing and powerful counterfeiting technologies. Modified intelligent polymeric gels exhibit color changes and shape morphing under external stimuli, which give them great potential for applications in information storage. This paper provides an overview of the latest progress in polymeric gel-based information storage materials in relation to counterfeiting. Following a brief introduction of anti-counterfeiting materials, the preparation methods for intelligent gels with adjustable colors (e.g., chemical colors and physical colors) and various encryption/decryption modes involving dimensions and diverse colors are outlined. Finally, the challenges and prospects for information storage and anti-counterfeiting based on smart gels are discussed.",
        "DOI": "10.1002/adma.202201262",
        "paper_author": "Sun Y.",
        "affiliation_name": "Ningbo Institute of Industrial Technology, Chinese Academy of Sciences",
        "affiliation_city": "Ningbo",
        "affiliation_country": "China",
        "affiliation_id": "60117387",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "A machine learning-based intrusion detection for detecting internet of things network attacks",
        "publication": "Alexandria Engineering Journal",
        "citied_by": "206",
        "cover_date": "2022-12-01",
        "Abstract": "The Internet of Things (IoT) refers to the collection of all those devices that could connect to the Internet to collect and share data. The introduction of varied devices continues to grow tremendously, posing new privacy and security risks—the proliferation of Internet connections and the advent of new technologies such as the IoT. Various and sophisticated intrusions are driving the IoT paradigm into computer networks. Companies are increasing their investment in research to improve the detection of these attacks. By comparing the highest rates of accuracy, institutions are picking intelligent procedures for testing and verification. The adoption of IoT in the different sectors, including health, has also continued to increase in recent times. Where the IoT applications became well known for technology researchers and developers. Unfortunately, the striking challenge of IoT is the privacy and security issues resulting from the energy limitations and scalability of IoT devices. Therefore, how to improve the security and privacy challenges of IoT remains an important problem in the computer security field. This paper proposes a machine learning-based intrusion detection system (ML-IDS) for detecting IoT network attacks. The primary objective of this research focuses on applying ML-supervised algorithm-based IDS for IoT. In the first stage of this research methodology, feature scaling was done using the Minimum-maximum (min–max) concept of normalization on the UNSW-NB15 dataset to limit information leakage on the test data. This dataset is a mixture of contemporary attacks and normal activities of network traffic grouped into nine different attack types. In the next stage, dimensionality reduction was performed with Principal Component Analysis (PCA). Lastly, six proposed machine learning models were used for the analysis. The experimental results of our findings were evaluated in terms of validation dataset, accuracy, the area under the curve, recall, F1, precision, kappa, and Mathew correlation coefficient (MCC). The findings were also benchmarked with the existing works, and our results were competitive with an accuracy of 99.9% and MCC of 99.97%.",
        "DOI": "10.1016/j.aej.2022.02.063",
        "paper_author": "Kayode Saheed Y.",
        "affiliation_name": "American University of Nigeria",
        "affiliation_city": "Yola",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60108913",
        "affiliation_state": "Adamawa"
    },
    {
        "paper_title": "Federated Deep Learning for Zero-Day Botnet Attack Detection in IoT-Edge Devices",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "204",
        "cover_date": "2022-03-01",
        "Abstract": "Deep learning (DL) has been widely proposed for botnet attack detection in Internet of Things (IoT) networks. However, the traditional centralized DL (CDL) method cannot be used to detect the previously unknown (zero-day) botnet attack without breaching the data privacy rights of the users. In this article, we propose the federated DL (FDL) method for zero-day botnet attack detection to avoid data privacy leakage in IoT-edge devices. In this method, an optimal deep neural network (DNN) architecture is employed for network traffic classification. A model parameter server remotely coordinates the independent training of the DNN models in multiple IoT-edge devices, while the federated averaging (FedAvg) algorithm is used to aggregate local model updates. A global DNN model is produced after a number of communication rounds between the model parameter server and the IoT-edge devices. The zero-day botnet attack scenarios in IoT-edge devices is simulated with the Bot-IoT and N-BaIoT data sets. Experiment results show that the FDL model: 1) detects zero-day botnet attacks with high classification performance; 2) guarantees data privacy and security; 3) has low communication overhead; 4) requires low-memory space for the storage of training data; and 5) has low network latency. Therefore, the FDL method outperformed CDL, localized DL, and distributed DL methods in this application scenario.",
        "DOI": "10.1109/JIOT.2021.3100755",
        "paper_author": "Popoola S.I.",
        "affiliation_name": "Manchester Metropolitan University",
        "affiliation_city": "Manchester",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60022046",
        "affiliation_state": "Greater Manchester"
    },
    {
        "paper_title": "Deep learning for deepfakes creation and detection: A survey",
        "publication": "Computer Vision and Image Understanding",
        "citied_by": "203",
        "cover_date": "2022-10-01",
        "Abstract": "Deep learning has been successfully applied to solve various complex problems ranging from big data analytics to computer vision and human-level control. Deep learning advances however have also been employed to create software that can cause threats to privacy, democracy and national security. One of those deep learning-powered applications recently emerged is deepfake. Deepfake algorithms can create fake images and videos that humans cannot distinguish them from authentic ones. The proposal of technologies that can automatically detect and assess the integrity of digital visual media is therefore indispensable. This paper presents a survey of algorithms used to create deepfakes and, more importantly, methods proposed to detect deepfakes in the literature to date. We present extensive discussions on challenges, research trends and directions related to deepfake technologies. By reviewing the background of deepfakes and state-of-the-art deepfake detection methods, this study provides a comprehensive overview of deepfake techniques and facilitates the development of new and more robust methods to deal with the increasingly challenging deepfakes.",
        "DOI": "10.1016/j.cviu.2022.103525",
        "paper_author": "Nguyen T.T.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "A contemporary survey on free space optical communication: Potentials, technical challenges, recent advances and research direction",
        "publication": "Journal of Network and Computer Applications",
        "citied_by": "203",
        "cover_date": "2022-04-01",
        "Abstract": "Due to the unprecedented growth of high speed multimedia services and diversified applications initiated from the massive connectivity of IoT devices, 5G and beyond 5G (B5G) cellular communications, the existing electromagnetic spectrum under RF ranges is incapable to tackle the enormous future data rate demands. Free space optical (FSO) communication systems covering an ultra-wide range of unlicensed spectrum have emerged as a promising solution to mitigate conventional RF spectrum scarcity ranging of communication distances from nm to several kilometers. The implication of hybrid FSO, radio over FSO (RoFSO), MIMO FSO systems support ultra high speed 5G/B5G demand by eliminating the limitations of individual technology. FSO offers a broad range of applications both in outdoor and indoor services, for instance, wireless video surveillance, data centers, terrestrial transmission, LAN connectivity, mobile cellular networks, last mile solution, space communications, radio astronomy, remote sensing, and so on. Despite the potential benefits of FSO technology, its link reliability deteriorates due to atmospheric turbulence, cloud induced fading, some other environmental factors such as fog, aerosol, temperature variations, storms, heavy rain, pointing error, and scintillation. This survey presents the overview of several key technologies, significance, demonstration, recent development, and implications of state-of-the-art criteria in terms of spectrum reuse, classification, architecture, physical layer security, and future applications for understanding FSO system among different appealing optical wireless technologies. In addition, the adaptive modulation, channel modeling schemes, relay-aided transmission, cooperative diversity, potential challenges, numerous mitigation techniques, and opportunities in the near future are also outlined to realize the successful deployment of FSO systems.",
        "DOI": "10.1016/j.jnca.2021.103311",
        "paper_author": "Jahid A.",
        "affiliation_name": "University of Ottawa",
        "affiliation_city": "Ottawa",
        "affiliation_country": "Canada",
        "affiliation_id": "60028897",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Detecting Cybersecurity Attacks in Internet of Things Using Artificial Intelligence Methods: A Systematic Literature Review",
        "publication": "Electronics (Switzerland)",
        "citied_by": "202",
        "cover_date": "2022-01-01",
        "Abstract": "In recent years, technology has advanced to the fourth industrial revolution (Industry 4.0), where the Internet of things (IoTs), fog computing, computer security, and cyberattacks have evolved exponentially on a large scale. The rapid development of IoT devices and networks in various forms generate enormous amounts of data which in turn demand careful authentication and security. Artificial intelligence (AI) is considered one of the most promising methods for addressing cybersecurity threats and providing security. In this study, we present a systematic literature review (SLR) that categorize, map and survey the existing literature on AI methods used to detect cybersecurity attacks in the IoT environment. The scope of this SLR includes an in-depth investigation on most AI trending techniques in cybersecurity and state-of-art solutions. A systematic search was performed on various electronic databases (SCOPUS, Science Direct, IEEE Xplore, Web of Science, ACM, and MDPI). Out of the identified records, 80 studies published between 2016 and 2021 were selected, surveyed and carefully assessed. This review has explored deep learning (DL) and machine learning (ML) techniques used in IoT security, and their effectiveness in detecting attacks. However, several studies have proposed smart intrusion detection systems (IDS) with intelligent architectural frameworks using AI to overcome the existing security and privacy challenges. It is found that support vector machines (SVM) and random forest (RF) are among the most used methods, due to high accuracy detection another reason may be efficient memory. In addition, other methods also provide better performance such as extreme gradient boosting (XGBoost), neural networks (NN) and recurrent neural networks (RNN). This analysis also provides an insight into the AI roadmap to detect threats based on attack categories. Finally, we present recommendations for potential future investigations.",
        "DOI": "10.3390/electronics11020198",
        "paper_author": "Abdullahi M.",
        "affiliation_name": "Universiti Teknologi PETRONAS",
        "affiliation_city": "Seri Iskandar",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60001278",
        "affiliation_state": "Perak"
    },
    {
        "paper_title": "A CNN-Transformer Network With Multiscale Context Aggregation for Fine-Grained Cropland Change Detection",
        "publication": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing",
        "citied_by": "200",
        "cover_date": "2022-01-01",
        "Abstract": "Nonagriculturalization incidents are serious threats to local agricultural ecosystem and global food security. Remote sensing change detection (CD) can provide an effective approach for in-time detection and prevention of such incidents. However, existing CD methods are difficult to deal with the large intraclass differences of cropland changes in high-resolution images. In addition, traditional CNN based models are plagued by the loss of long-range context information, and the high computational complexity brought by deep layers. Therefore, in this article, we propose a CNN-transformer network with multiscale context aggregation (MSCANet), which combines the merits of CNN and transformer to fulfill efficient and effective cropland CD. In the MSCANet, a CNN-based feature extractor is first utilized to capture hierarchical features, then a transformer-based MSCA is designed to encode and aggregate context information. Finally, a multibranch prediction head with three CNN classifiers is applied to obtain change maps, to enhance the supervision for deep layers. Besides, for the lack of CD dataset with fine-grained cropland change of interest, we also provide a new cropland change detection dataset, which contains 600 pairs of 512 × 512 bi-temporal images with the spatial resolution of 0.5-2m. Comparative experiments with several CD models prove the effectiveness of the MSCANet, with the highest F1 of 64.67% on the high-resolution semantic CD dataset, and of 71.29% on CLCD.",
        "DOI": "10.1109/JSTARS.2022.3177235",
        "paper_author": "Liu M.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Systematic Review of Security Vulnerabilities in Ethereum Blockchain Smart Contract",
        "publication": "IEEE Access",
        "citied_by": "199",
        "cover_date": "2022-01-01",
        "Abstract": "Blockchain is a revolutionary technology that enables users to communicate in a trust-less manner. It revolutionizes the modes of business between organizations without the need for a trusted third party. It is a distributed ledger technology based on a decentralized peer-to-peer (P2P) network. It enables users to store data globally on thousands of computers in an immutable format and empowers users to deploy small pieces of programs known as smart contracts. The blockchain-based smart contract enables auto enforcement of the agreed terms between two untrusted parties. There are several security vulnerabilities in Ethereum blockchain-based smart contracts, due to which sometimes it does not behave as intended. Because a smart contract can hold millions of dollars as cryptocurrency, so these security vulnerabilities can lead to disastrous losses. In this paper, a systematic review of the security vulnerabilities in the Ethereum blockchain is presented. The main objective is to discuss Ethereum smart contract security vulnerabilities, detection tools, real life attacks and preventive mechanisms. Comparisons are drawn among the Ethereum smart contract analysis tools by considering various features. From the extensive depth review, various issues associated with the Ethereum blockchain-based smart contract are highlighted. Finally, various future directions are also discussed in the field of the Ethereum blockchain-based smart contract that can help the researchers to set the directions for future research in this domain.",
        "DOI": "10.1109/ACCESS.2021.3140091",
        "paper_author": "Kushwaha S.S.",
        "affiliation_name": "Manipal University Jaipur",
        "affiliation_city": "Jaipur",
        "affiliation_country": "India",
        "affiliation_id": "60108737",
        "affiliation_state": "RJ"
    },
    {
        "paper_title": "Privacy-preserving federated learning based on multi-key homomorphic encryption",
        "publication": "International Journal of Intelligent Systems",
        "citied_by": "198",
        "cover_date": "2022-09-01",
        "Abstract": "With the advance of machine learning and the Internet of Things (IoT), security and privacy have become critical concerns in mobile services and networks. Transferring data to a central unit violates the privacy of sensitive data. Federated learning mitigates this need to transfer local data by sharing model updates only. However, privacy leakage remains an issue. This paper proposes xMK-CKKS, an improved version of the MK-CKKS multi-key homomorphic encryption protocol, to design a novel privacy-preserving federated learning scheme. In this scheme, model updates are encrypted via an aggregated public key before sharing with a server for aggregation. For decryption, a collaboration among all participating devices is required. Our scheme prevents privacy leakage from publicly shared model updates in federated learning and is resistant to collusion between (Formula presented.) participating devices and the server. The evaluation demonstrates that the scheme outperforms other innovations in communication and computational cost while preserving model accuracy.",
        "DOI": "10.1002/int.22818",
        "paper_author": "Ma J.",
        "affiliation_name": "Xidian University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60025578",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "ToN_IoT: The Role of Heterogeneity and the Need for Standardization of Features and Attack Types in IoT Network Intrusion Data Sets",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "195",
        "cover_date": "2022-01-01",
        "Abstract": "The Internet of Things (IoT) is reshaping our connected world as the number of lightweight devices connected to the Internet is rapidly growing. Therefore, high-quality research on intrusion detection in the IoT domain is essential. To this end, network intrusion data sets are fundamental, as many attack detection strategies have to be trained and evaluated using such data sets. In this article, we introduce the description, statistical analysis, and machine learning evaluation of the novel ToN_IoT data set. A comparison to other recent IoT data sets shows the importance of heterogeneity within these data sets, and how differences between data sets may have a huge impact on detection performance. In a cross-training experiment, we show that the inclusion of different data collection methods and a large diversity of the monitored features are of crucial importance for IoT network intrusion data sets to be useful for the industry. We also explain that the practical application of IoT data sets in operational environments requires the standardization of feature descriptions and cyberattack classes. This can only be achieved with a joint effort from the research community.",
        "DOI": "10.1109/JIOT.2021.3085194",
        "paper_author": "Booij T.M.",
        "affiliation_name": "Nederlandse Organisatie voor toegepast natuurwetenschappelijk onderzoek- TNO",
        "affiliation_city": "The Hague",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60019984",
        "affiliation_state": "Zuid-Holland"
    },
    {
        "paper_title": "Hierarchical Adversarial Attacks Against Graph-Neural-Network-Based IoT Network Intrusion Detection System",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "194",
        "cover_date": "2022-06-15",
        "Abstract": "The advancement of Internet of Things (IoT) technologies leads to a wide penetration and large-scale deployment of IoT systems across an entire city or even country. While IoT systems are capable of providing intelligent services, the large amount of data collected and processed in IoT systems also raises serious security concerns. Many research efforts have been devoted to design intelligent network intrusion detection system (NIDS) to prevent misuse of IoT data across smart applications. However, existing approaches may suffer from the issue of limited and imbalanced attack data when training the detection model, which make the system vulnerable especially for those unknown type attacks. In this study, a novel hierarchical adversarial attack (HAA) generation method is introduced to realize the level-aware black-box adversarial attack strategy, targeting the graph neural network (GNN)-based intrusion detection in IoT systems with a limited budget. By constructing a shadow GNN model, an intelligent mechanism based on a saliency map technique is designed to generate adversarial examples by effectively identifying and modifying the critical feature elements with minimal perturbations. A hierarchical node selection algorithm based on random walk with restart (RWR) is developed to select a set of more vulnerable nodes with high attack priority, considering their structural features, and overall loss changes within the targeted IoT network. The proposed HAA generation method is evaluated using the open-source data set UNSW-SOSR2019 with three baseline methods. Comparison results demonstrate its ability in degrading the classification precision by more than 30% in the two state-of-the-art GNN models, GCN and JK-Net, respectively, for NIDS in IoT environments.",
        "DOI": "10.1109/JIOT.2021.3130434",
        "paper_author": "Zhou X.",
        "affiliation_name": "Shiga University",
        "affiliation_city": "Hikone",
        "affiliation_country": "Japan",
        "affiliation_id": "60033365",
        "affiliation_state": "Shiga"
    },
    {
        "paper_title": "Blockchain and PUF-Based Lightweight Authentication Protocol for Wireless Medical Sensor Networks",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "193",
        "cover_date": "2022-06-01",
        "Abstract": "Due to the emergence of heterogeneous Internet of Medical Things (IoMT) (e.g., wearable health devices, smartwatch monitoring, and automated insulin delivery systems), large volumes of patient data are dispatched to central cloud servers for disease analysis and diagnosis. Although this direct mode brings a lot of convenience for both patients and medical professionals (MPs), the open communication channel between them also incurs several security and privacy issues, such as man-in-the-middle attacks, eavesdropping attacks, and tracking attacks. Based on the unsolved challenges in wireless medical sensor networks (WMSNs), several researchers have proposed various authentication and key agreement (AKA) protocols for this type of healthcare system recently. However, most of these protocols do not perceive physical-layer security and over-centralized server problem in WMSN. In this article, to address these two open problems, we propose a lightweight and reliable authentication protocol for WMSN, which is composed of cutting-edge blockchain technology and physically unclonable functions (PUFs). In addition, a fuzzy extractor scheme is introduced to deal with biometric information. Subsequently, two security evaluation methods are used to prove the high reliability of our proposed scheme. Finally, performance evaluation experiments illustrate that the proposed mutual authentication protocol requires the least computation and communication cost among the compared schemes.",
        "DOI": "10.1109/JIOT.2021.3117762",
        "paper_author": "Wang W.",
        "affiliation_name": "City University of Hong Kong",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60013983",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "From distributed machine learning to federated learning: a survey",
        "publication": "Knowledge and Information Systems",
        "citied_by": "192",
        "cover_date": "2022-04-01",
        "Abstract": "In recent years, data and computing resources are typically distributed in the devices of end users, various regions or organizations. Because of laws or regulations, the distributed data and computing resources cannot be aggregated or directly shared among different regions or organizations for machine learning tasks. Federated learning emerges as an efficient approach to exploit distributed data and computing resources, so as to collaboratively train machine learning models. At the same time, federated learning obeys the laws and regulations and ensures data security and data privacy. In this paper, we provide a comprehensive survey of existing works for federated learning. First, we propose a functional architecture of federated learning systems and a taxonomy of related techniques. Second, we explain the federated learning systems from four aspects: diverse types of parallelism, aggregation algorithms, data communication, and the security of federated learning systems. Third, we present four widely used federated systems based on the functional architecture. Finally, we summarize the limitations and propose future research directions.",
        "DOI": "10.1007/s10115-022-01664-x",
        "paper_author": "Liu J.",
        "affiliation_name": "Baidu, Inc.",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60112903",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital Twins in Built Environments: An Investigation of the Characteristics, Applications, and Challenges",
        "publication": "Buildings",
        "citied_by": "192",
        "cover_date": "2022-02-01",
        "Abstract": "The concept of digital twins is proposed as a new technology-led advancement to support the processes of the design, construction, and operation of built assets. Commonalities between the emerging definitions of digital twins describe them as digital or cyber environments that are bidirectionally-linked to their physical or real-life replica to enable simulation and data-centric decision making. Studies have started to investigate their role in the digitalization of asset delivery, including the management of built assets at different levels within the building and infrastructure sectors. However, questions persist regarding their actual applications and implementation chal-lenges, including their integration with other digital technologies (i.e., building information modeling, virtual and augmented reality, Internet of Things, artificial intelligence, and cloud computing). Within the built environment context, this study seeks to analyze the definitions and characteristics of a digital twin, its interactions with other digital technologies used in built asset delivery and operation, and its applications and challenges. To achieve this aim, the research utilizes a thorough literature review and semi-structured interviews with ten industry experts. The literature review explores the merits and the relevance of digital twins relative to existing digital technologies and highlights potential applications and challenges for their implementation. The data from the semi-structured interviews are classified into five themes: definitions and enablers of digital twins, applications and benefits, implementation challenges, existing practical applications, and future development. The findings provide a point of departure for future research aimed at clarifying the relationship between digital twins and other digital technologies and their key implementation challenges.",
        "DOI": "10.3390/buildings12020120",
        "paper_author": "Shahzad M.",
        "affiliation_name": "Foundation Property Management (FPM)",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "127663751",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Review and State of Art of Internet of Things (IoT)",
        "publication": "Archives of Computational Methods in Engineering",
        "citied_by": "190",
        "cover_date": "2022-05-01",
        "Abstract": "The Internet of Things (IoT) is basically like a system for connecting computer devices, mechanical and digital machines, objects, or individuals provided with the unique system (UIDs) and without transfer to transmit data over an ability human-to-human or computer-to-human relation. Another thing on the internet is that the items in the IoT are like a connected manner with humans and computers to which internet protocol addresses can be assigned and which can transfer data over the network or another man-made object. In this paper, we describe the utilization of IoT in the cloud, fog, IoT technologies with applications and security. Specifically, we provide IoT architecture for design and development with sensors in 6G. Finally, we discuss the current research, solutions, and present open issues of future research in IoT.",
        "DOI": "10.1007/s11831-021-09622-6",
        "paper_author": "Laghari A.A.",
        "affiliation_name": "Shenzhen University",
        "affiliation_city": "Shenzhen",
        "affiliation_country": "China",
        "affiliation_id": "60000937",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "ET-BERT: A Contextualized Datagram Representation with Pre-training Transformers for Encrypted Traffic Classification",
        "publication": "WWW 2022 - Proceedings of the ACM Web Conference 2022",
        "citied_by": "188",
        "cover_date": "2022-04-25",
        "Abstract": "Encrypted traffic classification requires discriminative and robust traffic representation captured from content-invisible and imbalanced traffic data for accurate classification, which is challenging but indispensable to achieve network security and network management. The major limitation of existing solutions is that they highly rely on the deep features, which are overly dependent on data size and hard to generalize on unseen data. How to leverage the open-domain unlabeled traffic data to learn representation with strong generalization ability remains a key challenge. In this paper, we propose a new traffic representation model called Encrypted Traffic Bidirectional Encoder Representations from Transformer (ET-BERT), which pre-trains deep contextualized datagram-level representation from large-scale unlabeled data. The pre-trained model can be fine-tuned on a small number of task-specific labeled data and achieves state-of-the-art performance across five encrypted traffic classification tasks, remarkably pushing the F1 of ISCX-VPN-Service to 98.9% (5.2%g†'), Cross-Platform (Android) to 92.5% (5.4%g†'), CSTNET-TLS 1.3 to 97.4% (10.0%g†'). Notably, we provide explanation of the empirically powerful pre-training model by analyzing the randomness of ciphers. It gives us insights in understanding the boundary of classification ability over encrypted traffic. The code is available at: https://github.com/linwhitehat/ET-BERT.",
        "DOI": "10.1145/3485447.3512217",
        "paper_author": "Lin X.",
        "affiliation_name": "Institute of Information Engineering",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60273040",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Blockchain-Based Reliable and Efficient Certificateless Signature for IIoT Devices",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "187",
        "cover_date": "2022-10-01",
        "Abstract": "Nowadays, the Industrial Internet of Things (IIoT) has remarkably transformed our personal lifestyles and society operations into a novel digital mode, which brings tremendous associations with all walks of life, such as intelligent logistics, smart grid, and smart city. Moreover, with the rapid increase of IIoT devices, a large amount of data is swapped between heterogeneous sensors and devices every moment. This trend increases the risk of eavesdropping and hijacking attacks in communication channels, so maintaining data privacy and security becomes two notable concerns at present. Recently, based on the mechanism of the Schnorr signature, a more secure and lightweight certificateless signature (CLS) protocol is popular for the resource-constrained IIoT protocol design. Nevertheless, we found most of the existing CLS schemes are susceptible to several common security weaknesses such as man-in-the-middle attacks, key generation center compromised attacks, and distributed denial of service attacks. To tackle the challenges mentioned previously, in this article, we propose a novel pairing-free certificateless scheme that utilizes the state-of-the-art blockchain technique and smart contract to construct a novel reliable and efficient CLS scheme. Then, we simulate the Type-I and Type-II adversaries to verify the trustworthiness of our scheme. Security analysis as well as performance evaluation outcomes prove that our design can hold more reliable security assurance with less computation cost (i.e., reduced by around 40.0% at most) and communication cost (i.e., reduced by around 94.7% at most) than other related schemes.",
        "DOI": "10.1109/TII.2021.3084753",
        "paper_author": "Wang W.",
        "affiliation_name": "City University of Hong Kong",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60013983",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Comprehensive Survey on Blockchain in Industrial Internet of Things: Motivations, Research Progresses, and Future Challenges",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "186",
        "cover_date": "2022-01-01",
        "Abstract": "With rapid development of enabling technologies such as Internet of Things, robotics, and big data, the fourth industrial revolution known as 'Industry 4.0' (I4.0) has become a great opportunity for productivity innovation around the world. Industrial Internet of Things (IIoT), as a typical implication of Cyber-Physical Systems (CPS) in I4.0 era, has attracted significant attention. It aims at optimizing resources and improving production efficiency for manufacturing industry through deep interconnection of physical equipment, wide collection of multi-dimensional data, intelligent awareness of environment and automatic control. Blockchain is a kind of distributed ledger technology and has features including decentralization, anti-tamper, transparency, anonymity, and contract-autonomy. These features are helpful to improve the services and promote the development of IIoT. In this paper, we provide a comprehensive survey on the literatures applying blockchain technology into IIoT. We firstly introduce the related works and background knowledge. And then, the motivations and benefits for applying blockchain into IIoT are discussed in detail. Furthermore, based on the layered architecture of blockchain we summarized in the previous work, we outline the research framework of blockchain in IIoT. Meanwhile, the related application research is presented from the perspectives of devices security, data collection and sharing, and industrial application. Moreover, we explore the technical requirements of blockchain platforms in IIoT applications. Finally, some challenges and future directions on blockchain in IIoT, as well as broader perspectives, are concluded for further study.",
        "DOI": "10.1109/COMST.2022.3141490",
        "paper_author": "Huo R.",
        "affiliation_name": "Beijing University of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022281",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Federated Learning in Edge Computing: A Systematic Survey",
        "publication": "Sensors",
        "citied_by": "186",
        "cover_date": "2022-01-01",
        "Abstract": "Edge Computing (EC) is a new architecture that extends Cloud Computing (CC) services closer to data sources. EC combined with Deep Learning (DL) is a promising technology and is widely used in several applications. However, in conventional DL architectures with EC enabled, data producers must frequently send and share data with third parties, edge or cloud servers, to train their models. This architecture is often impractical due to the high bandwidth requirements, legalization, and privacy vulnerabilities. The Federated Learning (FL) concept has recently emerged as a promising solution for mitigating the problems of unwanted bandwidth loss, data privacy, and legalization. FL can co-train models across distributed clients, such as mobile phones, automobiles, hospitals, and more, through a centralized server, while maintaining data localization. FL can therefore be viewed as a stimulating factor in the EC paradigm as it enables collaborative learning and model optimization. Although the existing surveys have taken into account applications of FL in EC environments, there has not been any systematic survey discussing FL implementation and challenges in the EC paradigm. This paper aims to provide a systematic survey of the literature on the implementation of FL in EC environments with a taxonomy to identify advanced solutions and other open problems. In this survey, we review the fundamentals of EC and FL, then we review the existing related works in FL in EC. Furthermore, we describe the protocols, architecture, framework, and hardware requirements for FL implementation in the EC environment. Moreover, we discuss the applications, challenges, and related existing solutions in the edge FL. Finally, we detail two relevant case studies of applying FL in EC, and we identify open issues and potential directions for future research. We believe this survey will help researchers better understand the connection between FL and EC enabling technologies and concepts.",
        "DOI": "10.3390/s22020450",
        "paper_author": "Abreha H.G.",
        "affiliation_name": "United Arab Emirates University",
        "affiliation_city": "Al Ain",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60008665",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "The role of technological progress and renewable energy deployment in green economic growth",
        "publication": "Renewable Energy",
        "citied_by": "184",
        "cover_date": "2022-05-01",
        "Abstract": "This study aims to measure the relationship between technological progress, renewable energy, and green economic growth (GEG). This study uses a data envelopment analysis (DEA) estimation method to evaluate the association between government expenditure on research and development (R&D), renewable energy deployment, and GEG in the Economic Community of West African States (ECOWAS) between 1990 and 2018. The estimates revealed an inconsistent GEG indicator in the analysis, suggesting the lesser impact disposition of public policy. In addition, the energy efficiency ratio of ECOWAS sub-region is under 0.50, implying energy poverty in the sub-region. Many people do not have sufficient energy to heat and cool their homes to enough temperature and meet their basic needs and energy security concerns. This research discovered that a percentage growth increase in renewable energy deployment results in a 3.2% increase in growth in sustainable performance. Alongside an essential effect of one percentage point growth in R&D expenditure boosts economic system sustainable performance to 4.4% combined with a supported effect of one percent. This research reveals that the ECOWAS government expenditure on human resources and R&D of sustainable energy resources would result in a low carbon growth via an advanced technological production process; nevertheless, the impacts are varied in the various countries in ECOWAS.",
        "DOI": "10.1016/j.renene.2022.03.076",
        "paper_author": "Mohsin M.",
        "affiliation_name": "Jiangsu University",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60017482",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Application of artificial intelligence in wearable devices: Opportunities and challenges",
        "publication": "Computer Methods and Programs in Biomedicine",
        "citied_by": "183",
        "cover_date": "2022-01-01",
        "Abstract": "Background and objectives: : Wearable technologies have added completely new and fast emerging tools to the popular field of personal gadgets. Aside from being fashionable and equipped with advanced hardware technologies such as communication modules and networking, wearable devices have the potential to fuel artificial intelligence (AI) methods with a wide range of valuable data. Methods: : Various AI techniques such as supervised, unsupervised, semi-supervised and reinforcement learning (RL) have already been used to carry out various tasks. This paper reviews the recent applications of wearables that have leveraged AI to achieve their objectives. Results: : Particular example applications of supervised and unsupervised learning for medical diagnosis are reviewed. Moreover, examples combining the internet of things, wearables, and RL are reviewed. Application examples of wearables will be also presented for specific domains such as medical, industrial, and sport. Medical applications include fitness, movement disorder, mental health, etc. Industrial applications include employee performance improvement with the aid of wearables. Sport applications are all about providing better user experience during workout sessions or professional gameplays. Conclusion: : The most important challenges regarding design and development of wearable devices and the computation burden of using AI methods are presented. Finally, future challenges and opportunities for wearable devices are presented.",
        "DOI": "10.1016/j.cmpb.2021.106541",
        "paper_author": "Nahavandi D.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Impact of artificial intelligence on employees working in industry 4.0 led organizations",
        "publication": "International Journal of Manpower",
        "citied_by": "182",
        "cover_date": "2022-05-24",
        "Abstract": "Purpose: This study attempts to develop a practical understanding of the positive and negative employee experiences due to artificial intelligence (AI) adoption and the creation of technostress. It unravels the human resource development-related challenges with the onset of Industry 4.0. Design/methodology/approach: Semi-structured interviews were conducted with 32 professionals with average work experience of 7.6 years and working across nine industries, and the transcripts were analyzed using NVivo. Findings: The findings establish prominent adverse impacts of the adoption of AI, namely, information security, data privacy, drastic changes resulting from digital transformations and job risk and insecurity brewing in the employee psyche. This is followed by a hierarchy of factors comprising the positive impacts, namely, work-related flexibility and autonomy, creativity and innovation and overall enhancement in job performance. Further factors contributing to technostress (among employees): work overload, job insecurity and complexity were identified. Practical implications: The emerging knowledge economy and technological interventions are changing the existing job profiles, hence the need for different skillsets and technological competencies. The organizations thus need to deploy strategic manpower development measures involving up-gradation of skills and knowledge management. Inculcating requisite skills requires well-designed training programs using specialized tools and virtual reality (VR). In addition, employees need to be supported in their evolving socio-technical relationships, for managing both positive and negative outcomes. Originality/value: This research makes the unique contribution of establishing a qualitative hierarchy of prominent factors constituting unintended consequences, positive impacts and technostress creators (among employees) of AI deployment in organizational processes.",
        "DOI": "10.1108/IJM-03-2021-0173",
        "paper_author": "Malik N.",
        "affiliation_name": "Jaipuria Institute of Management, Lucknow",
        "affiliation_city": "Lucknow",
        "affiliation_country": "India",
        "affiliation_id": "60097670",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "Big Data with Cloud Computing: Discussions and Challenges",
        "publication": "Big Data Mining and Analytics",
        "citied_by": "180",
        "cover_date": "2022-03-01",
        "Abstract": "With the recent advancements in computer technologies, the amount of data available is increasing day by day. However, excessive amounts of data create great challenges for users. Meanwhile, cloud computing services provide a powerful environment to store large volumes of data. They eliminate various requirements, such as dedicated space and maintenance of expensive computer hardware and software. Handling big data is a time-consuming task that requires large computational clusters to ensure successful data storage and processing. In this work, the definition, classification, and characteristics of big data are discussed, along with various cloud services, such as Microsoft Azure, Google Cloud, Amazon Web Services, International Business Machine cloud, Hortonworks, and MapR. A comparative analysis of various cloud-based big data frameworks is also performed. Various research challenges are defined in terms of distributed database storage, data security, heterogeneity, and data visualization.",
        "DOI": "10.26599/BDMA.2021.9020016",
        "paper_author": "Sandhu A.K.",
        "affiliation_name": "Institute of Nano Science and Technology, Mohali",
        "affiliation_city": "Mohali",
        "affiliation_country": "India",
        "affiliation_id": "60109780",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Agriculture-Food Supply Chain Management Based on Blockchain and IoT: A Narrative on Enterprise Blockchain Interoperability",
        "publication": "Agriculture (Switzerland)",
        "citied_by": "179",
        "cover_date": "2022-01-01",
        "Abstract": "Modern-day agriculture supply chains have evolved from sovereign and autonomous local stakeholders to a worldwide interconnected system of multiple participants linked by complicated interactions, impacting the production, processing, transportation, and delivery of food to end consumers. Regular instances of fraudulent acts reveal a lack of openness in agriculture supply chains, raising worries about financial losses, eroding customer trust, and lowering corporate brand value. To develop an efficient and reliable trading environment, several fundamental modifications in the present supply chain architecture are required. There is broad consensus that blockchain can improve transparency in agriculture-food supply chains (agri-food SCs). Consumers now demand safe, sustainable, and equitable food production processes, and businesses are using blockchains and the internet of things to meet these needs. For enhanced responsiveness in agri-food SCs, new concepts have evolved that combine blockchains with various Industry 5.0 technologies (e.g., blockchain technology, big data, internet of things (IoT), radio frequency identification (RFID), near field communication (NFC), etc.). It is critical to cut through the hype and examine the technology’s limits, which might stymie its acceptance, implementation, and scalability in agri-food supply chains. This study presents Agri-SCM-BIoT (Agriculture Supply Chain Management using Blockchain and Internet of things) architecture to address the storage and scalability optimization, interoperability, security and privacy issues security, and privacy of personal data along with storage concerns with present single-chain agriculture supply chain systems. We also discussed the classification of security threats with IoT infrastructure and possible available blockchain-based defense mechanisms. Finally, we discussed the features of the proposed supply chain architecture, followed by a conclusion and future work.",
        "DOI": "10.3390/agriculture12010040",
        "paper_author": "Bhat S.A.",
        "affiliation_name": "National Tsing Hua University",
        "affiliation_city": "Hsinchu",
        "affiliation_country": "Taiwan",
        "affiliation_id": "60018029",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The convergence and interplay of edge, fog, and cloud in the AI-driven Internet of Things (IoT)",
        "publication": "Information Systems",
        "citied_by": "178",
        "cover_date": "2022-07-01",
        "Abstract": "The Internet of Things (IoT) tsunami, public embracement, and the ubiquitous adoption of smart devices are affecting virtually every industry, directly or indirectly. The success of the current and future landscape of IoT and connected devices requires service provision characterized by scalability, ubiquity, reliability, and high-performance, among others. In order to achieve this attribution, the integration of IoT and Cloud Computing (CC), known as cloud IoT, has emerged as a new paradigm providing advanced services specific to aggregating, storing, and processing data generated by IoT. While the convergence of IoT and Cloud brings opportunities, it suffers from specific limitations such as bandwidth, latency, and connectivity. The increasing need for supporting interaction between cloud and IoT led to Edge and Fog Computing (FC) in which computing and storage resources are located not only in the cloud but also at the edges near the source of data. The hierarchical and collaborative edge–fog–cloud architecture brings tremendous benefits as it enables us to distribute the intelligence and computation – including Artificial Intelligence (AI), Machine Learning (ML), and big data analytics – to achieve an optimal solution while satisfying the given constraints e.g., delay-energy tradeoff. Due to the hierarchical, cross-layer, and distributed nature of this model, achieving an osmotic and effective convergence of IoT, edge, fog, and cloud computing requires overcoming many challenges with respect to design and implementation, as well as deployment and evaluation. This paper provides a comprehensive insight into the edge-fog-cloud computing paradigm by providing a blend of discussions on all important aspects of the underlying technologies to offer opportunities for more holistic studies and to accelerate knowledge acquisition. To gain a deep understanding of edge–fog–cloud, we will begin this paper by providing an in-depth tutorial and presenting the main requirements, state-of-the-art reference architectures, building blocks, components, protocols, applications, and other similar computing paradigms, including their similarities and differences. Following this, a holistic reference architecture for edge–fog–cloud IoT is presented and the major corresponding design and deployment considerations (e.g., service models, infrastructure design, provisioning, resource allocation, offloading, service migration, performance evaluation, and security concerns) are discussed. Next, we will take a look at the role of privacy-preserving, distributed, and collaborative analytics as well as the interaction between edge, fog, and cloud computing. Finally, we will overview the main challenges in the field of edge–fog–cloud computing that need to be tackled to realize the full potential of IoT.",
        "DOI": "10.1016/j.is.2021.101840",
        "paper_author": "Firouzi F.",
        "affiliation_name": "Pratt School of Engineering",
        "affiliation_city": "Durham",
        "affiliation_country": "United States",
        "affiliation_id": "60140102",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Deep Learning-based Anomaly Detection in Cyber-physical Systems: Progress and Opportunities",
        "publication": "ACM Computing Surveys",
        "citied_by": "176",
        "cover_date": "2022-06-30",
        "Abstract": "Anomaly detection is crucial to ensure the security of cyber-physical systems (CPS). However, due to the increasing complexity of CPSs and more sophisticated attacks, conventional anomaly detection methods, which face the growing volume of data and need domain-specific knowledge, cannot be directly applied to address these challenges. To this end, deep learning-based anomaly detection (DLAD) methods have been proposed. In this article, we review state-of-the-art DLAD methods in CPSs. We propose a taxonomy in terms of the type of anomalies, strategies, implementation, and evaluation metrics to understand the essential properties of current methods. Further, we utilize this taxonomy to identify and highlight new characteristics and designs in each CPS domain. Also, we discuss the limitations and open problems of these methods. Moreover, to give users insights into choosing proper DLAD methods in practice, we experimentally explore the characteristics of typical neural models, the workflow of DLAD methods, and the running performance of DL models. Finally, we discuss the deficiencies of DL approaches, our findings, and possible directions to improve DLAD methods and motivate future research.",
        "DOI": "10.1145/3453155",
        "paper_author": "Luo Y.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Computation offloading in mobile edge computing networks: A survey",
        "publication": "Journal of Network and Computer Applications",
        "citied_by": "175",
        "cover_date": "2022-06-01",
        "Abstract": "Computation offloading is one of the key technologies in Mobile Edge Computing (MEC), which makes up for the deficiencies of mobile devices in terms of storage resource, computing capacity, and energy efficiency. On one hand, computation offloading of task requests not only relieves the communication pressure on the core networks but also reduces the delay caused by long-distance data transmission. On the other hand, emerging applications in 5/6G also rely on the computation offloading technology for efficient service provisioning to users. At present, the industry and academia have conducted a lot of researches on the computation offloading methods in MEC networks with a diversity of meaningful techniques and approaches. In this paper, we present a comprehensive survey of the computation offloading in MEC networks including applications, offloading objectives, and offloading approaches. Particularly, we discuss key issues on various offloading objectives, including delay minimization, energy consumption minimization, revenue maximization, and system utility maximization. The approaches to achieve these objectives mainly include mathematical solver, heuristic algorithms, Lyapunov optimization, game theory, and Markov Decision Process (MDP) and Reinforcement Learning (RL). We compare the approaches by characterizing their pros and cons as well as targeting applications. Finally, from the four aspects of subtasks dependency and online task requests, server selection, real-time environment perception, and security, we analyze the current challenges and future directions of computation offloading in MEC networks.",
        "DOI": "10.1016/j.jnca.2022.103366",
        "paper_author": "Feng C.",
        "affiliation_name": "College of Computer Science and Engineering, Northeastern University",
        "affiliation_city": "Shenyang",
        "affiliation_country": "China",
        "affiliation_id": "60118877",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Reap the crop wild relatives for breeding future crops",
        "publication": "Trends in Biotechnology",
        "citied_by": "174",
        "cover_date": "2022-04-01",
        "Abstract": "Crop wild relatives (CWRs) have provided breeders with several 'game-changing' traits or genes that have boosted crop resilience and global agricultural production. Advances in breeding and genomics have accelerated the identification of valuable CWRs for use in crop improvement. The enhanced genetic diversity of breeding pools carrying optimum combinations of favorable alleles for targeted crop-growing regions is crucial to sustain genetic gain. In parallel, growing sequence information on wild genomes in combination with precise gene-editing tools provide a fast-track route to transform CWRs into ideal future crops. Data-informed germplasm collection and management strategies together with adequate policy support will be equally important to improve access to CWRs and their sustainable use to meet food and nutrition security targets.",
        "DOI": "10.1016/j.tibtech.2021.08.009",
        "paper_author": "Bohra A.",
        "affiliation_name": "ICAR - Indian Institute of Pulses Research, Kanpur",
        "affiliation_city": "Kanpur",
        "affiliation_country": "India",
        "affiliation_id": "60000301",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "A review of Blockchain Technology applications for financial services",
        "publication": "BenchCouncil Transactions on Benchmarks, Standards and Evaluations",
        "citied_by": "173",
        "cover_date": "2022-07-01",
        "Abstract": "Financial service providers find blockchain technology useful to enhance authenticity, security, and risk management. Several institutions are adopting blockchain in trade and finance systems to build smart contracts between participants, improve efficiency and transparency, and open up newer revenue opportunities. Blockchain's unique recording capabilities make the existing clearing and settlement process redundant. Banks and other financial entities are adopting blockchain-enabled IDs to identify people. Better results come from organisations’ capacity to foresee emerging trends in financial blockchain applications and develop blockchain functionality. The transfer of asset ownership and addressing the maintenance of a precise financial ledger. Measurement, communication, and analysis of financial information are three significant areas to be focussed on by accounting professionals. Blockchain clarifies asset ownership and the existence of obligations for accountants, and it has the potential to improve productivity. This paper identifies and studies relevant articles related to blockchain for finance. This paper focuses on Blockchain technology and its importance for financial services. Further takes up various tools, strategies, and featured services in Blockchain-based financial services. Finally, the paper identifies and evaluates the significant applications of Blockchain technology in financial services. Credit reports significantly impact the financial lives of customers. Recent data breaches demonstrate the superior security of blockchain-based credit reporting over conventional server-based reporting. Blockchain-based systems enable the faster, more cost-effective, and more customised issuance of digital securities. With its adoption, the market for investors can be expanded, costs for issuers can be reduced, and counterparty risk can be reduced due to the ability to customise digital financial instruments to the demands of investors. It uses mutualised standards, protocols, and shared procedures to give network users a single common source of truth. Participants in the business network can now more easily collaborate, manage data, and agree with this technology's application.",
        "DOI": "10.1016/j.tbench.2022.100073",
        "paper_author": "Javaid M.",
        "affiliation_name": "Jamia Millia Islamia",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60020458",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Does green finance mitigate the effects of climate variability: role of renewable energy investment and infrastructure",
        "publication": "Environmental Science and Pollution Research",
        "citied_by": "173",
        "cover_date": "2022-08-01",
        "Abstract": "Few researches have inspected the task of green finance in reducing CO2 emissions, while earlier studies have inspected the influence of economic development on carbon emissions. A green finance development index is built using four indicators to fill in this knowledge gap: green credit, green insurance, green securities, and green investing. Using data spanning the years 2005–2019, a panel quantile regression is applied to investigate the links between green finance, renewable energy, and CO2 emissions. Increases in renewable energy use and advances in the green finance development index have contributed to a reduction in CO2 emissions from BRICS countries. CO2 emissions on the other hand slowed the growth of renewable energy use, slowed the flow of investment to green projects, and ultimately hampered the development of green finance. There was also a clear policy-driven influence on renewable energy spending in the countries of the BRICS region. Green finance policies, on the other hand, have consistently failed to have a long-term impact. Therefore, rising the consumption of renewable energy and creating a carbon trading market are all part of this study’s recommendations for green finance policy improvement.",
        "DOI": "10.1007/s11356-022-19839-y",
        "paper_author": "Mngumi F.",
        "affiliation_name": "University of Shanghai for Science and Technology",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60008691",
        "affiliation_state": "Shanghai"
    },
    {
        "paper_title": "Conceptualizing smart city applications: Requirements, architecture, security issues, and emerging trends",
        "publication": "Expert Systems",
        "citied_by": "172",
        "cover_date": "2022-06-01",
        "Abstract": "The emergence of smart cities and sustainable development has become a globally accepted form of urbanization. The epitome of smart city development has become possible due to the latest innovative integration of information and communication technology. Citizens of smart cities can enjoy the benefits of a smart living environment, ubiquitous connectivity, seamless access to services, intelligent decision making through smart governance, and optimized resource management. The widespread acceptance of smart cities has raised data security issues, authentication, unauthorized access, device-level vulnerability, and sustainability. This article focuses on the holistic overview and conceptual development of smart city. Initially, the work discusses the smart city idea and fundamentals explored in various pieces of literature. Further various smart city applications along with notable implementations, are put forth to understand the quality of living standards. Finally, the article depicts a solid understanding of different security and privacy issues, including some crucial future research directions.",
        "DOI": "10.1111/exsy.12753",
        "paper_author": "Haque A.K.M.B.",
        "affiliation_name": "LUT University",
        "affiliation_city": "Lappeenranta",
        "affiliation_country": "Finland",
        "affiliation_id": "60014304",
        "affiliation_state": "South Karelia"
    },
    {
        "paper_title": "Towards a Standard Feature Set for Network Intrusion Detection System Datasets",
        "publication": "Mobile Networks and Applications",
        "citied_by": "171",
        "cover_date": "2022-02-01",
        "Abstract": "Network Intrusion Detection Systems (NIDSs) are important tools for the protection of computer networks against increasingly frequent and sophisticated cyber attacks. Recently, a lot of research effort has been dedicated to the development of Machine Learning (ML) based NIDSs. As in any ML-based application, the availability of high-quality datasets is critical for the training and evaluation of ML-based NIDS. One of the key problems with the currently available NIDS datasets is the lack of a standard feature set. The use of a unique and proprietary set of features for each of the publicly available datasets makes it virtually impossible to compare the performance of ML-based traffic classifiers on different datasets, and hence to evaluate the ability of these systems to generalise across different network scenarios. To address that limitation, this paper proposes and evaluates standard NIDS feature sets based on the NetFlow network meta-data collection protocol and system. We evaluate and compare two NetFlow-based feature set variants, a version with 12 features, and another one with 43 features. For our evaluation, we converted four widely used NIDS datasets (UNSW-NB15, BoT-IoT, ToN-IoT, CSE-CIC-IDS2018) into new variants with our proposed NetFlow based feature sets. Based on an Extra Tree classifier, we compared the classification performance of the NetFlow-based feature sets with the proprietary feature sets provided with the original datasets. While the smaller feature set cannot match the classification performance of the proprietary feature sets, the larger set with 43 NetFlow features, surprisingly achieves a consistently higher classification performance compared to the original feature set, which was tailored to each of the considered NIDS datasets. The proposed NetFlow-based NIDS feature set, together with four benchmark datasets, made available to the research community, allow a fair comparison of ML-based network traffic classifiers across different NIDS datasets. We believe that having a standard feature set is critical for allowing a more rigorous and thorough evaluation of ML-based NIDSs and that it can help bridge the gap between academic research and the practical deployment of such systems.",
        "DOI": "10.1007/s11036-021-01843-0",
        "paper_author": "Sarhan M.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Federated Learning for Cybersecurity: Concepts, Challenges, and Future Directions",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "169",
        "cover_date": "2022-05-01",
        "Abstract": "Federated learning (FL) is a recent development in artificial intelligence, which is typically based on the concept of decentralized data. As cyberattacks are frequently happening in the various applications deployed in real time, most industrialists are hesitating to move forward in adopting the technology of the Internet of Everything. This article aims to provide an extensive study on how FL could be utilized for providing better cybersecurity and prevent various cyberattacks in real time. We present an extensive survey of the various FL models currently developed by researchers for providing authentication, privacy, trust management, and attack detection. We also discuss few real-time use cases that have been deployed recently and how FL is adopted in them for preserving privacy of data and improving the performance of the system. Based on the study, we conclude this article with some prominent challenges and future directions on which the researchers can focus for adopting FL in real-time scenarios.",
        "DOI": "10.1109/TII.2021.3119038",
        "paper_author": "Alazab M.",
        "affiliation_name": "Charles Darwin University",
        "affiliation_city": "Darwin",
        "affiliation_country": "Australia",
        "affiliation_id": "60004655",
        "affiliation_state": "NT"
    },
    {
        "paper_title": "Federated Learning for intrusion detection system: Concepts, challenges and future directions",
        "publication": "Computer Communications",
        "citied_by": "168",
        "cover_date": "2022-11-01",
        "Abstract": "The rapid development of the Internet and smart devices trigger surge in network traffic making its infrastructure more complex and heterogeneous. The predominated usage of mobile phones, wearable devices and autonomous vehicles are examples of distributed networks which generate huge amount of data each and every day. The computational power of these devices have also seen steady progression which has created the need to transmit information, store data locally and drive network computations towards edge devices. Intrusion detection systems (IDS) play a significant role in ensuring security and privacy of such devices. Machine Learning (ML) and Deep Learning (DL) with Intrusion Detection Systems have gained great momentum due to their achievement of high classification accuracy. However the privacy and security aspects potentially gets jeopardized due to the need of storing and communicating data to centralized server. On the contrary, Federated Learning (FL) fits in appropriately as a privacy-preserving decentralized learning technique that does not transfer data but trains models locally and transfers the parameters to the centralized server. The present paper aims to present an extensive and exhaustive review on the use of FL in intrusion detection system. In order to establish the need for FL, various types of IDS, relevant ML approaches and its associated issues are discussed. The paper presents detailed overview of the implementation of FL in various aspects of anomaly detection. The allied challenges of FL implementations are also identified which provides idea on the scope of future direction of research. The paper finally presents the plausible solutions associated with the identified challenges in FL based intrusion detection system implementation acting as a baseline for prospective research.",
        "DOI": "10.1016/j.comcom.2022.09.012",
        "paper_author": "Agrawal S.",
        "affiliation_name": "Vellore Institute of Technology",
        "affiliation_city": "Vellore",
        "affiliation_country": "India",
        "affiliation_id": "60010618",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Secure and Efficient Federated Learning for Smart Grid with Edge-Cloud Collaboration",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "167",
        "cover_date": "2022-02-01",
        "Abstract": "With the prevalence of smart appliances, smart meters, and Internet of Things (IoT) devices in smart grids, artificial intelligence (AI) built on the rich IoT big data enables various energy data analysis applications and brings intelligent and personalized energy services for users. In conventional AI of Things (AIoT) paradigms, a wealth of individual energy data distributed across users’ IoT devices needs to be migrated to a central storage (e.g., cloud or edge device) for knowledge extraction, which may impose severe privacy violation and data misuse risks. Federated learning, as an appealing privacy-preserving AI paradigm, enables energy data owners (EDOs) to cooperatively train a shared AI model without revealing the local energy data. Nevertheless, potential security and efficiency concerns still impede the deployment of federatedlearning-based AIoT services in smart grids due to the low-quality shared local models, non-independently and identically distributed (non-IID) data distributions, and unpredictable communication delays. In this article, we propose a secure and efficient federated-learning-enabled AIoT scheme for private energy data sharing in smart grids with edge-cloud collaboration. Specifically, we first introduce an edge-cloud-assisted federated learning framework for communication-efficient and privacy-preserving energy data sharing of users in smart grids. Then, by considering non-IID effects, we design a local data evaluation mechanism in federated learning and formulate two optimization problems for EDOs and energy service providers. Furthermore, due to the lack of knowledge of multidimensional user private information in practical scenarios, a two-layer deep reinforcement-learning-based incentive algorithm is developed to promote EDOs’ participation and high-quality model contribution. Extensive simulation results show that the proposed scheme can effectively stimulate EDOs to share high-quality local model updates and improve the communication efficiency.",
        "DOI": "10.1109/TII.2021.3095506",
        "paper_author": "Su Z.",
        "affiliation_name": "Xi'an Jiaotong University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60018308",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "LVBS: Lightweight Vehicular Blockchain for Secure Data Sharing in Disaster Rescue",
        "publication": "IEEE Transactions on Dependable and Secure Computing",
        "citied_by": "167",
        "cover_date": "2022-01-01",
        "Abstract": "In disaster areas, a large amount of data (e.g., rescue commands, road damage, and rescue experience) should be delivered among ground rescuing vehicles for safe driving and efficient rescue. When communication infrastructures are destroyed by disasters, unmanned aerial vehicles (UAVs) can be employed to perform immediate rescue missions in destroyed areas and assist data sharing for ground Internet of vehicles (IoV). However, in such UAV-assisted IoV under disaster situation, there exist potential security threats on data sharing among vehicles and UAVs because of the untrusted network environment, unreliable misbehavior tracing, and low-quality shared data. To address these issues, in this article, we develop a lightweight vehicular blockchain-enabled secure (LVBS) data sharing framework in UAV-aided IoV for disaster rescue. First, we propose a novel UAV and blockchain-assisted collaborative aerial-ground network architecture in disaster areas. Second, we develop a credit-based consensus algorithm in the lightweight vehicular blockchain to securely and immutably trace misbehaviors and record data transactions for UAVs and vehicles with improved efficiency and security in reaching consensus. Third, since UAVs and vehicles have little explicit knowledge of the whole network, we develop reinforcement learning-based algorithms to optimally schedule the pricing and quality of data sharing strategies for both data contributor and data consumer via trial and error. Finally, extensive simulations are conducted, which demonstrate that LVBS can effectively improve the security of consensus phase and promote high-quality data sharing.",
        "DOI": "10.1109/TDSC.2020.2980255",
        "paper_author": "Su Z.",
        "affiliation_name": "Xi'an Jiaotong University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60018308",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Towards Secure and Privacy-Preserving Data Sharing for COVID-19 Medical Records: A Blockchain-Empowered Approach",
        "publication": "IEEE Transactions on Network Science and Engineering",
        "citied_by": "166",
        "cover_date": "2022-01-01",
        "Abstract": "COVID-19 is currently a major global public health challenge. In the battle against the outbreak of COVID-19, how to manage and share the COVID-19 Electric Medical Records (CEMRs) safely and effectively in the world, prevent malicious users from tampering with CEMRs, and protect the privacy of patients are very worthy of attention. In particular, the semi-trusted medical cloud platform has become the primary means of hospital medical data management and information services. Security and privacy issues in the medical cloud platform are more prominent and should be addressed with priority. To address these issues, on the basis of ciphertext policy attribute-based encryption, we propose a blockchain-empowered security and privacy protection scheme with traceable and direct revocation for COVID-19 medical records. In this scheme, we perform the blockchain for uniform identity authentication and all public keys, revocation lists, etc are stored on a blockchain. The system manager server is responsible for generating the system parameters and publishes the private keys for the COVID-19 medical practitioners and users. The cloud service provider (CSP) stores the CEMRs and generates the intermediate decryption parameters using policy matching. The user can calculate the decryption key if the user has private keys and intermediate decrypt parameters. Only when attributes are satisfied access policy and the user's identity is out of the revocation list, the user can get the intermediate parameters by CSP. The malicious users may track according to the tracking list and can be directly revoked. The security analysis demonstrates that the proposed scheme is indicated to be safe under the Decision Bilinear Diffie-Hellman (DBDH) assumption and can resist many attacks. The simulation experiment demonstrates that the communication and storage overhead is less than other schemes in the public-private key generation, CEMRs encryption, and decryption stages. Besides, we also verify that the proposed scheme works well in the blockchain in terms of both throughput and delay.",
        "DOI": "10.1109/TNSE.2021.3101842",
        "paper_author": "Tan L.",
        "affiliation_name": "Sichuan Normal University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60014556",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "A Data-Characteristic-Aware Latent Factor Model for Web Services QoS Prediction",
        "publication": "IEEE Transactions on Knowledge and Data Engineering",
        "citied_by": "165",
        "cover_date": "2022-06-01",
        "Abstract": "How to accurately predict unknown quality-of-service (QoS) data based on observed ones is a hot yet thorny issue in Web service-related applications. Recently, a latent factor (LF) model has shown its efficiency in addressing this issue owing to its high accuracy and scalability. An LF model can be improved by identifying user and service neighborhoods based on user and service geographical information. However, such information can be difficult to acquire in most applications with the considerations of information security, identity privacy, and commercial interests in a real system. Besides, the existing LF model-based QoS predictors mostly ignore the reliability of given QoS data where noises commonly exist to cause accuracy loss. To address the above issues, this paper proposes a data-characteristic-aware latent factor (DCALF) model to implement highly accurate QoS predictions, where 'data-characteristic-aware' indicates that it can appropriately implement QoS prediction according to the characteristics of given QoS data. Its main idea is two-fold: a) it detects the neighborhoods and noises of users and services based on the dense LFs extracted from the original sparse QoS data, b) it incorporates a density peaks-based clustering method into its modeling process for achieving the simultaneous detections of both neighborhoods and noises of QoS data. With such designs, it precisely represents the given QoS data in spite of their sparsity, thereby achieving highly accurate predictions for unknown ones. Experimental results on two QoS datasets generated by real-world Web services demonstrate that the proposed DCALF model outperforms state-of-the-art QoS predictors, making it highly competitive in addressing the issue of Web service selection and recommendation.",
        "DOI": "10.1109/TKDE.2020.3014302",
        "paper_author": "Wu D.",
        "affiliation_name": "Chongqing Institute of Green and Intelligent Technology",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60273098",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "ShieldFL: Mitigating Model Poisoning Attacks in Privacy-Preserving Federated Learning",
        "publication": "IEEE Transactions on Information Forensics and Security",
        "citied_by": "165",
        "cover_date": "2022-01-01",
        "Abstract": "Privacy-Preserving Federated Learning (PPFL) is an emerging secure distributed learning paradigm that aggregates user-trained local gradients into a federated model through a cryptographic protocol. Unfortunately, PPFL is vulnerable to model poisoning attacks launched by a Byzantine adversary, who crafts malicious local gradients to harm the accuracy of the federated model. To resist model poisoning attacks, existing defense strategies focus on identifying suspicious local gradients over plaintexts. However, the Byzantine adversary submits encrypted poisonous gradients to circumvent existing defense strategies in PPFL, resulting in encrypted model poisoning. To address the issue, in this paper we design a privacy-preserving defense strategy using two-trapdoor homomorphic encryption (referred to as ShieldFL), which can resist encrypted model poisoning without compromising privacy in PPFL. Specially, we first present the secure cosine similarity method aiming to measure the distance between two encrypted gradients. Then, we propose the Byzantine-tolerance aggregation using cosine similarity, which can achieve robustness for both Independently Identically Distribution (IID) and non-IID data. Extensive evaluations on three benchmark datasets (i.e., MNIST, KDDCup99, and Amazon) show that ShieldFL outperforms existing defense strategies. Especially, ShieldFL can achieve 30%-80% accuracy improvement to defend two state-of-the-art model poisoning attacks in both non-IID and IID settings.",
        "DOI": "10.1109/TIFS.2022.3169918",
        "paper_author": "Ma Z.",
        "affiliation_name": "Xidian University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60025578",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "FELIDS: Federated learning-based intrusion detection system for agricultural Internet of Things",
        "publication": "Journal of Parallel and Distributed Computing",
        "citied_by": "162",
        "cover_date": "2022-07-01",
        "Abstract": "In this paper, we propose a federated learning-based intrusion detection system, named FELIDS, for securing agricultural-IoT infrastructures. Specifically, the FELIDS system protects data privacy through local learning, where devices benefit from the knowledge of their peers by sharing only updates from their model with an aggregation server that produces an improved detection model. In order to prevent Agricultural IoTs attacks, the FELIDS system employs three deep learning classifiers, namely, deep neural networks, convolutional neural networks, and recurrent neural networks. We study the performance of the proposed IDS on three different sources, including, CSE-CIC-IDS2018, MQTTset, and InSDN. The results demonstrate that the FELIDS system outperforms the classic/centralized versions of machine learning (non-federated learning) in protecting the privacy of IoT devices data and achieves the highest accuracy in detecting attacks.",
        "DOI": "10.1016/j.jpdc.2022.03.003",
        "paper_author": "Friha O.",
        "affiliation_name": "Université Badji Mokhtar - Annaba",
        "affiliation_city": "Annaba",
        "affiliation_country": "Algeria",
        "affiliation_id": "60068749",
        "affiliation_state": "Annaba Province"
    },
    {
        "paper_title": "A Hybrid Intrusion Detection Model Using EGA-PSO and Improved Random Forest Method",
        "publication": "Sensors",
        "citied_by": "160",
        "cover_date": "2022-08-01",
        "Abstract": "Due to the rapid growth in IT technology, digital data have increased availability, creating novel security threats that need immediate attention. An intrusion detection system (IDS) is the most promising solution for preventing malicious intrusions and tracing suspicious network behavioral patterns. Machine learning (ML) methods are widely used in IDS. Due to a limited training dataset, an ML-based IDS generates a higher false detection ratio and encounters data imbalance issues. To deal with the data-imbalance issue, this research develops an efficient hybrid network-based IDS model (HNIDS), which is utilized using the enhanced genetic algorithm and particle swarm optimization(EGA-PSO) and improved random forest (IRF) methods. In the initial phase, the proposed HNIDS utilizes hybrid EGA-PSO methods to enhance the minor data samples and thus produce a balanced data set to learn the sample attributes of small samples more accurately. In the proposed HNIDS, a PSO method improves the vector. GA is enhanced by adding a multi-objective function, which selects the best features and achieves improved fitness outcomes to explore the essential features and helps minimize dimensions, enhance the true positive rate (TPR), and lower the false positive rate (FPR). In the next phase, an IRF eliminates the less significant attributes, incorporates a list of decision trees across each iterative process, supervises the classifier’s performance, and prevents overfitting issues. The performance of the proposed method and existing ML methods are tested using the benchmark datasets NSL-KDD. The experimental findings demonstrated that the proposed HNIDS method achieves an accuracy of 98.979% on BCC and 88.149% on MCC for the NSL-KDD dataset, which is far better than the other ML methods i.e., SVM, RF, LR, NB, LDA, and CART.",
        "DOI": "10.3390/s22165986",
        "paper_author": "Balyan A.K.",
        "affiliation_name": "Chitkara University, Punjab",
        "affiliation_city": "Rajpura",
        "affiliation_country": "India",
        "affiliation_id": "60113205",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Factors Influencing the Adoption of Big Data Analytics in the Digital Transformation Era: Case Study of Jordanian SMEs",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "160",
        "cover_date": "2022-02-01",
        "Abstract": "Big data (BD) analytics has been increasingly gaining attraction in both practice and theory in light of its opportunities, barriers and expected benefits. In particular, emerging economics view big data analytics as having great importance despite the fact that it has been in a constant struggle with the barriers that prevent its adoption. Thus, this study primarily attempted to determine the drivers of big data analytics in the context of a developing economy, Jordan. The study examined the influence of technological, organizational and environmental factors on big data adoption in the Jordanian SMEs context, using PLS-SEM for the analysis. The empirical results revealed that the relative advantage, complexity, security, top management support, organizational readiness and government support influence the adoption of BD, whilst pressure of competition and compatibility appeared to be of insignificant influence. The findings are expected to contribute to enterprise management and strategic use of data analytics in the present dynamic market environment, for both researcher and practitioner circles concerned with the adoption of big data in developing countries.",
        "DOI": "10.3390/su14031802",
        "paper_author": "Lutfi A.",
        "affiliation_name": "King Faisal University",
        "affiliation_city": "Al-Ahsa",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60030736",
        "affiliation_state": "Ash Sharqiyah"
    },
    {
        "paper_title": "CNN-LSTM: Hybrid Deep Neural Network for Network Intrusion Detection System",
        "publication": "IEEE Access",
        "citied_by": "159",
        "cover_date": "2022-01-01",
        "Abstract": "Network security becomes indispensable to our daily interactions and networks. As attackers continue to develop new types of attacks and the size of networks continues to grow, the need for an effective intrusion detection system has become critical. Numerous studies implemented machine learning algorithms to develop an effective IDS; however, with the advent of deep learning algorithms and artificial neural networks that can generate features automatically without human intervention, researchers began to rely on deep learning. In our research, we took advantage of the Convolutional Neural Network's ability to extract spatial features and the Long Short-Term Memory Network's ability to extract temporal features to create a hybrid intrusion detection system model. We added batch normalization and dropout layers to the model to increase its performance. Based on the binary and multiclass classification, the model was trained using three datasets: CIC-IDS 2017, UNSW-NB15, and WSN-DS. The confusion matrix determines the system's effectiveness, which includes evaluation criteria such as accuracy, precision, detection rate, F1-score, and false alarm rate (FAR). The effectiveness of the proposed model was demonstrated by experimental results showing a high detection rate, high accuracy, and a relatively low FAR.",
        "DOI": "10.1109/ACCESS.2022.3206425",
        "paper_author": "Halbouni A.",
        "affiliation_name": "International Islamic University Malaysia",
        "affiliation_city": "Kuala Lumpur",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60016775",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital Twin: A Comprehensive Survey of Security Threats",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "158",
        "cover_date": "2022-09-05",
        "Abstract": "Industry 4.0 is having an increasingly positive impact on the value chain by modernizing and optimizing the production and distribution processes. In this streamline, the digital twin (DT) is one of the most cutting-edge technologies of Industry 4.0, providing simulation capabilities to forecast, optimize and estimate states and configurations. In turn, these technological capabilities are encouraging industrial stakeholders to invest in the new paradigm, though an increased focus on the risks involved is really needed. More precisely, the deployment of a DT is based on the composition of technologies such as cyber-physical systems, the Industrial Internet of Things, edge computing, virtualization infrastructures, artificial intelligence and big data. However, the confluence of all these technologies and the implicit interaction with the physical counterpart of the DT in the real world generate multiple security threats that have not yet been sufficiently studied. In that context, this paper analyzes the current state of the DT paradigm and classifies the potential threats associated with it, taking into consideration its functionality layers and the operational requirements in order to achieve a more complete and useful classification. We also provide a preliminary set of security recommendations and approaches that can help to ensure the appropriate and trustworthy use of a DT.",
        "DOI": "10.1109/COMST.2022.3171465",
        "paper_author": "Alcaraz C.",
        "affiliation_name": "Universidad de Málaga",
        "affiliation_city": "Malaga",
        "affiliation_country": "Spain",
        "affiliation_id": "60003662",
        "affiliation_state": "Malaga"
    },
    {
        "paper_title": "AI-empowered, blockchain and SDN integrated security architecture for IoT network of cyber physical systems",
        "publication": "Computer Communications",
        "citied_by": "158",
        "cover_date": "2022-01-01",
        "Abstract": "Internet of things (IoT) is one of the most emerging technologies nowadays and it is one of the key enablers of industrial cyber physical system (CPSs). It has started to participate in almost every aspect of our social life, ranging from financial transactions to the healthcare system, communication to national security, battlefield to smart homes, and so on. However, the wide deployment of IoT suffers certain issues as well, such as interoperability, compatibility, heterogeneity, large amount of data, processing of heterogeneous data etc. Among others, energy efficiency and security are the utmost prominent issues. Scarce computing resources of IoT devices put hindrances on information sharing across edge or IoT network. Indeed, unintentional or malicious interference with IoT data may lead to severe concerns. In this study, the researcher exploits the potential benefits of a blockchain system and integrates it with software-defined networking (SDN) while justifying energy and security issues. More in detail, the researcher proposed a new routing protocol with the cluster structure for IoT networks using blockchain-based architecture for SDN controller. The proposed architecture obviates proof-of-work (PoW) with private and public blockchains for Peer-to-Peer (P2P) communication between SDN controllers and IoT devices. In addition to this, distributed trust-based authentication mechanism makes blockchain even more adoptive for IoT devices with limited resources. The experimental results show that the proposed cluster structure based routing protocol outperforms the state-of-the-art Ad-hoc On-demand Distance Vector (AODV), Destination-Sequenced Distance Vector (DSDV), Secure Mobile Sensor Network (SMSN), Energy efficient secured cluster based distributed fault diagnosis (EESCFD), and Ad-hoc On-demand Multipath Distance Vector (AOMDV), in terms of energy consumption, network throughput, and packet latency. Proposed protocol help overcome the issues especially, energy management and security of the next generation industrial cyber physical systems.",
        "DOI": "10.1016/j.comcom.2021.09.029",
        "paper_author": "Latif S.A.",
        "affiliation_name": "Anhui University of Science and Technology",
        "affiliation_city": "Huainan",
        "affiliation_country": "China",
        "affiliation_id": "60013008",
        "affiliation_state": "Anhui"
    },
    {
        "paper_title": "Lightweight and Anonymity-Preserving User Authentication Scheme for IoT-Based Healthcare",
        "publication": "IEEE Internet of Things Journal",
        "citied_by": "156",
        "cover_date": "2022-02-15",
        "Abstract": "Internet of Things (IoT) produces massive heterogeneous data from various applications, including digital health, smart hospitals, automated pathology labs, and so forth. IoT sensor nodes are integrated with the medical equipment to enable the health workers to monitor the patients' health condition and appliances in real time. However, due to security vulnerabilities, an unauthorized user can access health-related information or control the IoT nodes attached to the patient's body resulting in unprecedented outcomes. Due to wireless channels as a medium of communication, IoT poses several threats such as a denial of service attack, man-in-the-middle attack, and modification attack to the IoT networks' security and privacy. The proposed research presents a lightweight and anonymity-preserving user authentication protocol to counter these security threats. The given scheme establishes a secure session for the legitimate user and prohibits unauthorized users from gaining access to the IoT sensor nodes. The proposed protocol uses only lightweight cryptography primitives (hash) to alleviate the node's tiny processor burden. The proposed protocol is efficient and superior because it has low computational and communication costs than conventional protocols. The proposed scheme uses password protection to let only the legitimate user access the IoT sensor nodes to obtain the patient's real-time health report.",
        "DOI": "10.1109/JIOT.2021.3080461",
        "paper_author": "Masud M.",
        "affiliation_name": "Taif University",
        "affiliation_city": "Taif",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60091164",
        "affiliation_state": "Makkah al Mukarramah"
    },
    {
        "paper_title": "PMRSS: Privacy-Preserving Medical Record Searching Scheme for Intelligent Diagnosis in IoT Healthcare",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "156",
        "cover_date": "2022-03-01",
        "Abstract": "In medical field, previous patients' cases are extremely private as well as intensely valuable to current disease diagnosis. Therefore, how to make full use of precious cases while not leaking out patients' privacy is a leading and promising work especially in future privacy-preserving intelligent medical period. In this article, we investigate how to securely invoke patients' records from past case-database while protecting the privacy of both current diagnosed patient and the case-database and construct a privacy-preserving medical record searching scheme based on ElGamal Blind Signature. In our scheme, by blinded the healthy data of the patient and the database of the iDoctor, respectively, the patient can securely make self-helped medical diagnosis by invoking past case-database and securely comparing the blinded abstracts of current data and previous records. Moreover, the patient can obtain target searching information intelligently at the same time he knows whether the abstracts match or not instead of obtaining it after matching. It greatly increases the timeliness of information acquisition and meets high-speed information sharing requirements, especially in 5G era. What's more, our proposed scheme achieves bilateral security, that is, whether the abstracts match or not, both of the privacy of the case-database and the private information of the current patient are well protected. Besides, it resists different levels of violent ergodic attacks by adjusting the number of zeros in a bit string according to different security requirements.",
        "DOI": "10.1109/TII.2021.3070544",
        "paper_author": "Sun Y.",
        "affiliation_name": "Beijing University of Posts and Telecommunications",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016930",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Antecedents and consequences of panic buying: The case of COVID-19",
        "publication": "International Journal of Consumer Studies",
        "citied_by": "155",
        "cover_date": "2022-01-01",
        "Abstract": "Panic buying emerged as a significant phenomenon during the COVID-19 pandemic. This study draws on the scarcity principle, crowd psychology and contagion theory to investigate the antecedents and consequences of panic buying. The antecedents included in this study are government measures, media and peer influence and the fear of missing out. The consequences are founded on a sense of security and guilt. Retailer intervention is included as a moderator to the proposed main effects. Data were collected from 341 consumers who engaged in panic buying and were residents of the United States and Australia during the COVID-19 pandemic. Structural equation modelling was employed to test the proposed model. The results show that the proposed antecedents (except fear of missing out) were significantly related to panic buying, which in turn had a significant influence on panic buyers' psychological outcomes. The moderating effects of retailer intervention varied across different product categories. Discussion and implications of these findings are provided for policy makers, customers and practitioners.",
        "DOI": "10.1111/ijcs.12649",
        "paper_author": "Prentice C.",
        "affiliation_name": "Griffith Business School",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60189515",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Patients' and public views and attitudes towards the sharing of health data for research: A narrative review of the empirical evidence",
        "publication": "Journal of Medical Ethics",
        "citied_by": "155",
        "cover_date": "2022-01-01",
        "Abstract": "Introduction International sharing of health data opens the door to the study of the so-called Big Data', which holds great promise for improving patient-centred care. Failure of recent data sharing initiatives indicates an urgent need to invest in societal trust in researchers and institutions. Key to an informed understanding of such a social license' is identifying the views patients and the public may hold with regard to data sharing for health research. Methods We performed a narrative review of the empirical evidence addressing patients' and public views and attitudes towards the use of health data for research purposes. The literature databases PubMed (MEDLINE), Embase, Scopus and Google Scholar were searched in April 2019 to identify relevant publications. Patients' and public attitudes were extracted from selected references and thematically categorised. Results Twenty-seven papers were included for review, including both qualitative and quantitative studies and systematic reviews. Results suggest widespread - though conditional - support among patients and the public for data sharing for health research. Despite the fact that participants recognise actual or potential benefits of data research, they expressed concerns about breaches of confidentiality and potential abuses of the data. Studies showed agreement on the following conditions: value, privacy, risk minimisation, data security, transparency, control, information, trust, responsibility and accountability. Conclusions Our results indicate that a social license for data-intensive health research cannot simply be presumed. To strengthen the social license, identified conditions ought to be operationalised in a governance framework that incorporates the diverse patient and public values, needs and interests.",
        "DOI": "10.1136/medethics-2019-105651",
        "paper_author": "Kalkman S.",
        "affiliation_name": "University Medical Center Utrecht",
        "affiliation_city": "Utrecht",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60032724",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Scalable blockchain model using off-chain IPFS storage for healthcare data security and privacy",
        "publication": "Journal of Parallel and Distributed Computing",
        "citied_by": "154",
        "cover_date": "2022-06-01",
        "Abstract": "Traditional healthcare systems in the present scenario follow centralized client-server architecture to store and process patient-health related information. Data stored in each of the healthcare institution remain in silos which cannot be easily shared with other institutions due to technical and infrastructural constraints. Hospitals do not have an effective and secure data sharing mechanism leading to monetary and resource loss in the case of a person visiting different hospitals. Blockchain, a disruptive technology with secure and reliable decentralized framework, and can be used to circumvent problems in traditional healthcare architecture for secure storage, sharing and retrieval of Electronic Health Records (EHR). A blockchain-based framework integrated with InterPlanetary File System (IPFS) for EHR in healthcare management has been proposed in this paper. This proposed framework will enable healthcare institutions to maintain fail-safe and tamper-proof healthcare ledgers in a decentralized manner. Hospitals and doctors act as lightweight nodes, whereas patient nodes can be full or lightweight nodes. The model proposes two-factor authentication and multi-factor authentication for preventing fake node attacks. Patient-centric access model allows the patients to act as digital stewards for their health data, allowing access to doctors and hospitals on demand and revoking it after stipulated time. Symmetric key encryption (AES-128) is used for encrypting data before storing into IPFS. Asymmetric encryption (RSA-4096) is used for generating digital envelopes to pass on symmetric key to authorized entities. Digital signatures (RSA-1024) make sure that the transactions are valid and from authorized nodes. Hashing of the encrypted data is done using SHA-256 algorithm. Multiple layers of security implemented in this model makes sure that adversaries cannot obtain data stored in IPFS; even if they retrieve the data, it will not be meaningful since it is encrypted. The proposed framework for off-chain storage of health data using IPFS saves blockchain structure from scalability issues. Further the proposal for blockchain integration with IPFS helps preserve privacy in the healthcare system, making it highly secure, scalable and robust.",
        "DOI": "10.1016/j.jpdc.2022.03.009",
        "paper_author": "Jayabalan J.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Drivers and barriers in the transition from a linear economy to a circular economy",
        "publication": "Journal of Cleaner Production",
        "citied_by": "154",
        "cover_date": "2022-03-20",
        "Abstract": "A paradigm shift from a linear economy to a circular economy is crucial to reduce pressure on the environment and to improve the security of supply of primary raw materials. Under this new paradigm, governed by the imperatives of “reduce, reuse, and recycle”, the extraction of primary resources is minimised by extending the useful life of existing resources and materials. This paper seeks to identify the drivers and barriers of this circularisation and provide guidance for effective policies to hasten the transition to it. The innovative contribution made by this paper to this area of research is the empirical evidence it provides on the role played by economic, social, and environmental factors in the transition to a circular economy. To achieve this, yearly data from 2010 to 2019, for a panel of 19 European Union countries were analysed employing a Panel-Corrected Standard Errors estimator, which was shown to be an appropriate estimator for the data's characteristics. The circular material use rate was used as a proxy for the circular economy. The main findings suggest that the age distribution of a country is a significant predictor of a circular economy. Older people tend to be reluctant to change their behaviour, while young people are more inclined to move away from the so-called ‘take-make-waste’ extractive industrial model. Policies directed to older people to sensibilize them on the benefits and importance of a circular economy are thus required. When per capita income increases, the propensity to accept products containing recycled materials decreases. This finding merits the particular attention of policymakers. In turn, income inequality makes moving toward a circular economy more difficult. Those in the middle-income bracket are more likely to exhibit green behaviour, which implies that they are more aware of environmental issues.",
        "DOI": "10.1016/j.jclepro.2022.130865",
        "paper_author": "Neves S.A.",
        "affiliation_name": "Universidade da Beira Interior",
        "affiliation_city": "Covilha",
        "affiliation_country": "Portugal",
        "affiliation_id": "60001002",
        "affiliation_state": "Castelo Branco"
    }
]