[
    {
        "paper_title": "The Influence of Environmental, Social, and Governance (ESG) Practices on US Firms’ Performance: Evidence from the Coronavirus Crisis",
        "publication": "Journal of the Knowledge Economy",
        "citied_by": "73",
        "cover_date": "2024-03-01",
        "Abstract": "This study explores the influence of total and individual ESG practices and the coronavirus crisis on US firm performance (FP). A large and recent sample of 406 US firms that adopted ESG issues during 2016–2020 was used. This study uses the generalized least-squares (GLS) regression estimator, the dynamic analysis technique, and robustness tests. The results indicate that firms with heightened ESG practices have better performance measures. In most cases, the results suggest that firms with heightened environmental, social, and governance performances have better performance measures. The results suggest that the coronavirus crisis negatively affected FP measures. In addition, the analyses of the differences suggest significant distinctions in FP due to the coronavirus crisis. This study’s findings have important implications for stakeholders. Managers could benefit from the results of this examination by recognizing the status of ESG practices and FP before and during the coronavirus crisis and identifying the linkage between the fulfillment of ESG responsibilities and FP. This study provides noteworthy practical implications that could enable managers to develop strategies and policies for adopting and enhancing ESG practices to achieve the best performance. Furthermore, the results could influence trading processes as investors and financiers pursue attractive financial returns from investments in businesses concerned with ESG issues.",
        "DOI": "10.1007/s13132-023-01278-w",
        "paper_author": "Habib A.M.",
        "affiliation_name": "Independent Research",
        "affiliation_city": "Zagazig",
        "affiliation_country": "Egypt",
        "affiliation_id": "129310010",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Green building practices to integrate renewable energy in the construction sector: a review",
        "publication": "Environmental Chemistry Letters",
        "citied_by": "44",
        "cover_date": "2024-04-01",
        "Abstract": "The building sector is significantly contributing to climate change, pollution, and energy crises, thus requiring a rapid shift to more sustainable construction practices. Here, we review the emerging practices of integrating renewable energies in the construction sector, with a focus on energy types, policies, innovations, and perspectives. The energy sources include solar, wind, geothermal, and biomass fuels. Case studies in Seattle, USA, and Manama, Bahrain, are presented. Perspectives comprise self-sufficiency, microgrids, carbon neutrality, intelligent buildings, cost reduction, energy storage, policy support, and market recognition. Incorporating wind energy into buildings can fulfill about 15% of a building's energy requirements, while solar energy integration can elevate the renewable contribution to 83%. Financial incentives, such as a 30% subsidy for the adoption of renewable technologies, augment the appeal of these innovations.",
        "DOI": "10.1007/s10311-023-01675-2",
        "paper_author": "Chen L.",
        "affiliation_name": "Chongqing University",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60023380",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Racial platform capitalism: Empire, migration and the making of Uber in London",
        "publication": "Environment and Planning A",
        "citied_by": "44",
        "cover_date": "2024-06-01",
        "Abstract": "The critical platform studies literature has built a compelling picture of how techniques like worker (mis)classification, algorithmic management and workforce atomisation lie at the heart of how ‘work on-demand via apps’ actively restructure labour. Much of this emerging scholarship identifies that platform workforces are predominantly comprised of migrant and racially minoritised workers. However, few studies theorise migration and race as structuring logics of the platform model and the precarity it engenders. This paper addresses this gap by exploring how the platform economy – specifically work on-demand via apps – both shapes and is shaped by historically contingent contexts of racialisation, and their constitutive processes such as embodiment and immigration policy/rhetoric. Beyond identifying the over-representation of racial minorities in the platform economy, it argues that processes of racialisation have been crucial at every stage of the platform economy's rise to dominance, and therefore constitutes a key organising principle of platform capitalism – hence the term ‘racial platform capitalism’. In doing so, this paper draws on the racial capitalism literature, to situate key platform techniques such as worker (mis)classification and algorithmic management as forms of racial practice, deployed to (re-)organise surplus urban labour-power following the 2008 financial crisis. This framework will be explored through an ethnographic study of Uber's rise in London. Through this, the paper demonstrates a co-constitutive relationship, where the conditions of minoritised workers in a global city like London post-2008, and the political economy of platform companies can be said to have co-produced one another.",
        "DOI": "10.1177/0308518X221115439",
        "paper_author": "Gebrial D.",
        "affiliation_name": "London School of Economics and Political Science",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60003059",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The Second Cold War: US-China Competition for Centrality in Infrastructure, Digital, Production, and Finance Networks",
        "publication": "Geopolitics",
        "citied_by": "42",
        "cover_date": "2024-01-01",
        "Abstract": "Relations between the US and China have deteriorated to their lowest point since their rapprochement in the 1970s. To make sense of contemporary geopolitics, our objective in this article is two-fold. First, we historically situate contemporary US-China rivalry to conceptualise the Second Cold War (SCW). We argue that in the wake of the 2008 financial crisis, both the US and China launched ‘restorative’ political projects that harked back to imagined pasts. These projects are mutually exclusive and animate contemporary geopolitics. Second, we conceptualise the spatial logic of great power rivalry in the Second Cold War. In contrast to the first Cold War, when great powers sought to incorporate territory into blocs, the US and China currently compete on a global scale for centrality in four interrelated networks that they anticipate will underpin hegemony in the 21st century: infrastructure (e.g. logistics and energy), digital, production and finance. We review the state of competition in each network and draw two broad conclusions: (1) this mode of competition makes it difficult for either side to conclusively ‘win’ the Second Cold War, and (2) many countries are likely to remain integrated with both the US and China.",
        "DOI": "10.1080/14650045.2023.2253432",
        "paper_author": "Schindler S.",
        "affiliation_name": "The University of Manchester",
        "affiliation_city": "Manchester",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60003771",
        "affiliation_state": "Greater Manchester"
    },
    {
        "paper_title": "The Adoption and Implementation of Artificial Intelligence Chatbots in Public Organizations: Evidence from U.S. State Governments",
        "publication": "American Review of Public Administration",
        "citied_by": "41",
        "cover_date": "2024-04-01",
        "Abstract": "Although the use of artificial intelligence (AI) chatbots in public organizations has increased in recent years, three crucial gaps remain unresolved. First, little empirical evidence has been produced to examine the deployment of chatbots in government contexts. Second, existing research does not distinguish clearly between the drivers of adoption and the determinants of success and, therefore, between the stages of adoption and implementation. Third, most current research does not use a multidimensional perspective to understand the adoption and implementation of AI in government organizations. Our study addresses these gaps by exploring the following question: what determinants facilitate or impede the adoption and implementation of chatbots in the public sector? We answer this question by analyzing 22 state agencies across the U.S.A. that use chatbots. Our analysis identifies ease of use and relative advantage of chatbots, leadership and innovative culture, external shock, and individual past experiences as the main drivers of the decisions to adopt chatbots. Further, it shows that different types of determinants (such as knowledge-base creation and maintenance, technology skills and system crashes, human and financial resources, cross-agency interaction and communication, confidentiality and safety rules and regulations, and citizens’ expectations, and the COVID-19 crisis) impact differently the adoption and implementation processes and, therefore, determine the success of chatbots in a different manner. Future research could focus on the interaction among different types of determinants for both adoption and implementation, as well as on the role of specific stakeholders, such as IT vendors.",
        "DOI": "10.1177/02750740231200522",
        "paper_author": "Chen T.",
        "affiliation_name": "State University of New York Albany",
        "affiliation_city": "Albany",
        "affiliation_country": "United States",
        "affiliation_id": "60011666",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Sustainable Supply Chain Finance and Supply Networks: The Role of Artificial Intelligence",
        "publication": "IEEE Transactions on Engineering Management",
        "citied_by": "36",
        "cover_date": "2024-01-01",
        "Abstract": "Supply chain finance (SCF) is receiving increasing awareness in research as a result of uncertainties in the global financing for supply chain (SC). There are limited and fragmented studies in the implementations of financial services in SC management. This article builds on recovery from the financial crisis of 2008 and posts COVID-19 pandemic, where uncertainties crippled SCF providers and brokers services. At the same time, cutting-edge technological advancements such as Artificial Intelligence (AI) are revolutionizing the processes of business ecosystem in which SCF is entrenched. This article thus adopts a fuzzy set theoretical approach to unpack the entities relationship validity for sustainable SCF mate-framework, and the originality of AI concepts to sustainable SCF to identify the issues and inefficiencies. The results indicate that AI contributes significant economic opportunities and deliver the most effective utilization of the supply networks. In addition, the article provides a theoretical contribution to financing in SC and broadens the managerial implications in improving performance.",
        "DOI": "10.1109/TEM.2021.3133104",
        "paper_author": "Olan F.",
        "affiliation_name": "University of Northumbria",
        "affiliation_city": "Newcastle",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60004636",
        "affiliation_state": "Tyne and Wear"
    },
    {
        "paper_title": "Openness to Technological Innovation, Supply Chain Resilience, and Operational Performance: Exploring the Role of Information Processing Capabilities",
        "publication": "IEEE Transactions on Engineering Management",
        "citied_by": "33",
        "cover_date": "2024-01-01",
        "Abstract": "Increasing volatility in the global economy since the 2009 financial crisis, including the USA-China trade war and recent COVID-19 outbreak, has compelled businesses to build resilience to respond quickly to unexpected disruptions. Consistent with organizational information processing theory (OIPT), we posit that openness to technological innovation helps to build information processing capabilities (i.e., interfunctional coordination and interpartner informational justice), which are required to build supply chain resilience (SCR) and improve performance. Structural equation modeling is used to analyze survey data gathered from 241 Chinese manufacturers. The results reveal interfunctional coordination and interpartner informational justice fully mediate the relationship between openness to technological innovation and SCR, and information processing capabilities and SCR are significantly and positively associated with operational performance. This article extends OIPT by elucidating the role of openness to technological innovation and enhances the SCR literature by providing empirical evidence of the important roles for information processing capabilities. The findings provide a unique information processing perspective to help managers broaden their solutions against disruptive events, and thus avoid or minimize potential negative impacts on firms.",
        "DOI": "10.1109/TEM.2022.3156531",
        "paper_author": "Yu W.",
        "affiliation_name": "Roehampton Business School",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60159962",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The antibiotic resistance crisis and the development of new antibiotics",
        "publication": "Microbial Biotechnology",
        "citied_by": "29",
        "cover_date": "2024-07-01",
        "Abstract": "The Global Burden of Disease report of 2019 estimated 14 million infection-related deaths, making it the second leading cause of death after ischaemic heart disease. Bacterial pathogens accounted for 7.7 million deaths and deaths attributable to bacterial antibiotic resistance amounted to 1.3 million, describing a clear demand for novel antibiotics. Antibiotic development had its golden age in 1930–1960. Following failures in the screening of chemical libraries for novel antibiotics at the beginning of this century, the high cost of launching new antibiotics (estimated at US$ 1.4 billion per registered drug) and difficulties in achieving a return of investment for novel antibiotics, pharmaceutical industry has mostly left the field. The current Lilliput review analyses the question whether scientific or economic hurdles prevented the registration of new antibiotics. Scientifically, substantial progress has been achieved over recent years to define the chemical properties needed to overcome the permeation barrier in Gram-negative pathogens; in extending the chemical space of antibiotic candidates by full modular synthesis of suitable molecules; by extending bioprospecting to previously ‘unculturable’ bacteria or unusual bacteria; by attacking bacterial targets on the outer bacterial membrane; and by looking for support from structural biology, genomics, molecular genetics, phylogenetic analyses and deep machine learning approaches. However, these research activities were mostly conducted by academic researchers and biotech companies with limited financial resources. It thus seems that the development of new antibiotics, frequently described as the drying of the pipeline, is less limited by lack of scientific insight than by lack of the mobilization of the monetary resources needed to bring these discoveries to the market despite recent financial push and pull efforts of the public sector.",
        "DOI": "10.1111/1751-7915.14510",
        "paper_author": "Brüssow H.",
        "affiliation_name": "Departement Biosystemen",
        "affiliation_city": "Heverlee",
        "affiliation_country": "Belgium",
        "affiliation_id": "60121229",
        "affiliation_state": "Vlaams-Brabant"
    },
    {
        "paper_title": "Grassroots struggles challenging housing financialization in Spain",
        "publication": "Housing Studies",
        "citied_by": "28",
        "cover_date": "2024-01-01",
        "Abstract": "Spain was one of the most severely hit countries by the 2008 global financial crisis. More than ten years after, the belated economic recovery has hardly changed the roots of that crisis, especially the financialization of the real estate sector. Remarkably, from 2009 to the present, several grassroots struggles have questioned those roots and demanded solutions to the affordability housing crisis. In this study, we examine two salient cases: the campaign against the Bankia bank and opposition to the international investment fund Blackstone. Both firms forced thousands of home evictions upon financially broken homeowners and tenants, respectively, the latter doing so via sharp rent increases. Here we investigate the claims, protest repertoires and achievements of these housing struggles. Our analysis shows that every type of grassroots’ response was shaped by a distinct process of capital accumulation through the financialization of housing. The first was driven mainly by austerity policies and the second by state-led actions to reignite housing speculation.",
        "DOI": "10.1080/02673037.2022.2036328",
        "paper_author": "Martínez M.A.",
        "affiliation_name": "Uppsala Universitet",
        "affiliation_city": "Uppsala",
        "affiliation_country": "Sweden",
        "affiliation_id": "60003858",
        "affiliation_state": "Uppsala"
    },
    {
        "paper_title": "How does climate policy uncertainty affect financial markets? Evidence from Europe",
        "publication": "Economics Letters",
        "citied_by": "27",
        "cover_date": "2024-01-01",
        "Abstract": "This study analyzes the time-varying effect of climate policy uncertainty (CPU) on the stock market and clean energy indices in the European context. For this purpose, we use the Bayesian time-varying parameter VAR model. The empirical results show that CPU shocks have a significant effect on the financial indexes. Returns on clean energy (crude oil) stocks increase (decrease) in response to heightened climate risk. Moreover, the COVID-19 pandemic is a relevant tipping point in CPU dynamics. These results offer important implications for European investors and policymakers in the context of the European climate-energy crisis.",
        "DOI": "10.1016/j.econlet.2023.111443",
        "paper_author": "Tedeschi M.",
        "affiliation_name": "Università Politecnica delle Marche",
        "affiliation_city": "Ancona",
        "affiliation_country": "Italy",
        "affiliation_id": "60031624",
        "affiliation_state": "AN"
    },
    {
        "paper_title": "Earth at risk: An urgent call to end the age of destruction and forge a just and sustainable future",
        "publication": "PNAS Nexus",
        "citied_by": "26",
        "cover_date": "2024-04-01",
        "Abstract": "Human development has ushered in an era of converging crises: climate change, ecological destruction, disease, pollution, and socioeconomic inequality. This review synthesizes the breadth of these interwoven emergencies and underscores the urgent need for comprehensive, integrated action. Propelled by imperialism, extractive capitalism, and a surging population, we are speeding past Earth's material limits, destroying critical ecosystems, and triggering irreversible changes in biophysical systems that underpin the Holocene climatic stability which fostered human civilization. The consequences of these actions are disproportionately borne by vulnerable populations, further entrenching global inequities. Marine and terrestrial biomes face critical tipping points, while escalating challenges to food and water access foreshadow a bleak outlook for global security. Against this backdrop of Earth at risk, we call for a global response centered on urgent decarbonization, fostering reciprocity with nature, and implementing regenerative practices in natural resource management. We call for the elimination of detrimental subsidies, promotion of equitable human development, and transformative financial support for lower income nations. A critical paradigm shift must occur that replaces exploitative, wealth-oriented capitalism with an economic model that prioritizes sustainability, resilience, and justice. We advocate a global cultural shift that elevates kinship with nature and communal well-being, underpinned by the recognition of Earth's finite resources and the interconnectedness of its inhabitants. The imperative is clear: to navigate away from this precipice, we must collectively harness political will, economic resources, and societal values to steer toward a future where human progress does not come at the cost of ecological integrity and social equity.",
        "DOI": "10.1093/pnasnexus/pgae106",
        "paper_author": "Fletcher C.",
        "affiliation_name": "School of Ocean and Earth Science and Technology",
        "affiliation_city": "Honolulu",
        "affiliation_country": "United States",
        "affiliation_id": "60003579",
        "affiliation_state": "HI"
    },
    {
        "paper_title": "Composting municipal solid waste and animal manure in response to the current fertilizer crisis - a recent review",
        "publication": "Science of the Total Environment",
        "citied_by": "26",
        "cover_date": "2024-02-20",
        "Abstract": "The dynamic price increases of fertilizers and the generation of organic waste are currently global issues. The growth of the population has led to increased production of solid municipal waste and a higher demand for food. Food production is inherently related to agriculture and, to achieve higher yields, it is necessary to replenish the soil with essential minerals. A synergistic approach that addresses both problems is the implementation of the composting process, which aligns with the principles of a circular economy. Food waste, green waste, paper waste, cardboard waste, and animal manure are promising feedstock materials for the extraction of valuable compounds. This review discusses key factors that influence the composting process and compares them with the input materials' parameters. It also considers methods for optimizing the process, such as the use of biochar and inoculation, which result in the production of the final product in a significantly shorter time and at lower financial costs. The applications of composts produced from various materials are described along with associated risks. In addition, innovative composting technologies are presented.",
        "DOI": "10.1016/j.scitotenv.2023.169221",
        "paper_author": "Pajura R.",
        "affiliation_name": "Politechnika Rzeszowska im. Ignacego Łukasiewicza",
        "affiliation_city": "Rzeszow",
        "affiliation_country": "Poland",
        "affiliation_id": "60032402",
        "affiliation_state": "PK"
    },
    {
        "paper_title": "Assessing the US financial sector post three bank collapses: Signals from fintech and financial sector ETFs",
        "publication": "International Review of Financial Analysis",
        "citied_by": "26",
        "cover_date": "2024-01-01",
        "Abstract": "We investigate the effects of the collapses of Silicon Valley Bank, Signature Bank, and First Republic Bank on the US financial sector by analysing returns and second moments of traditional financial and fintech ETFs. Using a network model, we examine high-frequency data sampled at one-hour intervals for seventeen ETFs encompassing pre- and crisis periods. We find, using a time-varying parametric vector autoregressive (TVP-VAR) and volatility impulse response analysis, that traditional financial ETFs are net transmitters of returns and volatility spillovers in the network, and that this impact is more pronounced in volatility in the period coinciding with the collapse of the three big banks. We identify effects persisting through the medium term. This study is among the first to comprehensively analyze the recent crisis in the US banking sector, covering a full range of the fall of three big banks.",
        "DOI": "10.1016/j.irfa.2023.102995",
        "paper_author": "Banerjee A.K.",
        "affiliation_name": "XLRI, Jamshedpur",
        "affiliation_city": "Jamshedpur",
        "affiliation_country": "India",
        "affiliation_id": "60086128",
        "affiliation_state": "JH"
    },
    {
        "paper_title": "Can financial subsidy increase electric vehicle (EV) penetration—evidence from a quasi-natural experiment",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "25",
        "cover_date": "2024-02-01",
        "Abstract": "Electric vehicles (EVs) are considered a promising solution for reducing emissions in urban transportation and addressing energy crises. Several countries, including China, have implemented direct financial subsidies to encourage the adoption of EVs. However, there is a lack of comprehensive evaluation regarding the effectiveness of these subsidies and their interaction with non-financial incentive policies. Additionally, the design of subsidy policies can be endogenous, potentially leading to biased estimations of their effects on EV penetration. To address these issues, this study utilizes a “quasi-natural experiment\" approach, taking advantage of the gradual reduction of nationwide EV subsidies by the Chinese government due to financial constraints, rather than market conditions, thus mitigating the endogeneity problem. The study collects panel data from 224 prefecture-level cities in China and employs a modified panel data fixed effects model to quantify the impact of financial subsidies on EV sales and market shares. The analysis focuses on subsidy variations during six periods. The main empirical findings are as follows: (1) 1 % increase in purchase subsidies leads to a 1.36 % increase in EV sales and a 2.31 % increase in EV market share. (2) Non-financial policies, such as parking benefits, promotional goals, and restrictions on the number of vehicles, also contribute to boosting EV sales. (3) The effects of purchase subsidies vary across cities with different socio-economic conditions. (4) Some non-financial policies are found to enhance the positive effects of subsidy policies.",
        "DOI": "10.1016/j.rser.2023.114021",
        "paper_author": "Shang W.L.",
        "affiliation_name": "Beijing University of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022281",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The benefits are at the tail: Uncovering the impact of macroprudential policy on growth-at-risk",
        "publication": "Journal of Financial Stability",
        "citied_by": "25",
        "cover_date": "2024-10-01",
        "Abstract": "I uncover heterogeneous effects of macroprudential policy on GDP growth distribution by bringing together the literature on the impact of macroprudential policy and recent developments on the use of quantile regressions. I identify important benefits of macroprudential policy on the left-tail of the GDP growth distribution which contrast with the negative effects found in previous studies using conditional mean models. These benefits may offset the deterioration on growth-at-risk produced by the build-up of cyclical vulnerabilities and the materialization of financial crises. I also find that the impact of macroprudential policy is dependent on the position in the financial cycle, the type of instrument, and the time elapsed since its implementation. In particular, tightening capital measures during expansions may take up to two years to show evidence of benefits on growth-at-risk, while the positive impact of borrower-based measures is rapidly observed. Conversely, in downturns the benefits of loosening capital measures are more immediate, while those of borrower-based measures are limited. This suggests the importance of timing in macroprudential policy. Overall, this study provides a useful framework to assess the impact of macroprudential policy in terms of GDP growth and to identify the term-structure of specific instruments.",
        "DOI": "10.1016/j.jfs.2020.100831",
        "paper_author": "Galán J.E.",
        "affiliation_name": "Banco de España",
        "affiliation_city": "Madrid",
        "affiliation_country": "Spain",
        "affiliation_id": "60109587",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "How does digitalization affect the green transformation of enterprises registered in China's resource-based cities? Further analysis on the mechanism and heterogeneity",
        "publication": "Journal of Environmental Management",
        "citied_by": "24",
        "cover_date": "2024-08-01",
        "Abstract": "Digitalization, as a crucial engine for promoting sustainable development, has created new prospects for enterprise green transformation. Utilizing panel data from enterprises registered in China's resource-based cities from 2010 to 2021, this study innovatively examines the role of digitalization in promoting green transformation across two key performance dimensions. The findings indicate that enterprise digitalization significantly enhances the green innovation performance, while its impact on environmental performance, although positive, is not statistically significant. Overall, enterprise digitalization greatly facilitates green transformation. Moreover, mechanism analysis reveals that enterprise digitalization promotes green transformation through the alleviation of financial mismatch and the increase of external market attention. In addition, heterogeneity analysis shows that the effectiveness of enterprise digitalization in promoting green transformation is significantly different in different opportunist risk scenarios, proving more effective in areas with low-marketization, high-competition industries, and high environmental regulation intensity. In terms of the policy level, the National Big Data Comprehensive Pilot Zone (NBDCPZ) and the Carbon Emission Trading Policy (CETP) played a positive stimulating role in the process of enterprise digitalization affecting green transformation. This paper broadens the scope of research on green transformation, offers new development philosophy for enterprises in resource-based cities, and provides new directions for the synergistic development of digitalization and greenization.",
        "DOI": "10.1016/j.jenvman.2024.121560",
        "paper_author": "Feng Y.",
        "affiliation_name": "Zhengzhou University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60018554",
        "affiliation_state": "Henan"
    },
    {
        "paper_title": "Adaptation of solar energy in the Global South: Prospects, challenges and opportunities",
        "publication": "Heliyon",
        "citied_by": "23",
        "cover_date": "2024-04-15",
        "Abstract": "The Global South comprising economically disadvantaged regions of the world face various challenges such as limited access to electricity, clean water, industrialization, and food security. Solar energy, as a sustainable and abundant resource, holds great potential to address these challenges. Despite its immense potential, the Global South encounters hurdles related to technology adoption, infrastructure, and financial constraints. This review examines the history, classifications, global statistics, merits, and demerits of solar technology in the Global South. Furthermore, it delves into various applications of solar energy, including extreme environments, residential electricity generation, transportation, and industrial usage in this region. This study concludes by providing new insighths and highlighting the significant role solar energy can play in shaping the future of the Global South if challenges are adequately addressed, and opportunities are embraced.",
        "DOI": "10.1016/j.heliyon.2024.e28009",
        "paper_author": "Ukoba K.",
        "affiliation_name": "University of Johannesburg",
        "affiliation_city": "Johannesburg",
        "affiliation_country": "South Africa",
        "affiliation_id": "60000717",
        "affiliation_state": "Gauteng"
    },
    {
        "paper_title": "Has the Covid-19 pandemic jeopardized firms' environmental behavior? Bridging green initiatives and firm value through the triple bottom line approach",
        "publication": "Corporate Social Responsibility and Environmental Management",
        "citied_by": "23",
        "cover_date": "2024-01-01",
        "Abstract": "The Covid-19 pandemic has caused a significant decline in stock markets worldwide, and organizations are experiencing serious financial problems. Protecting and preserving firm value are critical ways to help organizations survive the crisis. This study analyzes a sample of 45 firms listed on the Polish Stock Market in two periods to determine the relationship among green initiatives, the triple bottom line (TBL) perspective, and firm value in the periods before and during the crisis caused by the Covid-19 pandemic. The results show that firms with higher green initiatives are more likely to obtain better TBL performance during the normal period. Economic and social dimensions of TBL positively influence firm value regardless of the period, but the same is not true of the ecological dimension. The Covid-19 pandemic's negative impact on investors' perception does not translate to firm value. This study provides the first empirical evidence on the value of organizations affected by the Covid-19 pandemic in the context of environmental management. By considering the TBL approach, this study provides a new boundary condition that explains the impact mechanism of green initiatives during a crisis.",
        "DOI": "10.1002/csr.2575",
        "paper_author": "Karman A.",
        "affiliation_name": "Uniwersytet Marii Curie-Sklodowskiej w Lublinie",
        "affiliation_city": "Lublin",
        "affiliation_country": "Poland",
        "affiliation_id": "60011685",
        "affiliation_state": "LU"
    },
    {
        "paper_title": "Exploring digital finance, financial regulations and carbon emission nexus: New insight from resources efficiency, industrial structure and green innovation in China",
        "publication": "Resources Policy",
        "citied_by": "22",
        "cover_date": "2024-01-01",
        "Abstract": "The global climate crisis is exacerbated by the massive burning of fossil energy, represented by natural resource extraction and usage. Likewise, digital finance (DF) is critical to enable financial support for reducing natural resource consumption and supporting low-carbon development. Against this backdrop, this paper analyses DF's impact on carbon emissions under financial regulatory constraints using 274 Chinese cities data from 2011 to 2020. Results reveal that DF does not present a carbon mitigation effect but rather stimulates carbon emissions. The breadth of DF use mainly materializes the carbon emission effect of DF. Realizing the carbon reduction effect of DF depends on the moderating effect of financial regulatory constraints. DF has prominent universality characteristics under the constraints of financial regulation; such effect is more evident in resource-based cities, third- and fourth-tier cities, and central and western regions. The carbon reduction effect of DF under financial regulatory constraints is mainly achieved by stimulating green innovation, resource efficiency, and industrial structure upgrading.",
        "DOI": "10.1016/j.resourpol.2023.104452",
        "paper_author": "Xuan S.",
        "affiliation_name": "Nanjing University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60033100",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Repercussions of the Russia–Ukraine war",
        "publication": "International Review of Economics and Finance",
        "citied_by": "22",
        "cover_date": "2024-01-01",
        "Abstract": "Using the heteroscedasticity-based estimator of Rigobon and Sack (2005) to identify daily shocks of the Russia–Ukraine war, I assess and quantify the dynamic impact of the conflict on 86 open economies from January 2021 to November 2022. Within local projections, I show that war shocks caused considerable effects on macroeconomic conditions, financial markets, and global financial stability. Following a shock, weekly GDP fell significantly while inflation expectations and commodity prices soared, verifying the war's nature as a contractionary supply shock. While global stock prices fell, the long-term government bond yields remained stable, implying the crisis had not triggered a flight of capital to the US, and governments remained able to borrow at the pre-war costs of funding. More concerning, a range of indicators – implied volatility, credit default swap spread, cross-currency basis – suggest a significant and sustained increase in systemic financial stress. Through a state-dependent model, I show that energy importers and nations that share borders or have close trade and military ties with the belligerents were more affected by war shocks. Taken together, these findings may inform policy responses and assist households and firms in preparing for possible contingencies arising from the war.",
        "DOI": "10.1016/j.iref.2023.07.064",
        "paper_author": "Tong E.",
        "affiliation_name": "Reserve Bank of New Zealand",
        "affiliation_city": "Wellington",
        "affiliation_country": "New Zealand",
        "affiliation_id": "60078729",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of climate risk on technological progress under the fourth industrial era",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "21",
        "cover_date": "2024-05-01",
        "Abstract": "Identifying the vital role of climate risk in developing technology is significant to promote the Fourth Industrial Revolution. The research utilises the full and sub-sample methodologies to capture the connection of the Southern Oscillation Index (SOI) and technological progress (TP) from the global perspective. In light of the quantitative discussion, we conclude that positive and adverse effects exist of SOI on TP, and the favourable one suggests that the La Nina phenomenon promotes technological progress. However, this opinion cannot be established in the adverse effect of SOI on TP that accompanies the La Nina phenomenon, which is primarily caused by the global financial crisis. Other adverse effects that accompany the El Nino phenomena point out that these climate risks are conducive to developing technology. In turn, the favourable and adverse influences from TP to SOI are accompanied by the El Nino phenomenon and La Nina event respectively, underlining that the development of technology is beneficial for alleviating climate risk. In the context of an increasingly severe climate crisis and a new round of scientific and technological revolution, this article will put forward valuable suggestions to tackle climate risk in the context of the Fourth Industrial Revolution.",
        "DOI": "10.1016/j.techfore.2024.123325",
        "paper_author": "Qin M.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Return and volatility spillovers among oil price shocks and international green bond markets",
        "publication": "Research in International Business and Finance",
        "citied_by": "21",
        "cover_date": "2024-04-01",
        "Abstract": "We analyse the spillover effects between oil price shocks and green bonds issued in twelve developed economies. We decompose oil price shocks into demand, risk and supply shocks. We employ daily data from December 2008 to June 2022 enabling us to cover major global crisis episodes such as the global financial crisis, European sovereign debt crisis, Covid-19 pandemic, Russia-Ukraine conflict, and the corresponding boom and bust in energy markets. Our results show the dominance of the US and the European green bond markets as the main contributors to return and volatility spillovers among international green bonds, respectively. The degree of connectedness among markets varies over time with a more pronounced effect on returns during turbulent periods. Oil shocks exhibit a relatively low degree of connectedness with green bonds implying potential diversification attributes. This result is, particularly, supported in the case of green bond markets of USA, Euro, Denmark and Hong-Kong.",
        "DOI": "10.1016/j.ribaf.2024.102254",
        "paper_author": "Umar Z.",
        "affiliation_name": "Zayed University",
        "affiliation_city": "Dubai",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60070818",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Tackling municipal solid waste crisis in India: Insights into cutting-edge technologies and risk assessment",
        "publication": "Science of the Total Environment",
        "citied_by": "21",
        "cover_date": "2024-03-20",
        "Abstract": "Municipal Solid Waste (MSW) management is a pressing global concern, with increasing interest in Waste-to-Energy Technologies (WTE-T) to divert waste from landfills. However, WTE-T adoption is hindered by financial uncertainties. The economic benefits of MSW treatment and energy generation must be balanced against environmental impact. Integrating cutting-edge technologies like Artificial Intelligence (AI) can enhance MSW management strategies and facilitate WTE-T adoption. This review paper explores waste classification, generation, and disposal methods, emphasizing public awareness to reduce waste. It discusses AI's role in waste management, including route optimization, waste composition forecasting, and process parameter optimization for energy generation. Various energy production techniques from MSW, such as high-solids anaerobic digestion, torrefaction, plasma pyrolysis, incineration, gasification, biodegradation, and hydrothermal carbonization, are examined for their advantages and challenges. The paper emphasizes risk assessment in MSW management, covering chemical, mechanical, biological, and health-related risks, aiming to identify and mitigate potential adverse effects. Electronic waste (E-waste) impact on human health and the environment is thoroughly discussed, highlighting the release of hazardous substances and their contribution to air, soil, and water pollution. The paper advocates for circular economy (CE) principles and waste-to-energy solutions to achieve sustainable waste management. It also addresses complexities and constraints faced by developing nations and proposes strategies to overcome them. In conclusion, this comprehensive review underscores the importance of risk assessment, the potential of AI and waste-to-energy solutions, and the need for sustainable waste management to safeguard public health and the environment.",
        "DOI": "10.1016/j.scitotenv.2024.170453",
        "paper_author": "Singh M.",
        "affiliation_name": "Kirori Mal College",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60114099",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Blockchain technology in a crisis: Advantages, challenges, and lessons learned for enhancing food supply chains during the COVID-19 pandemic",
        "publication": "Journal of Cleaner Production",
        "citied_by": "21",
        "cover_date": "2024-01-01",
        "Abstract": "This study explores the implementation of blockchain technology in the Chinese food supply chain during the COVID-19 pandemic and examines its advantages and challenges. This study uses an interpretive research strategy and theoretical framework to gather positive feedback on blockchain technology from the fresh vegetable food industry, online retailers, state-owned enterprises, the meat industry, the dairy industry, and retail stores. These findings highlight the potential benefits of blockchain, including enhanced efficiency, transparency, reliability, and traceability in the food supply chain. However, difficulties with labor data management, interoperability, data accuracy, financial constraints, and regulatory considerations have been identified. This study collects comprehensive data on labor management, standardized protocols, verification mechanisms, barrier-reduction efforts, and collaboration with stakeholders and regulators to address these challenges. This study aimed to create a more resilient and efficient food supply chain system by providing a roadmap for prioritizing improvements. The practical implications include risk management strategies, targeted support for farmers, and investments in sustainable agricultural practices to ensure food security. Overall, this study provides valuable insights for harnessing the potential of blockchain technology to strengthen the Chinese food supply chain amid crises.",
        "DOI": "10.1016/j.jclepro.2023.140034",
        "paper_author": "Akram M.W.",
        "affiliation_name": "Ningbo China Institute for Supply Chain Innovation",
        "affiliation_city": "Ningbo",
        "affiliation_country": "China",
        "affiliation_id": "124868723",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "‘Beyond GDP’ in cities: Assessing alternative approaches to urban economic development",
        "publication": "Urban Studies",
        "citied_by": "21",
        "cover_date": "2024-05-01",
        "Abstract": "Crises spur reflection and re-evaluation of what matters and what is valued. The impacts of the 2008 global financial crisis, COVID-19 pandemic and climate emergency are reigniting debates about the nature of economic development approaches and what they aim to achieve in urban settings. Addressing a substantive gap in contemporary debates by helping to navigate a burgeoning and diverse field, this paper provides a critical and comparative assessment of five leading agendas that have been positioned as alternative and progressive policy responses to urban economic change: inclusive growth; the wellbeing economy; community wealth building; doughnut economics; and the foundational economy. Taking an international perspective, the paper provides a comparative review of their stated visions, mechanisms for change, and the spatial scales through which they are led and implemented. Our argument is that these alternative approaches to urban economic development are shaping creative, innovative and progressive responses to longstanding urban problems within policy and practice communities but require on-going scrutiny and evaluation to realise their potential to meaningfully achieve transformative change.",
        "DOI": "10.1177/00420980231187884",
        "paper_author": "Crisp R.",
        "affiliation_name": "Sheffield Hallam University",
        "affiliation_city": "Sheffield",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60032204",
        "affiliation_state": "South Yorkshire"
    },
    {
        "paper_title": "The impact of COVID-19 on financial structure and performance of Islamic banks: a comparative study with conventional banks in the GCC countries",
        "publication": "Journal of Economic and Administrative Sciences",
        "citied_by": "20",
        "cover_date": "2024-11-27",
        "Abstract": "Purpose: The aim of this paper has twofold: (1) to explain and compare the financial evolution of Islamic and conventional banking sector in the Gulf Cooperative Council (GCC) countries before and during the COVID-19 pandemic and (2) to explore the key success factors that might affect Islamic and conventional banks performance before and mainly during COVID-19 pandemic period. Design/methodology/approach: Orbis Bank Focus database and annual financial reports are used to collect financial information of Islamic and conventional banks in GCC countries over four years: 2017, 2018, 2019 and 2020. Descriptive statistics, T-test, multiple regression, and 2SLS and GMM models are employed to analyze the financial structure and performance of Islamic and conventional banks before and during the COVID-19 pandemic period. Findings: Results of this study reveal that (1) there is a significant difference between Islamic banks and conventional banks during the crisis of COVID-19, where the conventional banks have presented a higher level of financial performance and financial liquidity than their Islamic counterparts, (2) conventional banks have revealed higher capacity to manage their financial risk during the crisis period, and (3) a high level of non-performing loan, high inflation rate and high percentage of non-important cost have a negative impact on the financial performance of Islamic banks mainly during the pandemic period of COVID-19. However, the result indicates that a high level of liquidity risk increased the performance of Islamic banks but this impact falls sharply during the pandemic period. Originality/value: This study provides information that supports investors, regulators and executive managers in GCC countries. A well-structured balance sheet would improve the financial performance and risk management of the banking sector in GCC countries, especially in times of crisis and pandemics.",
        "DOI": "10.1108/JEAS-07-2021-0138",
        "paper_author": "El-Chaarani H.",
        "affiliation_name": "Beirut Arab University",
        "affiliation_city": "Beirut",
        "affiliation_country": "Lebanon",
        "affiliation_id": "60068763",
        "affiliation_state": "Mount Lebanon"
    },
    {
        "paper_title": "Key audit matters and auditing quality in the era of COVID-19 pandemic: the case of Jordan",
        "publication": "International Journal of Law and Management",
        "citied_by": "20",
        "cover_date": "2024-05-21",
        "Abstract": "Purpose: This study aims to investigate the moderating effect of the COVID-19 epidemic on the relationship between key audit matter (KAM) and auditing quality. Design/methodology/approach: The authors use the ordinary least squares regression on data from 942 firm-year observations of Jordanian non-financial institutions across the period (2017–2022) to test the hypotheses. The authors use content analysis method to measure levels of KAM disclosure. Findings: The investigation’s findings highlight the importance of KAM disclosure in achieving audit quality in line with international standard on auditing no. 701 (ISA-701) requirements. COVID-19 is also found to have a positive relationship with audit quality, further confirming the crisis’s devastating impact on audit complexity and risks and providing evidence for the need for supplementary, high-quality audit services. Due to the correlation between KAM disclosure and increased auditor workload and responsibility, the analysis reveals that the COVID-19 factor strengthens the link between KAM disclosure and audit quality. Practical implications: This study has the potential to be used as a basis for the creation of a new regulation or standard regarding the reporting of unfavourable events in financial filings. This study’s findings provide standard-setters, regulators and policymakers with current empirical data on the effects of implementing ISA-701’s mandate for external auditors to provide more information on KAM. The COVID-19 crisis offers a suitable setting in which to examine the value of precautionary disclosures in times of economic uncertainty, as well as the significance of confidence interval disclosures and the role of external auditing in calming investor fears. This analysis is helpful for stakeholders, regulatory agencies, standard-setters and readers of audit reports who are curious about the current state of KAM disclosures and the implementation of ISA-701. The results may have ramifications for academia in the form of a call for more evidence expanding this data to other burgeoning fields to have a clear explanation of the real impact of reporting KAM on audit practices. Originality/value: To the authors’ awareness, this research is one of the few empirical studies on the effect of the COVID-19 crisis on auditing procedures, and more specifically, the effect of disclosures on KAM by external auditors on audit quality. This study’s findings represent preliminary scientific evidence linking the pandemic to business performance. Minimal research has been done on how auditors in developing nations react to pandemic investor protection and how auditors’ enlarged reporting responsibilities affect them. The vast majority of auditing studies have been conducted in a highly regulated system, so this research contributes by examining audit behaviour in a weak legal context.",
        "DOI": "10.1108/IJLMA-11-2023-0248",
        "paper_author": "Alharasis E.E.",
        "affiliation_name": "Mutah University",
        "affiliation_city": "Karak",
        "affiliation_country": "Jordan",
        "affiliation_id": "60035301",
        "affiliation_state": "Karak"
    },
    {
        "paper_title": "FinTech and sustainable financing for low carbon energy transitions: A biodiversity and natural resource perspective in BRICS economies",
        "publication": "Resources Policy",
        "citied_by": "20",
        "cover_date": "2024-01-01",
        "Abstract": "BRICS countries grapple with formidable challenges, declining biodiversity, and energy crises. This study examines the transformative potential of financial technology and sustainable financing in driving low-carbon energy transitions. It aims to achieve two objectives: first, to investigate the effectiveness of FinTech and sustainable financing in driving low-carbon energy transitions; and second, to probe the relationship between these mechanisms and the imperatives of biodiversity and sustainable natural resource utilization in the context of BRICS economies. Through the application of advanced econometric techniques such as fully modified OLS (FMOLS), dynamic OLS (DOLS), fixed effect-OLS (FE-OLS), and Method of Moments Quantile Regression (MMQR), this study investigates the impact of FinTech, sustainable financing, and biodiversity and natural resource utilization on low-carbon energy transitions. Our empirical findings underscore a robust, long-term co-integrating relationship among low-carbon energy advancement, financial technology, financial development, biodiversity preservation, and natural resource utilization. Notably, both FinTech innovations and accessible sustainable financing mechanisms positively influence the adoption of low-carbon energy practices. Moreover, economies rich in biodiversity and with higher income levels exhibit a strong inclination toward low-carbon energy sources. However, overreliance on natural resource extraction hampers the sustained adoption of low-carbon energy practices. This study recommends strategies that leverage FinTech and sustainable financing, while emphasizing the importance of safeguarding natural resources and promoting environmental management. These measures effectively address the energy crisis and foster policies and practices for low-carbon energy transitions.",
        "DOI": "10.1016/j.resourpol.2023.104486",
        "paper_author": "Zeng L.",
        "affiliation_name": "Minzu University of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60032275",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Bank performance before and during the COVID-19 crisis: Does efficiency play a role?",
        "publication": "Review of Managerial Science",
        "citied_by": "20",
        "cover_date": "2024-01-01",
        "Abstract": "This study aims to evaluate the effect of efficiency and banking market structure on bank performance in the Middle East and North Africa (MENA) region. The relationship between efficiency and bank performance in the countries in the MENA region during the COVID-19 outbreak has not been examined. We use data for 225 banks in 18 MENA countries and find that bank performance strongly depends on the efficiency level and market power of banks. Furthermore, we investigate whether efficiency and market competition effects are significantly different between the two banking systems (Islamic and conventional). Our results indicate that efficiency and competition have a greater influence on the profitability level of conventional than Islamic banks. However, the efficiency impact is only marginally significant during the COVID-19 outbreak. Overall, our results suggest that managing a higher efficiency level leads to improved financial stability but, at the same time, increases the bank's appetite for taking higher risks. These findings deepen the existing notion that efficient banks are more resilient during global financial crises and emphasize the importance of bank regulatory reforms that boost efficiency in standing against the negative consequences of the recent (COVID-19) crisis.",
        "DOI": "10.1007/s11846-022-00611-y",
        "paper_author": "Mateev M.",
        "affiliation_name": "Abu Dhabi School of Management",
        "affiliation_city": "Abu Dhabi",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60113237",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "Breaking carbon lock-in: the role of green financial inclusion for China",
        "publication": "Journal of Environmental Planning and Management",
        "citied_by": "20",
        "cover_date": "2024-01-01",
        "Abstract": "This article evaluates the composite index of carbon lock-in (CLI), and then examines whether green financial inclusion (GFI) can help to explain the pace of CLI in 283 Chinese cities for the period 2010–2017. We also conduct four heterogeneous analyses, and detect the asymmetric, threshold, and mediating effects in the GFI-CLI nexus. The primary findings reveal that: (1) GFI plays a significant role in CLI abatement; (2) the restraining effect of GFI on CLI is more significant in eastern China, first-tier cities, non-resource-based cities, and capital cities; (3) GFI shows an asymmetric correlation with CLI at various quantiles. Moreover, internet penetration would enhance such a negative relationship; (4) GFI has an indirect acceleration effect of eliminating CLI through the channels of innovation, government support, and development of the digital economy. Following the above findings, we propose some suggestions related to climate change mitigation and GFI evolution.",
        "DOI": "10.1080/09640568.2022.2125368",
        "paper_author": "Zhao C.",
        "affiliation_name": "University of International Business and Economics",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60013503",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A critical review of AI in accounting education: Threat and opportunity",
        "publication": "Critical Perspectives on Accounting",
        "citied_by": "19",
        "cover_date": "2024-03-01",
        "Abstract": "In this essay, we contribute to the limited literature that has critically examined the potential implications of generative AI on the accounting academy and accounting education (AE). We argue that the recent accelerated growth of AI, especially large language models (LLMs) such as ChatGPT, raises significant issues and challenges that the accounting academy needs to urgently address to survive in the long term. Developments in AI have, we suggest, created a ‘change-inducing crisis’, presenting a unique opportunity for accounting academics to address the uncritical and problematic functionalist view of the discipline and the technical reductionism of accounting. Our arguments represent a call for action to embrace AI in learning and teaching practices in a way that brings about a renewed focus on the human dimension of accounting, incorporating broader social and critical perspectives, thereby addressing longstanding calls for change in AE to move beyond the technical, managerial, and financial focus (core of the AE curriculum) that has dominated the discipline for many decades. Accounting academics have a fundamental role to play in recognising the nature of the threats and the associated challenge of AI and to seize the opportunities available in ways that bring both critique and being critical to the fore. However, to bring about the sort of change we argue for in this essay, the accounting academy has to lead to ‘take education back from the market’ and provide the impetus that can make accounting education more relevant to our students and the needs of contemporary society.",
        "DOI": "10.1016/j.cpa.2024.102711",
        "paper_author": "Ballantine J.",
        "affiliation_name": "Ulster University Business School",
        "affiliation_city": "Coleraine",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60171634",
        "affiliation_state": "Londonderry, Northern Ireland"
    },
    {
        "paper_title": "The Impact of Oil Shocks on Systemic Risk of the Commodity Markets",
        "publication": "Journal of Systems Science and Complexity",
        "citied_by": "19",
        "cover_date": "2024-12-01",
        "Abstract": "This study examines the influence of oil shocks on systemic risk spillover among the commodity markets. Specifically, this paper uses the DCC-GARCH approach combined with the TVP-VAR model to calculate risk connectedness and the GARCH-MIDAS model to explore how oil shocks from different sources affect the risk spillover effects among the commodity markets. The results are the following: First, there are significant risk spillovers among the commodity markets with important time-varying characteristics and with sharp changes in times of crisis. The industrial metals, agriculture, precious metals, and light energy commodity markets are risk recipients, and the energy and livestock commodity markets are risk exporters. Second, oil price shocks, particularly oil aggregate demand shocks, prominently affect the total risk connectedness among the commodity markets. In particular, the impact on the net risk spillover effect of different commodity market differs.",
        "DOI": "10.1007/s11424-024-3224-y",
        "paper_author": "Dai Z.",
        "affiliation_name": "Changsha University of Science and Technology",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60001338",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "Dark side whitewashes the benefits of FinTech innovations: a bibliometric overview",
        "publication": "International Journal of Bank Marketing",
        "citied_by": "19",
        "cover_date": "2024-01-22",
        "Abstract": "Purpose: The current study focuses on many risk categories that have emerged in the digital ecosystem of the financial technology industry, which has dramatically changed traditional financial systems as a result of innovations in financial technology. Design/methodology/approach: The Web of Science Core Collection database was used to find a data set of 719 pertinent papers on the subject encompassing the year 2015–2023. The sample procedure was carried out utilising the PRISMA approach. The keywords were first gathered relating to technological risks in banking sectors and after confirming the keywords, the authors performed the search by the “topic” which covers “title” in the search bar. On February 15, 2023, the Web of Science database was searched using the terms “Cyber security risk OR data theft OR financial crimes OR financial stability risk OR operational risk OR default risk OR money laundering OR financial terrorism AND FinTech AND banking sector”. Two-step approach is applied in this study. First, descriptive analysis is applied using RStudio to highlight prominent authors, countries and affiliations. Furthermore, relationship among authors, countries and keywords is shown by using three fields plot. Second, using VOSviewer, co-occurrence of keyword analysis is used to determine the most influential themes. Findings: The findings show that 2,611 documents have been published from 2016 to 2023. Year 2021 is the most productive year in terms of number of publications. The results also show that WANG XC is tied for the position of most prolific contributing author. In a similar vein, the United States leads the world in publication output. Furthermore, Southwestern University of Finance and Economics in China is leading the list with 15 articles. The results from the co-occurrence of keywords reveal that “default risk”, “operational risk”, “money laundering”, “credit risk”, “corporate governance”, “systematic risk”, “financial stability risk”, “risk management” and “crises” are the frequently keywords. Originality/value: The results of this study are beneficial to academia and industry in order to advance their current understanding of FinTech and associated concerns. This work expands the understanding of the technology hazards facing the banking industry from a broad perspective.",
        "DOI": "10.1108/IJBM-10-2022-0438",
        "paper_author": "Asif M.",
        "affiliation_name": "University of Education",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60121158",
        "affiliation_state": "Punjab"
    },
    {
        "paper_title": "Forecasting commodity prices: empirical evidence using deep learning tools",
        "publication": "Annals of Operations Research",
        "citied_by": "19",
        "cover_date": "2024-08-01",
        "Abstract": "Since the last two decades, financial markets have exhibited several transformations owing to recurring crises episodes that has led to the development of alternative assets. Particularly, the commodity market has attracted attention from investors and hedgers. However, the operational research stream has also developed substantially based on the growth of the artificial intelligence field, which includes machine learning and deep learning. The choice of algorithms in both machine learning and deep learning is case-sensitive. Hence, AI practitioners should first attempt solutions related to machine learning algorithms, and if such solutions are unsatisfactory, they must apply deep learning algorithms. Using this perspective, this study aims to investigate the potential of various deep learning basic algorithms for forecasting selected commodity prices. Formally, we use the Bloomberg Commodity Index (noted by the Global Aggregate Index) and its five component indices: Bloomberg Agriculture Subindex, Bloomberg Precious Metals Subindex, Bloomberg Livestock Subindex, Bloomberg Industrial Metals Subindex, and Bloomberg Energy Subindex. Based on daily data from January 2002 (the beginning wave of commodity markets' financialization) to December 2020, results show the effectiveness of the Long Short-Term Memory method as a forecasting tool and the superiority of the Bloomberg Livestock Subindex and Bloomberg Industrial Metals Subindex for assessing other commodities' indices. These findings is important in term for investors in term of risk management as well as policymakers in adjusting public policy, especially during Russian-Ukrainian war.",
        "DOI": "10.1007/s10479-022-05076-6",
        "paper_author": "Ben Ameur H.",
        "affiliation_name": "OMNES Education",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60280903",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Navigating the path to environmental sustainability: Exploring the role of fintech, natural resources and green energy in Belt and Road countries",
        "publication": "Resources Policy",
        "citied_by": "18",
        "cover_date": "2024-01-01",
        "Abstract": "The world is currently facing a major environmental crisis, with rising global warming, sea levels, droughts, and floods. This has particularly affected the poorest nations, leading to increased flooding and droughts that impact their livelihoods. To combat this, nations worldwide need to develop strategies to reverse environmental damage and achieve carbon neutrality. The Belt and Road Initiative (BRI) countries are responsible for a significant portion of pollution, making it crucial for them to take strong climate action. Besides, the financial technology (FNT), renewable energy generation (GEN) and the optimum usage of natural resources (NTR) can help the BRI economies towards Environmental Sustainability. This study used the “Cross-Sectional Autoregressive Distributed Lag Model” (CS-ARDL) model and focused on BRI countrieswhereby the data comprised of obervationsfrom 1990–2020. It was found that FNT can help reduce the cost of financial services and increase financial inclusion while also reducing carbon emissions. However, the use of NTR can have a detrimental effect on achieving environmental targets. It is important to transition towards GEN to reduce CO2 emissions and promote sustainable growth. Popular GEN methods like wind and solar power can significantly reduce emissions and satisfy a large portion of energy needs. BRI countries must take environmental action, promote the use of GEN, incentivize its adoption, encourage the development of FNT, and discourage the use of NTR-related fossil fuels to achieve environmental targets.",
        "DOI": "10.1016/j.resourpol.2023.104485",
        "paper_author": "Li Y.",
        "affiliation_name": "Jingdezhen University",
        "affiliation_city": "Jingdezhen",
        "affiliation_country": "China",
        "affiliation_id": "60271717",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "Connectivity and spillover during crises: Highlighting the prominent and growing role of green energy",
        "publication": "Energy Economics",
        "citied_by": "18",
        "cover_date": "2024-01-01",
        "Abstract": "How influential are green energy instruments? We examine how green- and carbon-energy assets differ regarding transmitting and receiving shocks between normal versus crises periods. Crises include the global financial crisis and Euro debt crisis, two waves of COVID-19, and the ongoing Russia-Ukrainian war. Our empirical illustration is based on volatility impulse function (VIRF) for dynamic conditional correlation–generalised autoregressive conditional heteroskedasticity (DCC-GARCH) method using daily data from January 03, 2007–March 31, 2023, of several green and brown energy instruments and market and energy controls, we evidence asymmetric connectedness that increases during crises. For specific green instruments, volatility transmissions can be transmitting or receiving. However, green instruments stand out overall as prominent transmitters, while brown energy instruments are prominent receivers. Results are consistent with green energy vehicles impacted by macroeconomic and market states and reflecting this to investors. Results are also consistent with green and brown interconnectivity. Further network analysis provides robustness to our study results and suggests this role is evolving. The study results are significant for policy intervention during the transition to alternative energy sectors and for risk and portfolio management implications.",
        "DOI": "10.1016/j.eneco.2023.107224",
        "paper_author": "Banerjee A.K.",
        "affiliation_name": "XLRI, Jamshedpur",
        "affiliation_city": "Jamshedpur",
        "affiliation_country": "India",
        "affiliation_id": "60086128",
        "affiliation_state": "JH"
    },
    {
        "paper_title": "Digital transformation in tourism and hospitality industry: a literature review of blockchain, financial technology, and knowledge management",
        "publication": "EuroMed Journal of Business",
        "citied_by": "18",
        "cover_date": "2024-03-28",
        "Abstract": "Purpose: This study aims to provide a new overview and opportunities of blockchain (BCT), financial technology (fintech) and knowledge management (KM) over the past ten years. Its focus is on their potential to drive new value creation and innovation processes within the digital landscape of the tourism and hospitality. Design/methodology/approach: This systematic literature review and sociotechnical approach employs a literature analysis, analyzing and synthesizing 62 relevant articles published in the past decade form e-databases (Web of Science and Scopus). Findings: This study reveals that researchers frequently discuss the potential advantages and challenges of BCT, fintech and KM in this industry. These include establishing systems that prioritize transparency and traceability, addressing blockchain security concerns, enhancing financial transaction efficiency and trustworthiness, and promoting innovation and improvement through KM strategies. Furthermore, this review suggests that the application of blockchain, fintech and KM has the potential to create new markets and opportunities in the tourism and hospitality industry. This study provides insights into the state and implementation of technology-based and knowledge-based for tourism and hospitality in times of crisis and digitization era. Practical implications: Shifting to new lens (refers to sociotechnical theory), from technology adoption strategy, it is important to stay updated with emerging technologies such as BCT and fintech and upcoming technologies trends must align with tourism and hospitality business objectives, customer expectations and market demands. From the socio-dimension, KM is not confined to technological tools alone. Instead, it is a strategic approach that emphasizes fostering a culture of open communication, collaboration and knowledge sharing within the team of tourism and hospitality industry. Originality/value: Through a literature review approach, this study establishes a new foundation in tourism and hospitality such as analyzing research gaps, understanding benefits and challenges, supporting methodologies/theoretical frameworks and informing the future research opportunities. Additionally, a novel contribution is the inclusion of sociotechnical approach that is allocated into socio or knowledge resources perspective (knowledge management), and technical or technology perspective (blockchain and fintech) that drives tourism and hospitality innovation.",
        "DOI": "10.1108/EMJB-04-2023-0118",
        "paper_author": "Ratna S.",
        "affiliation_name": "Islamic University of Kalimantan",
        "affiliation_city": "Banjarmasin",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60108868",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Stock Market Response to Quantitative Easing: Evidence from the Novel Rolling Windows Nonparametric Causality-in-Quantiles Approach",
        "publication": "Computational Economics",
        "citied_by": "18",
        "cover_date": "2024-08-01",
        "Abstract": "The US Federal Reserve has been using quantitative easing as an unconventional monetary policy tool for providing liquidity and credit-market facilities to banks, and undertaking large-scale asset purchases in periods of crisis. This study carefully examines whether the US stock market has been responsive to the use of quantitative easing over time. A major contribution of this study to the extant literature is the introduction of the novel rolling windows nonparametric causality-in-quantiles approach to studying the reaction of the stock market to quantitative easing. This approach provides a means of investigating the time-varying causality between the variables across quantiles. The standard nonparametric causality-in-quantiles test results show that stock market performance is significantly predicted by quantitative easing, except at very low and very high levels of stock returns (volatility). The rolling windows nonparametric causality-in-quantiles test results indicate that the causal effect of quantitative easing on stock market volatility and returns becomes pronounced during periods of crisis. The reactions are most significant in periods corresponding to the Asian financial crisis, the global financial crisis and the COVID-19 pandemic outbreak. Overall, the causal effect of quantitative easing on both stock market returns and volatility changes through time; the effect on stock market returns is also greater than on stock market volatility.",
        "DOI": "10.1007/s10614-023-10450-y",
        "paper_author": "Olasehinde-Williams G.",
        "affiliation_name": "Istanbul Ticaret Üniversitesi",
        "affiliation_city": "Istanbul",
        "affiliation_country": "Turkey",
        "affiliation_id": "60079634",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Exchange Rate and Stock Prices Volatility Connectedness and Spillover during Pandemic Induced-Crises: Evidence from BRICS Countries",
        "publication": "Asia-Pacific Financial Markets",
        "citied_by": "18",
        "cover_date": "2024-03-01",
        "Abstract": "This paper investigated exchange rate and stock price volatility connectedness and spillover in Brazil, Russia, India, China, and South Africa (BRICS) during pandemic-induced crises. We first extracted volatility using the Generalized Auto-Regressive Conditional Heteroskedasticity (GARCH) model. Then volatility connectedness and spillover were investigated by using (Diebold and Yilmaz, International Journal of Forecasting, 28(1), 57–66, 2012) method. We find that exchange rate volatility and stock return volatilities are connected during pandemic-induced crises. The study also finds volatilities spillover among countries in the sample. Russia has strong volatility connectedness with India in these financial markets. The direction of volatility spillover is from Russia to India. Similarly, Brazil has strong volatility connectedness with South Africa and the direction volatility spillover is from Brazil to South Africa. Finally, China has a weak volatility connection with the remaining BRICS countries. Thus, the volatility transfer in these financial markets and across BRICS countries has economic implications.",
        "DOI": "10.1007/s10690-023-09411-0",
        "paper_author": "Hussain M.",
        "affiliation_name": "Sohar University",
        "affiliation_city": "Sohar",
        "affiliation_country": "Oman",
        "affiliation_id": "60071785",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Building resilience and sustainable HRM in the visitor economy: An uneasy relationship",
        "publication": "Journal of Hospitality and Tourism Management",
        "citied_by": "18",
        "cover_date": "2024-03-01",
        "Abstract": "This paper draws on small and medium enterprises' (SMEs') experiences of the 2019/2020 Victorian (Australia) bushfires and COVID-19 to explore organizations' capacity to achieve Sustainable Human Resource Management (S-HRM) and organizational resilience outcomes within crisis contexts. The study adopts a qualitative research design. Virtual, semi-structured interviews were conducted with 33 stakeholders across two, contextually different tourism destinations (Bright and Echuca-Moama located in Victoria, Australia). Thematic analysis was undertaken. Findings present a mixed picture. Macro, meso and micro-level factors such as business type, location and workforce management; owner-managers’ skill sets and networks; prior experience of crises; individual wellbeing; government crisis management processes; and housing shortages were found to influence SMEs' sustainability and resilience outcomes. Tensions faced by SMEs, such as dilemmas between financial versus social sustainability, and employee versus business owner wellbeing, were revealed. Inspired by the UN's Sustainable Development Goal (SDG 8), the paper brings together literature from sustainable HRM and resilience to discuss how SMEs in the tourism and hospitality sector can nurture social outcomes and organizational resilience. This is a timely conversation given COVID-induced workplace disruptions, and the likelihood of future shocks.",
        "DOI": "10.1016/j.jhtm.2023.05.006",
        "paper_author": "Gamage A.",
        "affiliation_name": "Victoria University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60006234",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Green policies and financial development in G7 economies: An in-depth analysis of environmental regulations and green economic growth",
        "publication": "Natural Resources Forum",
        "citied_by": "17",
        "cover_date": "2024-01-01",
        "Abstract": "This comprehensive study explores the nuanced relationship between financial development and its determinants within the G7 nations, spanning the years 1990 to 2020. Motivated by the need to understand long-term financial trends, we meticulously analyze key variables including total natural resource rent, Environmental Policy Stringency Index, total energy consumption, green gross domestic product (GDP), and foreign direct investment inflow. Employing rigorous diagnostic tests to ensure the robustness of our findings, advanced methodologies such as “Method of Moment Quantile Regression,” along with simulations of “Bootstrap Quantile Regression,\" “Panel Corrected Standard Errors,” and “Feasible Generalized Least Squares” regressions uncover the statistical significance and practical implications of our results. Our pivotal findings carry substantial implications for both individual G7 member states and the collective group. Highlighting a positive correlation between stringent environmental policies, measured by the Environmental Policy Stringency Index, and financial development, our study emphasizes the imperative for these nations to align economic and environmental policies. Striking a harmonious balance between resource management and sustainable environmental regulations not only fosters financial growth but also addresses global environmental concerns. Furthermore, the adverse impact of total energy consumption on financial development underscores the urgent need for G7 nations to prioritize energy efficiency and transition to sustainable sources, aligning with the global trend towards eco-friendly practices. In response to these critical findings, we propose actionable policy measures. To align with the growing climate crisis and standardize green finance practices, we advocate for the establishment of a jointly funded Climate Resilience and Adaptation Fund and a unified Green Bond Framework within the G7. These measures not only enhance climate resilience and streamline sustainable investments but also demonstrate the G7's collective commitment to a greener and more prosperous future.",
        "DOI": "10.1111/1477-8947.12424",
        "paper_author": "Wang W.",
        "affiliation_name": "Anhui Public Security College",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "112918309",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Dynamic interlinkages between carbon risk and volatility of green and renewable energy: A TVP-VAR analysis",
        "publication": "Research in International Business and Finance",
        "citied_by": "17",
        "cover_date": "2024-04-01",
        "Abstract": "Our paper applies a time-varying parameter vector autoregression (TVP-VAR) in combination with an extended joint connectedness approach to investigate interlinkages among carbon emissions futures and the volatility of the renewable energy sector. The findings show that the system-wide dynamic connectedness realized a peak in early 2020 in the wake of the COVID-19 crisis. Net total directional connectedness proves that carbon emissions futures and wind energy play the roles of both net transmitters and net receivers of shocks in both periods – before and after the pandemic. The findings of this paper can support policy formulations to avoid rapid fluctuations in carbon prices, make the carbon price table, and limit the negative effect of carbon risk on the energy market, while promoting the protection of systemic financial risks in the renewable energy sector and ensuring a green energy supply.",
        "DOI": "10.1016/j.ribaf.2024.102278",
        "paper_author": "Ha L.T.",
        "affiliation_name": "National Economics University Hanoi",
        "affiliation_city": "Hanoi",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60071407",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Frequency spillovers between oil shocks and stock markets of top oil-producing and -consuming economies",
        "publication": "Energy",
        "citied_by": "17",
        "cover_date": "2024-03-15",
        "Abstract": "Motivated by large oil price swings, high economic and geopolitical uncertainties, and the financialization of oil, this paper examines the frequency spillovers and co-movements between oil shocks (risk and demand) and the stock markets of top oil-producer and consumer countries, namely, Canada, China, Russia, Saudi Arabia, and the US. The analysis uses the time-domain spillover index of [1], the frequency-domain spillover of [2]; and the wavelet coherence approach. The findings reveal that spillovers run from the U.S., Canada, and, to a lesser extent, Russia to oil shocks. On the other hand, oil shocks, Saudi Arabia, and China constitute net receivers of shocks. The intensity of spillovers is heavier in the short-term frequency than in the intermediate- and long-term. Furthermore, the direction of spillovers is more defined in the long-term. The U.S. stock market exerts a strong impact on oil risk in general, but the impact is stronger in the short-term. Conversely, an oil demand shock is susceptible to innovations from Canada and Russia that are stronger in the long-term. This means that oil risk shock stemming from innovations in financial markets is short-lived and dissipates quickly due to quick reactions from market participants. On the contrary, long-term links characterize the relationship between oil demand shock and financial markets, mirroring the macroeconomic nature of the linkages. Finally, while the 2008 crisis, EDC, oil price crash, and the COVID-19 pandemic coincided with strong spillovers in the short-term, the COVID-19 era was marked by higher spillovers in the long term. The findings provide important information for investors and policymakers in terms of diversification, risk management, and efforts to mitigate contagion.",
        "DOI": "10.1016/j.energy.2024.130239",
        "paper_author": "Ziadat S.A.",
        "affiliation_name": "Al-Ahliyya Amman University",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60058937",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Environmental performance and corporate tax avoidance: Greenwashing policy or eco-responsibility? The moderating role of ownership structure",
        "publication": "Journal of Cleaner Production",
        "citied_by": "17",
        "cover_date": "2024-01-01",
        "Abstract": "This study examines the impact of environmental performance on tax avoidance separately and then moderated by institutional and family ownership. Based on a sample of 222 French firms from 2009 to 2021, the results show that environmental performance is positively associated with tax avoidance. Moreover, the study reveals that this relationship is significantly moderated by institutional and family ownership. Specifically, institutional investors and family shareholders separately amplify the positive impact of environmental performance on tax avoidance. The research also presents further evidence indicating that all three dimensions of environmental performance—resource consumption, emissions, and eco-innovation—are positively linked to tax avoidance. Notably, this effect becomes prominent post the Paris Agreement. Even when accounting for the impact of major financial crises such as the Great Financial Crisis and the COVID-19 pandemic, the findings remain consistent. These results maintain their robustness when alternative measures of tax avoidance are considered. Overall, this study provides valuable insights with implications for regulators, authorities, and investors.",
        "DOI": "10.1016/j.jclepro.2023.140152",
        "paper_author": "Souguir Z.",
        "affiliation_name": "Ecole Supérieure de Commerce de Tunis",
        "affiliation_city": "Manouba",
        "affiliation_country": "Tunisia",
        "affiliation_id": "60091638",
        "affiliation_state": "Manouba"
    },
    {
        "paper_title": "ESG activity and bank lending during financial crises",
        "publication": "Journal of Financial Stability",
        "citied_by": "17",
        "cover_date": "2024-02-01",
        "Abstract": "This paper explores how banks’ environmental, social, and governance (ESG) activities affect their lending during financial crises. We use a sample of European listed banks with available ESG scores from 2002 to 2020 and consider the global financial crisis of 2007–2009 and the European sovereign debt crisis of 2010–2012. We estimate a two-step system GMM dynamic panel data model and also address potential endogeneity with instrumental variable (IV) and difference-in-difference (DiD) estimations. We find that lending falls to a lesser extent for banks with higher ESG scores during crisis times. Our findings are robust to using alternative ESG rating providers. An investigation of the different potential channels shows that, during crises, banks more engaged in ESG activities are less affected in terms of credit risk, asset risk, and profitability. They also face a lower reduction in market funding, allowing them to downsize to a lesser extent during crises, and their deposit rates do not increase as much as in less ESG-engaged banks. A deeper investigation reveals that our findings mainly hold for banks focused on traditional lending and deposit activities and are essentially driven by the environmental pillar component of ESG scores and the global financial crisis of 2007–2009.",
        "DOI": "10.1016/j.jfs.2023.101206",
        "paper_author": "Danisman G.O.",
        "affiliation_name": "Istanbul Bilgi Üniversitesi",
        "affiliation_city": "Istanbul",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60009715",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Navigating the storm: the SME way of tackling the pandemic crisis",
        "publication": "Small Business Economics",
        "citied_by": "17",
        "cover_date": "2024-06-01",
        "Abstract": "Small and medium-sized enterprises (SMEs) are a major contributor to economic growth and a potential source of growth and employment globally. This article employs a bibliometric analysis approach to examine 135 research articles focused on the barriers encountered by SMEs and their strategic responses during the COVID-19 pandemic. Through this analysis, we present a conceptual diagram that highlights prominent challenges, including organizational barriers (e.g., financial crisis, liquidity constraints, and reduced purchasing power), operational barriers (e.g., scarcity of skilled workforce and limited access to raw materials), technological barriers (e.g., digitalization and forecasting capabilities), and strategic restrictions (e.g., resource limitations and disruptions in supply chains). We further explore approaches to overcoming these barriers, such as entrepreneurial resilience and innovation. The findings of this review underscore the importance of government policies aimed at supporting SMEs and facilitating their survival in the aftermath of crises. Moreover, given the impact of COVID-19, policies should also prioritize the involvement of SMEs and business owners in decision-making processes related to policy responses and recovery strategies.",
        "DOI": "10.1007/s11187-023-00810-1",
        "paper_author": "Sharma G.D.",
        "affiliation_name": "Guru Gobind Singh Indraprastha University",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60012304",
        "affiliation_state": "DL"
    },
    {
        "paper_title": "Green management, access to credit, and firms’ vulnerability to the COVID-19 crisis",
        "publication": "Small Business Economics",
        "citied_by": "17",
        "cover_date": "2024-01-01",
        "Abstract": "This paper investigates the consequences of the COVID-19 crisis on firms’ performance and financial vulnerability. Exploiting longitudinal firm-level data from the World Bank’s “Enterprise Surveys follow-up on COVID-19” for 20 European countries, we assess whether green management quality and pre-pandemic credit access difficulties affect firms’ ability to withstand the negative impact of the pandemic. Our results indicate that green firms are more resilient to the pandemic shock. In particular, the likelihood of pandemic-induced drops in sales and liquidity significantly decreases as the quality of green management improves. Conversely, prior financing constraints strongly exacerbate the pandemic’s impact on firms’ performance and amplify liquidity stress and financing problems. Credit-constrained enterprises are not only more likely to experience liquidity shortages and repayment problems, but they also face higher difficulties in accessing bank financing. The COVID-19 crisis has also hampered the beneficial role that green management exerted on access to credit in the pre-pandemic period. During the pandemic, firms with sound environmental management practices do not benefit from improved access to finance and have a lower demand for credit, possibly suggesting a slowdown in their green investment activities.",
        "DOI": "10.1007/s11187-023-00759-1",
        "paper_author": "Aristei D.",
        "affiliation_name": "Università degli Studi di Perugia",
        "affiliation_city": "Perugia",
        "affiliation_country": "Italy",
        "affiliation_id": "60003003",
        "affiliation_state": "PG"
    },
    {
        "paper_title": "Entrepreneurship in Times of Crisis: A Comprehensive Review with Future Directions",
        "publication": "Entrepreneurship Research Journal",
        "citied_by": "17",
        "cover_date": "2024-07-01",
        "Abstract": "Despite an increased interest in crises within the field of entrepreneurship, there is still a lack of understanding about the interplay between different types of crises and entrepreneurship. In addition, the specific circumstances surrounding each type of crisis may also cause the conclusions of these studies to diverge or converge. To enhance our theoretical understanding of entrepreneurship during times of crisis, our review seeks to answer the following research questions: (1) How are the different types of crises addressed in entrepreneurship literature, and what similarities and differences exist? (2) How can we broaden our understanding and deepen our insights into the relationship between a crisis and entrepreneurship? In an effort to review the largest possible variety of crises that extends beyond political crises, natural disasters, and financial crises, we have also included a number of recent studies that examined COVID-19 from an entrepreneurial perspective. Following this, our study identifies six types of crises along with corresponding research themes, key findings, and critical shortcomings. This review also identifies multiple research gaps and suggests several future research directions, as well as theoretical approaches that researchers can take to build upon existing discussions surrounding entrepreneurship in times of crisis.",
        "DOI": "10.1515/erj-2022-0366",
        "paper_author": "Lee Y.",
        "affiliation_name": "Induk University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60121808",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Bank capital regulation and risk after the Global Financial Crisis",
        "publication": "Journal of Financial Stability",
        "citied_by": "17",
        "cover_date": "2024-10-01",
        "Abstract": "We explore and summarize the evolution in bank capital regulations and bank risk after the global financial crisis. Using a new survey of bank regulation and supervision covering more than 120 economies, we show that regulatory capital increased, but some elements of capital regulations became laxer. Analyzing bank-level data, we also document the importance of defining bank regulatory capital narrowly as the quality of capital matters in reducing bank risk. This is particularly true for banks that have more discretion in the computation of regulatory capital ratios and are subject to weaker market monitoring.",
        "DOI": "10.1016/j.jfs.2021.100891",
        "paper_author": "Anginer D.",
        "affiliation_name": "Beedie School of Business",
        "affiliation_city": "Burnaby",
        "affiliation_country": "Canada",
        "affiliation_id": "60113134",
        "affiliation_state": "BC"
    },
    {
        "paper_title": "Integrating digital and global transformations in forecasting regional growth: the MASST5 model",
        "publication": "Spatial Economic Analysis",
        "citied_by": "16",
        "cover_date": "2024-01-01",
        "Abstract": "During the past decade, world economic development was coupled with disruptive challenges. Among them, digitalisation and new forms of globalisation represent a potential threat for economic growth opportunities and for the future of labour markets. Digital transition calls for the assessment of the impact of robotisation and digitalisation on skill composition, employment levels, productivity and growth dynamics. In turn, the largest wave of globalisation after that taking place before the First World War caused, first, the emergence of global value chains and, more recently, their disintegration with partial mechanisms of reshoring, with consequences for growth and employment opportunities. All these challenges call for comprehensive approaches to their modelling. This paper presents the main advances introduced in the fifth generation of the MAcroeconomic, Sectoral, Social, Territorial (MASST5) model, which carved a relevant niche in the empirical literature on macro-econometric regional growth, and has now been strengthened to model future digitalisation transitions, as well as the national and regional breakdown of the way global value chains will reorganise. A longer time series, especially in the regional submodel, also allows one to take the major changes taking place in Europe following the 2007–08 financial crisis, and the 2020 COVID-induced contraction into account.",
        "DOI": "10.1080/17421772.2023.2278514",
        "paper_author": "Capello R.",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Examining supply chain vulnerability via an analysis of ESG-Prioritized firms amid the Russian-Ukrainian conflict",
        "publication": "Journal of Cleaner Production",
        "citied_by": "16",
        "cover_date": "2024-01-01",
        "Abstract": "This research study explores the impact of the ongoing Russian-Ukrainian conflict on ESG-enabled global supply chains, resulting in disruption to worldwide industries. The conflict has caused product shortages, food scarcity, and significantly impacted the global economy. From the extant literature, there is a lack of understanding about the effect of the conflict on different industries from a supply chain perspective, as well as the ESG-prioritized companies. Therefore, this study aims to evaluate the influence of the Russian-Ukrainian conflict on the performance of companies with respect to different regions and industries of their upstream and downstream customers. The top-100 companies in the S&P 500 index which are actively participating in the ESG development are selected and grouped according to customer regions and industries, and the event study analysis is applied to evaluate abnormal returns from stock prices due to the disruption events. Through the empirical analysis, no matter how the ESG-prioritized companies are grouped according to their supply chain structures, it is found that the occurrence of companies obtaining the abnormally high stock return is higher than the occurrence of the opposite. Moreover, the active involvement in ESG disclosure and environmental management demonstrates significant results to withstand disruptions to their supply chains. The findings in this study contribute to a growing body of ESG-related business research, implying that companies which prioritize ESG policies may be better equipped to manage supply chain disruptions during crises.",
        "DOI": "10.1016/j.jclepro.2023.139754",
        "paper_author": "Tsang Y.P.",
        "affiliation_name": "The Hong Kong Polytechnic University",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008928",
        "affiliation_state": "Hong Kong"
    },
    {
        "paper_title": "An investigation on dynamic connectedness of commodity market with financial market during the Russia–Ukraine invasion",
        "publication": "Benchmarking",
        "citied_by": "16",
        "cover_date": "2024-02-08",
        "Abstract": "Purpose: This study unravels an attempt to investigate the dynamic connectedness of agri-commodity (wheat) of Russia with 10 financial markets of wheat importing counties during the Russia–Ukraine invasion. Design/methodology/approach: This study took the daily prices of Wheat FOB Black Sea Index (Russia) along with stock indices of 10 major wheat-importing nations of Russia and Ukraine. The time frame for this study ranges from February 24, 2022 to July 31, 2022. This time frame was selected since it fully examines all of the effects of the crisis. The conditional correlations and volatility spillovers of these indices are predicted using the DCC-GARCH model, Diebold and Yilmaz (2012) and Baruník and Křehlík (2018) models. Findings: It is found that there is dynamic linkage of agri-commodity of with stock markets of Iraq, Pakistan and Tanzania in short run while stock markets of Egypt, Turkey, Bangladesh, Pakistan, Brazil and Iraq are spilled by agri-commodity in long run. In addition, it documents that there is large spillover in short run than medium and long run comparatively. This signifies that investors have more diversification opportunity in short run then long run contemplating to invest in these markets. Originality/value: To the best of the authors’ understanding this is the first study to undertake the dynamic linkage of agri-commodity (wheat) of Russia with financial market of select importing counties during the Russia–Ukraine invasion.",
        "DOI": "10.1108/BIJ-11-2022-0727",
        "paper_author": "Malhotra G.",
        "affiliation_name": "Amity University",
        "affiliation_city": "Noida",
        "affiliation_country": "India",
        "affiliation_id": "60076774",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "Convergence and resilience in border regions",
        "publication": "European Planning Studies",
        "citied_by": "16",
        "cover_date": "2024-01-01",
        "Abstract": "Border regions have often been analyzed regarding cohesion and convergence. However, their development in times of crisis is a relatively new field of interest. This study combines convergence and resilience measurement and explores how both concepts relate. The empirical operationalization is a time series based on GDP trends since the financial crisis for all European border and non-border regions. Firstly, results show that border regions have a lower resistance than non-border regions, but they show a higher recoverability. This finding calls for policy reflections on how to improve short-term resistance in border regions. Secondly, the overall convergence trends are more positive in border regions than in non-border regions. This finding reflects a general catching-up process due to border liberalization and cohesion policy. Thirdly, the more convergent the national state, the more resilient its border regions tend to be. Finally, this study shows that border regions must be seen as territorial objects with high potential and often a strength, but short-term vulnerability is highly relevant.",
        "DOI": "10.1080/09654313.2023.2170214",
        "paper_author": "Hippe S.",
        "affiliation_name": "Friedrich-Alexander-Universität Erlangen-Nürnberg",
        "affiliation_city": "Erlangen",
        "affiliation_country": "Germany",
        "affiliation_id": "60000765",
        "affiliation_state": "Bayern"
    },
    {
        "paper_title": "Multiple paths to enhancing the resilience of project-based organizations from the perspective of CSR configuration: evidence from the Chinese construction industry",
        "publication": "Engineering, Construction and Architectural Management",
        "citied_by": "16",
        "cover_date": "2024-02-01",
        "Abstract": "Purpose: The role of corporate social responsibility (CSR) fulfillment is critical when building resilience of project-based organizations (PBOs). However, fulfilling CSR to build a highly resilient PBO remains a black box problem. This study explores the different CSR combinations that enhance PBO resilience. Design/methodology/approach: This study defines CSR in terms of shareholder, employee, and social CSR, and analyzes corporate characteristics in terms of corporate scale and nature. Data are collected from Hexun.com and the China Stock Market and Accounting Research Database (CSMAR). The qualitative comparative analysis (QCA) method is used to analyze 48 listed construction and engineering companies from China to explore the CSR configurations for PBOs in enhancing organizational resilience. Findings: A large firm size is a necessary condition for high organizational resilience. We find six paths to build high and non-high resilience in PBOs, and the driving mechanisms of high and non-high resilience exhibit an asymmetric relationship. Research limitations/implications: This study cracks the black box of CSR fulfillment and PBO resilience. It reveals the CSR configurations that enhance or inhibit the resilience of PBOs. It also provides scientific basis for PBOs in their fulfillment of CSR in response to crises, and the enhancement of organizational resilience. Future research can be expanded to other industries, as the study sample is only limited to civil engineering construction companies. Since this study uses cross-sectional data, time series can be introduced in the future to further explore the relationship between CSR and organizational resilience. Practical implications: This study provides targeted suggestions that can help decision-makers of construction companies to determine how they can fulfill CSR to enhance organizational resilience. At the same time, it can provide intellectual support for PBOs to cope with systemic crises and promote the fulfillment of CSR. Originality/value: In terms of theoretical value, on the one hand, this study verifies the relationship between CSR fulfillment and PBO resilience, revealing its mechanism of action and multiple paths; on the other hand, it provides a new way of thinking for management research methods and enriches the theoretical study of organizational resilience.",
        "DOI": "10.1108/ECAM-06-2022-0526",
        "paper_author": "Ma T.",
        "affiliation_name": "Hebei University of Science and Technology",
        "affiliation_city": "Shijiazhuang",
        "affiliation_country": "China",
        "affiliation_id": "60025094",
        "affiliation_state": "Hebei"
    },
    {
        "paper_title": "Connectedness between cryptocurrencies, gold and stock markets in the presence of the COVID-19 pandemic",
        "publication": "European Journal of Management and Business Economics",
        "citied_by": "16",
        "cover_date": "2024-10-25",
        "Abstract": "Purpose: This paper analyzes the connectedness with network among the major cryptocurrencies, the G7 stock indexes and the gold price over the coronavirus disease 2019 (COVID-19) pandemic period, in 2020. Design/methodology/approach: This study used a multivariate approach proposed by Diebold and Yilmaz (2009, 2012 and 2014). Findings: For a stock index portfolio, the results of static connectedness showed a higher independence between the stock markets during the COVID-19 crisis. It is worth noting that in general, cryptocurrencies are diversifiers for a stock index portfolio, which enable to reduce volatility especially in the crisis period. Dynamic connectedness results do not significantly differ from those of the static connectedness, the authors just mention that the Bitcoin Gold becomes a net receiver. The scope of connectedness was maintained after the shock for most of the cryptocurrencies, except for the Dash and the Bitcoin Gold, which joined a previous level. In fact, the Bitcoin has always been the biggest net transmitter of volatility connectedness or spillovers during the crisis period. Maker is the biggest net-receiver of volatility from the global system. As for gold, the authors notice that it has remained a net receiver with a significant increase in the network reception during the crisis period, which confirms its safe haven. Originality/value: Overall, the authors conclude that connectedness is shown to be conditional on the extent of economic and financial uncertainties marked by the propagation of the coronavirus while the Bitcoin Gold and Litecoin are the least receivers, leading to the conclusion that they can be diversifiers.",
        "DOI": "10.1108/EJMBE-10-2021-0281",
        "paper_author": "Ghorbel A.",
        "affiliation_name": "FSEG Sfax - Faculté des Sciences Économiques et de Gestion de Sfax",
        "affiliation_city": "Sfax",
        "affiliation_country": "Tunisia",
        "affiliation_id": "60091647",
        "affiliation_state": "Sfax"
    },
    {
        "paper_title": "The impact of blockchain technology on enhancing sustainability in the agri-food sector: A scoping review",
        "publication": "Journal of Cleaner Production",
        "citied_by": "15",
        "cover_date": "2024-06-01",
        "Abstract": "Blockchain technology has the potential to address sustainability challenges in the agri-food industry. This scoping review analyzes 72 papers and finds that blockchain technology can enhance economic, environmental, and social sustainability. By reducing transaction costs, improving transparency, and empowering consumers, it contributes to economic sustainability. Environmental sustainability is enhanced through carbon emissions reduction, waste management, and better environmental impact monitoring. Social sustainability is promoted through food safety, consumer trust, and financial inclusion for small farmers. However, unexplored avenues like obstacle identification, localized solutions, consumer trust factors, crisis resilience, environmental implications, and fair market access require further research. The transformative potential of blockchain in the agri-food industry requires interdisciplinary collaboration to fully harness its benefits for a more sustainable future.",
        "DOI": "10.1016/j.jclepro.2024.142379",
        "paper_author": "Giganti P.",
        "affiliation_name": "Parthenope University of Naples",
        "affiliation_city": "Naples",
        "affiliation_country": "Italy",
        "affiliation_id": "60025235",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Energy security risk and financial development nexus: Disaggregated level evidence from South Korea by cross-quantilogram approach",
        "publication": "Applied Energy",
        "citied_by": "15",
        "cover_date": "2024-06-01",
        "Abstract": "Countries have been aiming to reduce dependence on fossil fuel energy and increase the use of clean energy. In this context, energy security has become one of the most important issues for countries, especially in light of the recent energy crisis that threatens energy security. The financial structure of the countries can be also influential in ensuring energy security. By taking higher fossil fuel energy dependence resulting in higher energy security risk (ESR) and higher financial development (FD) into consideration, the study analyzes how FD affects energy security in South Korea, which is an important case and neglected in the current literature. To do so, the study considers the ESR index as the dependent variable, uses disaggregated level FD indicators as explanatory variables, conducts a novel cross-quantilogram method to account for the quantile dependence, and uses data between 1980/Q2 and 2018/Q4. The findings reveal that (i) disaggregated level FD indicators are powerful estimators of ESR; (ii) the financial markets component has a much stronger effect on ESR than the financial institutions component; (iii) the effect of FD sub-components on ESR varies across quantiles; (vi) the predictive power of the FD indicators on ESR weakens as time (lag) passes. The study emphasizes the critical role of FD on ESR, which implies that South Korean policymakers should consider the significant effect of FD and its sub-components as well as changing structure across quantiles and time-lags in shaping policy framework to ensure energy security. Based on the outcomes, South Korea can benefit from FD to mitigate ESR and ensure economic and environmental sustainability.",
        "DOI": "10.1016/j.apenergy.2024.123135",
        "paper_author": "Kartal M.T.",
        "affiliation_name": "Lefke Avrupa Üniversitesi",
        "affiliation_city": "Mersin",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60012620",
        "affiliation_state": "Mersin"
    },
    {
        "paper_title": "The global economic burden of COVID-19 disease: a comprehensive systematic review and meta-analysis",
        "publication": "Systematic Reviews",
        "citied_by": "15",
        "cover_date": "2024-12-01",
        "Abstract": "Background: The COVID-19 pandemic has caused a considerable threat to the economics of patients, health systems, and society. Objectives: This meta-analysis aims to quantitatively assess the global economic burden of COVID-19. Methods: A comprehensive search was performed in the PubMed, Scopus, and Web of Science databases to identify studies examining the economic impact of COVID-19. The selected studies were classified into two categories based on the cost-of-illness (COI) study approach: top-down and bottom-up studies. The results of top-down COI studies were presented by calculating the average costs as a percentage of gross domestic product (GDP) and health expenditures. Conversely, the findings of bottom-up studies were analyzed through meta-analysis using the standardized mean difference. Results: The implemented search strategy yielded 3271 records, of which 27 studies met the inclusion criteria, consisting of 7 top-down and 20 bottom-up studies. The included studies were conducted in various countries, including the USA (5), China (5), Spain (2), Brazil (2), South Korea (2), India (2), and one study each in Italy, South Africa, the Philippines, Greece, Iran, Kenya, Nigeria, and the Kingdom of Saudi Arabia. The results of the top-down studies indicated that indirect costs represent 10.53% of GDP, while the total estimated cost accounts for 85.91% of healthcare expenditures and 9.13% of GDP. In contrast, the bottom-up studies revealed that the average direct medical costs ranged from US $1264 to US $79,315. The meta-analysis demonstrated that the medical costs for COVID-19 patients in the intensive care unit (ICU) were approximately twice as high as those for patients in general wards, with a range from 0.05 to 3.48 times higher. Conclusions: Our study indicates that the COVID-19 pandemic has imposed a significant economic burden worldwide, with varying degrees of impact across countries. The findings of our study, along with those of other research, underscore the vital role of economic consequences in the post-COVID-19 era for communities and families. Therefore, policymakers and health administrators should prioritize economic programs and accord them heightened attention.",
        "DOI": "10.1186/s13643-024-02476-6",
        "paper_author": "Faramarzi A.",
        "affiliation_name": "Urmia University of Medical Sciences",
        "affiliation_city": "Urmia",
        "affiliation_country": "Iran",
        "affiliation_id": "60021077",
        "affiliation_state": "West Azerbaijan Province"
    },
    {
        "paper_title": "Islamic finance as a driver for enhancing economic sustainability and innovation in the GCC",
        "publication": "Journal of Science and Technology Policy Management",
        "citied_by": "15",
        "cover_date": "2024-01-01",
        "Abstract": "Purpose: This study aims to investigate the role of Islamic finance in supporting sustainable economic growth, innovation and digital transformation in the Gulf Cooperation Council (GCC) region. Amid global challenges like the Russia–Ukraine conflict and COVID-19, the focus extends beyond the GCC’s oil dependency to explore how Islamic finance can enable technological advancements and foster a digitally innovative economy. The research aims to reveal the potential of Islamic finance in driving economic diversification, technological progress and sustainable development in the GCC. Design/methodology/approach: Using a content analysis approach, this study critically examines the economic repercussions of recent global crises, shedding light on how Islamic finance contributes to socio-economic justice and the provision of social goods in the GCC. The research synthesises findings from various secondary sources, including academic literature, reports and industry standards, to analyse Islamic finance’s role from an ethical and strategic perspective within the GCC’s evolving economic landscape. Findings: The findings reveal Islamic finance’s potential to significantly contribute to the GCC’s economic diversification and resilience against global economic downturns. The study highlights how Islamic finance aligns with the sustainable development goals and its effectiveness in promoting ethical financial practices and socio-economic justice. Research limitations/implications: Future research should focus on global comparative studies to understand Islamic finance’s impact on sustainable development beyond the GCC. Longitudinal studies are also essential to assess the long-term effects of Islamic financial instruments on economic stability. Practical implications: The research advocates for incorporating Islamic finance principles into the GCC’s economic strategies, emphasising its role in providing resilient and ethical financial alternatives conducive to sustainable development. It underscores the need for policy initiatives integrating Islamic finance to bolster socio-economic welfare and environmental sustainability. Originality/value: Offering a novel perspective, this paper enriches the discourse on the contribution of Islamic finance to sustainable economic development. It presents critical insights into how Islamic finance can underpin long-term economic resilience and growth in the GCC. It provides valuable implications for academia and policymaking, particularly in emerging economies’ science and technology policy management.",
        "DOI": "10.1108/JSTPM-11-2023-0206",
        "paper_author": "Alhammadi S.",
        "affiliation_name": "Arab Open University Kuwait",
        "affiliation_city": "Safat",
        "affiliation_country": "Kuwait",
        "affiliation_id": "60069835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The reputational costs of corporate environmental underperformance: evidence from China",
        "publication": "Business Strategy and the Environment",
        "citied_by": "15",
        "cover_date": "2024-02-01",
        "Abstract": "This study evaluates the relative importance of regulative and reputational pressures on corporate environmental performance by exploiting a novel research setting in China, where the financial penalties for corporate environmental wrongdoing are small. Despite the small monetary penalties, we still document a surprisingly strong negative stock price reaction to the news of corporate environmental violations. Additionally, we show that the negative stock market reaction weakens in firms with strong voluntary environmental commitment. But the effect of voluntary environmental commitment is less pronounced in state- or foreign-owned firms. Our study yields important managerial implications: our findings reveal considerable reputational losses associated with environmental misconducts and demonstrate the benefit of voluntary environmental commitment in upholding corporate reputation and helping firms recover during unfavorable environmental crises.",
        "DOI": "10.1002/bse.3528",
        "paper_author": "Hossain M.M.",
        "affiliation_name": "The University of Western Australia",
        "affiliation_city": "Perth",
        "affiliation_country": "Australia",
        "affiliation_id": "60031806",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Islamic social finance for achieving sustainable development goals: a systematic literature review and future research agenda",
        "publication": "International Journal of Ethics and Systems",
        "citied_by": "15",
        "cover_date": "2024-12-02",
        "Abstract": "Purpose: The sustainable development goals (SDGs) devised by the United Nations (UN) call on countries – whether rich or poor – to solve global issues, improve lives and save the planet for future generations. However, the UN predicts that between $5 and $7tn will need to be spent annually between now and 2030 to accomplish these goals, posing a major financial hurdle. Islamic social finance, if used ethically, seeks to realise SDGs through fairness, justice and equity. Thus, this study aims to determine how Islamic social finance instruments such as Zakat, Waqf, Sadaqat and Qard-hasan contribute to realising SDGs. Design/methodology/approach: This study used a preferred reporting items for systematic reviews and meta-analyses-based systematic literature review. Scopus and Google Scholar were chosen for the qualitative and meta-analysis of studies. The topic was reviewed in 178 academic papers from 2000 to 2022. The required articles were analysed after careful review. Findings: Islamic social financing mechanisms have the capacity to solve many social issues and create better welfare conditions by ensuring economic, social and environmental sustainability in line with the SDGs. Indonesia and Malaysia lead Islamic social finance research, the survey found. The review revealed that Islamic social funding can achieve 11 out of 17 SDGs. Islamic commercial finance can be used for the remaining goals. The paper highlights Islamic social funding research limitations and opportunities. Research limitations/implications: The review study shows that Islamic social finance can fill the SDG funding gap, especially considering the post-pandemic financial crisis that has increased global income inequality and social disparities. Originality/value: To the best of the authors’ knowledge, this article is the first of its kind to review the potential of Islamic social financing instruments to help achieve the SDGs.",
        "DOI": "10.1108/IJOES-12-2022-0317",
        "paper_author": "Dirie K.A.",
        "affiliation_name": "Universiti Utara Malaysia",
        "affiliation_city": "Sintok",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60002763",
        "affiliation_state": "Kedah"
    },
    {
        "paper_title": "Trade credit and corporate growth",
        "publication": "International Journal of Finance and Economics",
        "citied_by": "15",
        "cover_date": "2024-01-01",
        "Abstract": "While the underlying causal linkage between trade credit and corporate growth has mainly been explored, the primary factors that channel the relationship are limited. This article hypothesises a nonlinear relationship between trade credit and corporate growth due to the existing theoretical arguments on the benefit and cost of using suppliers' credit by corporations to enhance growth. Based on a panel of 23,023 non-financial companies from the United Kingdom over a 10-year period, evidence from this study reveals a nonlinear (concave) relation between trade credit and corporate growth: positive for low trade credit received and negative for high credit received. We also find trade credit to be sensitive to financial crisis, financial constraints and growth strategy. The predictability is stronger during a financial crisis, among financially constrained corporations and corporations pursuing an aggressive growth strategy. We also find growth to be higher in firms that move closer to achieving an optimal credit level. This relationship holds for both the above- and below-optimal deviations. These findings have implications for a more balanced and nuanced view of trade credit management.",
        "DOI": "10.1002/ijfe.2683",
        "paper_author": "Tingbani I.",
        "affiliation_name": "Southampton Business School",
        "affiliation_city": "Southampton",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60176937",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Revisiting Islamic banking efficiency using multivariate adaptive regression splines",
        "publication": "Annals of Operations Research",
        "citied_by": "15",
        "cover_date": "2024-03-01",
        "Abstract": "Islamic banking is among rapidly-growing components in the world's financial system. Within its institutions, continuous criteria of efficiency facilitate the evaluation of the impact of the reforms and policies on the banks' performance. In this paper, we employ the Multivariate Adaptive Regression Splines (MARS) method for estimating the efficiency of Islamic banks in developed and developing countries. MARS is a well-known efficient method for the flexible modelling of high-dimensional data. Unlike previous work, using a nonparametric technique of such a robustness instead of parametric approaches contributes to the improvement of the various estimates, which provides investors with accurate and timely information they can immediately react upon for a better decision-making in turbulent times. On the one hand, the results of the experiments show that, in the emerging region, there is evidence of a strong linkage between Islamic banking efficiency and gross domestic product. On the other hand, in the developed region, the efficiency is rather based upon Sharia Supervisory Board and board committees. These outcomes confirm previous works showing that governance-related variables have a significant positive effect on Islamic banking efficiency. Furthermore, the overall MARS-based predictions reveal that Islamic banks operating in developed countries are relatively more efficient than their counterparts in emerging countries.",
        "DOI": "10.1007/s10479-022-04545-2",
        "paper_author": "Saâdaoui F.",
        "affiliation_name": "Faculty of Sciences, King Abdulaziz University",
        "affiliation_city": "Jeddah",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60238510",
        "affiliation_state": "Makkah Province"
    },
    {
        "paper_title": "Institutionalizing authoritarian urbanism and the centralization of urban decision-making",
        "publication": "Territory, Politics, Governance",
        "citied_by": "15",
        "cover_date": "2024-01-01",
        "Abstract": "The changes in the global neoliberal order leading up to the 2008 financial crisis shaped individual countries’ political–administrative transformations. One of the most important trends in politics since then has been the (re)centralization of scalar politics. Urban financialization, which was proposed as a solution for the economic contraction in the post-crisis era, required fast and centralized decision-making without leaving much room for citizen participation and local variation. Turkey is a case in point for this global trend. Amid such rapid urban growth, we identify two parallel processes that weaken the local institutions and localized development in Turkey: the shifting of decision-making powers from municipalities to central state organs, especially with regard to the real estate industry; and the shifting of decision-making powers from the elected members of the city councils to the mayors themselves. We attempt to demonstrate the (re)centralization of urban decision-making process in Turkey by looking at the decisions and the processes within which those decisions were taken at Ankara Metropolitan Municipality City Council between 2014 and 2016. We argue that the rise of neoliberal authoritarianism is reinforced by the centralization of urban decision-making processes.",
        "DOI": "10.1080/21622671.2021.2020156",
        "paper_author": "Ergenc C.",
        "affiliation_name": "Xi'an Jiaotong-Liverpool University",
        "affiliation_city": "Suzhou",
        "affiliation_country": "China",
        "affiliation_id": "60102426",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "A Macro-Finance Model with Sentiment",
        "publication": "Review of Economic Studies",
        "citied_by": "14",
        "cover_date": "2024-01-01",
        "Abstract": "This paper incorporates diagnostic expectations into a general equilibrium macroeconomic model with a financial intermediary sector. Diagnostic expectations are a forward-looking model of extrapolative expectations that overreact to recent news. Frictions in financial intermediation produce non-linear spikes in risk premia and slumps in investment during periods of financial distress. The interaction of sentiment with financial frictions generates a short-run amplification effect followed by a long-run reversal effect, termed the feedback from behavioural frictions to financial frictions. The model features sentiment-driven financial crises characterized by low pre-crisis risk premia and neglected risk. The conflicting short-run and long-run effect of sentiment produces boom-bust investment cycles. The model also identifies a stabilizing role for diagnostic expectations. Under the baseline calibration, financial crises are less likely to occur when expectations are diagnostic than when they are rational.",
        "DOI": "10.1093/restud/rdad023",
        "paper_author": "Maxted P.",
        "affiliation_name": "Haas School of Business",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60072522",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "TVP-VAR based time and frequency domain food &amp; energy commodities connectedness an analysis for financial/geopolitical turmoil episodes",
        "publication": "Applied Energy",
        "citied_by": "14",
        "cover_date": "2024-03-01",
        "Abstract": "Amidst the current global inflationary challenges, the concurrent rise of energy and agricultural commodity prices, which constitute the primary components of consumer prices, has emerged as a matter of significant interest among both scholars and policymakers. To this end, this study examines the dynamic interlinkages between food and energy commodity indexes from 2005:1 to 2023:3, covering turmoil episodes such as the Global Financial Crisis (GFC), the COVID-19 pandemic, and the Russia-Ukraine Conflict (RUC). Additionally, following Broadstock et al. (2022), we perform dynamic portfolio analyses to determine portfolio performances under 3 different portfolio construction approaches. The empirical results presented in this paper allow for a number of important findings. First, both the time and frequency-domain connectedness indexes associate with major financial/geopolitical stress events. Second, the fuel energy and the crude oil price indexes are the largest propagators and recipients of spillovers Third, the cumulative portfolio returns exhibit significant growth during the early phase of the COVID-19, declining during the RUC, and a notable upswing during the GFC. Finally, our findings for frequency-dependent connectedness networks indicate that the market is particularly susceptible to short-term shocks. This paper has significant ramifications for investors, market players, and policymakers.",
        "DOI": "10.1016/j.apenergy.2023.122487",
        "paper_author": "Polat O.",
        "affiliation_name": "Bilecik Şeyh Edebali Üniversitesi",
        "affiliation_city": "Bilecik",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60104516",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "On the prediction of systemic risk tolerance of cryptocurrencies",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "14",
        "cover_date": "2024-01-01",
        "Abstract": "The role of big data in finance is pivotal, especially in forecasting stock prices, mitigating risk, and assessing market anomalies. With the financial system becoming more interconnected, analytical models using large data are gaining prominence in developing risk spillover models. This study estimates the systemic risk tolerance of twenty-five high-valued cryptocurrencies and finds that Fantom has the highest tolerance, while Bitcoin and Ethereum have a lower tolerance due to their large market share. It also shows that the common trend of cryptocurrencies enhances each other's tolerance and develops a predictive model for systemic risk tolerance. The study can help investors and market participants devise strategies for safe haven investment, hedging, and speculation during a market downturn.",
        "DOI": "10.1016/j.techfore.2023.122963",
        "paper_author": "Boubaker S.",
        "affiliation_name": "EM Normandie",
        "affiliation_city": "Le Havre",
        "affiliation_country": "France",
        "affiliation_id": "60032545",
        "affiliation_state": "Normandie"
    },
    {
        "paper_title": "Volatility spillovers during normal and high volatility states and their driving factors: A cross-country and cross-asset analysis",
        "publication": "International Journal of Finance and Economics",
        "citied_by": "14",
        "cover_date": "2024-01-01",
        "Abstract": "Understanding the transmission of volatility across markets is essential for managing risk and financial stability, especially under crisis periods during which an extreme event occurring in one market is easily transmitted to another market. To gain such an understanding and enrich the related literature, we examine in this article the system of volatility spillovers across various equity markets and asset classes using a quantile-based approach, allowing us to capture spillovers under normal and high volatility states. The sample period is 16 March 2011–10 November 2020 and the employed dataset comprises 12 implied volatility indices representing a forward-looking measure of uncertainty of global equities, strategic commodities and the US Treasury bond market. The results show that the identity of transmitters and receivers of volatility shocks differ between normal and high volatility states. The US stock market is at the centre of volatility spillovers in the normal volatility state. European and Chinese stock markets and strategic commodities (e.g. crude oil and gold) become major volatility transmitters in the high volatility state, after acting as volatility receivers during normal periods. Furthermore, we study the drivers of implied volatility spillovers using regression models and find that US Default spread contributes to the total volatility spillover index in both volatility states, whereas TED spread plays a significant role in the normal volatility state. As for the role of short rate and risk aversion, it is significant in the high volatility state. These findings matter to the decision-making process of risk managers and policymakers.",
        "DOI": "10.1002/ijfe.2717",
        "paper_author": "Iqbal N.",
        "affiliation_name": "Anhui University of Finance and Economics",
        "affiliation_city": "Bengbu",
        "affiliation_country": "China",
        "affiliation_id": "60108842",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The uncoupling of house prices and mortgage debt: towards wealth-driven housing market dynamics",
        "publication": "International Journal of Housing Policy",
        "citied_by": "14",
        "cover_date": "2024-01-01",
        "Abstract": "Mortgage credit has been central in fuelling housing market dynamics in many countries. While mortgage debt and house price increases used to go hand in hand, we see an uncoupling post-global financial crisis, with relative mortgage debts decreasing while house prices are increasing at unprecedented rates. This article scrutinises this uncoupling, contributing in three ways. First, we argue it is representative of how debt-driven housing dynamics have been supplemented by wealth-driven ones: while mortgage debt remains crucial, it has stagnated, and increased wealth investments have fuelled a new round of price increases. Second, we explore key examples of wealth-driven housing dynamics: the increase in private landlordism (buy-to-let), older homeowners reinvesting accumulated housing wealth and intergenerational house purchases. Third, we demonstrate that these dynamics are associated with increasing fractures along the lines of class, age and place, particularly benefiting affluent and older insiders while advancing uneven development. We base our arguments on an empirical analysis of the Netherlands, a country with a highly financialised owner-occupied market boasting one of the highest mortgage-debt-to-GDP ratios in the world, but our arguments have wider relevance. We conclude that current dynamics point to a new era of house price rentierism.",
        "DOI": "10.1080/19491247.2023.2170542",
        "paper_author": "Hochstenbach C.",
        "affiliation_name": "Universiteit van Amsterdam",
        "affiliation_city": "Amsterdam",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60002483",
        "affiliation_state": "Noord-Holland"
    },
    {
        "paper_title": "Speculative Urban Worldmaking: Meeting Financial Violence with a Politics of Collective Care",
        "publication": "Antipode",
        "citied_by": "14",
        "cover_date": "2024-05-01",
        "Abstract": "This article brings Black feminist thought to bear on the urban geography of racialised financial violence. Our analysis focuses on the Moms 4 Housing movement, which began when five Black mothers occupied a vacant, corporate investor-owned house in West Oakland to protest how real estate speculation is fuelling displacement and homelessness for Black Oakland residents, disrupting care at the scale of the home and community. In taking space through recuperating the house on Magnolia Street, the Moms insist on housing as a site of care central to the survival of Black families and reclaim Oakland as a Black geographic space. In claiming ownership based on relations of care while refusing the institution of private property, we argue the Moms engage in speculative urban worldmaking—a form of collective care and a praxis of providing an alternative present that imagines and advocates for urban futures beyond financialisation's abstract racial violence.",
        "DOI": "10.1111/anti.12900",
        "paper_author": "Summers B.T.",
        "affiliation_name": "University of California, Berkeley",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60025038",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Does COVID-19 Pandemic Motivate Privacy Self-Disclosure in Mobile Fintech Transactions? A Privacy-Calculus-Based Dual-Stage SEM-ANN Analysis",
        "publication": "IEEE Transactions on Engineering Management",
        "citied_by": "14",
        "cover_date": "2024-01-01",
        "Abstract": "The emergence of mobile financial technology (mobile fintech) services raises numerous public concerns regarding privacy issues; consequently, researchers in mobile technology acceptance have focused on consumers' privacy self-disclosure behaviors under the usual scenario. However, there is still a lack of understanding on how external influences, such as a public health crisis, affect consumers' privacy decision-making process. Therefore, in this article, we examine the effects of privacy-and pandemic-related antecedents on mobile fintech users' information self-disclosure behavior during the coronavirus disease 2019 pandemic. The present research adopts a self-administered questionnaire with 712 effective responses for data collection and a two-stage partial least squares-structural equation modeling-artificial neural network (PLS-SEM-ANN) approach to test the theoretical lens proposed. The results indicate that the significant structural paths in the model are consistent with the proposed hypotheses and existing literature. Surprisingly, face-to-face avoidance (FFA) does not significantly influence consumers' self-disclosure willingness. Infection severity and infection susceptibility were insignificant with FFA. The present research is the first to investigate consumers' privacy-related behavior via integrating the privacy-calculus framework with control agency theory. This research focuses on consumers' decision-making during the pandemic, explicitly highlighting the macroenvironment's role in influencing an individual's behavior.",
        "DOI": "10.1109/TEM.2022.3204285",
        "paper_author": "Yuan Y.P.",
        "affiliation_name": "UCSI University",
        "affiliation_city": "Kuala Lumpur",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60101841",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Does digital financial innovation enhance financial deepening and growth in Kenya?",
        "publication": "International Journal of Emerging Markets",
        "citied_by": "14",
        "cover_date": "2024-02-21",
        "Abstract": "Purpose: The purpose of this paper is to examine the effect of digital financial innovation on financial depth and economic growth in Kenya. Design/methodology/approach: The study utilized autoregressive distributed lag (ARDL) model, which is preferable over other time series methods as the model allows application of co-integration tests to time series with different integration orders and is flexible to the sample size including small and finite. Findings: The main findings of this paper are as follows: first, there is evidence of a positive relationship between digital financial innovation and financial depth with the strongest impact emanating from Internet usage and mobile financial services and the lowest impact from bank branches; second, the results reveal a significant positive impact of financial depth on economic growth consistent with the supply-leading finance theory. Practical implications: The results of the study imply a need for investment in technology-enabling infrastructure for digital financial services (DFS) and a redesign of strategies to avoid further financial exclusion of low-income earners due to the unaffordability of digital devices and financial and digital illiteracy. Originality/value: The study is original and important for policymakers as the study provides insights on the components of financial innovation that are growth-enhancing in Kenya, considering that some aspects of innovation can be growth-retarding as was demonstrated during the global financial crisis.",
        "DOI": "10.1108/IJOEM-09-2021-1389",
        "paper_author": "Misati R.",
        "affiliation_name": "Central Bank of Kenya",
        "affiliation_city": "Nairobi",
        "affiliation_country": "Kenya",
        "affiliation_id": "100767640",
        "affiliation_state": "Nairobi"
    },
    {
        "paper_title": "Quantifying the volatility spillover dynamics between financial stress and US financial sectors: Evidence from QVAR connectedness",
        "publication": "International Review of Financial Analysis",
        "citied_by": "13",
        "cover_date": "2024-10-01",
        "Abstract": "This study uses quantile vector-autoregressive to examine volatility connectedness among a global financial stress index (including five categories: credit, equity valuation, funding, safe assets, and volatility) and US financial sectors under low, moderate, and extreme volatility conditions. The dataset includes the special periods covering the global financial crisis, China crisis, COVID-19 pandemic, Russian–Ukrainian war, Silicon Valley Bank failure, and Credit Suisse bank crisis. The findings imply that spillover effects among the series are higher during extreme volatility than during low and moderate volatility periods. During periods of low volatility, the credit category of the financial stress index and the US financial sector indices are net shock transmitters, but during extreme volatility periods, the US financial sectors become net shock receivers alongside the credit and funding categories of the financial stress indices. US financial sectors also exhibit net shock recipient roles at extreme volatility levels during those special periods.",
        "DOI": "10.1016/j.irfa.2024.103434",
        "paper_author": "Hoque M.E.",
        "affiliation_name": "BRAC University",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60008935",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Geopolitical risk and firm-level environmental, social and governance (ESG) performance",
        "publication": "Journal of Environmental Management",
        "citied_by": "13",
        "cover_date": "2024-07-01",
        "Abstract": "This study investigates the impact of geopolitical risk on firm-level environmental, social, and governance (ESG) performance. Using a news-based indicator of geopolitical risk across 41 countries and a comprehensive dataset spanning from 2002 to 2021 with 65,354 firm-year observations, we uncover that geopolitical risk is negatively associated with ESG performance. Our findings remain robust even when considering alternative measures of geopolitical risk, ESG components, and sub-samples. Moreover, we address potential endogeneity concerns through two-stage least squares, propensity score matching and entropy balancing approaches. Interestingly, we find that the effect of geopolitical risk is positive for countries with lower geopolitical risk and high peace, indicating that relatively stable environments can incentivize firms to enhance their sustainability practices. We also examine the potential channel effects of cash holding, corporate investment, and cost of capital, and found significant effects. Overall, this paper underscores the significance of geopolitical risk as a macro-level shock that significantly influences ESG performance.",
        "DOI": "10.1016/j.jenvman.2024.121245",
        "paper_author": "Abdullah M.",
        "affiliation_name": "University of Southampton",
        "affiliation_city": "Southampton",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60025225",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Analyzing the asymmetric FinTech services under natural resources, and renewable energy in the future environmental performance: New insights from STIRPAT model framework",
        "publication": "Resources Policy",
        "citied_by": "13",
        "cover_date": "2024-05-01",
        "Abstract": "Increasing environmental degradation and energy crises have pushed economies to adopt and impliment more sustainable technologies. In this way, financial technologies (FinTech) and natural resources have played a significant role in diminishing environmental pollution by integrating economic growth and urbanization. Both of these factors can boost renewable energy sources and diminish environmental pollution. To achieve this goal, this study estimates the short run, and long run relationship between FinTech services, natural resources, and greenhouse gasses (GHG) emissions in China from 2010Q1–2022Q4, while applying economic growth, renewable energy use, and urbanization as control variables using novel dynamic autoregressive distributive lag (DARDL) simulations. This study discovers a novel FinTech development index through principal component analysis (PCA) comprising four imperative factors that signify the FinTech development and employes a reliable and robust environmental framework recognized as the Stochastic Impacts by Regression on Population, Affluence, and Technology (STIRPAT) model. The estimated findings reveal that FinTech development and renewable energy significantly reduce GHG emissions in the long run. At the same time, renewable energy consumption reduces environmental pollution in the short run. Conversely, natural resources and urbanization significantly boost GHG emissions in the long run, and short run. Moreover, economic growth increases GHG emissions in the long run but adversely influences environmental degradation in the short run. Finally, this study suggests that China implements sustainable progress tactics to accomplish a harmonious equilibrium between FinTech services, natural resources, energy use, economic growth, and ecological fortification, efficiently addressing the encounters of ecological deprivation, encouraging balance FinTech services and natural resource management, and achieving Sustainable Development Goals (SDGs) targets.",
        "DOI": "10.1016/j.resourpol.2024.104984",
        "paper_author": "Shu X.",
        "affiliation_name": "Southwestern University of Finance and Economics",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60018540",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Quantile connectedness between the climate policy and economic uncertainty: Evidence from the G7 countries",
        "publication": "Journal of Environmental Management",
        "citied_by": "13",
        "cover_date": "2024-02-01",
        "Abstract": "In this study, we investigate the transmission mechanism between climate policy uncertainty (CPU) and economic policy uncertainty (EPU) in the G7 countries. To account for different conditions, we use a quantile-based VAR (Q-VAR) model over the period between 2000 and 2021. Our results show high connectedness between the CPU and the EPU of G7 countries, particularly at extreme quantile orders. On the other hand, the spillover effects between climate and economic policy uncertainty differ depending on the distributional levels of the uncertainty indices. The CPU is a net receiver of uncertainty shocks, while for almost all countries, the EPU acts as a net receiver or emitter, depending on the economic situation. During times of high or low economic uncertainty, the EPU of all G7 countries is strongly affected by shocks originating from the CPU. Moreover, the results indicate that the dynamic spillover patterns between EPU and CPU vary over time, responding to different economic events and financial crises. These results call for policymakers and governments to urgently integrate climate considerations into economic planning, fiscal policies, and regulatory frameworks to promote sustainable economic growth and mitigate the impacts of climate change.",
        "DOI": "10.1016/j.jenvman.2023.119826",
        "paper_author": "Mokni K.",
        "affiliation_name": "Université de Sousse",
        "affiliation_city": "Sousse",
        "affiliation_country": "Tunisia",
        "affiliation_id": "60058071",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Tail risk spillover effects in commodity markets: A comparative study of crisis periods",
        "publication": "Journal of Commodity Markets",
        "citied_by": "13",
        "cover_date": "2024-03-01",
        "Abstract": "This research aims to investigate the propagation of extreme downside risk, commonly referred to as tail risk, within commodity markets using an innovative CAViaR-based connectivity model. We also evaluate the influence of various crises, including the global financial crisis, the shale oil revolution, the COVID-19 pandemic, and the Russia-Ukraine conflict, on the dynamic relationships among seventeen different commodity markets. Our findings reveal a diverse pattern of interconnections among these markets during distinct crisis periods. Surprisingly, we observe that the nature of these interconnections is remarkably similar during geopolitical and health crises. Notably, the spillover effects between different commodity categories are more pronounced during the COVID-19 pandemic and the Russia-Ukraine conflict than during the global financial crisis and the shale oil revolution. However, it is important to note that the total risk spillovers are more substantial during the global financial crisis. Furthermore, our analysis delves into the unique characteristics of each market, revealing that precious metals can function as a safe haven for both energy and industrial metals during times of economic turbulence.",
        "DOI": "10.1016/j.jcomm.2023.100370",
        "paper_author": "Naeem M.A.",
        "affiliation_name": "College of Business and Economics",
        "affiliation_city": "Al Ain",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60212462",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "What do individuals know, feel and do from a financial perspective? An empirical study on financial satisfaction",
        "publication": "International Journal of Social Economics",
        "citied_by": "13",
        "cover_date": "2024-05-21",
        "Abstract": "Purpose: Financial satisfaction is a potential ambition of individuals' lives that requires well-strategized economic behaviors. The authors examine the impact of various factors on the financial behavior (FB) and financial satisfaction (FIS) of individuals in India's National Capital Region (NCR). Design/methodology/approach: Through a literature review, a survey questionnaire was formulated using existing scales on FIS. For more in-depth insights, data are obtained from 427 respondents in the NCR region using self-administered questionnaires. This article used “partial least square structural equation modeling (PLS-SEM)” to inspect the hypothesized model of individuals' FIS. Findings: According to the study results, financial attitude (FA), financial self-efficacy (FSE), financial knowledge (FK) and demographic characteristics (DC) significantly influence FB. Conversely, financial stress (FS) negatively impacts FB. It also highlights that FA, FSE, FK and FB all significantly impact FIS. Nevertheless, FS and DC insignificantly influence FIS. Originality/value: To the best knowledge of the authors, this article is an initial attempt to offer a novel perspective of individuals' FB and FIS in India. It would help the government and stakeholders by providing various pioneering economic schemes and making policies that help increase individuals' FIS. Peer review: The peer review history for this article is available at: https://publons.com/publon/10.1108/IJSE-03-2023-0239.",
        "DOI": "10.1108/IJSE-03-2023-0239",
        "paper_author": "Kumar J.",
        "affiliation_name": "Deenbandhu Chhotu Ram University of Science and Technology",
        "affiliation_city": "Sonipat",
        "affiliation_country": "India",
        "affiliation_id": "60076923",
        "affiliation_state": "HR"
    },
    {
        "paper_title": "Aspiring teachers, financial incentives, and principals’ recruitment practices in hard-to-staff schools",
        "publication": "Journal of Education Policy",
        "citied_by": "13",
        "cover_date": "2024-01-01",
        "Abstract": "The crisis of teacher shortages in Anglophone nation states can no longer be ignored as this long-term issue has been compounded by the pandemic. Growing evidence of the challenges of attracting and retaining a teaching workforce is now foregrounded in education policy internationally. This issue provides increased impetus for studying teacher motivations and principal dispositions particularly in relation to roles in hard-to-staff schools that tend to be in disadvantaged or rural communities in terms of how policies are received and enacted. This mixed methods study examined a teacher financial incentive (TFI) scheme aimed at facilitating the appointment of qualified teachers in hard-to-staff government schools in Victoria, Australia. Although evidence of TFI scheme’s effects and effectiveness as a policy solution to teacher shortages is limited, TFI schemes are widespread internationally. Our study shows that while the Victorian TFI scheme resulted in successful appointments for most participating schools, a financial incentive was only one among many other policy settings, personal and professional factors and other motivations informing teachers’ decisions to apply for a TFI position and the recruitment practices of principals.",
        "DOI": "10.1080/02680939.2023.2193170",
        "paper_author": "Blackmore J.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Public debt sustainability: a bibliometric co-citation visualization analysis",
        "publication": "International Journal of Emerging Markets",
        "citied_by": "13",
        "cover_date": "2024-03-19",
        "Abstract": "Purpose: Due to the financial disturbances created by the COVID-19 pandemic and the burden on the government exchequer, it is expected to see a rise in the knowledge base of the research corpus so far as the government's fiscal sustainability is concerned. Therefore, the present research examines a systematic quantitative analysis of public debt sustainability research by applying a bibliometric approach. Research also analyzes journals, institutions, countries and authors contributing to public debt sustainability. Design/methodology/approach: This paper scrutinizes the published scientific research on public debt sustainability based on the dataset of 535 articles from 1991 to 2021 obtained from the Scopus database. Biblioshiny (R-based application) and VoSviewer software were used to perform bibliometric analysis through Performance analysis and science mapping techniques. The authors combined co-citation analysis (CCA), bibliometric analysis, keyword co-occurrence analysis (KCA) and a conceptual thematic map of the most cited articles to find the intellectual structure. Findings: The research identified three dominating clusters, e.g. fiscal sustainability and policy rules, empirical sustainability testing and debt and growth dynamics. Another finding was that most articles were analytical and empirical and few descriptive articles were found. Owing to the empirical nature of the domain, the issues concerning public debt sustainability have continued to change over the past decades for different economies, reflecting the complexity and diversity of economic structures of different economies at different times. Originality/value: The insight of this article provides academicians and researchers with a more refined comprehension of the conceptual and intellectual structure of the research corpus. The present research complements the existing literature review studies by pushing the research towards emerging or less developed issues such as financial and debt crises.",
        "DOI": "10.1108/IJOEM-04-2022-0724",
        "paper_author": "Kaur A.",
        "affiliation_name": "Guru Nanak Dev University",
        "affiliation_city": "Amritsar",
        "affiliation_country": "India",
        "affiliation_id": "60000078",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Institutional adaptability: its relevance for enhancing resilience and smart specialization capacity of the European Union’s lagging regions",
        "publication": "Eurasian Geography and Economics",
        "citied_by": "13",
        "cover_date": "2024-01-01",
        "Abstract": "After the 2008 financial crisis, institutional adaptability and economic diversification through smart specialization have been considered key forces for attaining an effective resilience trajectory of regional economies. Successful policy responses should not capture only limited, conjunctural and transitory measures, but should rather promote pro-active capabilities, able to cope with spatial perturbations and related drastic transformations, thus generating a more efficient regional development pattern. In this process, the economic and institutional factors, the conditions under which changes occur, as well as the actors of change play a pivotal role. The paper traces whether institutional arrangements have a decisive impact on the recovery of the European Union’s lagging regions after the economic crisis and whether these could be instrumental in developing a smart specialization potential, which could make regions even more capable to enhance strong adaptive mechanisms. Using a mix of econometric methods (e.g. panel analysis, logistic regression) to emphasize both institutional and smart specialization aspects in the European Union core-periphery differentiation, the present study is based on a multidisciplinary approach. The results highlight that the existence of smart specialization capacity is associated with higher institutional adaptability; they also distinguish between relevant resilience characteristics of the European regions and formulate appropriate response policies for strengthening their specialization potential.",
        "DOI": "10.1080/15387216.2022.2112254",
        "paper_author": "Nijkamp P.",
        "affiliation_name": "Open Universiteit",
        "affiliation_city": "Heerlen",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60024360",
        "affiliation_state": "Limburg"
    },
    {
        "paper_title": "Fifteen years of crowdfunding–a bibliometric analysis",
        "publication": "Technology Analysis and Strategic Management",
        "citied_by": "13",
        "cover_date": "2024-01-01",
        "Abstract": "Crowdfunding emerged as a flexible method of financing various projects during the financial crisis but has since developed into a fully fledged financing instrument that requires special attention from the academia and legislators. The purpose of this study is to perform a quantitative analysis of the up-to-date crowdfunding research employing bibliometric analysis. We have used data from the Scopus database and have extracted a number of 1951 research papers. Using VOSviewer software, we have looked into the yearly research production, the categories in which the studies fall, citation records, highly cited authors and papers, most prolific authors and country of origin in crowdfunding. We grouped keywords into clusters and identified emerging trends. We then revealed the thematic progression of the occurring keywords into four time ranges. We find that crowdfunding research has been growing steadily from 2006 to date, with a particular focus on business and finance. The most productive countries are highly developed economies, but other countries have started exploring crowdfunding, too. The most cited references are published between 2013 and 2016, which is when the bases of this stream of research have been established. We finally discuss the theoretical and practical implications.",
        "DOI": "10.1080/09537325.2022.2089548",
        "paper_author": "Baber H.",
        "affiliation_name": "School of Business Administration",
        "affiliation_city": "Sharjah",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60212476",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "To telework or not to telework: Does the macro context matter? A signalling theory analysis of employee interpretations of telework in times of turbulence",
        "publication": "Human Resource Management Journal",
        "citied_by": "13",
        "cover_date": "2024-04-01",
        "Abstract": "How do workers make sense of telework and respond to it in turbulent times? This study of a consultancy firm in Spain, during the 2008 financial crisis, explores employee interpretations of telework in the context of major macro-economic disruption. We draw on signalling theory to consider telework as a signal sent by the organisation and argue that the environment in which the signal occurs changes employees' interpretations. While telework is generally understood as an employee-centred practice, we find that in an economic crisis it is also interpreted as a potential threat for employees. Therefore, the meaning of telework is not predetermined, but continually shaped socially considering events beyond the boundaries of the firm. We propose adopting a social constructivist view to consider human resource (HR) practices as objects experienced and interpreted within their wider social contexts. We shed new light on signalling theory and HR studies by offering insights on the relevance of the signalling environment for interpreting messages, and bring forth the concept of “external fit”.",
        "DOI": "10.1111/1748-8583.12457",
        "paper_author": "Cañibano A.",
        "affiliation_name": "IE Business School",
        "affiliation_city": "Madrid",
        "affiliation_country": "Spain",
        "affiliation_id": "60108973",
        "affiliation_state": "Madrid"
    },
    {
        "paper_title": "The Number That Killed Us: A Story of Modern Banking, Flawed Mathematics, and a Big Financial Crisis",
        "publication": "The Number That Killed Us: A Story of Modern Banking, Flawed Mathematics, and a Big Financial Crisis",
        "citied_by": "12",
        "cover_date": "2024-01-01",
        "Abstract": "A critical look at the risk measurement tool that has repeatedly hurt the financial world The Number That Killed Us finally tells the \"greatest story never told\": how a mysterious financial risk measurement model has ruled the world for the past two decades and how it has repeatedly, and severely, caused market, economic, and social turmoil. This model was the key factor behind the unleashing of the cataclysmic credit crisis that erupted in 2007 and which the effects are still being felt around the world. The Number That Killed Us is the first and only book to thoroughly explain this hitherto-uncovered phenomenon, making it the key reference for truly understanding why the malaise took place. The very number financial institutions and regulators use to measure risk (Vale at Risk/VaR) has masked it, allowing firms to leverage up their speculative bets to unimaginable levels. VaR sanctioned and allowed the monstrously geared toxic punts that sank Wall Street, and the world, during the latest crisis. We can confidently say that VaR was the culprit. In The Number That Killed Us, derivatives expert Pablo Triana takes you through the development of VaR and shows how its inevitable structural flaws allowed banks to take on even greater risks. The precise role of VaR in igniting the latest crisis is thoroughly covered, including in-depth analysis of how and why regulators, by falling in love with the tool, condemned us to chaos. Uncritically embraced worldwide for way too long, VaR is, in the face of such destruction, just starting to be examined as problematic, and in this book Triana (long an open critic of the tool's role in encouraging mayhem) uncovers exactly why it makes our financial world a more dangerous place. If we care for our safety, we should let VaR go Contains controversial analysis of the hotly debated risk metric Value at Risk (VaR) and its central role in the credit crisis Denounces the role of regulators and academics in forcing the presence of the inevitably malfunctioning in financeland Describes how bonus-hungry traders can use VaR as an alibi to take on the most reckless of bets Reveals how the most recent financial crisis will simply repeat itself if the problems behind VaR are not unmasked Pablo Triana is also the author of Lecturing Birds on Flying The very risk measurement tool that was intended to contain risk allowed financial firms to blindly take on more. The model that was supposed to save us condemned us to misery. The Number That Killed Us reveals how this has happened and what needs to be done to correct the situation.",
        "DOI": "10.1002/9781119198826",
        "paper_author": "Triana P.",
        "affiliation_name": "Universitat Ramon Llull, ESADE",
        "affiliation_city": "Barcelona",
        "affiliation_country": "Spain",
        "affiliation_id": "60113192",
        "affiliation_state": "Barcelona"
    },
    {
        "paper_title": "Uplifting India from severe energy poverty accounting for strong asymmetries: Do inclusive financial development, digitization and human capital help reduce the asymmetry?",
        "publication": "Energy Economics",
        "citied_by": "12",
        "cover_date": "2024-06-01",
        "Abstract": "Securing seamless access to power in emerging territories like India is a prerequisite for attaining steady-state economic development and enhancing societal upliftment. Therefore, policymakers and power stakeholders face the pressing need to identify new factors that can effectively alleviate energy poverty, particularly in the context of increasing financial globalization and digitization. While previous studies have examined the linear relationship between fuel poverty and its determinants, there is a lack of research focusing on the nonlinear association. The present work, therefore, explores the asymmetric consequences of financial development (FD), digitization, and human capital on fuel poverty in India while controlling for the consequences of economic growth (GDP), trade, and natural resource rent. To accomplish this, we adopt innovative methodologies, including Wavelet Quantile Correlation (WQC), Quantile-on-Quantile regression (QQR), and Quantile Causality (QC), leveraging data spanning from 1990Q1 to 2021Q4. The results from WQC and QQR approaches underscore that financial development, human capital, GDP, and digitization share a strong asymmetric association with energy poverty and that excessive financial development and digitization foster energy poverty issues in India. Human capital and trade do not help reduce energy poverty when energy poverty appears to be extreme. However, natural resources help reduce fuel poverty. Our findings corroborate that moderate financial development and digitization growth can help uplift India from this social crisis of fuel poverty. As such, Delhi should focus more on absorbing the negative spillovers induced by augmented financial development and digitization and control for other subsidiary elements that share close contact with financial development and digitization. Besides, Delhi must foster human capital development before the energy poverty issue peaks.",
        "DOI": "10.1016/j.eneco.2024.107568",
        "paper_author": "Jahanger A.",
        "affiliation_name": "Hainan University",
        "affiliation_city": "Haikou",
        "affiliation_country": "China",
        "affiliation_id": "60017716",
        "affiliation_state": "Hainan"
    },
    {
        "paper_title": "Does the quality management system affect working capital management efficiency? Evidence from Polish firms",
        "publication": "Cogent Business and Management",
        "citied_by": "12",
        "cover_date": "2024-01-01",
        "Abstract": "This study explores the impact of adopting the quality management system according to the International Standardization for Organizations (ISO) standards called ISO 9001 on firms’ working capital management efficiency (WCME). This study analyzes Small- and Medium-Sized Enterprises (SMEs) in the Polish construction industry. Regression analysis, difference tests, and robustness checks were conducted to achieve the goals of this study. The regression analysis results confirm a limited positive relationship between firms implementing ISO 9001 and WCME. Additionally, the difference tests show no significant differences in WCME between firms that implemented ISO 9001 and those that did not. During the coronavirus pandemic, a sharp decrease in inventory management costs was observed in firms. Inventories did not linger in warehouses, so they did not generate unnecessary costs, but were quickly sold at high margins. The inventory turnover rates on different days were low. These results suggest that controlling stock levels and receivables during crises is essential because payment bottlenecks and delayed deliveries can occur quickly. The insights generated from this study demonstrate that Polish SMEs in the construction industry fail to realize optimum WCME. Therefore, policymakers in Poland must improve managers’ and shareholders’ awareness of the usefulness of working capital management (WCM).",
        "DOI": "10.1080/23311975.2023.2292787",
        "paper_author": "Zimon G.",
        "affiliation_name": "Politechnika Rzeszowska im. Ignacego Łukasiewicza",
        "affiliation_city": "Rzeszow",
        "affiliation_country": "Poland",
        "affiliation_id": "60032402",
        "affiliation_state": "PK"
    },
    {
        "paper_title": "Reconfiguration and transformation for resilience: building service organizations towards sustainability",
        "publication": "Journal of Services Marketing",
        "citied_by": "12",
        "cover_date": "2024-04-25",
        "Abstract": "Purpose: Amidst unpredictable and turbulent periods, such as the COVID-19 pandemic, service organization’s responses are required to be innovative, adaptable and resilient. The purpose of this study is to explore the utilization of both reconfiguration and transformational strategies as instruments for cultivating resilience and advancing sustainability in service organizations. Design/methodology/approach: The study examines a proposed resilience model using fuzzy logic. The research also used a semantic differential scale to capture nuanced and intricate attitudes. Finally, to augment the validity of the resilience model, a measurement scale was formulated using business mathematics and expert opinions. Findings: Although investing in resilience training can help organizations gain control and maintain their operations in times of crisis, it may not directly help service organizations understand the external turmoil, seek available resources or create adaptive remedies. Conversely, high levels of reconfiguration and transformation management vigour empower a service organization’s revolutionary, malleable vision, organizational structure and decision-making processes, welcoming talented and innovative employees to enhance capabilities during crises. Research limitations/implications: The resilience model bestows a comprehensive understanding of the pertinence of building resilience for service organizations identifying the antecedents that influence the adoption of these strategies and introduces a range of theoretical perspectives that empowers service organizations to conceptualize and plan for building resilience. The research guides service organizations to become more resilient to external shocks and adapt to changing circumstances by diversifying their offerings, optimizing their resources and adopting flexible work arrangements. The study elaborates on the enhancement of resilience, increasing innovation, improving efficiency and enhancing customer satisfaction for service organizations to remain competitive and contribute to positive social and economic outcomes through the adoption of both reconfiguration and transformational strategies. Practical implications: The study also guides the service organizations to become more resilient to external shocks and adapt to changing circumstances by diversifying their offerings, optimizing their resources and adopting flexible work arrangements. Rapid innovation and business model innovation are essential components, enabling service organizations to foster a culture of innovation and remain competitive. In addition, the adoption can lead to improved financial performance, job creation and economic growth, contributing to positive social and economic impacts. Social implications: The resilience model bestows a comprehensive understanding of the pertinence of building resilience for service organizations. It identifies the antecedents that influence the adoption of these strategies and introduces a range of theoretical perspectives that empowers service organizations to conceptualize and plan for building resilience. The research also provides a foundation for further investigation into the effectiveness of these strategies and their impact on organizational performance and sustainability. By better preparing service organizations for disruptions and uncertainties, this research triggers ameliorated organizational performance and sustainability. Originality/value: Within the realm of the service industry, the present investigation has undertaken the development, quantification and scrutiny of both resilience and tenacity. In addition, it has delved into the intricate dynamics surrounding the influencing factors and antecedents that bear upon resilience, elucidating their consequential impact on the operational performance and outlook of service-oriented organizations. The findings derived from this research furnish valuable insights germane to enhancing operational efficacy and surmounting impediments within the sector.",
        "DOI": "10.1108/JSM-04-2023-0144",
        "paper_author": "J Nair A.",
        "affiliation_name": "Chitkara University, Punjab",
        "affiliation_city": "Rajpura",
        "affiliation_country": "India",
        "affiliation_id": "60113205",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Economic policy uncertainty and foreign direct investment: Evidence from China",
        "publication": "Structural Change and Economic Dynamics",
        "citied_by": "12",
        "cover_date": "2024-09-01",
        "Abstract": "This paper examines the influence of economic policy uncertainty (EPU) on foreign direct investment (FDI). By utilizing a comprehensive dataset spanning 264 Chinese cities from 2005 to 2014, we uncover a negative relationship between EPU and FDI inflows. In addition, through heterogeneity tests, we demonstrate that this effect is more pronounced in cities characterized by a higher degree of marketization, stronger financial development, and a larger proportion of industrial production. Moreover, we observe that FDI exhibits greater sensitivity to EPU fluctuations following the 2008 Global Financial Crisis. To provide an explanation for these findings, we propose an open-economy model incorporating uncertainty.",
        "DOI": "10.1016/j.strueco.2024.01.014",
        "paper_author": "Gao H.",
        "affiliation_name": "Jiangxi University of Finance and Economics",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60028275",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "Central bank digital currency: When price and bank stability collide",
        "publication": "Journal of Monetary Economics",
        "citied_by": "12",
        "cover_date": "2024-07-01",
        "Abstract": "This paper shows the existence of a central bank trilemma. When a central bank is involved in financial intermediation, either directly through a central bank digital currency (CBDC) or indirectly through other policy instruments, it can only achieve two of three objectives: a socially efficient allocation, financial stability (i.e., absence of runs), and price stability. In particular, a commitment to price stability can cause a run on the central bank. Implementation of the socially optimal allocation requires a commitment to inflation. We illustrate this idea through a nominal version of the Diamond and Dybvig (1983) model. Our perspective may be particularly appropriate when CBDCs are introduced on a wide scale.",
        "DOI": "10.1016/j.jmoneco.2024.01.007",
        "paper_author": "Schilling L.",
        "affiliation_name": "Olin Business School",
        "affiliation_city": "St. Louis",
        "affiliation_country": "United States",
        "affiliation_id": "60116134",
        "affiliation_state": "MO"
    },
    {
        "paper_title": "Factors Influencing Turnover and Attrition in the Public Behavioral Health System Workforce: Qualitative Study",
        "publication": "Psychiatric services (Washington, D.C.)",
        "citied_by": "12",
        "cover_date": "2024-01-01",
        "Abstract": "Many states are experiencing a behavioral health workforce crisis, particularly in the public behavioral health system. An understanding of the factors influencing the workforce shortage is critical for informing public policies to improve workforce retention and access to care. The aim of this study was to assess factors contributing to behavioral health workforce turnover and attrition in Oregon. Semistructured qualitative interviews were conducted with 24 behavioral health providers, administrators, and policy experts with knowledge of Oregon's public behavioral health system. Interviews were transcribed and iteratively coded to reach consensus on emerging themes. Five key themes emerged that negatively affected the interviewees' workplace experience and longevity: low wages, documentation burden, poor physical and administrative infrastructure, lack of career development opportunities, and a chronically traumatic work environment. Large caseloads and patients' high symptom acuity contributed to worker stress. At the organizational and system levels, chronic underfunding and poor administrative infrastructure made frontline providers feel undervalued and unfulfilled, pushing them to leave the public behavioral health setting or behavioral health altogether. Behavioral health providers are negatively affected by systemic underinvestment. Policies to improve workforce shortages should target the effects of inadequate financial and workplace support on the daily work environment.",
        "DOI": "10.1176/appi.ps.20220516",
        "paper_author": "Hallett E.",
        "affiliation_name": "OHSU School of Medicine",
        "affiliation_city": "Portland",
        "affiliation_country": "United States",
        "affiliation_id": "60032702",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "A deep learning-based approach for predicting oil production: A case study in the United States",
        "publication": "Energy",
        "citied_by": "12",
        "cover_date": "2024-02-01",
        "Abstract": "The accuracy of oil production predictions is crucial in the field of petroleum engineering. However, due to the time series characteristics of oil production and the complex relationship among multiple influencing factors, traditional methods, and time series prediction techniques have limitations in fully extracting time series features and exploring the internal relationships between variables. Deep learning techniques possess unique advantages in solving nonlinear problems and time-series problems but require a significant amount of data and can only conduct short-term oil production predictions due to the nonlinear and chaotic nature of yield. Therefore, this work aims to establish a model that can overcome these limitations. A modified GRU (M-GRU) is proposed to extract time series features of variables and external economic information. Then, the autoregressive (AR) model is integrated into importing priori knowledge to enhance the model's capability in extracting time series information. In addition, feature mapping is used to improve convergence performance. Finally, A loss function that can dynamically adjust the weights is proposed, which can enhance the model's ability to fit from error-prone samples. By validating the proposed model using oil production data, it has been proven that the model can predict oil production accurately and outperform other models with a correlation coefficient reaching 0.99874. Further tests show that the model can provide accurate prediction results even with limited sample sizes and during coincidental events such as financial crises and COVID-19 epidemics, providing strong support for decision-making for reservoir engineers.",
        "DOI": "10.1016/j.energy.2023.129688",
        "paper_author": "Du J.",
        "affiliation_name": "China University of Petroleum-Beijing",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016087",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The effect of the Covid-19 epidemic on auditing quality and the reaction of family vs non-family businesses to Covid-19: the case of Jordan",
        "publication": "Journal of Family Business Management",
        "citied_by": "12",
        "cover_date": "2024-06-26",
        "Abstract": "Purpose: The purpose of this paper is to provide new scientific knowledge concerning the impact of the Covid-19 pandemic on auditing quality as determined by audit fees for both family- and non-family-owned firms in Jordan. Design/methodology/approach: The authors use an ordinary least squares (OLS) regression firm-clustered standard error employing data from 200 Jordanian enterprises between 2005 and 2020 to validate this study's hypotheses. Findings: The regression findings suggest that enterprises run by families are better able to handle crises and spend less on audits. Companies that are not family-owned have to spend the most on monitoring tasks since they need to take extra steps to prevent the agency problem and make their financial statements stand out from their peers in order to attract more investors. Additional analysis that stretched out throughout 2005–2022 came to the same findings. Practical implications: The findings can be beneficial for authorities to better regulate and supervise the auditing sector. Political leaders, legislators, regulators and the auditing industry can all learn important lessons from the findings as they assess the growing concerns in a turbulent economic situation. The results of this research can, therefore, be utilised to reassure investors and assist policymakers in crafting workable responses to Covid-19's creation of financial problems. After the devastation caused by the coronavirus, these findings may be used to strengthen the laws that oversee Jordan's auditing sector. Originality/value: In emerging nations like Jordan, where there is a clear concentration of ownership and a predominance of high levels of family ownership, and to the best of the authors' knowledge, this is the first empirical study to compare the auditing quality of family-owned versus non-family-owned enterprises. Preliminary insights into the crisis management tactics of family and non-family organisations are provided by this first empirical investigation of the consequences of the Covid-19 crisis on family-owned firms.",
        "DOI": "10.1108/JFBM-07-2023-0106",
        "paper_author": "Alharasis E.E.",
        "affiliation_name": "Mutah University",
        "affiliation_city": "Karak",
        "affiliation_country": "Jordan",
        "affiliation_id": "60035301",
        "affiliation_state": "Karak"
    },
    {
        "paper_title": "Continuity or change? Platforms and the hybridization of neoliberal institutional contexts",
        "publication": "Review of International Political Economy",
        "citied_by": "12",
        "cover_date": "2024-01-01",
        "Abstract": "In recent years, a wide range of contributions have sought to conceptualize the emergent effects of platforms on contemporary capitalism(s). One strand of literature has emphasized the novelty of platforms, stressing their disruptive features and proclaiming the rise of a new era–platform/digital capitalism. Another strand has tended to position platforms within the longue durée of capitalist transformation, focusing on the continuities and historical recurrences of platform-led transformations. In contrast to both strands of literature, this paper argues that platforms should be understood as reworking existing, neoliberal institutions from within, engendering a process of hybridization. It builds on the French Régulation approach to trace platform-led transformations in the wage relation and social reproduction. It argues that platforms have consolidated their dominance in the post-2008 financial crisis period by, on the one hand, inserting themselves into neoliberal ‘innovations’ in labor markets, benefitting from a flexibilized, precaritized and casualized workforce and, on the other, by responding to the neoliberal crisis in social reproduction, and the decades-long privatization, marketization and individualization of reproductive tasks. It explores these dynamics in the context of Amsterdam and Berlin, tracing the hybridization of the neoliberal wage-labor nexus in the context of food delivery, cleaning and care platforms.",
        "DOI": "10.1080/09692290.2023.2220088",
        "paper_author": "Piletić A.",
        "affiliation_name": "Universiteit van Amsterdam",
        "affiliation_city": "Amsterdam",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60002483",
        "affiliation_state": "Noord-Holland"
    },
    {
        "paper_title": "Volatility spillovers, hedging and safe-havens under pandemics: All that glitters is not gold!",
        "publication": "International Journal of Finance and Economics",
        "citied_by": "12",
        "cover_date": "2024-04-01",
        "Abstract": "In the context of the COVID-19's outbreak and its implications for the financial sector, this study analyses the aspect of hedging and safe-haven under the pandemic. Drawing on the daily data from 02 August 2019 to 17 April 2020, our key findings suggest that the contagious effects in financial assets' returns significantly increased under COVID-19, indicating exacerbated market risk. The connectedness spiked in the middle of March, consistent with lockdown timings in major economies. The effect became severe with the WHO's declaration of a pandemic, confirming negative news effects. The return connectedness suggests that COVID-19 has been a catalyst of contagious effects on the financial markets. The crude oil and the government bonds are however not as much affected by the spillovers as their endogenous innovation. In terms of spillovers, we do find the safe-haven function of Gold and Bitcoin. Comparatively, the safe-haven effectiveness of Bitcoin is unstable over the pandemic. Whereas, GOLD is the most promising hedge and safe-haven asset, as it remains robust during the current crisis of COVID-19 and thus exhibits superiority over Bitcoin and Tether. Our findings are useful for investors, portfolio managers and policymakers interested in spillovers and safe havens during the current pandemic.",
        "DOI": "10.1002/ijfe.2738",
        "paper_author": "Ghabri Y.",
        "affiliation_name": "Center of Research for Energy and Climate Change (CRECC)",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "126612040",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Leading the Board in a Crisis: Strategy and Performance Implications of Board Chair Directive Leadership",
        "publication": "Journal of Management",
        "citied_by": "12",
        "cover_date": "2024-02-01",
        "Abstract": "The COVID-19 pandemic has disrupted nearly every boardroom in the world. However, neither the extant leadership literature nor the corporate governance literature offers succinct guidance on what constitutes effective board leadership during such a calamity. To address this theoretical and practical need, we develop a moderated mediation model, in which directive leadership from the board chair promotes competitive simplification at the onset of the crisis, which in turn promotes firm financial performance during the crisis. Using survey responses from 120 directors of U.S. public firms in Spring of 2020, combined with firm-level archival data from multiple sources and time periods, we find support for this mediated relationship—but only if the chair is not CEO. If the chair is CEO, we find no evidence of a positive relationship between directive leadership and either competitive simplification or firm financial performance; rather, we find some evidence of a negative relationship. We explore the implications of these findings for the theory and practice of corporate governance and crisis management.",
        "DOI": "10.1177/01492063221121584",
        "paper_author": "Krause R.",
        "affiliation_name": "Texas Christian University",
        "affiliation_city": "Fort Worth",
        "affiliation_country": "United States",
        "affiliation_id": "60019424",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "The nexus between financial inclusion and bank profitability: a dynamic panel approach",
        "publication": "Journal of Sustainable Finance and Investment",
        "citied_by": "12",
        "cover_date": "2024-01-01",
        "Abstract": "This study examines the impact of financial inclusion on bank profitability in Sub-Saharan Africa (SSA) over the period 2000–2017. Using different sub-indicators of financial inclusion, the study employs the principal component analysis (PCA) to generate an index of financial inclusion. Applying the generalized method of moments technique which addresses the problem of endogeneity, the results show that financial inclusion negatively influences bank profitability in Sub-Saharan Africa, particularly in the post-global financial crisis period. Banking sector stability is noted to positively and significantly drive bank performance. Besides, while inflation has a significant positive impact on profitability, the effect of economic growth on profitability differs depending on the period of analysis. The study suggests that policy measures aimed at achieving a financially inclusive economy should encompass policies directed at improving banking sector profitability. That is, strategies to stimulate financial inclusion should move in tandem with policies to boost profitability.",
        "DOI": "10.1080/20430795.2022.2105792",
        "paper_author": "Yakubu I.N.",
        "affiliation_name": "Ankara Yildirim Beyazit University",
        "affiliation_city": "Ankara",
        "affiliation_country": "Turkey",
        "affiliation_id": "60106507",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Financial stability, liquidity risk and income diversification: evidence from European banks using the CAMELS–DEA approach",
        "publication": "Annals of Operations Research",
        "citied_by": "12",
        "cover_date": "2024-03-01",
        "Abstract": "Liquidity risk was at the heart of 2007–2008 global financial crisis, which has led to a series of financial institutions failure. We test whether and how liquidity risk impacts European banks’ stability (i.e., a bank risk-return profile) under different levels of engagement in non-traditional banking activities after the global financial crisis and during the implementation of the Basel III liquidity rules. To calculate financial stability, we adopt an efficiency perspective based on the combination of the CAMELS rating system with the data envelopment analysis technique. We implement a nonlinear panel smooth transition regression approach, where transitional factors of income diversification are endogenously captured from the data. We find that, liquidity risk stemming from liquidity creation has a positive impact on bank stability, implying that income diversification can serve as a “buffer” through which banks can ensure their liquidity creation and offset for the compression of intermediation margin in lending and deposit activities. This suggests that diversification does not impede the ability of banks to operate with lower liquidity holdings but allows them to make greater use of their balance sheets to fulfill their primary roles of credit provision and liquidity creation. The results offer interesting implications for regulators and bank managers in managing liquidity risk.",
        "DOI": "10.1007/s10479-022-04805-1",
        "paper_author": "Ben Lahouel B.",
        "affiliation_name": "IPAG Business School",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60278992",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "Towards sustainability: Evaluating energy efficiency with a super-efficiency SBM-DEA model across 168 economies",
        "publication": "Applied Energy",
        "citied_by": "11",
        "cover_date": "2024-12-15",
        "Abstract": "Enhancing energy efficiency (EE) is a crucial strategy for fostering sustainable development through the alignment of economic growth, energy conservation, emission mitigation, and social welfare improvement. It is widely recognized as the most accessible, secure, and cost-effective means of advancing sustainable development. However, many developing economies still exhibit remarkably low levels of EE, resulting in significant disparities compared to their developed counterparts. These disparities pose challenges to the realization of the United Nations' sustainable development goals (SDGs). In response to the limitations of extant EE definitions, our study proposes a redefined concept of EE within the sustainable development framework. Subsequently, we utilize the super-efficiency SBM-DEA model to assess the EE of 168 economies globally from 2000 to 2017, offering a detailed examination centered on spatiotemporal patterns and inequality. Key findings include: (1) Global EE initially displayed an upward trajectory, followed by a decline, with a persistent decrease post-2009; the impact of global financial crisis on EE varies across income groups of economies. (2) Spatially, EE exhibits a notable geographical clustering effect, with regions displaying distinct concentrations of high and low EE throughout the study period. (3) While global EE inequality has generally diminished, disparities within income groups have become the dominant source of EE inequality. Our research elucidates the intricate dynamics of global EE and underscores its integral role in the pursuit of sustainable development.",
        "DOI": "10.1016/j.apenergy.2024.124254",
        "paper_author": "Shu T.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Corporate governance effectiveness and firm performance in global crisis: evidence from GCC countries",
        "publication": "Corporate Governance (Bingley)",
        "citied_by": "11",
        "cover_date": "2024-01-01",
        "Abstract": "Purpose: This study aims to examine the impact of corporate governance (CG) effectiveness measured by board and audit committee index on firm performance of nonfinancial listed firms in Gulf Cooperation Council (GCC) countries, pre- and during the global crisis of COVID-19. Design/methodology/approach: The analysis used 2,238 observations from nonfinancial firms listed on GCC countries' stock exchange, covering the period from 2017 to 2022, using a fixed effect panel regression model. The data for this study were manually collected from the annual reports of 373 GCC-listed firms. Findings: The results demonstrate that the board's effectiveness index has a positive influence solely on accounting-based performance (return on assets) pre- and during the COVID-19 crisis. However, in terms of audit committee effectiveness, the results show a positive impact on market-based performance (Tobin’s Q) both pre- and during the COVID-19 crisis. Additional analysis indicates that the effectiveness of both the board and audit committee is more notable in larger firms compared to smaller firms. Practical implications: This study is crucial for investors, regulators, managers and governments tackling the financial impacts of global crises like COVID-19. Its comprehensive evaluation of board and audit committee effectiveness guides policymakers and practitioners in enhancing CG for profit and wealth maximization. Originality/value: This study offers novel evidence detailing the impact of CG effectiveness on firm performance over an extended period, encompassing the COVID-19 period and using a comprehensive index. In addition, this study was conducted in a unique CG setting, focusing on six emerging GCC countries.",
        "DOI": "10.1108/CG-12-2023-0518",
        "paper_author": "Alshdaifat S.M.",
        "affiliation_name": "Putra Business School",
        "affiliation_city": "Serdang",
        "affiliation_country": "Malaysia",
        "affiliation_id": "114911671",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Analyzing fossil fuel commodities' return spillovers during the Russia and Ukraine crisis in the energy market",
        "publication": "Energy Economics",
        "citied_by": "11",
        "cover_date": "2024-07-01",
        "Abstract": "During the Russia and Ukraine crises, the energy market, including fossil fuel commodities, experienced significant global shocks. This research paper investigates the phenomenon of return spillover across the energy market amid the Russia and Ukraine conflict, utilizing the Diebold and Yilmaz Spillover Framework and EGRACH Model. The study examines daily frequency data from 24 February 2022 to 30 June 2023, focusing on the interconnectedness between various energy commodities: Brent Oil, Carbon Emissions, Crude Oil WTI, Gasoline, Heating Oil, and Natural Gas. The result of the study reports a total spillover index of 36%, indicating a significant spillover during the Russia and Ukraine conflict. Furthermore, the highest dynamic gross directional return spillovers have been reported in Brent Oil compared to the others. However, carbon emissions and natural gas have the lowest spillovers. The study significantly contributes to a deeper understanding of energy commodities by confirming the volatility persistence across the energy market based on the E-GARCH model.",
        "DOI": "10.1016/j.eneco.2024.107651",
        "paper_author": "Kayani U.",
        "affiliation_name": "Al Ain University",
        "affiliation_city": "Al Ain",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60105817",
        "affiliation_state": "Abu Dhabi"
    }
]