[
    {
        "paper_title": "Viable supply chain model: integrating agility, resilience and sustainability perspectives—lessons from and thinking beyond the COVID-19 pandemic",
        "publication": "Annals of Operations Research",
        "citied_by": "656",
        "cover_date": "2022-12-01",
        "Abstract": "Viability is the ability of a supply chain (SC) to maintain itself and survive in a changing environment through a redesign of structures and replanning of performance with long-term impacts. In this paper, we theorize a new notion—the viable supply chain (VSC). In our approach, viability is considered as an underlying SC property spanning three perspectives, i.e., agility, resilience, and sustainability. The principal ideas of the VSC model are adaptable structural SC designs for supply–demand allocations and, most importantly, establishment and control of adaptive mechanisms for transitions between the structural designs. Further, we demonstrate how the VSC components can be categorized across organizational, informational, process-functional, technological, and financial structures. Moreover, our study offers a VSC framework within an SC ecosystem. We discuss the relations between resilience and viability. Through the lens and guidance of dynamic systems theory, we illustrate the VSC model at the technical level. The VSC model can be of value for decision-makers to design SCs that can react adaptively to both positive changes (i.e., the agility angle) and be able to absorb negative disturbances, recover and survive during short-term disruptions and long-term, global shocks with societal and economical transformations (i.e., the resilience and sustainability angles). The VSC model can help firms in guiding their decisions on recovery and re-building of their SCs after global, long-term crises such as the COVID-19 pandemic. We emphasize that resilience is the central perspective in the VSC guaranteeing viability of the SCs of the future. Emerging directions in VSC research are discussed.",
        "DOI": "10.1007/s10479-020-03640-6",
        "paper_author": "Ivanov D.",
        "affiliation_name": "Hochschule für Wirtschaft und Recht Berlin",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60029732",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Sustainable development, ESG performance and company market value: Mediating effect of financial performance",
        "publication": "Business Strategy and the Environment",
        "citied_by": "334",
        "cover_date": "2022-11-01",
        "Abstract": "At present, more and more attention is paid to the sustainable development of enterprises. In particular, in the context of frequent financial crises and COVID-19 pandemic, how the performance of listed companies' environmental, social, and governance (ESG) affects the company's market value has attracted widespread attention. Different from existing studies, this paper takes financial performance as a mediating variable and constructs linear regression model and mediating effect model based on analyzing the relationship between ESG performance, financial performance, and company market value and their influencing mechanism. The ESG rating data of Chinese listed companies newly developed by SynTao Green Finance from 2014 to 2019 were selected for empirical test. The results show that the improvement of ESG performance of listed companies can improve the market value of the company, and the financial performance of the company presents an obvious mediating effect. At the same time, operational capacity is an important mediating way for ESG performance to affect the company's market value. Further research shows that ESG performance of state-owned listed companies exerts a stronger mediating effect on corporate operating capacity. Finally, this paper provides relevant suggestions for regulators, listed companies, and investors.",
        "DOI": "10.1002/bse.3089",
        "paper_author": "Zhou G.",
        "affiliation_name": "Fudan University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60009860",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Testing the fluctuations of oil resource price volatility: A hurdle for economic recovery",
        "publication": "Resources Policy",
        "citied_by": "307",
        "cover_date": "2022-12-01",
        "Abstract": "The influence of oil price volatility on significant international macroeconomic indicators is examined empirically. The vector auto-regression (VAR) system is used to examine the influence of oil price volatility. According to the Granger causality test, impulse response functions, and variance decomposition, economic recovery and investment have been significantly affected by oil price volatility from 2000Q1 to 2020Q4. According to this research, business investment and oil prices have shown great power throughout the international economic meltdown. Volatility in economic activity and oil prices are expected during this crisis, according to the recent COVID-19 outbreak. Furthermore, in the international financial crisis and COVID-19 crises, oil prices and economic growth are strongly linked. We propose that the COVID-19 epidemic and the global financial problems have major effects on economic activity when oil prices fall. The COVID-19 epidemic had the greatest total connectedness between oil prices and economic activities, which suggests that the speed of information propagation between the oil market and financial initiatives was greater during the COVID-19 outbreak than during past global financial crises. There are important consequences for policymakers based on the findings of this research.",
        "DOI": "10.1016/j.resourpol.2022.102982",
        "paper_author": "Xiuzhen X.",
        "affiliation_name": "Guangzhou College of Technology and Business",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60264393",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Responding to the opioid crisis in North America and beyond: recommendations of the Stanford–Lancet Commission",
        "publication": "The Lancet",
        "citied_by": "264",
        "cover_date": "2022-02-05",
        "Abstract": "NA",
        "DOI": "10.1016/S0140-6736(21)02252-2",
        "paper_author": "Humphreys K.",
        "affiliation_name": "Stanford University School of Medicine",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60032838",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Corporate ESG reporting quantity, quality and performance: Where to now for environmental policy and practice?",
        "publication": "Business Strategy and the Environment",
        "citied_by": "257",
        "cover_date": "2022-03-01",
        "Abstract": "Environmental, social and governance (ESG) issues are driving corporate strategy and performance. However, does this mean more ESG reporting is being done? If so, is the quality of ESG reports improving? And what about ESG performance? In this paper, we examine these three trends in ESG reporting—quantity, quality and corporate ESG performance. With a Swedish multinational corporate focus, we analyse data from Sustainalytics, corporateregister.com and the Alliance for Corporate Transparency to answer our research questions. Our analysis shows that, while the quality of ESG information in Sweden has steadily improved, performance plateaued around 2015. Mitigating problems such as the impacts of climate change and COVID-19 call for improved ESG performance, not improved ESG reporting quantity or quality. Thus, rather than focusing on improving ESG reporting regulations, we need to redirect our focus towards creating better ESG outcomes. Therefore, we argue that companies must be asked to provide data that are more timely, relevant, credible and comparable and that demonstrate improved ESG performance. With this information, financial analysts and investors can redirect and accelerate capital flows towards corporate investments that help tackle important problems related to climate crises and the reaching of a sustainable development. Our analysis reveals that we need more research focusing on consumers, investors and policymakers. Future scholars could explore how changing consumer preferences are driving improvements in ESG performance and how changing capital market allocations affect ESG performance.",
        "DOI": "10.1002/bse.2937",
        "paper_author": "Arvidsson S.",
        "affiliation_name": "Ekonomihögskolan vid Lunds Universitet",
        "affiliation_city": "Lund",
        "affiliation_country": "Sweden",
        "affiliation_id": "60110628",
        "affiliation_state": "Skane"
    },
    {
        "paper_title": "Time-frequency connectedness among clean-energy stocks and fossil fuel markets: Comparison between financial, oil and pandemic crisis",
        "publication": "Energy",
        "citied_by": "227",
        "cover_date": "2022-02-01",
        "Abstract": "Motivated by lack of empirical research on volatility linkages among clean-energy stock markets and fossil fuel markets during the recent Covid-19 pandemic, the study examines the volatility connectedness network among clean-energy stocks and fossil fuels such as crude WTI, natural gas, gas oil, and fuel oil. In addition, we also compare the influence of financial crises such as the Global Financial Crisis (GFC), oil crisis, and Covid-19 pandemic crisis is driving the volatility connectedness network of energy markets. We apply Diebold and Yilmaz (2012) [1] time-domain and Barunik and Krehlik (Baruník and Křehlík, 2018) [2] frequency-domain approach. The empirical results uncover weak volatility connections among clean-energy stocks and fossil fuel markets. Meanwhile, we find strong volatility interconnectedness between petroleum markets. Further, the results show that most of the volatility spillovers among energy markets persist in the short-run, whereas the findings display weak volatility transmission among the sample markets in the long run. Furthermore, the findings also unveil that contagion effects between the energy markets increase in the crisis periods, intensifying the volatility interlinkages among the sample energy markets. The findings have important significance for energy policymakers and investors.",
        "DOI": "10.1016/j.energy.2021.122702",
        "paper_author": "Umar M.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Market incentives, carbon quota allocation and carbon emission reduction: Evidence from China's carbon trading pilot policy",
        "publication": "Journal of Environmental Management",
        "citied_by": "214",
        "cover_date": "2022-10-01",
        "Abstract": "As a major carbon dioxide-emitting country, China set carbon trading market to reduce enterprise carbon emissions through the rational allocation of carbon quotas among different enterprises and regions. The market has also conducted a preliminary exploration for the country to achieve carbon dioxide emissions peak in 2030 and carbon neutrality in 2060 while actively addressing the challenges of global climate change. This study analysed the emission reduction effect of China's carbon trading pilot policy, especially the role of carbon quota and carbon trading price. The analysis used county-level panel data from 1997 to 2017, regarded the implementation of the carbon trading pilot policy as a quasi-natural experiment, and used the difference-in-differences method. The results showed that, first, the policy implementation not only reduced regional carbon emissions but also inhibited carbon dioxide emissions per capita, with long-term effects. Second, the carbon emission reduction effect brought by the carbon pilot policy showed significant heterogeneous results with the different degrees of regional carbon emissions and environmental supervision. The effect was greater in areas with higher carbon emission density and stronger legal supervision. Third, the difference in carbon quota allocations resulted in different emission reduction effects, among which the historical method had the strongest effect. The carbon quota price and number of enterprises participating carbon trading market were the key factors affecting carbon emission reduction.",
        "DOI": "10.1016/j.jenvman.2022.115650",
        "paper_author": "Shi B.",
        "affiliation_name": "Northwest University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60001298",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Does oil connect differently with prominent assets during war? Analysis of intra-day data during the Russia-Ukraine saga",
        "publication": "Resources Policy",
        "citied_by": "191",
        "cover_date": "2022-08-01",
        "Abstract": "The ongoing Russia-Ukraine war is obviously the most prominent war in Europe since the second world war, changing the dynamics of the oil and other prominent markets. As the oil market has been historically known to associate with other financial and commodity markets, it is important to see if oil connects differently with prominent financial assets during market turbulence caused by a war. Thus, we make the first attempt to examine how oil connects with prominent financial assets, namely bonds, bitcoin, U.S. dollar, gold, and stocks, using intra-day data, before and during the war. We find that connectedness is stronger during the war than before it. Oil becomes a net transmitter of spillovers during the war, unlike in the pre-war era when it is characterized as a net receiver of spillovers. Also, whereas the net directional pairwise results suggest heterogeneity regarding how oil connects individually with each of the remaining assets before the war, oil has a strong spillover effect on all of them during the war. However, the spillover effect is transitory, as it dies out over time. The findings are robust to intra-day data of different frequency, and have suitable implications for short-term investors, and further agendas for future research in relation to the impacts of the war are provided.",
        "DOI": "10.1016/j.resourpol.2022.102728",
        "paper_author": "Adekoya O.B.",
        "affiliation_name": "Federal University of Agriculture, Abeokuta",
        "affiliation_city": "Abeokuta",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60008386",
        "affiliation_state": "Ogun"
    },
    {
        "paper_title": "Impact of Green financing, FinTech, and financial inclusion on energy efficiency",
        "publication": "Environmental Science and Pollution Research",
        "citied_by": "178",
        "cover_date": "2022-03-01",
        "Abstract": "In modern times, enhancing energy efficiency is one of the core agenda items for the economies to progress the world. United Nations general assembly has recommended increasing energy efficiency by considering the SDG-7 guidelines. In the contemporary period, E7 economies are deficient in producing the financial resources to ensure the availability of funds for the acquisition of energy efficiency. COVID-19 crises, lack of resilience in economies, devastating fiscal burdens, and tight monetary conditions of E7 economies are the major barriers. To resolve such issues, some innovative financing techniques, such as green financing, financial inclusion, and FinTech, were suggested to investigate. However, this research tested the empirical role of financial inclusion, green financing, and FinTech on the energy efficiency of E7 economies. Study findings have shown a significant role of such financing techniques on energy efficiency. Comparatively, green financing is found most fitting and highly supportive financing tool for energy efficiency among the three. The differences in attributes, financing mechanism, funds flow system, transection systems, and variation in support by the financial institution are the main reasons that lessen the role of financial inclusion and FinTech for energy efficiency. However, theorists must revisit the transaction system of FinTech and financial inclusion parameters like green bonds for energy efficiency attainment. Policymakers are suggested to develop viable and energy system-friendly policies to grant green finance to the energy systems of E7 economies, as conveniently as possible.",
        "DOI": "10.1007/s11356-021-16949-x",
        "paper_author": "Liu H.",
        "affiliation_name": "Tongji University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60073652",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Prioritizing and overcoming biomass energy barriers: Application of AHP and G-TOPSIS approaches",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "177",
        "cover_date": "2022-04-01",
        "Abstract": "India strives to utilize optimum biomass potential to overcome the prevailing energy crises. However, a variety of barriers are hindering the development of the biomass industry. Some scholars have considered these barriers in previous studies; however, it has been largely unknown the extent to which these barriers obstruct the Indian biomass industry. To address this issue, this study systematically prioritizes barriers based on their importance. A total of twenty-four barriers are recognized and classified into five major categories using an extensive literature review and a modified Delphi approach. The rankings of major barriers and sub-barriers are determined based on weight allocation using the Analytic Hierarchical Process (AHP). The Grey Technique for Order Preference by Similarity to Ideal Solution (G-TOPSIS) is used to rank the alternative solutions to these barriers. The research results specify that the \"technological & infrastructural\" barrier is the top-ranked barrier among major categories, followed by economic & financial, political & institutional, cultural & behavioral, and meteorological barriers. The overall ranking indicates that \"technological complexity\" ranks highest among all sub-barriers across all categories. It has been posited that \"enhancing research and development (R&D) activities\" would prove to be the best alternative solution. Based on study findings, it is recommended that policymakers, stakeholders, and government institutions should work in a consistent and coherent way to make sure the availability of adequate subsidies, increase feedstock supply and provide training to local inhabitants for the sake of accelerating the currently crawling progress of the Indian biomass industry.",
        "DOI": "10.1016/j.techfore.2022.121524",
        "paper_author": "Irfan M.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "NFTs and asset class spillovers: Lessons from the period around the COVID-19 pandemic",
        "publication": "Finance Research Letters",
        "citied_by": "166",
        "cover_date": "2022-06-01",
        "Abstract": "In this paper, we analyze the connectedness between returns for non-fungible tokens (NFTs) and other financial assets (equities, bonds, currencies, gold, oil, Ethereum) during the period from January 2018 to June 2021. By using the Time-Varying Parameter Vector Autoregressions (TVP-VAR) approach, we show that the overall connectedness between the returns for financial assets increased during the COVID-19 period. Our static analysis shows that the behavior of the majority of NFT returns is attributable to endogenous shocks and only a small portion of this variation resulted from the impact of innovation in other assets. The results suggest that NFTs are mainly independent of shocks from common assets classes and even from their close relation, Ethereum. The dynamic analysis across time reveals that during normal times, NFTs act as transmitters of systemic risk to some degree, but during stressful times, their role shifts, and they act as absorbers of risk spillovers. This suggests that NFTs may have diversification benefits during turbulent times, as apparent during the COVID-19 crisis, and especially around the great March 2020 market plunge.",
        "DOI": "10.1016/j.frl.2021.102515",
        "paper_author": "Aharon D.Y.",
        "affiliation_name": "Ono Academic College",
        "affiliation_city": "Kiriat Ono",
        "affiliation_country": "Israel",
        "affiliation_id": "60112467",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Automated landlord: Digital technologies and post-crisis financial accumulation",
        "publication": "Environment and Planning A",
        "citied_by": "164",
        "cover_date": "2022-02-01",
        "Abstract": "This article centers the role of digital technologies in extending financial accumulation into new sectors of the US housing market in the wake of the global financial crisis. I argue that while post-crisis market conditions provided an opportunity for large investors to acquire foreclosed single-family homes, convert them to rental housing, and roll out an new asset class based on bundled rent checks, these conditions were insufficient on their own. Digital innovations coming to prominence since the 2008 crisis were required to automate core functions, such as rent collection and maintenance, in order to efficiently manage large, geographically dispersed property portfolios. New information technologies enabled investors to aggregate ownership of resources, extract income flows, and securely convey these flows to capital markets. Such advances have, therefore, given rise to the “automated landlord”, whereby the management of tenants and properties is increasingly not only mediated, but governed, by smartphones, digital platforms, and apps, and the data and analytics these devices and infrastructures gather and enable. This article shows how technological transformations actively participate in the ongoing, dynamic process of financial accumulation strategies, and contends that digital technologies, therefore, also comprise a crucial terrain of struggles over housing’s place in contemporary capitalism.",
        "DOI": "10.1177/0308518X19846514",
        "paper_author": "Fields D.",
        "affiliation_name": "The University of Sheffield",
        "affiliation_city": "Sheffield",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60001881",
        "affiliation_state": "South Yorkshire"
    },
    {
        "paper_title": "What matters for regional economic resilience amid COVID-19? Evidence from cities in Northeast China",
        "publication": "Cities",
        "citied_by": "154",
        "cover_date": "2022-01-01",
        "Abstract": "This paper examines how the economies of old industrial cities in Northeast China respond to the on-going COVID-19 pandemic crisis. The notion of resistance in regional economic resilience is used to explore what impact factors shape the response to the early stage of the crisis. The analysis reveals significant differences in terms of regional economic impact between COVID-19 and the 2008 financial crisis. We find that large cities are more vulnerable and exposed to the pandemic at its early stage, state agency plays a crucial role in shaping the economic resistance in most cities. Going beyond the existing 2008 financial crisis-induced account on regional economic resilience, this paper argues that regional resistance amid COVID-19 is not merely shaped by economic structural factors but also influenced by state agency in terms of economic restriction and restoration measures. The study suggests that the nature of COVID-19 as a particular context of crisis itself needs to be taken seriously when exploring the determinants and outcomes of regional economic resilience.",
        "DOI": "10.1016/j.cities.2021.103440",
        "paper_author": "Hu X.",
        "affiliation_name": "Nanjing Normal University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60020258",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "The Political Economy of Populism<sup>†</sup>",
        "publication": "Journal of Economic Literature",
        "citied_by": "151",
        "cover_date": "2022-09-01",
        "Abstract": "We synthesize the literature on the recent rise of populism. First, we discuss definitions and present descriptive evidence on the recent increase in support for populists. Second, we cover the historical evolution of populist regimes since the late nineteenth century. Third, we discuss the role of secular economic factors related to cross-border trade and automation. Fourth, we review studies on the role of the 2008–09 global financial crisis and subsequent austerity, connect them to historical work covering the Great Depression, and discuss likely mechanisms. Fifth, we discuss studies on identity politics, trust, and cultural backlash. Sixth, we discuss economic and cultural consequences of growth in immigration and the recent refugee crisis. We also discuss the gap between perceptions and reality regarding immigration. Seventh, we review studies on the impact of the internet and social media. Eighth, we discuss the literature on the implications of populism’s recent rise. We conclude outlining avenues for further research.",
        "DOI": "10.1257/jel.20201595",
        "paper_author": "Guriev S.",
        "affiliation_name": "SciencesPo Paris",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60083821",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "Measuring China's green economic recovery and energy environment sustainability: Econometric analysis of sustainable development goals",
        "publication": "Economic Analysis and Policy",
        "citied_by": "149",
        "cover_date": "2022-09-01",
        "Abstract": "The purpose of this research is to assess China's sustainable economic recovery and growth through a comparative analysis of China's global economy following Covid-19. We use the unit root test and generalized method of moments (GMM) to make inferences. The growth scenario is an important consequence of economic recovery, and the study concludes that increased energy use and rising energy costs need greater funding for the energy industry. Green energy financing is urgently required to offset rising production costs of gas and electricity. It is recommended that both Chinese and global financial institutions, banks and finance ministries, take a prominent role in addressing the crisis. This can be achieved by investing in renewable energy to improve sustainable economic recovery, reduce greenhouse gas (GHG) emissions and accelerate economic recovery. This must be carried out over a long period to achieve the intended results. Strategic development goals (SDGs), such as SDG 7 on clean and cheap energy, and SDG 13 on combating climate change, are urged on all nations in both areas.",
        "DOI": "10.1016/j.eap.2022.07.005",
        "paper_author": "Bai X.",
        "affiliation_name": "Zhejiang University of Finance and Economics",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60098512",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "COVID-19 in Africa: socio-economic impact, policy response and opportunities",
        "publication": "International Journal of Sociology and Social Policy",
        "citied_by": "149",
        "cover_date": "2022-04-05",
        "Abstract": "Purpose: This paper examines the socio-economic impact of COVID-19 and the policy response in African countries. Design/methodology/approach: This study uses discourse analysis to analyse the socio-economic impact of COVID-19 in Africa. Findings: The findings reveal that African countries have been affected by the coronavirus pandemic, and the effect was more severe for African regions compared to other regions. The rising pandemic affected social interaction and economic activities through the imposed social distancing policies that have different levels of strictness in several African countries Practical implications: The implication of the findings is that social policies can affect the social and economic well-being of citizens. Secondly, the coronavirus outbreak has revealed how a biological crisis can be transformed to a sociological subject. The most important sociological consequence of the coronavirus outbreak for African citizens is the creation of social anxiety among families and households in the region. The outbreak has also shown how vulnerable African societies are in facing health hazards. Policymakers should enforce social policies that unite communities in bad times, to reduce social anxiety. Originality/value: This is the first paper that explore the socio-economic impact of coronavirus and the policy response in African countries.",
        "DOI": "10.1108/IJSSP-05-2020-0171",
        "paper_author": "Ozili P.",
        "affiliation_name": "Central Bank of Nigeria",
        "affiliation_city": "Abuja",
        "affiliation_country": "Nigeria",
        "affiliation_id": "112973190",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Land financialisation and the financing of urban development in China",
        "publication": "Land Use Policy",
        "citied_by": "145",
        "cover_date": "2022-01-01",
        "Abstract": "There is a growing body of literature on China's land reform, land system and land-centred urbanisation. While the contribution of land proceeds to Chinese local public finance and infrastructure investment has been widely acknowledged, few studies examine land through the perspective of financialisation, namely how land development uses financial instruments to generate development finance. The process of land-driven financialisation in China has not been well understood. This paper examines the land mortgage, which has accelerated since 2008, and subsequent waves of financialisation through local government financial vehicles (LGFVs) and Chengtou Bonds (urban construction and investment bonds). We highlight that the adoption of a fiscal stimulus package triggered land financialisation, which started as a development strategy for crisis management in China.",
        "DOI": "10.1016/j.landusepol.2019.104412",
        "paper_author": "Wu F.",
        "affiliation_name": "The Bartlett Faculty of the Built Environment",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60084282",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Changes in Alcohol Use During COVID-19 and Associations With Contextual and Individual Difference Variables: A Systematic Review and Meta-Analysis",
        "publication": "Psychology of Addictive Behaviors",
        "citied_by": "143",
        "cover_date": "2022-01-01",
        "Abstract": "Objective: The present study meta-analyzed studies examining changes in alcohol consumption during the coronavirus disease (COVID-19) pandemic and systematically reviewed contextual and individual difference factors related to these changes. Method: Following the preferred reporting items for systematic reviews and meta-analysis (PRISMA) protocol, studies were gathered via PsycINFO, PubMed/MEDLINE, and preprint databases (published April 29, 2021) that examined individual-level changes in consumption during the initial COVID-19 mitigation measures (before October 2020). Next, sample proportion increases and decreases in consumption, in addition to mean change in consumption variables from pre to during-COVID, were meta-analyzed, and contextual and individual difference variables related to consumption changes during the pandemic were summarized. Results: One hundred and twenty-eight studies provided data from 58 countries (M n = 3,876; Mdn n = 1,092; aggregate sample n = 492,235). The average mean change in alcohol consumption was nonsignificant (Cohen’s d = −0.01, p =.68); however, meta-analysis revealed that 23% of participants reported increases in consumption and 23% reported decreases. These changes were moderated by per capita gross domestic product and country. Narrative synthesis revealed multiple predictors of increased drinking, including contextual changes (e.g., children at home, income loss, working remotely), individual difference variables (being female, a young-to-middle aged adult, or Black), and mental health/alcohol-related risk factors (e.g., depression). Conclusions: The identified factors associated with increased alcohol consumption should be considered in planning behavioral health services during future crisis events that abruptly alter everyday environments in ways that increase stress and decrease access to naturally occurring rewards.",
        "DOI": "10.1037/adb0000796",
        "paper_author": "Acuff S.F.",
        "affiliation_name": "College of Arts &amp; Sciences",
        "affiliation_city": "Memphis",
        "affiliation_country": "United States",
        "affiliation_id": "60280399",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Do ESG strategies enhance bank stability during financial turmoil? Evidence from Europe",
        "publication": "European Journal of Finance",
        "citied_by": "140",
        "cover_date": "2022-01-01",
        "Abstract": "This paper investigates the joint and separate effects of Environmental (E), Social (S), and Governance (G) scores on bank stability. Using a sample of European banks operating in 21 countries over 2005–2017, we find that the total ESG score, as well as its sub-pillars, reduces bank fragility during periods of financial distress. This stabilizing effect holds strongly for banks with higher ESG ratings. These results are confirmed by a differences-in-differences (DID) analysis built around the introduction of the EU 2014 Non-Financial Reporting Directive (NFRD). Our evidence also reveals that, in times of financial turmoil, the longer the duration of ESG disclosures, the greater the benefits on stability. Finally, we show that the ESG–bank stability linkages vary significantly across banks’ characteristics and operating environments. Our findings are robust to selection bias and endogeneity concerns. Overall, they support the regulatory effort in requiring an enhanced disclosure of non–financial information.",
        "DOI": "10.1080/1351847X.2021.1964556",
        "paper_author": "Chiaramonte L.",
        "affiliation_name": "Università degli Studi di Verona",
        "affiliation_city": "Verona",
        "affiliation_country": "Italy",
        "affiliation_id": "60032256",
        "affiliation_state": "VR"
    },
    {
        "paper_title": "The Time Variation in Risk Appetite and Uncertainty",
        "publication": "Management Science",
        "citied_by": "137",
        "cover_date": "2022-06-01",
        "Abstract": "We formulate a dynamic no-arbitrage asset pricing model for equities and corporate bonds, featuring time variation in both risk aversion and economic uncertainty. The joint dynamics among cash flows, macroeconomic fundamentals, and risk aversion accommodate both heteroskedasticity and non-Gaussianity. The model delivers measures of risk aversion and uncertainty at the daily frequency. We verify that equity variance risk premiums are very informative about risk aversion, whereas credit spreads and corporate bond volatility are highly correlated with economic uncertainty. Our model-implied risk premiums outperform standard instruments for predicting asset excess returns. Risk aversion is substantially correlated with consumer confidence measures and in early 2020 reacted more strongly to new COVID cases than did an uncertainty proxy.",
        "DOI": "10.1287/mnsc.2021.4068",
        "paper_author": "Bekaert G.",
        "affiliation_name": "Columbia Business School",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60027552",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Linking nuclear energy, human development and carbon emission in BRICS region: Do external debt and financial globalization protect the environment?",
        "publication": "Nuclear Engineering and Technology",
        "citied_by": "133",
        "cover_date": "2022-09-01",
        "Abstract": "Nuclear energy has the potential to play an influential role in energy transition efforts than is now anticipated by many countries. Realizing sustainable human development and reducing global climate crises will become more difficult without significantly increasing nuclear power. This paper aims to probe the role of nuclear energy, external debt, and financial globalization in sustaining human development and environmental conditions simultaneously in BRICS (Brazil, Russia, India, China, and South Africa) countries. This study applied a battery of second-generation estimation approaches over the period from 1990 to 2019. These methods are useful and robust to cross-countries dependencies, slope heterogeneity, parameters endogeneity, and serial correlation that are ignored in conventional approaches to generate more comprehensive and reliable estimates. The empirical findings indicate that nuclear energy and financial globalization contribute to human development, whereas external debt inhibits it. Similarly, financial globalization accelerates ecological deterioration, but nuclear energy and external debt promote environmental sustainability. Moreover, the study reveals bidirectional feedback causalities between human development, carbon emissions and nuclear energy consumption. The study offers useful policy guidance on accomplishing sustainable and inclusive development in BRICS countries.",
        "DOI": "10.1016/j.net.2022.03.024",
        "paper_author": "Sadiq M.",
        "affiliation_name": "Central South University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60017060",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "Fintech in the time of COVID−19: Technological adoption during crises",
        "publication": "Journal of Financial Intermediation",
        "citied_by": "131",
        "cover_date": "2022-04-01",
        "Abstract": "We document the effects of the COVID−19 pandemic on digital finance and fintech adoption. Drawing on mobile application data from a globally representative sample, we find that the spread of COVID− 19 and related government lockdowns led to a sizeable increase in the rate of finance app downloads. We then analyze factors that may have driven this effect on the demand−side and better understand the “winners” from this digital acceleration on the supply−side. Our overall results suggest that traditional incumbents saw the largest growth in their digital offerings during the initial period, but that “BigTech” companies and newer fintech providers ultimately outperformed them over time. Finally, we drill−down further on the adoption of fintech apps pertaining to both the asset and liability side of the traditional bank balance sheet, to explore the implications that the accelerated trends in digitization may have for the future landscape of financial intermediation.",
        "DOI": "10.1016/j.jfi.2021.100945",
        "paper_author": "Fu J.",
        "affiliation_name": "Universität Zürich",
        "affiliation_city": "Zurich",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60012614",
        "affiliation_state": "ZH"
    },
    {
        "paper_title": "Volatility Spillovers between Stock and Energy Markets during Crises: A Comparative Assessment between the 2008 Global Financial Crisis and the Covid-19 Pandemic Crisis",
        "publication": "Finance Research Letters",
        "citied_by": "129",
        "cover_date": "2022-05-01",
        "Abstract": "This paper investigates volatility spillovers between energy and stock markets during periods of crises. Our main findings reveal that transmissions of volatilities among these markets during the Covid-19 pandemic crisis exceeded the ones recorded throughout the 2008 global financial crisis. All stock markets are net transmitters of volatility to energy markets during the 2008 global financial crisis while they show different patterns during the Covid-19 crisis. We also provide evidence of asymmetric volatility spillovers among stock and energy markets. Our results also indicate that on average natural gas provides better hedging effectiveness to the stock markets than crude oil.",
        "DOI": "10.1016/j.frl.2021.102363",
        "paper_author": "JEBABLI I.",
        "affiliation_name": "International University of Rabat",
        "affiliation_city": "Sale",
        "affiliation_country": "Morocco",
        "affiliation_id": "60111570",
        "affiliation_state": "Rabat-Sale-Kenitra"
    },
    {
        "paper_title": "Dynamic spillover effects and portfolio strategies between crude oil, gold and Chinese stock markets related to new energy vehicle",
        "publication": "Energy Economics",
        "citied_by": "125",
        "cover_date": "2022-05-01",
        "Abstract": "This paper investigates the volatility spillover effects and the dynamic relationships among WTI crude oil, gold and the Chinese stock markets of new energy vehicle, environmental protection, new energy, coal & consumable fuels, high and new technology, by adopting the method of Diebold and Yilmaz (2012, 2014) based on TVP-VAR model. The results indicate that there exists a high interdependence among all analyzed assets, and the total volatility spillover has a sharp increase under the major crisis events. On average, WTI crude oil and gold are the net receivers of the systemic shocks, while all of the analyzed stock markets are the net transmitters of the systemic shocks. Besides, the Granger causality test shows that the volatility of each asset can Granger cause the total connectedness index. Finally, we also calculate optimal hedge ratios, portfolio weights and the corresponding hedging effectiveness based on DCC-GARCH-t copula model. The empirical results show WTI crude oil and gold are cheap hedging tools. When investing a small part in WTI crude oil and a large part in the analyzed stock markets, high hedging effectiveness could be achieved.",
        "DOI": "10.1016/j.eneco.2022.105959",
        "paper_author": "Dai Z.",
        "affiliation_name": "Changsha University of Science and Technology",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60001338",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "Experiences of Intimate Partner Violence during Lockdown and the COVID-19 Pandemic",
        "publication": "Journal of Family Violence",
        "citied_by": "123",
        "cover_date": "2022-08-01",
        "Abstract": "Previous studies have demonstrated that there is an increase in Intimate Partner Violence (IPV) during times of crisis (e.g., financial, environmental, or socio-political situations). The COVID-19 pandemic has triggered an unprecedented global health and financial tragedy, but research is yet to establish exactly how the situation may impact on IPV. The present study investigates victims’ experience of IPV during lockdown and the COVID-19 pandemic. We report a qualitative thematic analysis of 50 discussion forum posts written by victims of IPV. Of these, 48 forum posts were written by female victims of male perpetrated violence. All forum posts were obtained from the popular online platform, Reddit. We identified four themes associated with IPV victims’ experiences during lockdown and the global pandemic: (i) Use of COVID-19 by the Abuser, (ii) Service Disruption, (iii) Preparation to Leave, and (iv) Factors Increasing Abuse or Distress. The COVID-19 pandemic has had a substantial impact on those living with IPV, often increasing the severity of IPV experienced. The experiences of those affected by IPV during this period inform interventions and the guidance and support provided to IPV victims during times of crisis.",
        "DOI": "10.1007/s10896-021-00260-x",
        "paper_author": "Lyons M.",
        "affiliation_name": "University of Liverpool",
        "affiliation_city": "Liverpool",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020661",
        "affiliation_state": "Merseyside"
    },
    {
        "paper_title": "Quantifying the hedge and safe-haven properties of bond markets for cryptocurrency indices",
        "publication": "Journal of Risk Finance",
        "citied_by": "116",
        "cover_date": "2022-03-02",
        "Abstract": "Purpose: This study quantified the hedge and safe haven features of bond markets for multiple cryptocurrency indices from June 2014 to April 2021 to highlight whether bond markets offer hedging facilities to uncertainty indices of cryptocurrencies. Design/methodology/approach: The authors employed the methodology of Baur and McDermott (2010) and AGDCC-GARCH model to measure the hedge and safe-haven characteristics of three bond markets (BBGT, SPGB and SKUK) for three uncertainty indexes of cryptocurrencies (UCRPR, UCRPO and ICEA). Findings: The authors find that bond markets are neither hedge nor safe havens except for SKUK which is a safe haven investment for cryptocurrency indices and offers substantial diversification during the periods of economic fragility. In addition, the hedge effectiveness of SPGB outperforms other bonds during crisis periods and provides sufficient diversification potential for cryptocurrency indices. Practical implications: The findings are important for policymakers, regulatory bodies, financial firms and investors in assessing hedge and safe haven characteristics of bond markets against cryptocurrency indices. Originality/value: Employing the novel methodology of AGDCC-GARCH with three different bond markets and three uncertainty indices of cryptocurrencies, the current study adds to the existing strand of literature in terms of quantifying hedge and safe-haven attributes of bond markets for cryptocurrency uncertainty indexes.",
        "DOI": "10.1108/JRF-09-2021-0158",
        "paper_author": "Karim S.",
        "affiliation_name": "Ilma University",
        "affiliation_city": "Karachi",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60089654",
        "affiliation_state": "Sindh"
    },
    {
        "paper_title": "Impact of COVID-19 on the quantile connectedness between energy, metals and agriculture commodities",
        "publication": "Energy Economics",
        "citied_by": "115",
        "cover_date": "2022-05-01",
        "Abstract": "With many studies highlighting the heterogeneous impact of the COVID-19 pandemic on different commodity markets, this study provides evidence of quantile connectedness between energy, metals, and agriculture commodity markets before and during the COVID-19 outbreak. Since mean-based measures of connectedness are not necessarily suitable to measure connectedness in the crisis period, especially in the tails of the return distribution, thus in this study, we use the newly developed approach of quantile-based connectedness. The full-sample analysis results show that return shocks only propagate within the energy commodity group. The findings manifest that transmission of return spillovers is stronger in the left and right tails of the conditional return distribution. In addition, the results unveil that degree of tail-dependence between energy, metals, and agriculture commodities are time-varying. Meanwhile, our sub-sample analysis clearly shows that the commodity market return connectedness demonstrates a significant shift over time due to COVID-19 shocks. There is evidence of strong transmission of return shocks between energy, metals, and agriculture commodities during the COVID-19 fiasco. Finally, the results also illustrate that softs and livestock commodities hold significant diversification benefits for energy market investors.",
        "DOI": "10.1016/j.eneco.2022.105962",
        "paper_author": "Farid S.",
        "affiliation_name": "University of Management and Technology Lahore",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60070625",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "ESG ratings and financial performance of exchange-traded funds during the COVID-19 pandemic",
        "publication": "Journal of Sustainable Finance and Investment",
        "citied_by": "115",
        "cover_date": "2022-01-01",
        "Abstract": "With the advent of the COVID-19 pandemic, the world has experienced economic and social fragility, which calls for alternative approaches to navigate towards sustainable outcomes. While recent studies show that responsible investments (RI) are resilient during the economic downturn caused by crises such as COVID-19, there has been little exploration into exchange-traded funds (ETFs). Using ANOVA and multivariate regression models, we analyze the differences and relationship between the financial returns of ETFs and their Eco-fund ratings during the COVID-19 pandemic-related financial market crash. Our results indicate that higher levels of the sustainability performance of ETFs do not safeguard investments from financial losses during a severe market downturn. These results contribute to the research by exposing weaknesses of current sustainability scores and rating methods to provide an initial analysis of RI during the COVID-19 pandemic.",
        "DOI": "10.1080/20430795.2020.1782814",
        "paper_author": "Folger-Laronde Z.",
        "affiliation_name": "University of Waterloo",
        "affiliation_city": "Waterloo",
        "affiliation_country": "Canada",
        "affiliation_id": "60014171",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Rethinking financial contagion: Information transmission mechanism during the COVID-19 pandemic",
        "publication": "Journal of International Financial Markets, Institutions and Money",
        "citied_by": "110",
        "cover_date": "2022-07-01",
        "Abstract": "Rapidly growing numbers of empirical papers assessing the financial effects of COVID-19 pandemic triggered an urgent need for a study summarising the existing knowledge of contagion phenomenon. This paper provides a review of conceptual approaches to studying financial contagion at four levels of information transmission: (i) Catalyst of contagion; (ii) Media attention; (iii) Spillover effect at financial markets; (iv) Macroeconomic fundamentals. We discuss the unique characteristics of COVID-19 crisis and demonstrate how this shock differs from previous crises and to what extent the COVID-19 pandemic can be considered a ‘black swan’ event. We also review the main concepts, definitions and methodologies that are frequently, but inconsistently, used in contagion literature to unveil the existing problems and ambiguities in this popular area of research. This paper will help researchers to conduct coherent and methodologically rigorous research on the impact of COVID-19 on financial markets during the pandemic and its aftermath.",
        "DOI": "10.1016/j.intfin.2022.101589",
        "paper_author": "Yarovaya L.",
        "affiliation_name": "Southampton Business School",
        "affiliation_city": "Southampton",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60176937",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Product Market Competition and Firm Performance: Business Survival Through Innovation and Entrepreneurial Orientation Amid COVID-19 Financial Crisis",
        "publication": "Frontiers in Psychology",
        "citied_by": "108",
        "cover_date": "2022-03-25",
        "Abstract": "The product market competition has become a global challenge for business organizations in the challenging and competitive market environment in the influx of the COVID-19 outbreak. The influence of products competition on organizational performance in developed economies has gained scholars’ attention, and numerous studies explored its impacts on business profitability. The existing studies designate mixed findings between the linkage of CSR practices and Chinese business firms’ healthier performance in emerging economies; however, the current global crisis due to the coronavirus has made product market completion fierce, which ultimately affects business firms’ performance. This study focuses on this logical global challenge, investigates the rationale, and examines product-market completion impact on firms’ performance operating in the Chinese markets. The study collected data from the annual reports of Chinese business organizations with A-share listing and registered with the database of China Stock Markets and Accounting Research (CSMAR). The study employed a Generalized Method of Moment technique and investigated the connection between product market competition and Chinese firm performance. The empirical analysis of this study highlights the conclusion that market competition positively and significantly affected business firms’ performance. This study specified that product market competition play a dynamic and indispensable role in achieving healthier firm performance in the Chinese markets. This study provides valuable insights on practical implications and future research directions for the scholars to draw interesting results with new study models.",
        "DOI": "10.3389/fpsyg.2021.790923",
        "paper_author": "Liu Q.",
        "affiliation_name": "Liaoning University of Technology",
        "affiliation_city": "Jinzhou",
        "affiliation_country": "China",
        "affiliation_id": "60002018",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "The spillover effects and connectedness among green commodities, Bitcoins, and US stock markets: Evidence from the quantile VAR network",
        "publication": "Journal of Environmental Management",
        "citied_by": "103",
        "cover_date": "2022-03-15",
        "Abstract": "Several economic and financial crises, as well as the recent health crisis, have driven major shock spillover channels over stock markets. While various empirical studies have explored risk transmission among financial markets, this study examined the shock spillover network across green markets, including the energy, solar, wind, water, and environment markets, as well as Bitcoins, uncertainty, and the US stock market. Indeed, this paper is the first study to ascertain whether green commodities, Bitcoins, and uncertainty are connected to the US stock market. Using the quantile vector autoregressive (VAR) connectedness framework, the key findings are as follows: (i) A static spillover network showed there was high spillover transfer between markets at extreme market states. (ii) Global green economy and global clean energy markets act as the highest contributors of information spillover under bearish market scenarios. (iii) With regard to dynamic connectedness, this work highlights the asymmetric spillover effect of green commodities, Bitcoins, and uncertainty on the US stock market. (iv) Bitcoin (BTC), uncertainty, and global carbon indexes were found to be net receipts of shock spillovers, while most green commodities acted as net contributors. (v) Significant implications for environmental and financial investors as well as policymakers are provided.",
        "DOI": "10.1016/j.jenvman.2022.114493",
        "paper_author": "Khalfaoui R.",
        "affiliation_name": "International University of Rabat",
        "affiliation_city": "Sale",
        "affiliation_country": "Morocco",
        "affiliation_id": "60111570",
        "affiliation_state": "Rabat-Sale-Kenitra"
    },
    {
        "paper_title": "Sustainable Finance and Fintech: Can Technology Contribute to Achieving Environmental Goals? A Preliminary Assessment of 'Green Fintech' and 'Sustainable Digital Finance'",
        "publication": "European Company and Financial Law Review",
        "citied_by": "102",
        "cover_date": "2022-02-01",
        "Abstract": "The Digital Finance/Fintech Action Plan and the Sustainable Finance Strategy both represent important pillars of the current EU policy agenda. Nonetheless, the two areas have been treated as separate for a long time, while they present certain common features and great potential when combined. In particular, Fintech appears able to respond to some shortcomings in the current sustainable finance framework (e.g. access to retail financing, ESG disclosure, verification and ratings, etc.). The relevance of the link between sustainability, finance and technology has also been evidenced by the COVID-19 pandemic crisis, which has urged all countries to re-think the models traditionally deployed and rely more on technology and sustainability. However, Fintech/digital finance still raises per se relevant technical and legal issues that need to be addressed to fulfil its promises and potential in the sustainable finance sector. The present paper aims at starting a debate about \"Green Fintech\" in order to effectively connect the two worlds and spur the research in such a new and promising area. Special attention will be also reserved to the recent proposal for a European Single Access Point for corporate financial and non-financial disclosure.",
        "DOI": "10.1515/ecfr-2022-0005",
        "paper_author": "Macchiavello E.",
        "affiliation_name": "Università degli Studi di Genova",
        "affiliation_city": "Genoa",
        "affiliation_country": "Italy",
        "affiliation_id": "60025153",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Green investments: A luxury good or a financial necessity?",
        "publication": "Energy Economics",
        "citied_by": "102",
        "cover_date": "2022-01-01",
        "Abstract": "This study examines the diversification and hedging benefits of green investments for conventional stock portfolios in the context of the recent COVID-19 pandemic. While the findings confirm the status of gold as a strong hedge against stock market downturns, we find that clean energy investments, green bonds, in particular, have the potential to serve as a safe haven as well. In fact, compared to the other alternative and sustainable investments in our sample, green bonds are found to be the only asset that serves as a safe haven against large stock market fluctuations due to the COVID-19 pandemic. Portfolio analysis further shows that supplementing conventional stock portfolios with green bonds during the COVID-19 pandemic resulted in the highest risk-adjusted returns, compared to those supplemented with other alternative assets in the sample. Our findings support the emergence of green investments not as a luxury good, but a necessity for improved financial stability and performance, particularly during the turbulent market states driven by the recent pandemic.",
        "DOI": "10.1016/j.eneco.2021.105745",
        "paper_author": "Yousaf I.",
        "affiliation_name": "Namal University",
        "affiliation_city": "Mianwali",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60166770",
        "affiliation_state": "Punjab"
    },
    {
        "paper_title": "The Impacts of the Russia–Ukraine Invasion on Global Markets and Commodities: A Dynamic Connectedness among G7 and BRIC Markets",
        "publication": "Journal of Risk and Financial Management",
        "citied_by": "100",
        "cover_date": "2022-08-01",
        "Abstract": "The conflict between Russia and Ukraine has been causing knock-on effects worldwide. The supply and price of major commodity markets (oil, gas, platinum, gold, and silver) have been greatly impacted. Due to the ongoing conflict, financial markets across the world have experienced a strong dynamic regarding commodities prices. This effect can be considered the biggest change since the occurrence of the financial crisis in the year 2008, which explicitly influenced the oil and gold markets. This study attempts to investigate the impacts of the Russian invasion crisis on the dynamic connectedness among five commodities and the G7 and BRIC (leading stock) markets. We have applied the time-varying parameter vector autoregressive (TVP-VAR) method, which reflects the way spillovers are shaped by various crises periods, and we found extreme connectedness among all commodities and markets (G7 and BRIC). The findings show that gold and silver (commodities) and the United States, Canada, China, and Brazil (stock markets) are the receivers from the rest of the commodities/market’s transmitters of shocks during this invasion crisis. This research has policy implications that could be beneficial to commodity and stock investors, and these implications could guide them to make many decisions about investment in such tumultuous situations. Policymakers, institutional investors, bankers, and international organizations are the possible beneficiaries of these policy decisions.",
        "DOI": "10.3390/jrfm15080352",
        "paper_author": "Alam M.K.",
        "affiliation_name": "BRAC University",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60008935",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Assessing data-driven sustainable supply chain management indicators for the textile industry under industrial disruption and ambidexterity",
        "publication": "International Journal of Production Economics",
        "citied_by": "99",
        "cover_date": "2022-03-01",
        "Abstract": "This study contributes to developing the existing knowledge regarding data-driven sustainable supply chain management (SSCM) indicators under industrial disruption and ambidexterity. SSCM is a type of information flow management that facilitates cooperation and collaboration among supply chain players and stakeholders while considering economic, social, and environmental perspectives. Previous studies have failed to (1) generate these indicators from databases and confirm the validity of the effective indicators; (2) build a hierarchical structure with interrelationships under industrial disruption and ambidexterity; and (3) identify the indicators necessary for effective textile performance. The proposed hybrid method generates indicators from a database and based on the existing literature. This study proposes using the fuzzy Delphi method to validate these indicators in the textile industry and applies the best and worst methods to examine the most effective and ineffective indicators. Valid aspects and criteria are used to construct a hierarchical structure under conditions of industrial disruption and ambidexterity. The results show that the most important aspects are financial vulnerability, supply chain uncertainty, risk assessment, and resilience; these aspects are drivers that are guaranteed to ensure the effectiveness of SSCM under industrial disruption and ambidexterity. Financial crisis response, business continuity, supply chain integration, bullwhip effect, facility location, and supplier selection are highlighted as vital practical strategies.",
        "DOI": "10.1016/j.ijpe.2021.108401",
        "paper_author": "Tseng M.L.",
        "affiliation_name": "Asia University",
        "affiliation_city": "Taichung",
        "affiliation_country": "Taiwan",
        "affiliation_id": "60072429",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Oil shocks and BRIC markets: Evidence from extreme quantile approach",
        "publication": "Energy Economics",
        "citied_by": "96",
        "cover_date": "2022-04-01",
        "Abstract": "The present study aims to configure the extreme quantile dependence between oil shocks and BRIC markets from January 2, 1995 to July 27, 2021. Using the cross-quantilogram technique, the current study first decomposed oil shocks pertaining to demand and supply and analyzed their asymmetric impact on BRIC markets. Our findings manifest positive and persistent dependencies between oil demand shocks and BRIC markets. Meanwhile, substantial cross-quantile dependence is demonstrated among shocks in oil supply and the stock returns of Russia. The recursive cross-quantilogram analysis indicates time-varying characteristics reiterating that oil demand shocks are positively and significantly correlated with BRIC stock returns, particularly after the Global Financial Crisis and the financialization of energy commodities. However, weaker dependencies are observed in the normal market conditions in the absence of financial contagion. Finally, our results remain robust after controlling the impact of idiosyncratic risk shocks. Our findings are of particular prominence for BRIC markets, particularly in terms of oil-exporting (importing) status. Along with these, the findings carry substantial ramifications for policymakers, investors, and financial market constituents to restructure their current policies and strategies for avoiding uncertainty in the stock returns.",
        "DOI": "10.1016/j.eneco.2022.105932",
        "paper_author": "Naeem M.A.",
        "affiliation_name": "United Arab Emirates University",
        "affiliation_city": "Al Ain",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60008665",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "Return and volatility spillovers between energy and BRIC markets: Evidence from quantile connectedness",
        "publication": "Research in International Business and Finance",
        "citied_by": "94",
        "cover_date": "2022-12-01",
        "Abstract": "Using the quantile connectedness approach for the median, lower, and upper quantiles, we examine the return and volatility connectedness between energy and BRIC markets from January 1, 2000, to July 9, 2021. We find that uncertain economic activity and intense periods characterize energy and BRIC market returns and volatility connectedness. A parallel return and volatility connectedness structure for upper and lower quantiles against the average quantile revealed different results. Time-varying features are substantiated between energy and BRIC markets; significant distress events, such as the Global Financial Crisis, European Debt Crisis, Shale Oil Revolution, and COVID-19 pandemic, intensified spillovers. We highlight diversification avenues for energy and BRIC markets given the periods of financial turmoil, with investors’ concerns widely addressed by opt-in investment opportunities with lower risk and greater diversification. Our study has beneficial implications for policymakers, regulators, investors, and financial market constituents to redevelop their existing strategies to avoid financial losses.",
        "DOI": "10.1016/j.ribaf.2022.101680",
        "paper_author": "Billah M.",
        "affiliation_name": "International Islamic University Malaysia",
        "affiliation_city": "Kuala Lumpur",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60016775",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Progress and trends in integrating Industry 4.0 within Circular Economy: A comprehensive literature review and future research propositions",
        "publication": "Business Strategy and the Environment",
        "citied_by": "92",
        "cover_date": "2022-01-01",
        "Abstract": "Society is facing many challenges, including, climate change, COVID, inequity and human population growth. Some researchers suggest that integration of Circular Economy (CE) and Industry 4.0 (I4.0) concepts and approaches can help us to make progress towards sustainable societies. Integrated implementation can help to improve the design of product–service systems focused on prevention and reduction of wastage of materials, energy, human health, and ecosystems. The CE practices enable consumers to return products after use and to reuse the products with more value. Will integrated adoption of CE and I4.0 practices help society to be more sustainable? What is known about the climate change benefits of integration of I4.0 and CEs to reduce energy and resource usage? The authors sought to answer these questions, via a systematic bibliometric literature review, and network analysis of literature on I4.0 and CE for logistics and supply chain applications. The review was performed by searching the SCOPUS database for literature about I4.0 and CE. A total of 165 articles were shortlisted for in-depth review. The literature review was complimented by bibliometric and network analyses. The review provided insights into the present and future trends in integration of I4.0 and related Artificial Intelligence (AI) tools in CE's. Based on the findings, a framework for integrating I4.0 and CE, was developed to guide CE decision-making that will help researchers and industrialists, integrate I4.0 tools within CEs to improve logistics, resource efficiency, safety, product quality and reduce fossil-carbon footprints.",
        "DOI": "10.1002/bse.2910",
        "paper_author": "Agrawal R.",
        "affiliation_name": "National Institute of Technology Tiruchirappalli",
        "affiliation_city": "Tiruchirappalli",
        "affiliation_country": "India",
        "affiliation_id": "60005630",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Energy financing in COVID-19: how public supports can benefit?",
        "publication": "China Finance Review International",
        "citied_by": "88",
        "cover_date": "2022-04-07",
        "Abstract": "Purpose: The study aims to empirically estimate the role of public supports for energy efficiency financing and presents the way forward to mitigate the energy financing barriers that incurred during the COVID-19 crisis. Design/methodology/approach: Using the G7 countries data, the study estimated the nexus between the constructs. Generalized method of moments (GMM) and conventional increasing-smoothing asymptotic of GMM are applied to justify the study findings. Wald econometric technique is also used to robust the results. Findings: The study findings reported a consistent role of public support on energy efficiency financing indicators, during the COVID-19 crisis period. G7 countries raised funds around 17% through public supports for energy efficiency financing, and it raised 4% of per unit energy usage to GDP, accelerated 16% energy efficiency and 24% output of renewable energy sources, during COVID-19. By this, study findings warrant a maximum support from public offices, energy ministries and other allied departments for energy efficiency optimization. Practical implications: The study presents multiple policy implications to enhance energy efficiency through different alternative sources, such as, on-bill financing, direct energy efficiency grant, guaranteed financial contracts for energy efficiency and energy efficiency credit lines. If suggested policy recommendations are applied effectively, this holds the potential to diminish the influence of the COVID-19 crisis and can probably uplift the energy efficiency financing during structural crisis. Originality/value: The originality of the recent study exists in a novel framework of study topicality. Despite growing literature, the empirical discussion in the field of energy efficiency financing and COVID-19 is still shattered and less studied, which is contributed by this study.",
        "DOI": "10.1108/CFRI-02-2021-0046",
        "paper_author": "Iqbal S.",
        "affiliation_name": "University of Management and Technology Lahore",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60070625",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A ‘just’ hydrogen economy: A normative energy justice assessment of the hydrogen economy",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "87",
        "cover_date": "2022-10-01",
        "Abstract": "The climate crisis, the renewed importance of energy security and geopolitics, and economic interests are fuelling interest in the hydrogen economy. While still in its nascency, if financial and political commitments are an indication, the hydrogen economy is likely to rapidly develop. Many scholars have noted, however, the significant lack of social assessments of the hydrogen economy. This work addresses this gap through a normative energy justice assessment across the hydrogen economy value chain to provide an initial proactive mapping of potential energy injustices that could occur from its development across four injustice perspectives (distribution, procedural, cosmopolitan, and recognition). Further, this work suggests potential abatement actions that could be taken to reduce the identified injustices. Lacking research on the social impacts of the hydrogen economy due to its nascency, this work benchmarks to energy justice assessments as well as abating actions from other transitions to provide this first mapping. The results of this work show that potential injustices could arise from unjust decision-making, socially irresponsible development, and the poor sharing of ills/benefits on the consumption end. While the hydrogen economy's development pathway is still largely unknown, this work hopes to provide foresight to policymakers and future researchers (who can then study them in more detail) about potential injustices along the hydrogen value chain with the goal of avoiding or reducing them. Being aware of and reducing these injustices during the development of the hydrogen economy should serve to foster public support for its proliferation.",
        "DOI": "10.1016/j.rser.2022.112648",
        "paper_author": "Dillman K.J.",
        "affiliation_name": "Haskoli Islands",
        "affiliation_city": "Reykjavik",
        "affiliation_country": "Iceland",
        "affiliation_id": "60071113",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of the coronavirus lockdown on mental health: evidence from the United States",
        "publication": "Economic Policy",
        "citied_by": "86",
        "cover_date": "2022-01-01",
        "Abstract": "The coronavirus outbreak has caused significant disruptions to people's lives. We exploit variation in lockdown measures across states to document the impact of stay-at-home orders on mental health using real-time survey data in the United States. We find that the lockdown measures lowered mental health by 0.083 standard deviations. This large negative effect is entirely driven by women. As a result of the lockdown measures, the existing gender gap in mental health has increased by 61%. The negative effect on women's mental health cannot be explained by an increase in financial worries or caring responsibilities.",
        "DOI": "10.1093/epolic/eiac002",
        "paper_author": "Adams-Prassl A.",
        "affiliation_name": "University of Oxford",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026851",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "To what extent does COVID-19 drive stock market volatility? A comparison between the U.S. and China",
        "publication": "Economic Research-Ekonomska Istrazivanja",
        "citied_by": "86",
        "cover_date": "2022-01-01",
        "Abstract": "This paper presents a novel wavelet-based quantile-on-quantile method for comparing the impact of COVID-19 on stock market volatility between the U.S. and China. Wavelet decomposition shows that the impact has stronger regularity in the lower frequency domain. Compared with oil price fluctuations, COVID-19 is the main reason for the sharp fluctuation of the U.S. stock market. Unlike China, however, the strong growth of daily new cases, which continued for months, has made the U.S. stock market insensitive to COVID-19. In addition, the particularly loose interest rate policy has effectively suppressed the volatility of the U.S. stock market. However, in contrast to China, the near zero interest rate applied by the U.S. makes it difficult to generate sufficient monetary policy space to address a new potential crisis. The result of this study presents the differences of the financial market response under different epidemic management modes. Under the background that COVID-19 is not effectively controlled, a loose monetary policy may be an expedient measure to stabilise the market. This is of great practical significance towards achieving epidemic control and financial market stability under the background of the global spread of COVID-19.",
        "DOI": "10.1080/1331677X.2021.1906730",
        "paper_author": "Gao X.",
        "affiliation_name": "Shandong University of Science and Technology",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60001429",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Time-varying spillover effects and investment strategies between WTI crude oil, natural gas and Chinese stock markets related to belt and road initiative",
        "publication": "Energy Economics",
        "citied_by": "84",
        "cover_date": "2022-04-01",
        "Abstract": "This paper investigates the return volatility spillover effects and the dynamic relationships among WTI crude oil futures, Natural Gas futures, and the Chinese stock markets related to Belt and Road initiative employing the method of Diebold and Yilmaz (2012, 2014) based on TVP-VAR model and generalized forecast error variance decomposition. Our empirical results show that there exists a high interdependence among all analyzed assets, and the total volatility spillover has a sharp increase under the major crisis events. On average, WTI, GAS and the stock markets of FM, AGR and COM are the net receivers of systematic shocks, while the stock markets of EU, HSR and INF are the net transmitters of systematic shocks. Besides, we also calculate the hedge ratios, the optimal portfolio weights and the corresponding hedging effectiveness based on DCC-GARCH t-copula model. We find that WTI crude oil and Natural Gas futures are cheap hedging tools. When investing a small part in WTI crude oil future market and a large part in the analyzed stock markets, or investing a small part in the analyzed stock markets and a large part in Natural Gas future market, high hedging effectiveness could be achieved.",
        "DOI": "10.1016/j.eneco.2022.105883",
        "paper_author": "Dai Z.",
        "affiliation_name": "Changsha University of Science and Technology",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60001338",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "A comparison of 2020 health policy responses to the COVID-19 pandemic in Canada, Ireland, the United Kingdom and the United States of America",
        "publication": "Health Policy",
        "citied_by": "84",
        "cover_date": "2022-05-01",
        "Abstract": "This paper compares health policy responses to COVID-19 in Canada, Ireland, the United Kingdom and United States of America (US) from January to November 2020, with the aim of facilitating cross-country learning. Evidence is taken from the COVID-19 Health System Response Monitor, a joint initiative of the European Observatory on Health Systems and Policies, the WHO Regional Office for Europe, and the European Commission, which has documented country responses to COVID-19 using a structured template completed by country experts. We show all countries faced common challenges during the pandemic, including difficulties in scaling-up testing capacity, implementing timely and appropriate containment measures amid much uncertainty and overcoming shortages of health and social care workers, personal protective equipment and other medical technologies. Country responses to address these issues were similar in many ways, but dissimilar in others, reflecting differences in health system organization and financing, political leadership and governance structures. In the US, lack of universal health coverage have created barriers to accessing care, while political pushback against scientific leadership has likely undermined the crisis response. Our findings highlight the importance of consistent messaging and alignment between health experts and political leadership to increase the level of compliance with public health measures, alongside the need to invest in health infrastructure and training and retaining an adequate domestic health workforce. Building on innovations in care delivery seen during the pandemic, including increased use of digital technology, can also help inform development of more resilient health systems longer-term.",
        "DOI": "10.1016/j.healthpol.2021.06.012",
        "paper_author": "Unruh L.",
        "affiliation_name": "University of Central Florida",
        "affiliation_city": "Orlando",
        "affiliation_country": "United States",
        "affiliation_id": "60022144",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "Crisis-induced behavior: From fear and frugality to the familiar",
        "publication": "International Journal of Consumer Studies",
        "citied_by": "84",
        "cover_date": "2022-03-01",
        "Abstract": "This research uncovers the impact of a multifaceted crisis on consumers' immediate shopping behaviors, short-term financial spending, and long-term shopping and spending responses. This longitudinal study adopts a future studies approach to expose consumers' current experiences, expectations of the future, and realized future experiences to understand a pandemic's impact on consumers' collective shopping and spending behaviors. Data were collected at the beginning of the COVID-19 pandemic, during its peak, and as restrictions were being lifted. Findings reveal that consumers adapt their shopping and spending behavior through a crisis in response to constantly shifting environmental stimuli. Consumers moved from fear to frugality and then followed one of two paths—maintaining new crisis-induced behaviors or, more often, returning to prior familiar consumption behaviors. Retailers and service providers must understand these responses to be able to serve both groups during and after a crisis.",
        "DOI": "10.1111/ijcs.12698",
        "paper_author": "Rayburn S.W.",
        "affiliation_name": "McCoy College of Business",
        "affiliation_city": "San Marcos",
        "affiliation_country": "United States",
        "affiliation_id": "60134843",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Health economics of diabetic foot ulcer and recent trends to accelerate treatment",
        "publication": "Foot",
        "citied_by": "83",
        "cover_date": "2022-09-01",
        "Abstract": "Diabetic foot ulcer is a preventable complication of diabetes that imposes a significant burden on the community. It leads to amputation and increased disability if left untreated and thus bears profound implications on the individual, the community and the health system at large. Diabetic foot (DF) is an area of research interest where interdisciplinary researchers are trying to elucidate the best strategy to halt the progression of chronic diabetic wounds. It is an area where tissue engineering research is making a strong impact through the use of scaffolds and skin substitutes for diabetic wound healing. This review aims at discussing the geographical health economics, its impact on healing and factors influencing financial costs of DFU. The upcoming economic and clinical impacts due to disease outbreak such as the 2020 COVID-19 has also been discussed. Finally, it will discuss novel therapy available with emphasis on skin tissue engineering scaffolds with a cost-benefit analysis. The review aims at promoting better management of people with diabetes with emphasis on emerging treatments and technologies.",
        "DOI": "10.1016/j.foot.2022.101909",
        "paper_author": "Jodheea-Jutton A.",
        "affiliation_name": "University of Mauritius",
        "affiliation_city": "Reduit",
        "affiliation_country": "Mauritius",
        "affiliation_id": "60072656",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Small firms and the COVID-19 insolvency gap",
        "publication": "Small Business Economics",
        "citied_by": "83",
        "cover_date": "2022-02-01",
        "Abstract": "COVID-19 placed a special role on fiscal policy in rescuing companies short of liquidity from insolvency. In the first months of the crisis, SMEs as the backbone of Germany’s economy benefited from large and mainly indiscriminate aid measures. Avoiding business failures in a whatever-it-takes fashion contrasts, however, with the cleansing mechanism of economic crises: a mechanism which forces unviable firms out of the market, thereby reallocating resources efficiently. By focusing on firms’ pre-crisis financial standing, we estimate the extent to which the policy response induced an insolvency gap and analyze whether the gap is characterized by firms which were already struggling before the pandemic. With the policy measures being focused on smaller firms, we also examine whether this insolvency gap differs with respect to firm size. Our results show that the COVID-19 policy response in Germany has triggered a backlog of insolvencies that is particularly pronounced among financially weak, small firms, having potential long-term implications on entrepreneurship and economic recovery. Plain English Summary This study analyzes the extent to which the strong policy support to companies in the early phase of the COVID-19 crisis has prevented a large wave of corporate insolvencies. Using data of about 1.5 million German companies, it is shown that it was mainly smaller firms that experienced strong financial distress and would have gone bankrupt without policy assistance. In times of crises, insolvencies usually allow for a reallocation of employees and capital to more efficient firms. However, the analysis reveals that this ‘cleansing effect’ is hampered in the current crisis as the largely indiscriminate granting of liquidity subsidies and the temporary suspension of the duty to file for insolvency have caused an insolvency gap that is driven by firms which were already in a weak financial position before the crisis. Overall, the insolvency gap is estimated to affect around 25,000 companies, a substantial number compared to the around 16,300 actual insolvencies in 2020. In the ongoing crisis, policy makers should prefer instruments favoring entrepreneurs who respond innovatively to the pandemic instead of prolonging the survival of near-insolvent firms.",
        "DOI": "10.1007/s11187-021-00514-4",
        "paper_author": "Dörr J.O.",
        "affiliation_name": "Zentrum für Europäische Wirtschaftsforschung GmbH",
        "affiliation_city": "Mannheim",
        "affiliation_country": "Germany",
        "affiliation_id": "60076709",
        "affiliation_state": "Baden-Wurttemberg"
    },
    {
        "paper_title": "Safe havens in Islamic financial markets: COVID-19 versus GFC",
        "publication": "Global Finance Journal",
        "citied_by": "83",
        "cover_date": "2022-11-01",
        "Abstract": "Using a bivariate dynamic conditional correlation (DCC) generalized autoregressive conditional heteroskedasticity (GARCH) model, this study compares the safe-haven properties of various assets against the major Gulf Cooperation Council (GCC) stock indexes during two periods of financial turmoil, the COVID-19 pandemic and the 2008 Global Financial Crisis (GFC). Sovereign bonds offered the highest hedging benefits under both crises. The traditional safe assets, gold and silver, which were reasonably productive under the GFC, have been less so during the pandemic. The Japanese yen emerged as a very safe choice for investors holding GCC stock indexes. Both sector indexes and stock indexes failed to safeguard investors most of the time during each crisis.",
        "DOI": "10.1016/j.gfj.2021.100643",
        "paper_author": "Hassan M.K.",
        "affiliation_name": "University of New Orleans",
        "affiliation_city": "New Orleans",
        "affiliation_country": "United States",
        "affiliation_id": "60022758",
        "affiliation_state": "LA"
    },
    {
        "paper_title": "The 2021 eruption of the Cumbre Vieja volcanic ridge on La Palma, Canary Islands",
        "publication": "Geology Today",
        "citied_by": "82",
        "cover_date": "2022-05-01",
        "Abstract": "Almost exactly half a century after the eruption of the Teneguía Volcano on La Palma (26 October to 28 November 1971), a new eruption occurred on the island and lasted for 85 days from 19 September until 13 December 2021. This new eruption opened a volcanic vent complex on the western flank of the Cumbre Vieja rift zone, the N-S elongated polygenetic volcanic ridge that has developed on La Palma over the last c. 125 ka. The Cumbre Vieja ridge is the volcanically active region of the island and the most active one of the Canary Islands, hosting half of all the historically recorded eruptive events in the archipelago. The 2021 La Palma eruption has seen no direct loss of human life, thanks to efficient early detection and sensible management of the volcanic crisis by the authorities, but more than 2800 buildings and almost 1000 hectares of plantations and farmland were affected by lava flows and pyroclastic deposits. Satellite surveillance enabled accurate mapping of the progressive buildup of the extensive and complex basaltic lava field, which together with monitoring of gas emissions informed the timely evacuation of local populations from affected areas. Lava flows that reached the sea constructed an extensive system of lava deltas and platforms, similar to events during earlier historical eruptions such as in 1712, 1949 and 1971. Long-term challenges in the aftermath of the eruption include protection of drainage systems from potential redistribution of tephra during high rainfall events, the use of the large surplus quantities of ash in reconstruction of buildings and in agriculture, and the crucial concerns of where and how rebuilding should and could occur in the aftermath of the eruption. Finally, there remain strong financial concerns over insurance for properties consumed or damaged by the eruption in the light of future volcanic hazards from the Cumbre Vieja volcanic ridge.",
        "DOI": "10.1111/gto.12388",
        "paper_author": "Carracedo J.C.",
        "affiliation_name": "Universidad de Las Palmas de Gran Canaria",
        "affiliation_city": "Las Palmas de Gran Canaria",
        "affiliation_country": "Spain",
        "affiliation_id": "60009669",
        "affiliation_state": "Canary Islands"
    },
    {
        "paper_title": "A content analysis for government’s and hotels’ response to COVID-19 pandemic in Egypt",
        "publication": "Tourism and Hospitality Research",
        "citied_by": "81",
        "cover_date": "2022-01-01",
        "Abstract": "Drawing on the Situational Crisis Communication theory (SCCT), this study recapitulates the initiatives, practices, and responses of the Egyptian government and chain-managed five-star hotels during the COVID-19 global health pandemic. Subjective and objective content analysis is employed in this study. Subjective content analysis is employed to examine newspapers, magazines, T.V channels, and official pages on Facebook to determine the initiatives and practices adopted by the Egyptian government. Objective content analysis is further used to determine the COVID-19 hospitality practices adopted by 22 chain-managed five-star hotels by examining their official websites. Thematic saturation was attained when observations and analyses exhibited no new themes. Findings indicated that the Egyptian government and chain-managed five-star hotels implemented a number of initiatives and practices focused on financial policies, health and hygiene, workforce and training, marketing, domestic tourism, booking flexibility, cancellation policies, community support, vacations, and contracts. This study contributes to crisis management research by being one of the first studies to explore governments and hotel operations practices and initiatives during the COVID-19 using Egypt as a case study. We discuss the theoretical and practical implications during and post the COVID-19.",
        "DOI": "10.1177/14673584211002614",
        "paper_author": "Salem I.E.",
        "affiliation_name": "Alexandria University",
        "affiliation_city": "Alexandria",
        "affiliation_country": "Egypt",
        "affiliation_id": "60033041",
        "affiliation_state": "Alexandria"
    },
    {
        "paper_title": "Act now before Ukraine war plunges millions into malnutrition",
        "publication": "Nature",
        "citied_by": "80",
        "cover_date": "2022-04-28",
        "Abstract": "Governments, donors and others must step up to protect current and future generations from the devastating effects of malnutrition, as well as to prevent acute food insecurity. [Figure not available: see fulltext.].",
        "DOI": "10.1038/d41586-022-01076-5",
        "paper_author": "Osendarp S.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Online Gambling in the Midst of COVID-19: A Nexus of Mental Health Concerns, Substance Use and Financial Stress",
        "publication": "International Journal of Mental Health and Addiction",
        "citied_by": "80",
        "cover_date": "2022-02-01",
        "Abstract": "This study examined the emerging impact of COVID-19 on gambling during the first 6 weeks of emergency measures in Ontario, Canada. A cross-sectional online survey of 2005 gamblers, including a sub-sample of 1081 online gamblers (age 18 years and older), was administered to assess risky gambling behaviours and motivations, financial impacts from COVID-19, the influence of COVID-19 on online gambling, mental health concerns and substance use. A series of odds ratio comparisons and measures of association were carried out. Results show significant likelihood of online gambling among those classified as high-risk gamblers (according to the Problem Gambling Severity Index) and those with past experience of online gambling, though migration from land-based gambling was apparent. Among high-risk online gamblers, the most predictive risk factors included moderate and severe anxiety and depression, reduced work hours, being influenced to gamble due to COVID-19, gambling under the influence of cannabis or alcohol and risky gambling motives tied to mental health concerns, including gambling because it helps with nervousness and depression, chasing gambling losses and seeking to earn income. This study has confirmed many of the risk associations presented in emerging COVID-19-related studies and past research on global economic crisis relating to gambling risk, mental health concerns and substance use. However, unlike many past studies, the present paper takes note of all of these elements holistically and provides incremental clarity on online gambling risk factors during the pandemic, specifically.",
        "DOI": "10.1007/s11469-020-00366-1",
        "paper_author": "Price A.",
        "affiliation_name": "Responsible Gambling Council",
        "affiliation_city": "Toronto",
        "affiliation_country": "Canada",
        "affiliation_id": "100744900",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Is Corporate Social Responsibility investing a free lunch? The relationship between ESG, tail risk, and upside potential of stocks before and during the COVID-19 crisis",
        "publication": "Finance Research Letters",
        "citied_by": "79",
        "cover_date": "2022-05-01",
        "Abstract": "Did Corporate Social Responsibility investing benefit shareholders during the COVID-19 pandemic crisis? Distinguishing between downside tail risk and upside reward potential of stock returns, we provide evidence from 5,073 stocks listed on stock markets in ten countries. The findings suggest that better ESG ratings are associated with lower downside risk, but also with lower upside return potential. Thus, ESG ratings helped investors to reduce their risk exposure to the market turmoil caused by the pandemic, while maintaining the fundamental trade-off between risk and reward.",
        "DOI": "10.1016/j.frl.2021.102499",
        "paper_author": "Lööf H.",
        "affiliation_name": "The Royal Institute of Technology (KTH)",
        "affiliation_city": "Stockholm",
        "affiliation_country": "Sweden",
        "affiliation_id": "60002014",
        "affiliation_state": "Stockholms"
    },
    {
        "paper_title": "On the dynamic return and volatility connectedness of cryptocurrency, crude oil, clean energy, and stock markets: a time-varying analysis",
        "publication": "Environmental Science and Pollution Research",
        "citied_by": "77",
        "cover_date": "2022-09-01",
        "Abstract": "The high energy consumption of cryptocurrency transactions has raised concerns about the environment and sustainability among green investors and regulatory authorities. The current study examines the connectedness among clean energy, Bitcoin, the stock market, and crude oil empirically. The time-varying parameter vector autoregression (TVP-VAR) is used to estimate the dynamics of connectedness in a daily dataset spanning the period November 11, 2013 to September 30, 2021. We find that the clean energy and traditional stock markets transmit shocks to Bitcoin and oil in terms of return, and they receive shocks in terms of volatility from Bitcoin and oil. Additionally, Bitcoin and other financial markets are only tenuously linked during non-crisis periods. Nonetheless, their connection strengthens substantially during times of crisis, such as the great cryptocurrency crash of 2018 and the COVID-19 pandemic of 2020. We believe that these findings can help explain how clean energy and cryptocurrency markets are linked during times of crisis.",
        "DOI": "10.1007/s11356-022-20115-2",
        "paper_author": "Attarzadeh A.",
        "affiliation_name": "İşletme ve Ekonomi Fakültesi",
        "affiliation_city": "Famagusta",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60204087",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Fresh Insight through a Keynesian Theory Approach to Investigate the Economic Impact of the COVID-19 Pandemic in Pakistan",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "76",
        "cover_date": "2022-02-01",
        "Abstract": "Beyond the immediate impositions of dealing with COVID-19, this disease represents a severe and significant challenge confronting Pakistan’s economy. The study’s objective was to evaluate the coronavirus epidemic’s effect on Pakistan’s economy and measures devised to mitigate the damage done by this disease. The study research design used the elementary concept of Keynesian theory comprising of the mapping of systematic behavior of the COVID-19 pandemic. Issues were formally underpinned, described, and visualized through the Keynesian theory concept. The eruption of COVID-19 has jolted the national and international economy. Pakistan is included, causing millions of people to stay at home, lose their jobs, and suspend or end business operations. Unemployment in Pakistan has reached nearly 25 million people, driving many towards conditions of hunger and poverty as the major economic damage in several sectors is anticipated at around PKR 1.3 trillion. The hardest-affected sectors comprise industries such as tourism and travel, financial markets, entertainment, manufacturing, etc., having a devastating effect on gross domestic product (GDP). It is mainly daily-wage earners and people running small businesses that have been seriously exploited and subjected to a curfew-like situation. However, the Keynesian theory suggests that supportive macroeconomic policies must restore trust, demand recovery, and provide interest-free loans to overcome Pakistan’s currently upcoming crisis.",
        "DOI": "10.3390/su14031054",
        "paper_author": "Abbass K.",
        "affiliation_name": "Nanjing University of Science and Technology",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60010080",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Impact of the COVID-19 pandemic on suicidal attempts and death rates: a systematic review",
        "publication": "BMC Psychiatry",
        "citied_by": "75",
        "cover_date": "2022-12-01",
        "Abstract": "Background: The COVID-19 pandemic has exacerbated the risk factors associated with suicidal behavior and thus, prioritizing its prevention is recommended. Methods: This study systematically reviewed the global evidence on the incidence of suicide/suicidal attempts and the trend in suicidal rates during the COVID-19 pandemic. Cross-sectional and cohort studies investigating the outcomes of suicidal death and suicidal attempts at any setting during the COVID-19 pandemic were searched in Medline, Embase, and PsycINFO databases for papers published from December 2019 to May 2021. Results: Out of 1052 studies18 studies with 12,746 suicidal attempts and 33,345 suicidal deaths were included in the final analysis. The mental health impact of social distancing, COVID-19 quarantine, and financial crises due to loss of employment were associated risk factors with suicide and/or suicidal attempts during the COVID-19 pandemic. Six common thematic recommendations for preventing suicidal deaths and suicidal attempts were identified. Conclusions: Unexpected behavior changes during the COVID-19 pandemic may have contributed to the increasing trend of suicidal attempts reported. Domestic conflicts and violence, financial loss, anxiety and depression, and pre-existing mental health condition/s should be considered in preventing suicidal attempts and deaths secondary to the COVID 19 pandemic. Early detection and timely intervention for individuals with suicidal behavior is crucial and collated recommendations in the current study can be utilized for those preventive interventions. More systematic suicide risk screening process should be introduced who are at risk, along with an evidence base prevention approach.",
        "DOI": "10.1186/s12888-022-04158-w",
        "paper_author": "Pathirathna M.L.",
        "affiliation_name": "University of Peradeniya",
        "affiliation_city": "Peradeniya",
        "affiliation_country": "Sri Lanka",
        "affiliation_id": "60071082",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Systemic risk and the COVID challenge in the european banking sector",
        "publication": "Journal of Banking and Finance",
        "citied_by": "75",
        "cover_date": "2022-07-01",
        "Abstract": "This paper studies the systemic risk contribution of a set of large publicly traded European banks. Over a sample covering the last twenty years and three different crises, we find that all banks in our sample significantly contribute to systemic risk. Moreover, larger banks and banks with a business model more exposed to trading and financial market volatility, contribute more. In the shorter sample characterized by the Covid-19 shock, sovereign default risks significantly affected the systemic risk contribution of all banks. However, the ECB announcement of the Pandemic Emergency Purchasing Programme restored calm in the European banking sector.",
        "DOI": "10.1016/j.jbankfin.2021.106073",
        "paper_author": "Borri N.",
        "affiliation_name": "LUISS University",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60016374",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Small fish in big ponds: Connections of green finance assets to commodity and sectoral stock markets",
        "publication": "International Review of Financial Analysis",
        "citied_by": "74",
        "cover_date": "2022-10-01",
        "Abstract": "We analyze return and volatility connectedness of the rising green asset and the well-established US industry stock and commodity markets from September 2010 to July 2021. We find that the time-varying return and volatility connectedness have exhibited serious crisis jumps. Some individual assets of both the green and commodity markets are in connection to the US sectoral stock market returns, and the volatility connections are even more common than the return connections. Furthermore, some financial and economic uncertainty indicators manifest positive impacts from the volatility of some ‘big pond’ markets for e.g. commodities, whereas some others affect the connectedness negatively. Additional analysis of financial and economic uncertainty indicators manifests positive impacts from the volatility of some ‘big pond’ markets, e.g., commodities, while others negatively affect the connectedness.",
        "DOI": "10.1016/j.irfa.2022.102283",
        "paper_author": "Naeem M.A.",
        "affiliation_name": "United Arab Emirates University",
        "affiliation_city": "Al Ain",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60008665",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "Bank green lending and credit risk: an empirical analysis of China's Green Credit Policy",
        "publication": "Business Strategy and the Environment",
        "citied_by": "74",
        "cover_date": "2022-05-01",
        "Abstract": "This study empirically investigates the relationship between banks' green lending and their credit risk, and how Chinese green finance regulations contribute to the solvency of individual banks and the resilience of the financial system. Analysing a sample of 41 Chinese banks from 2007 to 2018, we find that the association between a bank's (relative) green lending as a proportion of its overall loan portfolio, and its credit risk, depends critically on the size and structure of state ownership. While the implementation of China's Green Credit Policy reduces credit risk for the major state-controlled banks, it increases credit risk for the city and regional commercial banks. This performance difference appears largely due to information and expertise asymmetries, with the city and regional commercial banks having less access to information and expertise necessary to evaluate the credit risk of green lending. Understanding this phenomenon can help policymakers tailor green finance policies according to banks' characteristics. It also suggests that mechanisms and platforms for the city/regional commercial banks to learn from the major state-controlled banks could be beneficial.",
        "DOI": "10.1002/bse.2973",
        "paper_author": "Zhou X.Y.",
        "affiliation_name": "University of Oxford",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026851",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "Measuring consumers’ level of satisfaction for online food shopping during COVID-19 in Italy using POSETs",
        "publication": "Socio-Economic Planning Sciences",
        "citied_by": "74",
        "cover_date": "2022-08-01",
        "Abstract": "The pandemic COVID 19 has upset the economic, social, financial, and general behavioral systems. Global crisis has a large impact overall and related fallouts significantly affect existent structural paradigms in every country and region across the world. In particular, the spread of COVID-19 pandemic has led to having to rethink the way we produce and consume food. Within this global change, a rise in the number of consumers who purchase food products online in order to comply with the rules aimed at limiting the circulation of the virus should be emphasized. Consequently, probably causing a long-term positive effect on m-commerce. The purpose is to elaborate on the index of the satisfaction level of consumers of purchasing food online via food shopping channels, by using key factors that characterize the online spending behavior. The analysis was carried out by collection of data deriving from an anonymous online questionnaire administrated via social networks and emails, during the ‘hot’ months of the pandemic progression in Italy, which is March–May 2020. We analyse both dimensions of customer satisfaction (process and outcome), by means of two systems of indicators. We reduce their complexity using synthesis obtained with the Partially ordered set. Results highlight the differences between the two dimensions of customer satisfaction. Online shopping can surely contribute to reduction of food waste thanks to elimination of frenzied shopping routines at supermarkets and can open space to new fields of study. On the other hand, defining an index of the consumer's satisfaction can alter sales strategies of m-commerce managers and entrepreneurs.",
        "DOI": "10.1016/j.seps.2021.101064",
        "paper_author": "Alaimo L.S.",
        "affiliation_name": "Sapienza Università di Roma",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60032350",
        "affiliation_state": "RM"
    },
    {
        "paper_title": "Determining dependence, centrality, and dynamic networks between green bonds and financial markets",
        "publication": "Journal of Environmental Management",
        "citied_by": "73",
        "cover_date": "2022-09-15",
        "Abstract": "We adopted a network approach to examine the dependence between green bonds and financial markets. We first created a static dependency network for a given set of variables using partial correlations. Secondly, to evaluate the centrality of the variables, we illustrated with-in system connections in a minimum spanning tree (MST). Afterward, rolling-window estimations are applied in both dependency and centrality networks for indicating time variations. Using the data spanning January 3, 2011 to October 30, 2020, we found that green bonds and commodity index had positive dependence on other financial markets and are system-wide net contributors before and after COVID-19. Time-varying dynamics illustrated heightened system integration, particularly during the crisis periods. The centrality networks reiterated the leading role of green bonds and commodity index pre- and post-COVID. Finally, rolling window analysis ascertained system dependence, centrality, and dynamic networks between green bonds and financial markets where green bond sustained their positive dependence all over the sample period. Green bonds’ persistent dependence and centrality enticed several implications for policymakers, regulators, investors, and financial market participants.",
        "DOI": "10.1016/j.jenvman.2022.115618",
        "paper_author": "Karim S.",
        "affiliation_name": "Nottingham University Business School Malaysia",
        "affiliation_city": "Semenyih",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60272552",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Energy financing for energy retrofit in COVID-19: Recommendations for green bond financing",
        "publication": "Environmental Science and Pollution Research",
        "citied_by": "73",
        "cover_date": "2022-04-01",
        "Abstract": "The aim of study is to estimate the role of energy financing for energy retrofit in COVID-19, with the intervening role of green bond financing. For this, Kalman technique is applied to infer the empirical findings. It is found that energy financing is significantly dependent on green bonds, and green bonds have a significant role in energy retrofit in E-7 economies specifically. It is further found that E-7 economies gained significant rise in energy efficiency financing green bonds financing, that has supportively extended energy retrofit - before and during COVID-19 crises. It is further found significant that the E-7 nations have to put alot of money into hydro and nuclear energy for energy retrofit, with low carbon emissions. In the light of COVID-19 crises, this study offers policy recommendations for effective energy management. However, such policy recommendations are expected to finely serve the financial intermediaries and national governments of E-7 economies to better optimize energy financing through green bond financing. The novelty of the study exists in topical framework and research directions, talking about the way forwards for energy efficiency financing - which is one of the latest issue of the recent times. Hence, this research provides some empirical verifications about energy financing in COVID-19 crises for energy retrofit, and shares some suggestions for stakeholders.",
        "DOI": "10.1007/s11356-021-17440-3",
        "paper_author": "Zhang L.",
        "affiliation_name": "Jiangxi University of Finance and Economics",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60028275",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "Work, family, Fatherland: the political economy of populism in central and Eastern Europe",
        "publication": "Journal of European Public Policy",
        "citied_by": "73",
        "cover_date": "2022-01-01",
        "Abstract": "Since 2008, Hungary and Poland have developed a distinctive populist economic program, which has begun to spread to other Central and East European Countries (CEECs). This article develops a theory of the political economy of populism in CEECs, arguing that these countries’ dependence on foreign capital constrained them to follow (neo)liberal economic policies. After the global financial crisis, populist parties began to break from the (neo)liberal consensus, ‘thickening’ their populist agenda to include an economic program based on a conservative developmental statism. Case studies of Hungary, Poland, and Serbia describe these policies and show that they exhibit a particular form of economic nationalism that emphasizes workforce activation, natalism, and sovereignty. This shift has gone hand-in-hand with attempts to attract investments from Eastern authoritarian states, illustrating the connection between CEEC development strategies and sources of foreign capital.",
        "DOI": "10.1080/13501763.2020.1832557",
        "paper_author": "Orenstein M.A.",
        "affiliation_name": "University of Pennsylvania",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60006297",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "The Rise of Finance Companies and FinTech Lenders in Small Business Lending",
        "publication": "Review of Financial Studies",
        "citied_by": "72",
        "cover_date": "2022-11-01",
        "Abstract": "We document that finance companies and FinTech lenders increased lending to small businesses after the 2008 financial crisis. We show that most of the increase substituted for a reduction in bank lending. In counties in which banks had a larger market share before the crisis, finance companies and FinTech lenders increased their lending more. We find no effect of reduced bank lending on employment, wages, and new business creation by 2016. Our results suggest that finance companies and FinTech lenders are major suppliers of credit to small businesses and played an important role in the recovery from the 2008 financial crisis.",
        "DOI": "10.1093/rfs/hhac034",
        "paper_author": "Gopal M.",
        "affiliation_name": "Scheller College of Business",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60116662",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "Financing constraints and firm-level responses to the COVID-19 pandemic: International evidence",
        "publication": "Research in International Business and Finance",
        "citied_by": "71",
        "cover_date": "2022-01-01",
        "Abstract": "We explore whether financing constraints affected the ways in which small and medium-sized enterprises navigated through the economic disruptions caused by the COVID-19 pandemic. We draw on data from a novel source, the COVID-19 Impact Follow-up Surveys conducted in 19 countries by the World Bank Enterprise Analysis Unit as a follow-up to enterprise surveys conducted in these countries prior to the COVID-19 outbreak. We find that previous bank-lending credit constraints magnified the effects of the pandemic. More specifically, credit-rationed firms were more likely to experience greater liquidity and cash flow problems and more likely than unconstrained firms to be delinquent in meeting their obligations to financial institutions during the economic crisis. Furthermore, these firms were less likely to have access to bank funding as a principal source of financing to address pandemic-induced cash flow and liquidity problems during the COVID-19 outbreak. We further find that credit-constrained firms were more likely to use trade credit, delay payments to suppliers or employees, and rely on government grants to cope with pandemic-related liquidity and cash flow problems. We find little evidence that credit-rationed firms were more likely to raise equity capital during this economic crisis. Finally, we find that financing constraints were more likely to hamper firms’ ability to adjust business operations in response to exogenous shocks. This study contributes to the literature on the impact of credit constraints on firm behavior in times of crisis.",
        "DOI": "10.1016/j.ribaf.2021.101545",
        "paper_author": "Khan S.U.",
        "affiliation_name": "Universiti Teknologi Brunei",
        "affiliation_city": "Gadong",
        "affiliation_country": "Brunei Darussalam",
        "affiliation_id": "60072090",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Risk of burnout in French entrepreneurs during the COVID-19 crisis",
        "publication": "Small Business Economics",
        "citied_by": "71",
        "cover_date": "2022-02-01",
        "Abstract": "Abstract: The COVID-19 crisis presents manifest threats for entrepreneurs since their business survival is often directly at stake given the alarming economic downturn. This existential threat, together with their crucial role in the economy, is the reason for the plethora of public financial support schemes being implemented throughout the entire world. However, support schemes for mental health are lacking. We aim to investigate, first, whether burnout levels have increased during the crisis and, second, whether burnout levels during the COVID-19 crisis depend on the threat of becoming ill, having to stay at home due to the lockdown, and/or having to file for bankruptcy due to the economic downturn. We do so using seven data sets of French entrepreneurs with a temporal comparison of averages and two data sets of French entrepreneurs with a cross-sectional analysis of individuals. Our findings show that indeed, the risks of burnout have increased during the pandemic and that the threat of bankruptcy is the dominant threat. As an increasing number of studies in the entrepreneurship literature indicate that entrepreneurs’ mental health influences their activities, as well as the growth and sustainability of their ventures, our study is important and timely in its contribution, as it takes a close look at the perception of burnout in general and more specifically during the COVID-19 pandemic. Plain English Summary: The risk of burnout in French entrepreneurs has increased significantly during the COVID-19 pandemic, which calls for not only financial support but also other forms of support. The COVID-19 pandemic presents many threats for entrepreneurs since their business survival is often directly at stake. These threats are not just financial but also related to health, such as the threat of burnout. The findings of our study show that for French entrepreneurs, the threat of burnout increased after the arrival of the COVID-19 pandemic. This finding raises the question whether this outcome is due to the threat to health, the effects of the lockdown, or the threat of bankruptcy. It appears that all three factors play important roles, although the financial threat is the dominant threat. These findings call for the extension of entrepreneurial support systems beyond the financial area by also involving an “entrepreneurship care” aspect, which includes telephone support, webinars, and mental help facilities.",
        "DOI": "10.1007/s11187-021-00516-2",
        "paper_author": "Torrès O.",
        "affiliation_name": "Université de Montpellier",
        "affiliation_city": "Montpellier",
        "affiliation_country": "France",
        "affiliation_id": "60108488",
        "affiliation_state": "Occitanie"
    },
    {
        "paper_title": "Financial distress prediction using integrated Z-score and multilayer perceptron neural networks",
        "publication": "Decision Support Systems",
        "citied_by": "70",
        "cover_date": "2022-08-01",
        "Abstract": "The COVID-19 pandemic led to a great deal of financial uncertainty in the stock market. An initial drop in March 2020 was followed by unexpected rapid growth over 2021. Therefore, financial risk forecasting continues to be a central issue in financial planning, dealing with new types of uncertainty. This paper presents a stock market forecasting model combining a multi-layer perceptron artificial neural network (MLP-ANN) with the traditional Altman Z-Score model. The contribution of the paper is presentation of a new hybrid enterprise crisis warning model combining Z-score and MLP-ANN models. The new hybrid default prediction model is demonstrated using Chinese data. The results of empirical analysis show that the average correct classification rate of thew hybrid neural network model (99.40%) is higher than that of the Altman Z-score model (86.54%) and of the pure neural network method (98.26%). Our model can provide early warning signals of a company's deteriorating financial situation to managers and other related personnel, investors and creditors, government regulators, financial institutions and analysts and others so that they can take timely measures to avoid losses.",
        "DOI": "10.1016/j.dss.2022.113814",
        "paper_author": "Wu D.",
        "affiliation_name": "University of Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027363",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The global burden of coeliac disease: opportunities and challenges",
        "publication": "Nature Reviews Gastroenterology and Hepatology",
        "citied_by": "70",
        "cover_date": "2022-05-01",
        "Abstract": "Coeliac disease is a systemic disorder characterized by immune-mediated enteropathy, which is caused by gluten ingestion in genetically susceptible individuals. The clinical presentation of coeliac disease is highly variable and ranges from malabsorption through solely extra-intestinal manifestations to asymptomatic. As a result, the majority of patients with coeliac disease remain undiagnosed, misdiagnosed or experience a substantial delay in diagnosis. Coeliac disease is diagnosed by a combination of serological findings of disease-related antibodies and histological evidence of villous abnormalities in duodenal biopsy samples. However, variability in histological grading and in the diagnostic performance of some commercially available serological tests remains unacceptably high and confirmatory assays are not readily available in many parts of the world. Currently, the only effective treatment for coeliac disease is a lifelong, strict, gluten-free diet. However, many barriers impede patients’ adherence to this diet, including lack of widespread availability, high cost, cross-contamination and its overall restrictive nature. Routine follow-up is necessary to ensure adherence to a gluten-free diet but considerable variation is evident in follow-up protocols and the optimal disease management strategy is not clear. However, these challenges in the diagnosis and management of coeliac disease suggest opportunities for future research.",
        "DOI": "10.1038/s41575-021-00552-z",
        "paper_author": "Makharia G.K.",
        "affiliation_name": "All India Institute of Medical Sciences, New Delhi",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60009790",
        "affiliation_state": "DL"
    },
    {
        "paper_title": "A risk perception scale for travel to a crisis epicentre: visiting Wuhan after COVID-19",
        "publication": "Current Issues in Tourism",
        "citied_by": "70",
        "cover_date": "2022-01-01",
        "Abstract": "Although the significance of tourist risk perceptions is well documented, perspectives on risk associated with major pandemics such as COVID-19 remain poorly understood, especially from the viewpoint of destination crisis management. This research measured risk perceptions among Chinese residents related to travelling to Wuhan after the outbreak of COVID-19. Based on the concept and dimensions of tourist risk perceptions, a risk perception scale with 13 items on four dimensions (health, financial, social. performance) was developed and validated using exploratory and confirmatory factor analysis. Risk perception differences among visitor groups were identified based on 1818 survey responses collected during the COVID-19 outbreak in China. The results show that occupations and place of residence had significant effects on all 13 items, while gender, age, educational attainment, and income independently affected some items. Similarly, respondent involvement in disease prevention and control, losses suffered during the pandemic, and previous experiences of visiting Wuhan were found to produce significant differences.",
        "DOI": "10.1080/13683500.2020.1857712",
        "paper_author": "Zhan L.",
        "affiliation_name": "Hubei University Of Economics",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60108808",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Fintech in islamic finance literature: A review",
        "publication": "Heliyon",
        "citied_by": "68",
        "cover_date": "2022-09-01",
        "Abstract": "This study reviews Islamic FinTech research development from 2017 to 2022. The study adopts a hybrid approach combining bibliometric and content analysis to reveal the current research trend of Islamic FinTech research. Using the Scopus database, we retrieve 85 documents and analyze them using RStudio and VOSviewer. The content analysis categorizes the research output in Islamic FinTech into four distinct streams. The study finds potential for cointegrating FinTech into Islamic finance to benefit the unbanked and small-medium-size businesses, the adoption of FinTech in Islamic finance will also help the government improve financial inclusion, conquer financial crises, such as COVID-19, and achieve SDGs for a sustainable nation. However, the lack of legal regulation and the lower financial literacy becomes the primary obstacle to the development of FinTech in Islamic finance.",
        "DOI": "10.1016/j.heliyon.2022.e10385",
        "paper_author": "Alshater M.M.",
        "affiliation_name": "Philadelphia University",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60054151",
        "affiliation_state": "Amman"
    },
    {
        "paper_title": "Growing differently? Financial cycles, austerity, and competitiveness in growth models since the Global Financial Crisis",
        "publication": "Review of International Political Economy",
        "citied_by": "68",
        "cover_date": "2022-01-01",
        "Abstract": "The paper contributes to the recent growth models debate through a cross-country analysis of growth drivers before and after the 2008 Global Financial Crisis (GFC). It argues that the widely used dichotomy of export-led versus (debt-financed) consumption-led growth has lost its usefulness since the GFC. Specifically, identifying growth models through growth contributions can give misleading results when the drivers of economic growth change. The paper contends that Comparative Political Economy (CPE) has neglected the unstable nature of financial growth drivers, effectively ignores fiscal policy, and overemphasizes price competitiveness as a growth driver. It shows empirically that, first, debt-financed growth is cyclical and financial booms come with busts and debt overhang; second, post-GFC growth dynamics are strongly shaped by the fiscal policy reaction; third, price competitiveness through wage deflation has played a negligible role in driving growth. We conclude that CPE needs to broaden its analysis of growth drivers in order to understand how the GFC transformed growth models.",
        "DOI": "10.1080/09692290.2021.1899035",
        "paper_author": "Kohler K.",
        "affiliation_name": "King's College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60011520",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "COVID-19 pandemic exposes the vulnerability of the sharing economy: a novel accounting framework",
        "publication": "Journal of Sustainable Tourism",
        "citied_by": "68",
        "cover_date": "2022-01-01",
        "Abstract": "The outbreak of the COVID-19 pandemic has resulted in a global economic recession, but little is known about the impact it has had on the informal economy, including the peer-to-peer rental market. This study assessed the financial loss of Airbnb listings for its hosts in Greater Sydney, Australia. Findings show that comparing August 2020 to January 2020, the pandemic resulted in 89.5 per cent income loss for Airbnb hosts (about 14 million) with hosts suffering about 6.5 times more than the Airbnb platform itself. However, many Airbnb hosts are not eligible for the financial aid being offered by the NSW State Government or the Australian Federal Government. The study further demonstrates the vulnerability of the sharing economy during a time of crisis. It contributes empirical evidence to the widening public debate on the sharing economy’s contribution to sustainable tourism and decent work (SDG 8), and reduced inequalities (SDG 10), and, most importantly, it raises concerns over taxation and social protections for informal employees. Methodologically, this study contributes to the literature by presenting a comprehensive income accounting framework to analyse this segment of the workforce’s financial performance, which can serve as benchmark for tax estimation and financial aids.",
        "DOI": "10.1080/09669582.2020.1868484",
        "paper_author": "Chen G.",
        "affiliation_name": "Beijing Normal University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60023237",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Studying corporate liquidity and regulatory responses for economic recovery in COVID-19 crises",
        "publication": "Economic Analysis and Policy",
        "citied_by": "67",
        "cover_date": "2022-12-01",
        "Abstract": "Many enterprises across the European Union (EU) have been hampered by the massive spread of COVID-19. It has severely impacted revenues and financial flows, potentially leading to an increase in corporate insolvency. This study investigates the influence of this new coronavirus on the solvency status of businesses in EU Member States. Several stress scenarios were constructed for non-financial listed enterprises. The results reveal a gradual surge in the possibility of default, a rise in loan repayment, and coverage being refused. According to our findings, the solvency profiles of all firms are deteriorating. Industries, such as mining, mass production, and retail, are the most susceptible to a drop in sales income and market capitalization. Before COVID-19, previous research had looked at policy options for maintaining solvency. Our data imply that a tax delay is adequate if there is a slight deterioration in the economic outlook. There should be hybrid assistance through loans and equity for even a slight deterioration in the state of an economy. This research will benefit policymakers, corporate executives, and creditors.",
        "DOI": "10.1016/j.eap.2022.07.004",
        "paper_author": "Chang L.",
        "affiliation_name": "Peking University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014966",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Safe haven properties of green, Islamic, and crypto assets and investor's proclivity towards treasury and gold",
        "publication": "Energy Economics",
        "citied_by": "66",
        "cover_date": "2022-11-01",
        "Abstract": "Turbulent times significantly exacerbate the search for a safe haven asset, inspired by investors' loss aversion. The same happened during the Covid-19 crisis when recurring losses forced investors to alter their investment strategies, and the search for alternative investment classes picked momentum. This study evaluates the safe haven properties of Green financial products, Islamic assets, and Cryptocurrencies, all of which gained prominence in financial markets after the global financial crisis, coupled with the long-acknowledged safe haven assets like Gold, Silver, and Treasuries. We employ a quantile VAR framework to examine the connectedness between the assets' markets during stressed, normal, and euphoric periods. Our results show that both Green and Islamic Bonds only act as a safe haven during the normal market condition; however, US Treasury, cryptocurrencies, and gold emerged as safe-haven assets under bearish or extreme volatility periods. While proclivity towards US Treasury and gold supports the phenomenon of flight-to-safety, we find cryptos have also become investors' preference amid bearish trends to satiate their risk appetite finding their way into the list of speculative assets, if not the true safe havens for investors.",
        "DOI": "10.1016/j.eneco.2022.106396",
        "paper_author": "Rizvi S.K.A.",
        "affiliation_name": "Suleman Dawood School of Business",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60218019",
        "affiliation_state": "Punjab"
    },
    {
        "paper_title": "The ESG Disclosure and the Financial Performance of Norwegian Listed Firms",
        "publication": "Journal of Risk and Financial Management",
        "citied_by": "66",
        "cover_date": "2022-06-01",
        "Abstract": "The world is constantly changing, and with an evolving global environmental crisis, there is a growing trend of Corporate Social Responsibility, and Environmental, Social, and Governance (ESG) disclosure initiatives. The final report on the new E.U. taxonomy for sustainable activities was released in 2020, making ESG disclosure more relevant. This paper investigates the effects of ESG initiatives on the financial performance of Norwegian listed companies from 2010 to 2019. ESG is measured through the Thomson Reuters Eikon ESG disclosure score and financial performance through ROA and Tobin’s Q. To the best of our knowledge, this is the first time this relationship has been investigated in Norway. Using panel data regression analysis and two proxies for the dependent variable (financial performance), the results of this study are mixed. In particular, findings suggest a strong significant relationship between ESG initiatives and financial performance. More specifically, the regression model, with ROA as the dependent variable, suggests that ESG initiatives have a clear negative impact. On the other hand, the variable Tobin’s Q increases when ESG increases. This could be explained by the different horizons of the measures and other factors affecting the business environment.",
        "DOI": "10.3390/JRFM15060237",
        "paper_author": "Giannopoulos G.",
        "affiliation_name": "Kingston Business School",
        "affiliation_city": "Kingston Upon Thames",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60171707",
        "affiliation_state": "Surrey"
    },
    {
        "paper_title": "The Impact of Corporate Governance on the Financial Performance of the Banking Sector in the MENA (Middle Eastern and North African) Region: An Immunity Test of Banks for COVID-19",
        "publication": "Journal of Risk and Financial Management",
        "citied_by": "66",
        "cover_date": "2022-02-01",
        "Abstract": "The purpose of this paper is to measure the impact of internal and external corporate governance mechanisms on the financial performance of banks in the under-researched Middle Eastern and North African (MENA) region during the COVID-19 pandemic period. Bank annual reports, the Orbis Bank Focus database, and World Bank reports were used to collect both financial and non-financial information on the banking sector, followed by fixed effects regressions and two-stage least squares. Results showed that the corporate governance measures of presence of independent members on the board of directors, high ownership concentration, lack of political pressure on board members, and strong legal protection, had positive effects on bank financial performance. Corporate governance mechanisms, such as performance-based compensation, the presence of women on boards, moderate size of the board, and anti-takeover mechanisms had no significant impact on bank performance during the crisis period. An effective internal and external corporate governance mechanism could improve the financial performance of banks in MENA countries in times of pandemics and crises.",
        "DOI": "10.3390/jrfm15020082",
        "paper_author": "El-Chaarani H.",
        "affiliation_name": "Beirut Arab University",
        "affiliation_city": "Beirut",
        "affiliation_country": "Lebanon",
        "affiliation_id": "60068763",
        "affiliation_state": "Mount Lebanon"
    },
    {
        "paper_title": "The Covid-19 pandemic and entrepreneurship: some reflections",
        "publication": "International Journal of Emerging Markets",
        "citied_by": "66",
        "cover_date": "2022-05-19",
        "Abstract": "Purpose: The Covid-19 pandemic has affected the world in an unprecedented manner. The economic recession in 2020 is expected to be the most serious since the Second World War. This study aims to analyse the likely consequences of the Covid-19 pandemic crisis on entrepreneurship and new venture activity. Design/methodology/approach: The paper focuses first on the major shocks caused by the pandemic that may affect entrepreneurial activity. To do so, the authors briefly review the literature about the previous financial crisis and its effects on entrepreneurship. Then, the manuscript means to disentangle how these shocks will impinge on the different stages and motives within the entrepreneurial process. Findings: This analysis reveals that the consequences of the pandemic for entrepreneurship will be generally damaging, but they may not be so tremendously negative as originally thought. We could initially expect a broad downturn in entrepreneurial activity. Soon after that, however, necessity entrepreneurship is likely to boom. At the same time, but to a lesser extent, high-potential entrepreneurial activity could also be fostered, provided the recovery is quick and there is sufficient support from the environment and institutions. Originality/value: This is probably one of the first academic reflections on the likely effects of the Covid-19 pandemic on entrepreneurship. It specifically addresses the role of institutions and how they may differently affect necessity and opportunity entrepreneurship. It also suggests interesting related research areas and some basic recommendations on how to help entrepreneurs overcome it.",
        "DOI": "10.1108/IJOEM-05-2020-0491",
        "paper_author": "Liñán F.",
        "affiliation_name": "Universidad de Sevilla",
        "affiliation_city": "Sevilla",
        "affiliation_country": "Spain",
        "affiliation_id": "60033284",
        "affiliation_state": "Seville"
    },
    {
        "paper_title": "Towards a conceptual framework for non-financial reporting inclusive of pandemic and climate risk reporting",
        "publication": "Meditari Accountancy Research",
        "citied_by": "65",
        "cover_date": "2022-05-26",
        "Abstract": "Purpose: This paper aims to evaluate non-financial reporting (NFR) frameworks insofar as risk reporting is concerned. This is facilitated through analysis of the adequacy of climate- and pandemic-related risk reporting in three industries that are both significantly impacted by the COVID-19 pandemic and are at risk from climate change. The pervasiveness of pandemic and climate-change risks have been highlighted in 2020, the hottest year on record and the year the COVID-19 pandemic struck. Stakeholders might reasonably expect reporting on these risks to have prepared them for the consequences. Design/methodology/approach: The current debate on the “complexity” of sustainability and NFR frameworks/standards is critically analysed in light of the COVID-19 pandemic and calls to “build back better”. Context is provided through analysis of risk reporting by the ten largest airlines and the five largest companies in each of the hotel and cruise industries. Findings: Risk reporting on two significant issues, pandemics and climate change, is woefully inadequate. While very little consideration has been given to pandemic risks, disclosures on climate-related risks focus predominantly on “risks” of increased regulation rather than physical risks, indicating a short-term focus. The disclosures are dispersed across different corporate reporting media and fail to appreciate the long-term consequences or offer solutions. Mindful that a conceptual framework for NFR must address this, the authors propose a new definition of materiality and recommend that sustainable development risks and opportunities be placed at the core of a future framework for connected/integrated reporting. Research limitations/implications: For sustainable development risks to be perceived as “real” by managers, further research is needed to determine the nature and extent of key sustainable development risks and the most effective mitigation strategies. Social implications: This paper highlights the importance of recognising the complexity of the issues facing organisations, society and the planet and addressing them by encouraging robust consideration of the interdependencies in evolving approaches to corporate reporting. Originality/value: This study contributes to the current debate on the future of corporate reporting in light of two significant interconnected crises that threaten business and society – the pandemic and climate change. It provides evidence to support a long-term oriented and holistic approach to risk management and reporting.",
        "DOI": "10.1108/MEDAR-11-2020-1097",
        "paper_author": "Abhayawansa S.",
        "affiliation_name": "Swinburne Business School",
        "affiliation_city": "Hawthorn",
        "affiliation_country": "Australia",
        "affiliation_id": "60172295",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Pharmacotherapy of Generalized Myasthenia Gravis with Special Emphasis on Newer Biologicals",
        "publication": "Drugs",
        "citied_by": "64",
        "cover_date": "2022-06-01",
        "Abstract": "Myasthenia gravis (MG) is a chronic, fluctuating, antibody-mediated autoimmune disorder directed against the post-synaptic neuromuscular junctions of skeletal muscles, resulting in a wide spectrum of manifestations ranging from mild to potentially fatal. Given its unique natural course, designing an ideal trial design for MG has been wrought with difficulties and evidence in favour of several of the conventional agents is weak as per current standards. Despite this, acetylcholinesterases and corticosteroids have remained the cornerstones of treatment for several decades with intravenous immunoglobulins (IVIG) and therapeutic plasma exchange (PLEX) offering rapid treatment response, especially in crises. However, the treatment of MG entails long-term immunosuppression and conventional agents are viable options but take longer to act and have a number of class-specific adverse effects. Advances in immunology, translational medicine and drug development have seen the emergence of several newer biological agents which offer selective, target-specific immunotherapy with fewer side effects and rapid onset of action. Eculizumab is one of the newer agents that belong to the class of complement inhibitors and has been approved for the treatment of refractory general MG. Zilucoplan and ravulizumab are other agents in this group in clinical trials. Neisseria meningitis is a concern with all complement inhibitors, mandating vaccination. Neonatal Fc receptor (FcRn) inhibitors prevent immunoglobulin recycling and cause rapid reduction in antibody levels. Efgartigimod is an FcRn inhibitor recently approved for MG treatment, and rozanolixizumab, nipocalimab and batoclimab are other agents in clinical trial development. Although lacking high quality evidence from randomized clinical trials, clinical experience with the use of anti-CD20 rituximab has led to its use in refractory MG. Among novel targets, interleukin 6 (IL6) inhibitors such as satralizumab are promising and currently undergoing evaluation. Cutting-edge therapies include genetically modifying T cells to recognise chimeric antigen receptors (CAR) and chimeric autoantibody receptors (CAAR). These may offer sustained and long-term remissions, but are still in very early stages of evaluation. Hematopoietic stem cell transplantation (HSCT) allows immune resetting and offers sustained remission, but the induction regimens often involve serious systemic toxicity. While MG treatment is moving beyond conventional agents towards target-specific biologicals, lack of knowledge as to the initiation, maintenance, switching, tapering and long-term safety profile necessitates further research. These concerns and the high financial burden of novel agents may hamper widespread clinical use in the near future.",
        "DOI": "10.1007/s40265-022-01726-y",
        "paper_author": "Menon D.",
        "affiliation_name": "National Institute of Mental Health and Neuro Sciences",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "60016175",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "A comparative analysis of COVID-19 and global financial crises: evidence from US economy",
        "publication": "Economic Research-Ekonomska Istrazivanja",
        "citied_by": "63",
        "cover_date": "2022-01-01",
        "Abstract": "The COVID-19 crisis has had deep adverse effects on a global level, affecting many economies and worsening their conditions which may have led to severe recession or even depression. The numbers of positive cases have risen sharply over the last few months, and the fatalities have also reached their peak. This study aims to examine the impact of the global financial crisis, and the COVID-19 pandemic on the macroeconomic variables of the US economy. It also provides an understanding in a descriptive format, to analyze and compare the global financial crisis and COVID-19 pandemic, in a tabulated and graphical format. For analysis purposes, the tables and average method have been used. For the graphical formats, charts have been used for the later year of 2008, and the beginning of the 2009 global financial crisis. The first six months of the spread of the COVID-19 pandemic have also been taken into consideration. The results have confirmed that the current COVID-19 pandemic shows more severity in terms of economic activity, than the global financial crisis had experienced. Moreover, the impact of the crisis on the recession probabilities in the current pandemic is lower than that at the time of the global financial crisis.",
        "DOI": "10.1080/1331677X.2021.1952640",
        "paper_author": "Li Z.",
        "affiliation_name": "Wuchang University of Technology",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60261354",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "The determinants of bootstrap financing in crises: evidence from entrepreneurial ventures in the COVID-19 pandemic",
        "publication": "Small Business Economics",
        "citied_by": "63",
        "cover_date": "2022-02-01",
        "Abstract": "Bootstrap financing refers to measures that entrepreneurial ventures undertake to preserve liquidity (e.g., reducing expenses, collecting receivables, delaying payments, preselling). Prior research shows that bootstrap financing is an important enabler for the growth of resource-constrained early-stage ventures. However, little is known about the use of bootstrap financing in crises, during which the preservation of liquidity is particularly salient. We investigate the determinants of bootstrap financing in the 2020 COVID-19 crisis using a sample of 17,046 German entrepreneurial ventures. We formulate hypotheses about the determinants of bootstrap financing from a necessity, human capital, and opportunity cost perspective. Among others, our results show that the severity of the crisis for the venture, the level of private consumption, and self-employment experience are positively associated with an increased use of bootstrap financing measures. Our study contributes to the literature on bootstrap financing and illuminates how entrepreneurial ventures maintain liquidity in crises. Plain English Summary Economic downturns or crises often lead to financial distress for ventures. To survive such tumultuous times, ventures need to preserve their liquidity. Bootstrap financing refers to measures that entrepreneurial ventures take to preserve liquidity (like sending payment reminders, paying invoices later, reducing tax advances, reducing commercial rent). Because little is known about how bootstrap financing is used during crises, we investigate how it was used during the COVID-19 crisis. Our study builds on a survey of 17,046 German entrepreneurial ventures and self-employed individuals. We find that the use of bootstrap financing is positively related to how severe the crisis was for the venture along with the level of private consumption and self-employment experience of the venture’s owner. In contrast, a negative association exists with private liquidity, business liquidity, how long before the owner retires, and part-time self-employment. The positive association between self-employment experience and bootstrap financing indicates that targeted entrepreneurship education programs or webinars should focus on inexperienced entrepreneurs so that these individuals are prepared to use bootstrapping methods to maintain liquidity during crises.",
        "DOI": "10.1007/s11187-020-00445-6",
        "paper_author": "Block J.H.",
        "affiliation_name": "Universität Trier",
        "affiliation_city": "Trier",
        "affiliation_country": "Germany",
        "affiliation_id": "60011891",
        "affiliation_state": "Rheinland-Pfalz"
    },
    {
        "paper_title": "How does information and communication technology affect renewable energy technology innovation? International evidence",
        "publication": "Renewable Energy",
        "citied_by": "62",
        "cover_date": "2022-11-01",
        "Abstract": "Renewable energy technology innovation (RETI) has become a key factor in mitigating climate change and promoting sustainable development of the world economy, but there is no literature on the effect of information and communication technology (ICT) on RETI and its impact mechanism. This paper measures RETI using panel data for 70 countries from 2005 to 2019 based on the combination of diffusion and depreciation effects of technological innovation and systematically examines the direct and mediating mechanisms of ICT's effect on RETI. The results show that ICT significantly contributes to RETI and even holds after addressing endogeneity, replacing the explanatory or explanatory variables, excluding extreme values, and excluding the effects of the financial crisis. The results of the transmission mechanism analysis indicate that ICT affects RETI through human capital accumulation, financial development, and information disclosure, meaning that human capital, financial development, and information disclosure are important mediating transmission mechanisms. The results of heterogeneity analysis note significant economic organizational heterogeneity and innovation environment heterogeneity of ICT to RETI. Specifically, in IEA and OECD member nations as well as in the high renewable energy consumption and high R&D investment groups, the contribution effect of ICT on RETI is more significant.",
        "DOI": "10.1016/j.renene.2022.10.015",
        "paper_author": "Lee C.C.",
        "affiliation_name": "Nanchang University",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60008332",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "A bibliometric review of financial market integration literature",
        "publication": "International Review of Financial Analysis",
        "citied_by": "62",
        "cover_date": "2022-03-01",
        "Abstract": "We undertake a meta-literature review on the topic of financial market integration (FMI), covering 260 articles from 1981 to 2021. Our review consists of quantitative analysis of bibliometric citations concomitant with qualitative analysis of content, towards a goal of identifying primary research streams and proposing directions for future research. We identify five research groups: (1) portfolio diversification with financial market integration; (2) general equity market integration; (3) financial market linkage with respect to crises and events; (4) time-varying financial market integration; and (5) co-movements and spillovers between commodities and financial markets; as well as present a wide array of future research directions. We conduct an extensive review of FMI literature, answering several questions: (1) What is the domain of FMI research?; (2) What are the influential aspects of top journals and authors, and the characteristics of the most studied topics?; (3) What are the past and current key research streams in FMI literature?; and (4) What are the substantial future relevant research questions to explore regarding FMI? Given the ongoing attention on financial market integration by both academicians and policy makers, our results should be of great interest.",
        "DOI": "10.1016/j.irfa.2022.102035",
        "paper_author": "Patel R.",
        "affiliation_name": "Nirma University, Institute of Management",
        "affiliation_city": "Ahmedabad",
        "affiliation_country": "India",
        "affiliation_id": "60117265",
        "affiliation_state": "GJ"
    },
    {
        "paper_title": "Innovation and uneven development: The challenge for low- and middle-income economies",
        "publication": "Research Policy",
        "citied_by": "62",
        "cover_date": "2022-03-01",
        "Abstract": "This essay begins with a recounting of the rise of the Mass Production techno-economic paradigm and the emergence of the systemic economic crisis in the early 1970s. It then explains how this crisis was stemmed by the deepening of globalisation, which accelerated during the 1980s. However, shortly before the turn of the millennium, the internal fissures of the paradigm became more apparent, resulting in a renewed slowdown in growth and global financial crises. In the context of these global developments, most emerging economies are confronted by two structural problems. The first is the prevalence of a massive informal sector; the second is the erosion of the possibilities for a flying geese policy replicating the export success of China. However, crisis presents both challenge and opportunity, and three sets of innovation opportunities are addressed in the paper. These are the largely unrecognised innovative potential within the informal sector, the possibilities opened up by growing regional and South-South trade, and the transformative potential of the heartland technology driving the new techno-economic paradigm, ICTs. Building on seminal contribution to ideas by Freeman, we argue that these are important pillars to build an innovation agenda for inclusion in developing countries. The essay concludes with a discussion of the main policy implications to maximise the development impact of these new opportunities.",
        "DOI": "10.1016/j.respol.2021.104394",
        "paper_author": "Kaplinsky R.",
        "affiliation_name": "University of Sussex",
        "affiliation_city": "Brighton",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60017317",
        "affiliation_state": "East Sussex"
    },
    {
        "paper_title": "Hydrogen and medical oxygen by renewable energy based electrolysis: A green and economically viable route",
        "publication": "Applied Energy",
        "citied_by": "62",
        "cover_date": "2022-01-15",
        "Abstract": "As emphasised by the crisis caused by the COVID-19 pandemic, medical oxygen is an essential health commodity. The purpose of this study is the application of Renewable Energy Sources (RES)-based (photovoltaic-powered) water electrolysis plant for oxygen production in hospitals to self-produce the amount of oxygen they need, and – in particular – to define when this choice could be economically competitive with the current medical gas market. The proposed plant is able to produce oxygen and to store energy in hydrogen form at the same time, proposing a new approach in RES applications. Therefore, we calculated as a function of the hospital size (number of beds, up to 500) what should be the market price of oxygen above which the self-production of oxygen is economically profitable (assuming a break-event point of 15 years). Hydrogen is considered a by-product allowing to increase the system efficiency and supplying extra services. The results demonstrated that, assuming a selling price of 3 €/kg for the hydrogen (co)-produced by the plant, the on-site production of medical oxygen could be an interesting alternative compared to purchasing from the local gas resellers, if its market price is higher than 3–4 €/kg. Since this value is in line with current prices established for ex-factory oxygen by some national regulatory authorities (e.g., AIFA), we can conclude that the proposed RES-based electrolysis system is a green and economically feasible solution for oxygen production in hospitals, able also to increase hospital resilience against energy and oxygen shortage.",
        "DOI": "10.1016/j.apenergy.2021.117993",
        "paper_author": "Maggio G.",
        "affiliation_name": "Istituto Di Tecnologie Avanzate Per L'energia, Messina",
        "affiliation_city": "Messina",
        "affiliation_country": "Italy",
        "affiliation_id": "60024092",
        "affiliation_state": "ME"
    },
    {
        "paper_title": "Surviving the coronavirus pandemic and beyond: Unlocking family firms’ innovation potential across crises",
        "publication": "Journal of Family Business Strategy",
        "citied_by": "62",
        "cover_date": "2022-03-01",
        "Abstract": "In this research note, we examine Finnboat, a traditional Finnish family firm, from the interrelated perspectives of crisis behavior and innovation. The firm under study has endured three major crises: the economic recession of the 1990s, the 2008–2009 financial crisis, and the coronavirus pandemic. Our study shows that Finnboat has undertaken only very modest, if any, innovations during stable periods but has conducted a series of radical business-model and technology innovations, triggered by the different crises. This finding implies that during crises, a risk-averse family firm can productively engage into risk-taking and innovative behavior, effectively engaging in a “preference reversal.” We also find evidence of a deliberate accumulation of slack resources during periods of calm, which are mobilized to back up innovation and renewal efforts when a crisis hits. Our findings highlight family firms’ potential to endure crises by adopting a temporal separation logic to the risk-aversion vs. risk-taking paradox, and relatedly, by strategically managing the resource portfolio. Based on the case study, we suggest several research directions, approaches, and methodologies for studying family firm behavior and change during and in-between crises.",
        "DOI": "10.1016/j.jfbs.2021.100440",
        "paper_author": "Leppäaho T.",
        "affiliation_name": "LUT kauppakorkeakoulu",
        "affiliation_city": "Lappeenranta",
        "affiliation_country": "Finland",
        "affiliation_id": "60226620",
        "affiliation_state": "South Karelia"
    },
    {
        "paper_title": "The impact of the Russia-Ukraine conflict on market efficiency: Evidence for the developed stock market",
        "publication": "Finance Research Letters",
        "citied_by": "61",
        "cover_date": "2022-12-01",
        "Abstract": "This paper investigates the impact of the Russia-Ukraine conflict on the stock market efficiency of six developed countries. The sample is composed of daily stock index data from the United States (US), United Kingdom, Germany, France, Italy and Spain. Market efficiency was analyzed by the multifractal structure of the series of returns in four periods (full series, COVID-19 outbreak, before the conflict and after the conflict). The results show the presence of multifractality of the index's return series in periods of crisis. The evidence rejects the market efficiency hypothesis and indicates the predictability of asset prices in times of instability and global financial crisis. Our findings can help fund managers, institutional investors, and investors in general to make decisions about asset allocation in times of crisis.",
        "DOI": "10.1016/j.frl.2022.103302",
        "paper_author": "Gaio L.E.",
        "affiliation_name": "Universidade Estadual de Campinas",
        "affiliation_city": "Campinas",
        "affiliation_country": "Brazil",
        "affiliation_id": "60029570",
        "affiliation_state": "SP"
    },
    {
        "paper_title": "The COVID-19 black swan crisis: Reaction and recovery of various financial markets",
        "publication": "Research in International Business and Finance",
        "citied_by": "61",
        "cover_date": "2022-01-01",
        "Abstract": "This paper examines and compares financial market reaction and recovery of four broad classes of financial assets – equity indexes, precious metals, 10-year benchmark bonds and cryptocurrencies, to the COVID-19 pandemic. The data set comprises daily observations of close prices in the selected markets from 17-04-2018 to 20-06-2021. Using the Yang and Zhao (2020) and Koenker and Xiao (2004) quantile unit-root tests for return persistence, we find heterogeneity in reactions and recovery patterns not only across asset classes, but also within them. Specifically, we find strong potential for mean reversion in equity markets even at high levels of shocks. While gold offers limited mean reversion, platinum shows very strong resistance to the COVID. Government bonds show small declines in value to the COVID in addition to high persistence. Cryptocurrencies, as a group, turn out to be the riskiest in the long-term, with more than a 50% decline in value coupled with high degrees of persistence. Our results raise questions as to the safe haven characteristics of the newly-popular Bitcoin. Our findings are useful for policy makers and investors through a better understanding of differences in the potential for mean reversion provided by different asset classes.",
        "DOI": "10.1016/j.ribaf.2021.101521",
        "paper_author": "Yarovaya L.",
        "affiliation_name": "Southampton Business School",
        "affiliation_city": "Southampton",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60176937",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Public universities and impacts of COVID-19 in Australia: risk disclosures and organisational change",
        "publication": "Accounting, Auditing and Accountability Journal",
        "citied_by": "61",
        "cover_date": "2022-01-03",
        "Abstract": "Purpose: The purpose of this study is to examine the COVID-19 pandemic risk disclosures in a sample of annual reports of Australian public universities. These universities rely heavily on fee-paying onshore overseas students. Analysing these risk disclosures is essential to understanding the COVID-19 crisis and the implications for organisational change. Design/methodology/approach: Document analysis and content analysis of the 2019 annual reports of all Victorian public universities were undertaken to identify the disclosure of COVID-19 risk impacts. Applying Laughlin's Habermasian insights of change, the study explores the pathways of change adopted by universities to overcome the risk impacts. However, financial risk disclosures about income from this source were virtually non-existent. Findings: Any risk associated with COVID-19 disclosed was minimal in a qualitative, neutral and constant format. The quality of disclosures was low. Media statements, however, pointed to significant income loss and suggested a strategy of substantial cost-cutting, including employee redundancies, which we identified as morphostatic changes of universities to overcome the risk impacts. Research limitations/implications: The study reveals the risk associated with sector's aggressive growth strategy, jeopardising their financial viability and quality of teaching and research. Practical implications: The findings provide insights to the Australian higher education sector. The low quality of external risk disclosures of these universities suggests an urgent need for transformation. Originality/value: Australian public universities play a crucial role in society. This role will be diminished by a failure to disclose and manage significant risks adequately.",
        "DOI": "10.1108/AAAJ-09-2020-4906",
        "paper_author": "Carnegie G.D.",
        "affiliation_name": "RMIT University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60011362",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "The potency of natural resources on ecological sustainability in PIIGS economies",
        "publication": "Resources Policy",
        "citied_by": "60",
        "cover_date": "2022-12-01",
        "Abstract": "The current study assesses nonlinear/asymmetric influences of natural resources (NR) on the ecological footprint (EF) at both the lower and higher tails for the case of PIIGS countries (Portugal, Ireland, Italy, Greece, and Spain) using quarterly data between 1970 and 2018. The PIIGS grew in popularity during the 2008 eurozone financial downturn, alluding to the nations impacted the hardest by the crisis. The study utilizes the sophisticated “quantile-on-quantile (QQ)\" technique initiated by Sim and Zhou (2015) which can estimate the dependence of the time series in each nation individually to offer country-specific indication for the interrelationship between the series. Furthermore, we utilize the quantile causality proposed by Troster et al. (2018) to identify the causal association between series at the lower and higher tails of the data distribution. The outcomes of the quantile cointegration revealed the long-run association between NR and EF in each sample country. Moreover, the results from the QQR disclosed that NR impacted EF negatively in Greece, Portugal, Ireland, and Spain across most of the quantiles. In contrast, positive connections between EF and NR surfaced in most of the quantiles for the case of Italy. Furthermore, the quantile causality revealed bidirectional causality between EF and NR for the PIIGS nations across major quantiles. This demonstrates that any policy initiated on NR will have a substantial but heterogeneous effect on EF and vice versa in the PIIGS countries.",
        "DOI": "10.1016/j.resourpol.2022.102941",
        "paper_author": "Razzaq A.",
        "affiliation_name": "Dalian University of Technology",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60004538",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Policy Implications for the Green Bank Development in the Context of Global Climate Change",
        "publication": "Emerging Science Journal",
        "citied_by": "60",
        "cover_date": "2022-08-01",
        "Abstract": "With the global financial crisis in 2008, climate change, and the COVID-19 pandemic, most countries worldwide have re-thought their organization and operating models in their financial systems, including the banking system. In Vietnam, sustainable economic development has become an essential need in the long term. However, sustainable development requires a balance between economic growth and environmental protection. Therefore, Vietnam has chosen to develop a green economy, in which \"green banks\" have an essential role. Green banking is a future banking model that balances all stakeholders' economic and environmental benefits and costs in banking activities. Green banking emerges as an ideal model for future banking, a foundation for a green economy and sustainable development. Therefore, the article analyzes the current situation and some challenges to promoting the development of green banking in Vietnam and proposes policy recommendations to promote green banking development in Vietnam in the coming time. The article used methods to test the reliability of Cronbach's alpha scale, exploratory factor analysis (EFA), confirmatory factor analysis (CFA), and SEM to test the research hypotheses based on surveying 700 commercial bank managers and collecting data by a convenient sampling method from June 2021 to December 2021. Research novelty explores five factors affecting green bank development with a significance level of 1.0%. Finally, the author had policy implications for developing the green bank in the future.",
        "DOI": "10.28991/ESJ-2022-06-04-011",
        "paper_author": "Hang N.P.T.",
        "affiliation_name": "University of Finance - Marketing",
        "affiliation_city": "Ho Chi Minh City",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60113436",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Tail risk connectedness in the refined petroleum market: A first look at the impact of the COVID-19 pandemic",
        "publication": "Energy Economics",
        "citied_by": "59",
        "cover_date": "2022-07-01",
        "Abstract": "This study provides a novel framework for analysing systematic tail risk transmission mechanisms by combining the Conditional Autoregressive Value-at-Risk (CAViaR) model with the recently developed Time-Varying Parameter Vector Autoregressive (TVP-VAR) based connectedness approach. We estimate dynamic spillovers across two crude oil (Brent and WTI) and four refined petroleum product (gasoline, heating oil, jet fuel and propane) prices from January, 17, 1997 to December 11, 2020. Results show that, both heating oil and kerosene are persistent net transmitters of shocks, signifying the important role of liquidity in the relevant markets. In addition, the role of either crude oil type appears to shift around 2009 following developments in the energy market. Overall, our findings suggest that, total connectedness are positively affected by major crisis episodes and that the recent COVID-19 pandemic appears to have the potential to propel both tail risk and exposure to losses to levels akin to those of the Global Financial Crisis of 2007–2008.",
        "DOI": "10.1016/j.eneco.2022.106051",
        "paper_author": "Chatziantoniou I.",
        "affiliation_name": "Hellenic Mediterranean University",
        "affiliation_city": "Heraklion",
        "affiliation_country": "Greece",
        "affiliation_id": "60032307",
        "affiliation_state": "Crete"
    },
    {
        "paper_title": "COVID-19 Pandemic Implications for Corporate Sustainability and Society: A Literature Review",
        "publication": "International Journal of Environmental Research and Public Health",
        "citied_by": "59",
        "cover_date": "2022-02-01",
        "Abstract": "The paper revises the ample empirical and theoretical literature on sustainable organizational growth and strategic leadership relating to the critical aspects of the ongoing pandemic, including poverty, social responsibility, public health, and organizational and managerial innovation. Drawing from available COVID-19, management, and sustainable leadership publications released from 2020 to 2021, this paper considers influential studies exploring core business concepts, principles, philosophies, and activities for accelerating, stimulating, and nurturing social and corporate sustain-ability. The study analyzed the characteristics and interrelation of 133 articles through bibliometric and literature systemization techniques. We shed light on the significant influence COVID-19 has had on financial, operational, and psychological solvency and organizational health to elucidate expectations and implications for businesses worldwide concerning the long-term financial and functional impact of COVID-19. An overview of the relevant studies on the individual, organizational, and external factors relating to novel disease’s relation to sustainability are provided. We emphasize the need for digital transformation following the COVID-19 upheaval and throughout the upcoming years. Some of the generally employed techniques in response to adversity entail portfolio diver-sification, service delivery innovation, product redesigning, new market development, partnering with competitors and/or complementary service providers, synergizing with other stakeholders, and open innovation.",
        "DOI": "10.3390/ijerph19031592",
        "paper_author": "Su R.",
        "affiliation_name": "Jiangsu University",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60017482",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "A new comprehensive database of financial crises: Identification, frequency, and duration",
        "publication": "Economic Modelling",
        "citied_by": "59",
        "cover_date": "2022-03-01",
        "Abstract": "This paper introduces a new database of financial crises, providing an important insight into the causes, duration, and consequences of different types of financial crises. Besides extending the systemic banking crises database by Laeven and Valencia (2020) to the period 1970–2019, we develop new approaches for the identification of currency and sovereign debt crises, which we regard as preferable in some respects to those in the literature. Covering 206 countries, our crises database draws on 151 systemic banking crises (1970–2019), 414 currency crises (1950–2019), 200 sovereign debt crises (1960–2019), 75 twin crises (1970–2019), and 21 triple crises (1970–2019). We provide evidence that banking and debt crises tend to coincide or precede currency crises, while debt crises and banking crises are less likely to coincide with or precede each other. We also find that advanced countries experienced longer banking crises but shorter currency, debt, twin, and triple crises.",
        "DOI": "10.1016/j.econmod.2022.105770",
        "paper_author": "Nguyen T.C.",
        "affiliation_name": "Phenikaa University",
        "affiliation_city": "Hanoi",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60112782",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Data-driven application of MEMS-based accelerometers for leak detection in water distribution networks",
        "publication": "Science of the Total Environment",
        "citied_by": "59",
        "cover_date": "2022-02-25",
        "Abstract": "Water scarcity is a global concern; 68 countries are facing extremely-high to medium-high risk of water stress. In this era of crisis, where water conservation is an absolute necessity, the water distribution networks (WDNs) globally are experiencing significant leaks. These leaks cause tremendous financial loss and unacceptable environmental hazards, thus further aggravating the water scarcity situation. To minimize such damage, the adoption of advanced technologies and methodologies for leak detection in the WDNs is absolutely necessary. In this regard, we have investigated the application of cost-effective MEMS-based accelerometers. Experiments were conducted on real networks (metal and non-metal pipes), over the course of ten months, and the acquired acceleration signals were analyzed using a monitoring algorithm. Monitoring index efficiencies and standard deviations for every leak and no-leak case was extracted. Two individual [KNN and Decision Tree] and two ensembles [Random Forest and Adaboost (Decision Tree)] based machine learning models were developed for the accurate classification of the leak and no-leak cases using extracted features; and separate models were developed for metal and non-metal pipes. Random Forest outperformed the other machine learning models and the overall accuracy reached 100% for metal pipes and 94.93% for non-metal pipes. The machine learning models were further validated using unseen/unlabeled cases and were highly effective in detecting leaks. This study demonstrated the applicability of MEMS-based accelerometers for leak detection and established real network-based machine learning models thereby contributing to the research scarcity in this important area.",
        "DOI": "10.1016/j.scitotenv.2021.151110",
        "paper_author": "Tariq S.",
        "affiliation_name": "The Hong Kong Polytechnic University",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008928",
        "affiliation_state": "Hong Kong"
    },
    {
        "paper_title": "Managing restaurants during the COVID-19 crisis: Innovating to survive and prosper",
        "publication": "Journal of Innovation and Knowledge",
        "citied_by": "58",
        "cover_date": "2022-10-01",
        "Abstract": "This research examines the experiences of small- and medium-sized enterprise (SME) owners in the food service sector during the COVID-19 crisis. We collected authentic opinion through semi-structured interviews with restaurant owners in the Outaouais region (Quebec, Canada). Qualitative analysis of the interviews revealed that restaurant owners suffered from several issues: stress, shortage of employees, financial losses, liquidity problems, closures, reopenings, and difficulties in adapting to change. To overcome this crisis, entrepreneurs had to demonstrate resilience, innovation, and strategic management. Meanwhile, through its assistance programs, the government greatly supported entrepreneurs. While Canadian federal programs performed well, the Quebec government's support remained limited. We suggest that public administrators and program evaluators should address the shortcomings raised in this research. Lastly, this study contributes to the literature by providing a new perspective on the strategic management of SMEs during crisis and new managerial insights. Furthermore, we provide new perspectives on inclusive policy and program design during crisis.",
        "DOI": "10.1016/j.jik.2022.100234",
        "paper_author": "Messabia N.",
        "affiliation_name": "Royal Military College of Canada",
        "affiliation_city": "Kingston",
        "affiliation_country": "Canada",
        "affiliation_id": "60026338",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Strengthening mental health responses to COVID-19 in the Americas: A health policy analysis and recommendations",
        "publication": "The Lancet Regional Health - Americas",
        "citied_by": "58",
        "cover_date": "2022-01-01",
        "Abstract": "The COVID-19 pandemic is having a major impact on the mental health of populations in the Americas. Studies show high rates of depression and anxiety, among other psychological symptoms, particularly among women, young people, those with pre-existing mental health conditions, health workers, and persons living in vulnerable conditions. Mental health systems and services have also been severely disrupted. A lack of financial and human resource investments in mental health services, limited implementation of the decentralized community-based care approach and policies to address the mental health gap prior to the pandemic, have all contributed to the current crisis. Countries must urgently strengthen their mental health responses to COVID-19 by taking actions to scale up mental health and psychosocial support services for all, reach marginalized and at-risk populations, and build back better mental health systems and services for the future. Editorial Disclaimer: This translation in Spanish was submitted by the authors and we reproduce it as supplied. It has not been peer-reviewed. Our editorial processes have only been applied to the original abstract in English, which should serve as a reference for this manuscript. Disclaimer: The Authors hold sole responsibility for the views expressed in this article, which may not necessarily reflect the opinion or policy of the Pan American Health Organization/World Health Organization.",
        "DOI": "10.1016/j.lana.2021.100118",
        "paper_author": "Tausch A.",
        "affiliation_name": "Pan American Health Organization",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60014013",
        "affiliation_state": "DC"
    },
    {
        "paper_title": "High-dimensional CoVaR network connectedness for measuring conditional financial contagion and risk spillovers from oil markets to the G20 stock system",
        "publication": "Energy Economics",
        "citied_by": "58",
        "cover_date": "2022-01-01",
        "Abstract": "This paper employs a new framework, the high-dimensional conditional Value-at-Risk (CoVaR) connectedness based on the LASSO-VAR model, to explore the conditional financial contagion among a specific system conditional on extreme events occurring outside the specific system and its extreme risk spillovers to the system from the systemic perspective. Then, this paper employs the delta CoVaR and CoVaR networks to analyse the risk spillovers from oil markets to the G20 stock system from both the pairwise and systemic perspectives. From the pairwise perspective, the delta CoVaR (∆CoVaR) results show that when separating every G20 stock market from the whole market system, there are significant risk spillovers from oil to G20 stocks only during the crisis period. Further, the CoVaR connectedness results show that the G20 stock contagion presents regional characteristics and oil-related characteristics conditional on oil in extreme risk, and also verify the significant risk spillovers from the oil market to the global stock system from the systemic perspective. North American oil-related countries, including the United States of America, Canada and Mexico, are the most affected, and Asian countries have few shocks when the oil market shifts to extreme risk from a normal state. Last, this paper proposes two main policy implications after considering the empirical results.",
        "DOI": "10.1016/j.eneco.2021.105749",
        "paper_author": "Liu B.Y.",
        "affiliation_name": "Beihang University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60013789",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "How frugal innovation shape global sustainable supply chains during the pandemic crisis: lessons from the COVID-19",
        "publication": "Supply Chain Management",
        "citied_by": "58",
        "cover_date": "2022-02-17",
        "Abstract": "Purpose: The COVID-19 crisis has created enormous strain in global supply chains. The disruption has caused severe shortages of critical items, including personal protective equipment (e.g. face masks), ventilators and diagnostics. The failure of the industry to meet the sudden demand for these necessary items has caused a severe humanitarian crisis. These situations, resulting from the COVID-19, crisis have led to the informal growth of frugal innovation in sustainable global supply chains. This paper aims to provide a detailed overview of drivers of frugal-oriented sustainable global supply chains, following lessons acquired from emerging countries’ attempts to deal with the COVID-19 pandemic. Design/methodology/approach: The authors used a focused group approach to identify the drivers and this paper further validated them using existing literature published in international peer-reviewed journals and reports. The authors adopted total interpretive structural modeling (TISM) to analyze the complex relationships among identified drivers. Findings: The authors present a theoretical framework to explain how the drivers are interlinked. This paper has developed the framework through a synthesis of the TISM modeling and Matrice d’impacts croisés multiplication appliquée á un classment analysis. This paper observed that government financial support, policies and regulations, under the mediating effect of leadership and the moderating effect of national culture and international rules and regulations, has a significant effect on the adoption of emerging technology, volunteering initiatives and values and ethics. Further, emerging technology, volunteering initiative and values and ethics have a significant effect on supply chain talent and frugal engineering. These results provide some useful theoretical insights that may help in further investigating the role of frugal innovations in other contexts. Originality/value: The authors find that outcomes of the methodical contributions and the resulting managerial insights can be categorized into four levels. Industry and researchers alike can use the study to develop the decision-support systems guiding frugal-oriented sustainable global supply chains amid the COVID-19 pandemic and in recovering them thereafter. Suggestions for future research directions are offered and discussed.",
        "DOI": "10.1108/SCM-02-2021-0071",
        "paper_author": "Dubey R.",
        "affiliation_name": "Liverpool Business School",
        "affiliation_city": "Liverpool",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60170411",
        "affiliation_state": "Merseyside"
    },
    {
        "paper_title": "Are firms with better sustainability performance more resilient during crises?",
        "publication": "Business Strategy and the Environment",
        "citied_by": "57",
        "cover_date": "2022-11-01",
        "Abstract": "This paper investigates the relationship between sustainability and financial performance using a sample of G7 firms from 2004 to 2020. We find a positive bidirectional relationship that firms with better sustainability performance are more profitable in the future and firms with better financial performance have higher subsequent sustainability performance. In addition, we test how two major crises (the financial crisis and the COVID-19 pandemic) affect the sustainability-financial performance relationship. Firms with better sustainability performance are hit harder on their financial performance, but the benefits of financial performance on sustainability are strengthened during the financial crisis. During the ongoing COVID-19 crisis, firms with strong sustainability performance have been more resilient, and their financial performance has dropped less than firms with poor sustainability performance. However, the benefits of profitability on sustainability are weakened. Our results suggest that sustainability provides “insurance”-like protection against economic downturns during COVID-19 and mature sustainability offers economic benefits but not early-stage sustainability. It expands the contingency perspective of sustainability–financial performance relationship to crisis management.",
        "DOI": "10.1002/bse.3088",
        "paper_author": "Lu J.",
        "affiliation_name": "Gordon S. Lang School of Business and Economics",
        "affiliation_city": "Guelph",
        "affiliation_country": "Canada",
        "affiliation_id": "60192968",
        "affiliation_state": "ON"
    }
]