[
    {
        "paper_title": "The role of ESG performance during times of financial crisis: Evidence from COVID-19 in China",
        "publication": "Finance Research Letters",
        "citied_by": "794",
        "cover_date": "2021-01-01",
        "Abstract": "We examine the role of ESG performance during market-wide financial crisis, triggered in response to the COVID-19 global pandemic. The unique circumstances create an inimitable opportunity to question if investors interpret ESG performance as a signal of future stock performance and/or risk mitigation. Using a novel dataset covering China's CSI300 constituents, we show (i) high-ESG portfolios generally outperform low-ESG portfolios (ii) ESG performance mitigates financial risk during financial crisis and (iii) the role of ESG performance is attenuated in ‘normal’ times, confirming its incremental importance during crisis. We phrase the results in the context of ESG investment practices.",
        "DOI": "10.1016/j.frl.2020.101716",
        "paper_author": "Broadstock D.C.",
        "affiliation_name": "The Hong Kong Polytechnic University",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008928",
        "affiliation_state": "Hong Kong"
    },
    {
        "paper_title": "Health systems resilience in managing the COVID-19 pandemic: lessons from 28 countries",
        "publication": "Nature Medicine",
        "citied_by": "678",
        "cover_date": "2021-06-01",
        "Abstract": "Health systems resilience is key to learning lessons from country responses to crises such as coronavirus disease 2019 (COVID-19). In this perspective, we review COVID-19 responses in 28 countries using a new health systems resilience framework. Through a combination of literature review, national government submissions and interviews with experts, we conducted a comparative analysis of national responses. We report on domains addressing governance and financing, health workforce, medical products and technologies, public health functions, health service delivery and community engagement to prevent and mitigate the spread of COVID-19. We then synthesize four salient elements that underlie highly effective national responses and offer recommendations toward strengthening health systems resilience globally.",
        "DOI": "10.1038/s41591-021-01381-y",
        "paper_author": "Haldane V.",
        "affiliation_name": "Institute of Health Policy, Management and Evaluation",
        "affiliation_city": "Toronto",
        "affiliation_country": "Canada",
        "affiliation_id": "60193840",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Financial contagion during COVID–19 crisis",
        "publication": "Finance Research Letters",
        "citied_by": "655",
        "cover_date": "2021-01-01",
        "Abstract": "This study examines how financial contagion occurs through financial and nonfinancial firms between China and G7 countries during the COVID–19 period. The empirical results show that listed firms across these countries, financial and non-financial firms alike, experience significant increase in conditional correlations between their stock returns. However, the magnitude of increase in these correlations is considerably higher for financial firms during the COVID-19 outbreak, indicating the importance of their role in financial contagion transmission. They also show that optimal hedge ratios increase significantly in most cases, implying higher hedging costs during the COVID-19 period.",
        "DOI": "10.1016/j.frl.2020.101604",
        "paper_author": "Akhtaruzzaman M.",
        "affiliation_name": "Australian Catholic University",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60010679",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Impact of COVID-19 on the travel and tourism industry",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "561",
        "cover_date": "2021-02-01",
        "Abstract": "Our paper is among the first to measure the potential effects of the COVID-19 pandemic on the tourism industry. Using panel structural vector auto-regression (PSVAR) (Pedroni, 2013) on data from 1995 to 2019 in 185 countries and system dynamic modeling (real-time data parameters connected to COVID-19), we estimate the impact of the pandemic crisis on the tourism industry worldwide. Past pandemic crises operated mostly through idiosyncratic shocks' channels, exposing domestic tourism sectors to large adverse shocks. Once domestic shocks perished (zero infection cases), inbound arrivals revived immediately. The COVID-19 pandemic, however, is different; and recovery of the tourism industry worldwide will take more time than the average expected recovery period of 10 months. Private and public policy support must be coordinated to assure capacity building and operational sustainability of the travel tourism sector during 2020–2021. COVID-19 proves that pandemic outbreaks have a much larger destructive impact on the travel and tourism industry than previous studies indicate. Tourism managers must carefully assess the effects of epidemics on business and develop new risk management methods to deal with the crisis. Furthermore, during 2020–2021, private and public policy support must be coordinated to sustain pre-COVID-19 operational levels of the tourism and travel sector.",
        "DOI": "10.1016/j.techfore.2020.120469",
        "paper_author": "Škare M.",
        "affiliation_name": "Juraj Dobrila University of Pula",
        "affiliation_city": "Pula",
        "affiliation_country": "Croatia",
        "affiliation_id": "60276044",
        "affiliation_state": "Istria"
    },
    {
        "paper_title": "COVID-19 implications on household income and food security in Kenya and Uganda: Findings from a rapid assessment",
        "publication": "World Development",
        "citied_by": "396",
        "cover_date": "2021-01-01",
        "Abstract": "This study assessed implications of the Coronavirus Disease 19 (COVID-19) pandemic on household income and food security in two East African countries – Kenya and Uganda, using online survey data from 442 respondents. Results show that more than two-thirds of the respondents experienced income shocks due to the COVID-19 crisis. Food security and dietary quality worsened, as measured by the food insecurity experience scale and the frequency of consumption of nutritionally-rich foods. The proportion of food insecure respondents increased by 38% and 44% in Kenya and Uganda respectively, and in both countries, the regular consumption of fruits decreased by about 30% during the COVID-19 pandemic, compared to a normal period (before the pandemic). Results from probit regressions show that the income-poor households and those dependent on labour income were more vulnerable to income shock, and had poorer food consumption during the COVID-19 pandemic compared to other respondent categories. As such, they were more likely to employ food-based coping strategies compared to those pursuing alternative livelihoods, who generally relied on savings. Farmers were less likely to experience worsened food security compared to other respondent categories who depended to a great extent on market sources for food. In both countries, participation in national social security schemes was less likely to mitigate respondents’ income shock during the COVID-19 period. Conversely, membership in savings and loan groups was correlated with less likelihood of suffering income shocks and reduction in food consumption. The results suggest that ongoing and future government responses should focus on structural changes in social security by developing responsive packages to cushion members pushed into poverty by such pandemics while building strong financial institutions to support the recovery of businesses in the medium term, and ensuring the resilience of food supply chains particularly those making available nutrient-dense foods.",
        "DOI": "10.1016/j.worlddev.2020.105199",
        "paper_author": "Kansiime M.K.",
        "affiliation_name": "CABI, Kenya",
        "affiliation_city": "Nairobi",
        "affiliation_country": "Kenya",
        "affiliation_id": "60070565",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "IoT for smart cities: Machine learning approaches in smart healthcare—A review",
        "publication": "Future Internet",
        "citied_by": "394",
        "cover_date": "2021-08-01",
        "Abstract": "Smart city is a collective term for technologies and concepts that are directed toward making cities efficient, technologically more advanced, greener and more socially inclusive. These concepts include technical, economic and social innovations. This term has been tossed around by various actors in politics, business, administration and urban planning since the 2000s to establish tech-based changes and innovations in urban areas. The idea of the smart city is used in conjunction with the utilization of digital technologies and at the same time represents a reaction to the economic, social and political challenges that post-industrial societies are confronted with at the start of the new millennium. The key focus is on dealing with challenges faced by urban society, such as environ-mental pollution, demographic change, population growth, healthcare, the financial crisis or scarcity of resources. In a broader sense, the term also includes non-technical innovations that make urban life more sustainable. So far, the idea of using IoT-based sensor networks for healthcare applications is a promising one with the potential of minimizing inefficiencies in the existing infrastructure. A machine learning approach is key to successful implementation of the IoT-powered wireless sensor networks for this purpose since there is large amount of data to be handled intelligently. Throughout this paper, it will be discussed in detail how AI-powered IoT and WSNs are applied in the healthcare sector. This research will be a baseline study for understanding the role of the IoT in smart cities, in particular in the healthcare sector, for future research works.",
        "DOI": "10.3390/fi13080218",
        "paper_author": "Ghazal T.M.",
        "affiliation_name": "Universiti Kebangsaan Malaysia",
        "affiliation_city": "Bangi",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60001821",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "COVID-19 and the United States financial markets’ volatility",
        "publication": "Finance Research Letters",
        "citied_by": "373",
        "cover_date": "2021-01-01",
        "Abstract": "We empirically investigate the effect of the official announcements regarding the COVID-19 new cases of infection and fatality ratio, on the financial markets volatility in the United States (US). We consider both COVID-19 global and US figures and show that the sanitary crisis enhances the S&P 500 realized volatility. Our findings are robust to different model specifications and suggest that the prolongation of the coronavirus pandemic is an important source of financial volatility, challenging the risk management activity.",
        "DOI": "10.1016/j.frl.2020.101699",
        "paper_author": "Albulescu C.T.",
        "affiliation_name": "Universitatea Politehnica Timisoara",
        "affiliation_city": "Timisoara",
        "affiliation_country": "Romania",
        "affiliation_id": "60001317",
        "affiliation_state": "Timis"
    },
    {
        "paper_title": "Is gold a hedge or a safe-haven asset in the COVID–19 crisis?",
        "publication": "Economic Modelling",
        "citied_by": "340",
        "cover_date": "2021-09-01",
        "Abstract": "This study examines the role of gold as a hedge or safe-haven asset in different phases of the COVID-19 pandemic crisis, corresponding to the timing of fiscal and monetary stimuli to support the weakened economy. Using high-frequency data, the results show that gold served as a safe-haven asset for stock markets during Phase I (December 31, 2019–March 16, 2020) of the pandemic. However, gold lost its safe-haven role during Phase II (March 17−April 24, 2020). The optimal weights of gold in S&P 500, Euro Stoxx 50, Nikkei 225, and WTI crude oil portfolios significantly increased during Phase II, suggesting that investors expanded investment in gold as a ‘flight-to-safety asset’ during the crisis. Further, hedging costs increased significantly during Phase II. These findings provide insight for individual and institutional investors and guidance to policymakers, regulators, and media on how gold evolved as a hedge and safe-haven asset in different phases of the pandemic.",
        "DOI": "10.1016/j.econmod.2021.105588",
        "paper_author": "Akhtaruzzaman M.",
        "affiliation_name": "Australian Catholic University",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60010679",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Disruptions and resilience in global container shipping and ports: the COVID-19 pandemic versus the 2008–2009 financial crisis",
        "publication": "Maritime Economics and Logistics",
        "citied_by": "297",
        "cover_date": "2021-06-01",
        "Abstract": "Economic shocks test the resilience and adaptability of the shipping industry and container ports. Each crisis triggers different ramifications in the container market. This paper investigates the temporal and spatial sequences of the supply and demand shocks of COVID-19 on container ports and the container shipping industry by comparing these events to the 2008–2009 financial crisis. Using operational and financial data from primary and secondary sources, we analyze short-term impacts and their differences, the reasons for these variations, and the evolution in the adaptive capacity and resilience of ports, terminal operators, and carriers. The analysis revolves around several inter-related domains: impacts on global supply chains; impacts on operational aspects, market structure, and strategic behavior of shipping lines and terminal operators; impacts on port activity levels in terms of vessel calls and container volumes handled; and network impacts in terms of changes in aspects of container port connectivity. The changes observed and the strategic behavior of the market players involved reveal that further adaptation mechanisms, such as slow steaming, economies of scale, and capacity management, have been applied differently between the financial crisis and COVID-19, resulting in different outcomes. For an external shock such as COVID-19, impacts are the outcome of how ports and the shipping industry fit within complex supply chains and the cargo composition handled by ports.",
        "DOI": "10.1057/s41278-020-00180-5",
        "paper_author": "Notteboom T.",
        "affiliation_name": "Universiteit Gent",
        "affiliation_city": "Ghent",
        "affiliation_country": "Belgium",
        "affiliation_id": "60033316",
        "affiliation_state": "VOV"
    },
    {
        "paper_title": "Prevalence of anxiety in the COVID-19 pandemic: An updated meta-analysis of community-based studies",
        "publication": "Progress in Neuro-Psychopharmacology and Biological Psychiatry",
        "citied_by": "279",
        "cover_date": "2021-07-13",
        "Abstract": "Background: The unprecedented worldwide crisis caused by the rapid spread of COVID-19 and the restrictive public health measures enforced by some countries to slow down its transmission have severely threatened the physical and mental wellbeing of communities globally. Methods: We conducted a systematic review and meta-analysis to determine the prevalence of anxiety in the general population during the COVID-19 pandemic. Two researchers independently searched for cross-sectional community-based studies published between December 1, 2019 and August 23, 2020, using PubMed, WoS, Embase, and other sources (e.g., grey literature, manual search). Results: Of 3049 records retrieved, 43 studies were included. These studies yielded an estimated overall prevalence of anxiety of 25%, which varied significantly across the different tools used to measure anxiety. Consistently reported risk factors for the development of anxiety included initial or peak phase of the outbreak, female sex, younger age, marriage, social isolation, unemployment and student status, financial hardship, low educational level, insufficient knowledge of COVID-19, epidemiological or clinical risk of disease and some lifestyle and personality variables. Conclusions: As the overall global prevalence of anxiety disorders is estimated to be 7.3% normally, our results suggest that rates of anxiety in the general population could be more than 3 times higher during the COVID-19 pandemic. These findings suggest a substantial impact on mental health that should be targeted by individual and population-level strategies.",
        "DOI": "10.1016/j.pnpbp.2020.110207",
        "paper_author": "Santabárbara J.",
        "affiliation_name": "Universidad de Zaragoza",
        "affiliation_city": "Zaragoza",
        "affiliation_country": "Spain",
        "affiliation_id": "60016809",
        "affiliation_state": "Zaragoza"
    },
    {
        "paper_title": "Pandemic precarity: COVID-19 is exposing and exacerbating inequalities in the American heartland",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "275",
        "cover_date": "2021-02-23",
        "Abstract": "Crises lay bare the social fault lines of society. In the United States, race, gender, age, and education have affected vulnerability to COVID-19 infection. Yet, consequences likely extend far beyond morbidity and mortality. Temporarily closing the economy sent shock waves through communities, raising the possibility that social inequities, preexisting and current, have weakened economic resiliency and reinforced disadvantage, especially among groups most devastated by the Great Recession. We address pandemic precarity, or risk for material and financial insecurity, in Indiana, where manufacturing loss is high, metro areas ranked among the hardest hit by the Great Recession nationally, and health indicators stand in the bottom quintile. Using longitudinal data (n = 994) from the Person to Person Health Interview Study, fielded in 2019–2020 and again during Indiana’s initial stay-at-home order, we provide a representative, probability-based assessment of adverse economic outcomes of the pandemic. Survey-weighted multivariate regressions, controlling for preexisting inequality, find Black adults over 3 times as likely as Whites to report food insecurity, being laid off, or being unemployed. Residents without a college degree are twice as likely to report food insecurity (compared to some college), while those not completing high school (compared to bachelor’s degree) are 4 times as likely to do so. Younger adults and women were also more likely to report economic hardships. Together, the results support contentions of a Matthew Effect, where pandemic precarity disproportionately affects historically disadvantaged groups, widening inequality. Strategically deployed relief efforts and longer-term policy reforms are needed to challenge the perennial and unequal impact of disasters.",
        "DOI": "10.1073/pnas.2020685118",
        "paper_author": "Perry B.L.",
        "affiliation_name": "Indiana University Bloomington",
        "affiliation_city": "Bloomington",
        "affiliation_country": "United States",
        "affiliation_id": "60021121",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Crude Oil futures contracts and commodity markets: New evidence from a TVP-VAR extended joint connectedness approach",
        "publication": "Resources Policy",
        "citied_by": "266",
        "cover_date": "2021-10-01",
        "Abstract": "This study introduces a novel time-varying parameter vector autoregression (TVP-VAR) based extended joint connectedness approach in order to characterize connectedness of 11 agricultural commodity and Crude Oil futures prices spanning from July 1, 2005 to May 1, 2020. Our results reveal that the system-wide dynamic connectedness is heterogeneous over time and driven by economic events. Peaks have been reached during the Global Financial Crisis, European Governmental Debt Crisis, and the COVID-19 pandemic. Further findings show that commodities such as Crude Oil, Grains, Livestock, Sugar, and Soybean Oil tend to be the main net transmitters of shocks while Corn, Lean Hogs, Soybeans, Cattle, and Wheat are the main receivers of shocks. Pairwise connectedness on the other hand shows that Crude Oil not only affects other commodity markets, but is also equally responsive to innovations that take place in most of these markets explaining the high interconnectedness of the network. Finally, we illustrate the importance of the chosen normalization technique employed in the connectedness framework as the retrieved findings have important implications for investors to design strategies for optimization of portfolio and asset allocation, reduction in downside risk along with hedging strategies. The full implementation and replication code is available at: https://github.com/GabauerDavid/ConnectednessApproach.",
        "DOI": "10.1016/j.resourpol.2021.102219",
        "paper_author": "Balcilar M.",
        "affiliation_name": "İşletme ve Ekonomi Fakültesi",
        "affiliation_city": "Famagusta",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60204087",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "How does financial risk affect global CO<inf>2</inf> emissions? The role of technological innovation",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "264",
        "cover_date": "2021-07-01",
        "Abstract": "To empirically verify whether financial risk affects global carbon emissions, this study investigates the financial risk-emission nexus by employing a global balanced panel dataset of 62 countries over the period 2003–2018. Furthermore, we explore the mediation effect of technological innovation on the financial risk-emission nexus. Fully considering potential regional heterogeneity and asymmetry, this study further analyzes the heterogeneous and asymmetric relationships among the variables, such as the difference between regional comprehensive economic partnership countries and other countries. The empirical results indicate that: (1) a mediation effect between financial risk and global carbon emissions exists; in other words, increased financial risk not only reduces global carbon emissions directly, but can also have an indirect impact in mitigating carbon emissions by promoting technological innovation; (2) the impacts of financial risk and technological innovation on global carbon emissions show significant regional heterogeneity; and (3) financial risk and technological innovation show asymmetry across different quantiles. To be specific, technological innovation and financial risk have a significant inhibitory effect on global carbon emissions only in the 10th quantile, while promoting carbon emissions in other quantiles.",
        "DOI": "10.1016/j.techfore.2021.120751",
        "paper_author": "Zhao J.",
        "affiliation_name": "University of International Business and Economics",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60013503",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Plastics in the time of COVID-19 pandemic: Protector or polluter?",
        "publication": "Science of the Total Environment",
        "citied_by": "260",
        "cover_date": "2021-03-10",
        "Abstract": "The COVID-19 pandemic has reemphasized the indispensable role of plastics in our daily life. Plastics in terms of personal protective equipment (PPEs) and other single-use medical equipment along with packaging solutions owing to their inherent properties have emerged as a life-savior for protecting the health and safety of the frontline health workers and the common citizens during the pandemic. However, plastics have been deemed as evil polluter due to their indiscriminate littering and mismanagement amid increased plastic usage and waste generation during this unprecedented crisis. This article reviews and assesses to dwell upon whether plastics in the time of pandemic are acting as protector of the public health or polluter of the environment. Considering the utilities and limitations of plastic along with its management or mismanagement, and the fate, an equitable appraisal suggests that the consumers' irresponsible behavior, and attitude and poor awareness, and the stress on waste management infrastructure in terms of collection, operation, and financial constraints as the major drivers, leading to mismanagement, turn plastic into an evil polluter of the environment. Plastic can be a protector if managed properly and complemented by the circular economy strategies in terms of reduction, recycle and recovery, and thereby preventing leakage into the environment. To safeguard the supply chain of PPEs, several decontamination techniques have been adopted worldwide ensuring their effective reprocessing to prioritize the circular economy within the system. Policy guidelines encouraging to adopt safer practices and sustainable technical solutions along with consumers' education for awareness creation are the need of the hour for preventing plastic to turn from protector with high utility to polluter.",
        "DOI": "10.1016/j.scitotenv.2020.144274",
        "paper_author": "Parashar N.",
        "affiliation_name": "Indian Institute of Technology Patna",
        "affiliation_city": "Patna",
        "affiliation_country": "India",
        "affiliation_id": "60104342",
        "affiliation_state": "BR"
    },
    {
        "paper_title": "COVID-19 crisis and SMEs responses: The role of digital transformation",
        "publication": "Knowledge and Process Management",
        "citied_by": "256",
        "cover_date": "2021-04-01",
        "Abstract": "In addition to causing dramatic damage to people's health, the coronavirus has affected also the financial health of companies worldwide. Among them, SMEs (small and medium-sized enterprises) tend to be more vulnerable. Characteristics such as scarcity of financial resources and lack of specialized knowledge make their situation even harder. This pandemic has resulted in increased digital transformation, changes in customer behavior and the managerial and technological knowledge gap to address them. Therefore, this article discusses the general weaknesses, strengths, challenges and opportunities for SMEs to face this pandemic, and how the field of knowledge management (KM) can help. Based on the concepts of organizational resilience, we drafted a conceptual model to illustrate how their first responses were and how they could become more adapted. First, we conducted a literature search to investigate how SMEs responded to this scenario. We found responses to the financial impacts in the form of mass layoffs, temporary and permanent closures, bootstrapping of digitalization and strategic alliances. In the discussions section, we raise some key questions to demonstrate how knowledge can improve the role of digital transformation. We approach how a KM strategy could start from organizational resilience concepts to assist SMEs to seize digital transformation opportunities. As practical implications, our research raises awareness of digital transformation's role as a set of tools to adapt during and after the pandemic, along with resilience engineering and knowledge management principles. Future researchers can use this report as a conceptual guide to start their own response and adaptation plans.",
        "DOI": "10.1002/kpm.1660",
        "paper_author": "Klein V.B.",
        "affiliation_name": "Instituto Federal De Educação, Ciência E Tecnologia Catarinense - IFC",
        "affiliation_city": "Blumenau",
        "affiliation_country": "Brazil",
        "affiliation_id": "60271895",
        "affiliation_state": "SC"
    },
    {
        "paper_title": "How Valuable Is Financial Flexibility when Revenue Stops? Evidence from the COVID-19 Crisis",
        "publication": "Review of Financial Studies",
        "citied_by": "251",
        "cover_date": "2021-11-01",
        "Abstract": "Firms with greater financial flexibility should be better able to fund a revenue shortfall resulting from the COVID-19 shock and benefit less from policy responses. We find that firms with high financial flexibility within an industry experience a stock price drop that is 26%, or 9.7 percentage points, lower than those with low financial flexibility. This differential return persists as stock prices rebound. Firms more exposed to the COVID-19 shock benefit more from cash holdings. No evidence suggests that recent payouts worsened the average firm's drop in stock price. Our results cannot be explained by a leverage effect.",
        "DOI": "10.1093/rfs/hhaa134",
        "paper_author": "Fahlenbrach R.",
        "affiliation_name": "École Polytechnique Fédérale de Lausanne",
        "affiliation_city": "Lausanne",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60028186",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Exploring the role of green innovation and investment in energy for environmental quality: An empirical appraisal from provincial data of China",
        "publication": "Journal of Environmental Management",
        "citied_by": "251",
        "cover_date": "2021-08-15",
        "Abstract": "To better analyze China's carbon neutrality target, this study investigates the effect of green innovation and investment in the energy industry on China's provincial and regional data from 1995 to 2017. Using Westerlund and Edgerton's panel cointegration test, the authors found a stable long-run relationship between CO2 emissions and its determinants. We found that under major structural breaks at the local, regional, and global levels, such as the East Asian crises of 1997, the financial crises of 2007–2008, China's RMB exchange rate reform announced on August 11, 2015, and mild recession in 2001, CO2 emissions, income, green innovation, renewable energy use, and energy industry investment are cointegrated. The environmental Kuznets curve hypothesis is valid. In the long run, income, environmental innovation, investment in the energy industry, and renewable energy consumption are key contributors in explaining CO2 emissions. The empirical evidence from augmented mean group (AMG) is consistent with the estimates of CS-ARDL. Concerning practical implications, the findings suggest that there is a need to switch the Chinese economy to more sustainable sources of energy, a viable solution to abate environmental degradation. China should introduce and shift investments to green innovation.",
        "DOI": "10.1016/j.jenvman.2021.112779",
        "paper_author": "Guo J.",
        "affiliation_name": "Dalian Maritime University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60029322",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "The relationship of renewable energy consumption to financial development and economic growth in China",
        "publication": "Renewable Energy",
        "citied_by": "250",
        "cover_date": "2021-06-01",
        "Abstract": "Renewable energy has been considered as an effective way to solve environmental pollution and energy crisis in China. However, the development of renewable energy sector depends on economic growth and financial issues. Thus, it is significant to study the relationships of these three indicators in China. Using ARDL-PMG model, this paper explores the long-run and short-run impacts of economic growth and financial development on renewable energy consumption based on the panel data during period 1997–2017 at national and regional levels of China. The long-run relationships indicate that for China as a whole and western China, economic growth stimulates renewable energy consumption while financial development impacts it negatively. However, the short-run relationships show that economic growth and financial development influence renewable energy consumption negatively and positively, respectively. Moreover, we employ the Granger causality test to study the existence and direction of causality among variables. The causality test results display that the unidirectional causality relationships exist from financial development to renewable energy consumption for China as a whole and eastern China. Meanwhile, economic growth unidirectionally causes renewable energy consumption in China as a whole, eastern and western China. Our empirical results provide some policies to promote the development of renewable energy sector.",
        "DOI": "10.1016/j.renene.2021.02.038",
        "paper_author": "Wang J.",
        "affiliation_name": "Tianjin University of Finance and Economics",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60025148",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Crude oil market and stock markets during the COVID-19 pandemic: Evidence from the US, Japan, and Germany",
        "publication": "International Review of Financial Analysis",
        "citied_by": "247",
        "cover_date": "2021-03-01",
        "Abstract": "We analyzed the return and volatility spillover between the COVID-19 pandemic in 2020, the crude oil market, and the stock market by employing two empirical methods for connectedness: the time-domain approach developed by Diebold and Yilmaz (2012) and the method based on frequency dynamics developed by Barunik and Krehlik (2018). We find that the return spillover mainly occurs in the short term; however, the volatility spillover mainly occurs in the long term. From the moving window analysis results, the impact of COVID-19 created an unprecedented level of risk, such as plummeting oil prices and triggering the US stock market circuit breaker four times, which caused investors to suffer heavy losses in a short period. Furthermore, the impact of COVID-19 on the volatility of the oil and stock markets exceeds that caused by the 2008 global financial crisis, and continues to have an effect. The impact of the COVID-19 pandemic on financial markets is uncertain in both the short and long terms. Our research provides some urgent and prominent insights to help investors and policymakers avoid the risks in the crude oil and stock markets because of the COVID-19 pandemic and reestablish economic development policy strategies.",
        "DOI": "10.1016/j.irfa.2021.101702",
        "paper_author": "Zhang W.",
        "affiliation_name": "Kobe University",
        "affiliation_city": "Kobe",
        "affiliation_country": "Japan",
        "affiliation_id": "60011418",
        "affiliation_state": "Hyogo"
    },
    {
        "paper_title": "Greening through finance?",
        "publication": "Journal of Development Economics",
        "citied_by": "222",
        "cover_date": "2021-09-01",
        "Abstract": "This paper investigates how green credit regulation affects firms' loan conditions and their economic and environmental performance. In a simple theoretical model, with strengthened green credit regulations, banks raise loan interest rates to nonabatement firms. Firms that were formerly indifferent to pollution abatement must redetermine their abatement and production strategies. Using disaggregated firm-level data, we find that, after the reinforcement of green credit regulation, noncompliant firms saw a larger increase in interest rates, decrease in loan amounts, and more difficulty in access to loans. We further find different impacts on large and small firms in terms of their loans and their financial and economic responses. Regarding the impact on firms’ environmental performance, although all of these firms reduced their total emissions, the reductions are realized in dissimilar ways; large firms reduced their emission intensity by investing more in adopting abatement facilities, while small firms simply choose to produce less.",
        "DOI": "10.1016/j.jdeveco.2021.102683",
        "paper_author": "Fan H.",
        "affiliation_name": "Fudan University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60009860",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "ESG did not immunize stocks during the COVID-19 crisis, but investments in intangible assets did",
        "publication": "Journal of Business Finance and Accounting",
        "citied_by": "222",
        "cover_date": "2021-03-01",
        "Abstract": "Environmental, social and governance (“ESG”) scores have been widely touted as indicators of share price resilience during the COVID-19 crisis. Contrary to this conventional wisdom, we present robust evidence that once industry affiliation, market-based measures of risk and accounting-based measures of performance, financial position and intangibles investments have been controlled for, ESG offers no such positive explanatory power for returns during the COVID crisis. Specifically, ESG is insignificant in fully specified returns regressions for each of the Q1 2020 COVID market crisis period and for the full COVID year of 2020. By contrast, a measure of the firm's stock of investments in internally generated intangible assets is an economically and statistically significant positive determinant of returns during each of the Q1 market implosion and full 2020 COVID year periods. Our results are robust to alternative measures of returns, as well as for using Refinitiv, Refinitiv II and MSCI data to capture ESG performance. We conclude that ESG did not immunize stocks during the COVID-19 crisis, but those investments in intangible assets did.",
        "DOI": "10.1111/jbfa.12523",
        "paper_author": "Demers E.",
        "affiliation_name": "University of Waterloo",
        "affiliation_city": "Waterloo",
        "affiliation_country": "Canada",
        "affiliation_id": "60014171",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "CEO Greed, Corporate Social Responsibility, and Organizational Resilience to Systemic Shocks",
        "publication": "Journal of Management",
        "citied_by": "220",
        "cover_date": "2021-04-01",
        "Abstract": "In this study, we explore how top executives affect the well-being of multiple stakeholders and long-run organizational outcomes. In the context of the 2008 global financial crisis (GFC), we examine how CEO greed impacts firms’ stance toward corporate social responsibility (CSR) prior to the onset of the GFC and how this, in turn, shapes firms’ fate during and after the GFC. We argue that CEO greed will be negatively associated with CSR, because in their unbridled pursuit of personal wealth, greedy CEOs are more likely to exhibit myopic behaviors and neglect investment in CSR. We also adopt a person-pay interactionist logic to theorize that the willingness of greedy executives to invest in CSR will be especially sensitive to different types of pay instruments. Next, we build on recent findings from research on CSR that suggest that stakeholder engagement is a defining feature of resilient organizations. We expect that, due to low CSR investment, firms led by greedy CEOs will experience greater losses in the short run and will take longer time to recover from the 2008 GFC. For a sample of 301 CEOs of public U.S. organizations, we analyzed the stock prices and found general support for our hypotheses.",
        "DOI": "10.1177/0149206320902528",
        "paper_author": "Sajko M.",
        "affiliation_name": "Universiteit Antwerpen",
        "affiliation_city": "Antwerpen",
        "affiliation_country": "Belgium",
        "affiliation_id": "60012937",
        "affiliation_state": "VAN"
    },
    {
        "paper_title": "Economic policy uncertainty and financial stability–Is there a relation?",
        "publication": "Economic Modelling",
        "citied_by": "216",
        "cover_date": "2021-01-01",
        "Abstract": "This paper investigates the impact of economic policy uncertainty on financial stability. Using data for 23 countries over the period of 1996 to 2016, we show that the impact is negative and statistically significant. Economically, a unit standard deviation increase in economic policy uncertainty decreases financial stability by between 2.66% and 7.26% of its sample mean. The negative impact of economic policy uncertainty on financial stability is stronger for countries with higher competition, lower regulatory capital, and smaller financial systems. We show that our finding is robust using bank-level data and different constructions of global panel portfolios, and controlling for Z-score skewness, the Global Financial Crisis, and for endogeneity.",
        "DOI": "10.1016/j.econmod.2020.02.042",
        "paper_author": "Phan D.H.B.",
        "affiliation_name": "La Trobe Business School",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60185896",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "The relationship between environmental, social, and financial performance in the banking sector: A European study",
        "publication": "Journal of Cleaner Production",
        "citied_by": "209",
        "cover_date": "2021-03-25",
        "Abstract": "There is a growing interest in assessing environmental performance, social responsibility, and corporate governance (ESG) in the banking sector. Also, significant relationships are expected between ESG dimensions and corporate financial performance. The purpose of this research is to analyze the relationships between ten dimensions of the environmental, social, and governance pillars and bank financial performance, for the decade after the 2008 financial crisis. Data was collected from the Refinitiv database for 39 European banks, for the period 2010–2019. Our results show a positive relationship between emission reductions and financial performance. However, a bank's accounting and market performance may be at odds with its product quality and social responsibility policies. Moreover, an increase in the quality of a bank's corporate governance system was found to negatively affect company financial performance. Our results have multiple theoretical implications. The predictions related to stakeholder theory and the resource-based view were confirmed, as banks show interest in resource efficiency, environment-aware products and services, and process digitization. On the other hand, the prediction of stakeholder theory regarding the positive relationship between corporate social responsibility and financial performance was rejected. Also, corporate governance quality has a negative contribution to accounting performance and market valuation, going against the hypotheses of agency theory. This could mean that market investors do not value a bank's involvement in social responsibility initiatives and do not endorse the adoption of best governance practices that could reduce the riskiness of a bank's portfolio. These findings have practical implications for bank managers and company boards in selecting and disclosing ESG policies and initiatives.",
        "DOI": "10.1016/j.jclepro.2021.125791",
        "paper_author": "Bătae O.M.",
        "affiliation_name": "Bucharest University of Economic Studies",
        "affiliation_city": "Bucharest",
        "affiliation_country": "Romania",
        "affiliation_id": "60107810",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Urban agriculture — A necessary pathway towards urban resilience and global sustainability?",
        "publication": "Landscape and Urban Planning",
        "citied_by": "207",
        "cover_date": "2021-06-01",
        "Abstract": "The Covid-19 pandemic newly brings food resilience in cities to our attention and the need to question the desired degree of food self-sufficiency through urban agriculture. While these questions are by no means new and periodically entering the global research focus and policy discussions during periods of crises — the last time during the global financial crisis and resulting food price increases in 2008 — urban and peri-urban agriculture continue to be replaced by land-uses rendering higher market values (e.g. housing, transport, leisure). The loss of priority for urban agriculture in urban land-use planning is a global trend with only a few exceptions. We argue in this essay that this development has widely taken place due to three blind spots in urban planning. First, the limited consideration of social and ecological vulnerabilities and risk-related inequalities of urban inhabitants, food shortage among them, in the face of different scenarios of global change, including climate change or pandemic events such as Covid-19. Second, the disregard of the intensified negative environmental (and related social) externalities caused by distant agricultural production, as well as lacking consideration of nutrient re-cycling potentials in cities (e.g. from wastewater) to replace emission intensive mineral fertilizer use. Third, the lack of accounting for the multifunctionality of urban agriculture and the multiple benefits it provides beyond the provision of food, including social benefits and insurance values, for instance the maintenance of cultural heritage and agro-biodiversity. Along these lines, we argue that existing and new knowledge about urban risks and vulnerabilities, the spatially explicit urban metabolism (e.g. energy, water, nutrients), as well as ecosystem services need to be stronger and jointly considered in land-use decision-making.",
        "DOI": "10.1016/j.landurbplan.2021.104055",
        "paper_author": "Langemeyer J.",
        "affiliation_name": "ICTA-UAB Institut de Ciència i Tecnologia Ambientals",
        "affiliation_city": "Cerdanyola del Valles",
        "affiliation_country": "Spain",
        "affiliation_id": "60105510",
        "affiliation_state": "Barcelona"
    },
    {
        "paper_title": "Can corporate social responsibility protect firm value during the COVID-19 pandemic?",
        "publication": "International Journal of Hospitality Management",
        "citied_by": "205",
        "cover_date": "2021-02-01",
        "Abstract": "The novel coronavirus (COVID-19) pandemic has caused a significant decline in the stock market worldwide, and hospitality companies are experiencing serious financial problems. Protecting and preserving firm value is a critical way of helping hospitality companies survive the crisis. The influence of corporate social responsibility (CSR) on firm value has been widely investigated. However, little is known about the stock price movement following CSR activity adoption during an industrial crisis. Using event study and difference-in-difference method, this study reveals that engaging in CSR activities can increase the stock returns and stakeholder attention of hospitality firms during the pandemic. Community-related CSR has a stronger and more immediate effect on stock returns than customer- and employee-related CSR. Results also indicate that hospitality firms that pursue improved stock market performance during a pandemic can invest in CSR to protect communities, customers, and employees for attracting further stakeholder attention.",
        "DOI": "10.1016/j.ijhm.2020.102759",
        "paper_author": "Qiu S.(.",
        "affiliation_name": "Xiamen University",
        "affiliation_city": "Xiamen",
        "affiliation_country": "China",
        "affiliation_id": "60018205",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "Central banking and the infrastructural power of finance: The case of ECB support for repo and securitization markets",
        "publication": "Socio-Economic Review",
        "citied_by": "197",
        "cover_date": "2021-01-01",
        "Abstract": "The pre-crisis rise and post-crisis resilience of European repo and securitization markets represent political victories for the interests of large banks. To explain when and how finance wins, the literature emphasizes lobbying capacity (instrumental power) and the financial sector's central position in the economy (structural power). Increasingly, however, finance also enjoys infrastructural power, which stems from entanglements between specific financial markets and public-sector actors, such as treasuries and central banks, which govern by transacting in those markets. To demonstrate the analytical value of this perspective, the article traces how the European Central Bank (ECB), motivated by monetary policy considerations, has shaped post-crisis financial policymaking in the EU. It shows that the ECB has played a key part in fending off a financial transaction tax on repos and in shoring up and rebuilding the securitization market. With market-based forms of state agency on the rise, infrastructural entanglement and power shed new light on the politics of finance.",
        "DOI": "10.1093/SER/MWY008",
        "paper_author": "Braun B.",
        "affiliation_name": "Max Planck Institute for the Study of Societies",
        "affiliation_city": "Koln",
        "affiliation_country": "Germany",
        "affiliation_id": "60026594",
        "affiliation_state": "Nordrhein-Westfalen"
    },
    {
        "paper_title": "Co-movement of energy prices and stock market return: environmental wavelet nexus of COVID-19 pandemic from the USA, Europe, and China",
        "publication": "Environmental Science and Pollution Research",
        "citied_by": "195",
        "cover_date": "2021-07-01",
        "Abstract": "This work aims to study the time-frequency relationship between the recent COVID-19 pandemic and instabilities in oil price and the stock market, geopolitical risks, and uncertainty in the economic policy in the USA, Europe, and China. The coherence wavelet method and the wavelet-based Granger causality tests are applied to the data (31st December 2019 to 1st August 2020) based on daily COVID-19 observations, oil prices, US-EPU, the US geopolitical risk index, and the US stock price index. The short- and long-term COVID-19 consequences are depicted differently and may initially be viewed as an economic crisis. The results illustrate the reduced industrial productivity, which intensifies with the increase in the pandemic’s severeness (i.e., a 10.57% decrease in the productivity index with a 1% increase in the pandemic severeness). Similarly, indices for oil demand, stock market, GDP growth, and electricity demand decrease significantly with an increase in the pandemic severeness index (i.e., a 1% increase in the pandemic severeness results in a 0.9%, 0.67%, 1.12%, and 0.65% decrease, respectively). However, the oil market shows low co-movement with the stock exchange, exchange rate, and gold markets. Therefore, investors and the government are recommended to invest in the oil market to generate revenue during the sanctions period.",
        "DOI": "10.1007/s11356-021-12938-2",
        "paper_author": "Chien F.S.",
        "affiliation_name": "Fuzhou University of Foreign Studies and Trade",
        "affiliation_city": "Fuzhou",
        "affiliation_country": "China",
        "affiliation_id": "60122027",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "Safe haven in GFC versus COVID-19: 100 turbulent days in the financial markets",
        "publication": "Finance Research Letters",
        "citied_by": "194",
        "cover_date": "2021-11-01",
        "Abstract": "In this paper, we use a bivariate Dynamic Conditional Correlation Generalized Autoregressive Conditional Heteroskedasticity model within the world's dominant financial asset classes— represented by sovereign bonds, commodities, and major exchange rates—to characterize the correlation within the major asset classes among the Global Financial Crisis (GFC) and COVID-19’s 100 days. Our results specify a noteworthy degradation of co-relationship within the asset classes dominant in COVID-19 compared to the GFC, especially when the VIX was at its peak, indicating massive fear among investors. We also find that gold, U.S., UK, and German sovereign bonds are a safe option for investors.",
        "DOI": "10.1016/j.frl.2021.101951",
        "paper_author": "Kinateder H.",
        "affiliation_name": "Universität Passau",
        "affiliation_city": "Passau",
        "affiliation_country": "Germany",
        "affiliation_id": "60014151",
        "affiliation_state": "Bayern"
    },
    {
        "paper_title": "Impacts of COVID-19 on global poverty, food security, and diets: Insights from global model scenario analysis",
        "publication": "Agricultural Economics (United Kingdom)",
        "citied_by": "190",
        "cover_date": "2021-05-01",
        "Abstract": "This study assesses the impact of coronavirus disease 2019 (COVID-19) on poverty, food insecurity, and diets, accounting for the complex links between the crisis and the incomes and living costs of vulnerable households. Key elements are impacts on labor supply, effects of social distancing, shifts in demand from services involving close contact, increases in the cost of logistics in food and other supply chains, and reductions in savings and investment. These are examined using IFPRI's global general equilibrium model linked to epidemiological and household models. The simulations suggest that the global recession caused by COVID-19 will be much deeper than that of the 2008–2009 financial crisis. The increases in poverty are concentrated in South Asia and sub-Saharan Africa with impacts harder in urban areas than in rural. The COVID-19-related lockdown measures explain most of the fall in output, whereas declines in savings soften the adverse impacts on food consumption. Almost 150 million people are projected to fall into extreme poverty and food insecurity. Decomposition of the results shows that approaches assuming uniform income shocks would underestimate the impact by as much as one-third, emphasizing the need for the more refined approach of this study.",
        "DOI": "10.1111/agec.12624",
        "paper_author": "Laborde D.",
        "affiliation_name": "International Food Policy Research Institute",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60000840",
        "affiliation_state": "DC"
    },
    {
        "paper_title": "Ensuring effective implementation of the post-2020 global biodiversity targets",
        "publication": "Nature Ecology and Evolution",
        "citied_by": "187",
        "cover_date": "2021-04-01",
        "Abstract": "Biodiversity underpins the fundamental elements for human well-being including food security, human health and access to clean water. In 2010, the Aichi Targets were adopted by world leaders to address the crisis of biodiversity loss. Despite conservation efforts, none of the Aichi Targets have been fully met. However, comprehensive analysis of the reasons for failure in terms of implementation mechanisms is, to date, rare and limited in scope. Here, we demonstrate that most parties did not set effective national targets in accordance with the Aichi Targets, and investments, knowledge and accountability for biodiversity conservation have been inadequate to enable effective implementation. We recommend that the new global targets under the post-2020 Global Biodiversity Framework should be adopted by parties as the minimum national targets to achieve the 2050 Vision. We propose that financial resources for biodiversity conservation are substantially increased through a variety of sources, including the deployment of new economic instruments such as payments for ecosystem services. In addition, science–policy interfaces at all levels need to be strengthened to integrate scientific, Indigenous and local knowledge to support decision-making. We suggest that a compliance and accountability mechanism, based on monitoring systems, is created to provide transparent and credible review of parties’ implementation of the new global targets.",
        "DOI": "10.1038/s41559-020-01375-y",
        "paper_author": "Xu H.",
        "affiliation_name": "Ministry of Ecology and Environment of China",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "125572795",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Banking sector performance during the COVID-19 crisis",
        "publication": "Journal of Banking and Finance",
        "citied_by": "179",
        "cover_date": "2021-12-01",
        "Abstract": "This paper examines the impact of financial sector policy announcements on bank stocks around the world during the onset of the COVID-19 crisis. Overall, we find that liquidity support, borrower assistance programs and monetary easing moderated the adverse impact from the crisis, but their impact varied considerably across banks and countries. By contrast, countercyclical prudential measures led to negative abnormal returns in bank stocks, suggesting that markets price the downside risks associated with these policies.",
        "DOI": "10.1016/j.jbankfin.2021.106305",
        "paper_author": "Demirgüç-Kunt A.",
        "affiliation_name": "The World Bank, USA",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60112834",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Visit intention and destination image in post-Covid-19 crisis recovery",
        "publication": "Current Issues in Tourism",
        "citied_by": "177",
        "cover_date": "2021-01-01",
        "Abstract": "The aim of this research is to analyze the factors influencing visit intention and destination image in post-Covid-19 crisis recovery. In post-crisis recovery, the factors influencing visit intention are physical, socio-psychological and financial factors. A total of 426 respondents were selected and analyzed using correlation and multiple regression analyses. The findings demonstrate that physical factors are the main factors that influence tourists’ visit intention. Additionally, destination image significantly affects visit intention and significantly mediates the relationship between the factors and visit intention. All this inevitably affects the organizational structure of the tourist destination.",
        "DOI": "10.1080/13683500.2020.1842342",
        "paper_author": "Ahmad A.",
        "affiliation_name": "Management &amp; Science University, Malaysia",
        "affiliation_city": "Shah Alam",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60090667",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "The Long Game: China’s Grand Strategy to Displace American Order",
        "publication": "The Long Game: China's Grand Strategy to Displace American Order",
        "citied_by": "176",
        "cover_date": "2021-01-01",
        "Abstract": "For more than a century, no US adversary or coalition of adversaries-not Nazi Germany, Imperial Japan, or even the Soviet Union-has ever reached 60 percent of US GDP. China is the sole exception, and it is fast emerging into a global superpower that could rival, if not eclipse, the United States. What does China want, does it have a grand strategy to achieve it, and what should the United States do about it? The Long Game draws from a rich base of Chinese primary sources, including decades’ worth of party documents, leaked materials, memoirs by party leaders, as well as careful analysis of China’s conduct, to provide a history of China’s grand strategy since the end of the Cold War. Taking readers behind the Party’s closed doors, this book uncovers Beijing’s long, methodical game to displace America from the regional and global order through three sequential “strategies of displacement.” The book shows how China’s strategy is profoundly shaped by key events that change its perception of American power-the end of the Cold War, the 2008 Global Financial Crisis, the populist elections of 2016, and the coronavirus pandemic of 2020. Finally, the book offers a comprehensive yet “asymmetric” plan for an effective US response to the China challenge. Ironically, the proposed approach takes a page from Beijing’s own strategic playbook to undermine China’s ambitions and strengthen American order without competing dollar-for-dollar, ship-for-ship, or loan-for-loan.",
        "DOI": "10.1093/oso/9780197527917.001.0001",
        "paper_author": "Doshi R.",
        "affiliation_name": "The Brookings Institution",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60010534",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Has financial attitude impacted the trading activity of retail investors during the COVID-19 pandemic?",
        "publication": "Journal of Retailing and Consumer Services",
        "citied_by": "176",
        "cover_date": "2021-01-01",
        "Abstract": "Financial attitude influences the financial behavior of retail investors. Although the extant research has acknowledged and examined this relationship, the measures of financial attitude and behavior still vary widely and are generally posed as a series of questions rather than statements. In addition to this, there is insufficient knowledge regarding retail investors' behavior in the face of a health crisis, such as the current COVID-19 pandemic. This study addresses these gaps in the prior literature by examining the relative influence of six dimensions of financial attitude, namely, financial anxiety, optimism, financial security, deliberative thinking, interest in financial issues, and needs for precautionary savings, on the trading activity of retail investors during the pandemic. Data were collected from 404 respondents and analyzed using the artificial neural network (ANN) method. The results revealed that all six dimensions had a positive influence on trading activity, with interest in financial issues exerting the strongest influence, followed by deliberative thinking. The study thus contributes important inferences for researchers and managers.",
        "DOI": "10.1016/j.jretconser.2020.102341",
        "paper_author": "Talwar M.",
        "affiliation_name": "Alkesh Dinesh Mody Institute for Financial and Management Studies",
        "affiliation_city": "Mumbai",
        "affiliation_country": "India",
        "affiliation_id": "124728665",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Environmental consequences of economic complexities in the EU amidst a booming tourism industry: Accounting for the role of brexit and other crisis events",
        "publication": "Journal of Cleaner Production",
        "citied_by": "171",
        "cover_date": "2021-07-10",
        "Abstract": "The European Union (EU) is one of the strongest, but most complex unions in the world with a competitive tourism industry. The aim of this study, therefore, is to account for economic complexity index (ECI), Brexit and other crisis episodes in the growth-energy-emissions nexus. Theoretically, the traditional Environmental Kuznets Curve (EKC) model is assessed by adopting a One-step System Generalized Method of Moment (Sys GMM) on data for 26 EU member states over the period from 1995 to 2018. For the first time, an EU-macro regional analysis is conducted with and without the UK. Empirical results reveal that an increase in tourism, real GDP per capita, and energy use across the four EU macro regions leads to increase in carbon emission. In some regions, it was observed that tourism, ECI, Brexit, and the Greece bailout have no significant impact on carbon emission. This suggests that the increase in international travel, complexity of the economy, and financial crisis do not accelerate environmental crisis in such regions. However, where such factors are statistically significant, Brexit and the Greece bailout crisis both heighten emissions. Particularly, when the UK is excluded, Brexit and the Greece bailout crisis increase and reduce emissions, respectively. The EKC hypothesis, however, holds in either scenario. Based on these empirical findings, vital policy directions are suggested for a post-Brexit EU-UK energy and environmental relations.",
        "DOI": "10.1016/j.jclepro.2021.127117",
        "paper_author": "Fatai Adedoyin F.",
        "affiliation_name": "Bournemouth University",
        "affiliation_city": "Bournemouth",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60029336",
        "affiliation_state": "Dorset"
    },
    {
        "paper_title": "Global assessment of the impacts of COVID-19 on food security",
        "publication": "Global Food Security",
        "citied_by": "159",
        "cover_date": "2021-12-01",
        "Abstract": "In this paper we present the first global assessments of COVID-19's impacts on food systems and their actors, focusing specifically on the food security and nutritional status of those affected in low and middle-income countries. The assessment covers 62 countries and is based on the analysis of 337 documents published in English, French, Spanish and Portuguese. The review confirms the magnitude and the severity of an unprecedented crisis that has spread worldwide and has spared only a few. The analysis shows that the dimension of food security that has been most affected is accessibility, with reasonably solid evidence suggesting that both financial and physical access to food have been disrupted. In contrast, there is no clear evidence that the availability of food has been affected. Overall, data suggests that food systems resisted and adapted to the disruption of the pandemic. This resilience came, however, at great costs, with the majority of the systems' actors having to cope with severe disruptions in their activities. In contrast, grocery stores and supermarkets made billions of dollars in profits in 2020.",
        "DOI": "10.1016/j.gfs.2021.100575",
        "paper_author": "Béné C.",
        "affiliation_name": "Centro Internacional de Agricultura Tropical",
        "affiliation_city": "Cali",
        "affiliation_country": "Colombia",
        "affiliation_id": "60045061",
        "affiliation_state": "Valle del Cauca"
    },
    {
        "paper_title": "Asymmetric spillover and network connectedness between crude oil, gold, and Chinese sector stock markets",
        "publication": "Energy Economics",
        "citied_by": "159",
        "cover_date": "2021-06-01",
        "Abstract": "This paper examines the asymmetric return spillovers between crude oil futures, gold futures and ten sector stock markets of China. The results show using the spillover index of Diebold and Yilmaz (2012, 2014) time-varying asymmetry spillovers among commodity and the ten sectors. Industrials and consumer discretionary sectors are the largest contributor and receiver of spillovers in the system. In addition, basic materials sector is a net contributor of spillovers whereas oil futures, gold futures and the remaining sectors are net receiver of spillovers. Furthermore, the bad return spillovers dominate the good return spillovers. The asymmetry spillovers are influenced by the global financial and European crises (GFC & ESDC), oil price crash and global health crisis (COVID-19 outbreak). Equity investors benefit from adding gold and oil to their individual equity markets. Moreover, the hedging is sensitive to the GFC & ESDC, oil price crash, and COVID-19 outbreak. Finally, the highest hedging effectiveness occurs during COVID-19 spread for the case of oil futures. The result is similar for gold under only good spillovers and it is highest during recovery period under bad spillovers.",
        "DOI": "10.1016/j.eneco.2021.105262",
        "paper_author": "Mensi W.",
        "affiliation_name": "Sultan Qaboos University",
        "affiliation_city": "Muscat",
        "affiliation_country": "Oman",
        "affiliation_id": "60071768",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "COVID-19 and time-frequency connectedness between green and conventional financial markets",
        "publication": "Global Finance Journal",
        "citied_by": "158",
        "cover_date": "2021-08-01",
        "Abstract": "Against the backdrop of the exponentially growing trend in green finance investments and the calls for green recovery in the post-COVID world, this study presents the time-frequency connectedness between green and conventional financial markets by using the spillover models of Diebold and Yilmaz (2012) and Baruník and Křehlík (2018). Covering a sample period from January 01, 2008, to July 31, 2020, we aim to explore the dynamics of connectedness between conventional and green investments in fixed income, equity, and energy markets. Additionally, we determine the role of market-wide uncertainty in altering the connectedness structure by performing a subsample analysis for the ongoing COVID-19 pandemic crisis period. Our results show that competing energy investments are not connected, and there is only one-way spillovers from the conventional bonds in the fixed-income investments. Additionally, we observe a low (high) intergroup connectedness for conventional (green) investments. Moreover, the frequency-based analysis shows that connectedness between these competing markets is more pronounced during the short-run. The subsample analysis for the pandemic crisis period shows similar results except for the disconnection between bond markets in the short-run frequency. Our time-varying analysis shows peaks and troughs in the connectedness between climate-friendly and conventional investments that suggest different global events such as the Eurozone Debt Crisis and Shale Oil Revolution drives the association between alternate investments. Similarly, we observe an enhanced connectedness during the recent COVID-19 period, suggesting that financial stability would be a significant factor in determining the smooth transition to green investments.",
        "DOI": "10.1016/j.gfj.2021.100650",
        "paper_author": "Arif M.",
        "affiliation_name": "Shaheed Benazir Bhutto University",
        "affiliation_city": "Nawabshah",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60268302",
        "affiliation_state": "Sindh"
    },
    {
        "paper_title": "Occupational burnout and job satisfaction among physicians in times of COVID-19 crisis: a convergent parallel mixed-method study",
        "publication": "BMC public health",
        "citied_by": "158",
        "cover_date": "2021-04-28",
        "Abstract": "BACKGROUND: Healthcare professionals including physicians were subjected to an increased workload during the COVID-19 crisis, leaving them exposed to significant physical and psychological distress. Therefore, our present study aimed to (i) assess the prevalence of burnout and levels of job satisfaction among physicians in Jordan, and (ii) explore physicians' opinions, experiences, and perceptions during the pandemic crisis. METHODS: This was a mixed-method study that utilized a structured web-based questionnaire and semi-structured individual interviews. The 10-Item Burnout Measure-Short version (BMS), and the 5-Item Short Index of Job Satisfaction (SIJS) were adopted to assess occupational burnout and job satisfaction, respectively. Semi-structured interviews were conducted, based on a conceptual framework that was developed from Herzberg's Two-Factor Theory of Motivation and Job Demands-Resources Model. Descriptive statistics and regression models, as well as inductive thematic analysis, were used to analyze quantitative and qualitative data, respectively. RESULTS: A total of 973 survey responses and 11 interviews were included in our analysis. The prevalence of burnout among physicians was (57.7%). Several significant factors were positively associated with burnout, including female gender, working at highly loaded hospitals, working for long hours, doing night shifts, lack of sufficient access to personal protective equipment, and being positively tested for SARS-CoV-2. Regarding job satisfaction, regression analysis revealed that age was positively associated with higher levels of job satisfaction. On contrary, being a general practitioner or specialist, working at highly loaded hospitals, low salaries, and suffering from burnout have predicted lower levels of job satisfaction. Besides, four themes have emerged from the thematic analysis: (i) Work-induced psychological distress during the pandemic, (ii) Decision-driven satisfactory and dissatisfactory experiences, (iii) Impact of the pandemic on doctor-patient communication and professional skills, and (iv) Economic impacts of the pandemic crisis and lockdown. CONCLUSION: A significant physical and psychological burden was associated with the COVID-19 pandemic. Reliable efforts should be implemented aiming at protecting physicians' physical and mental wellbeing, enhancing their working conditions, and raising awareness about burnout. Evidence-based decisions and proper utilization of financial and human resources at institutional and national levels are believed to be crucial for the sustainability of the health workforce, especially in crises.",
        "DOI": "10.1186/s12889-021-10897-4",
        "paper_author": "Alrawashdeh H.M.",
        "affiliation_name": "Sharif Eye Centers",
        "affiliation_city": "Irbid",
        "affiliation_country": "Jordan",
        "affiliation_id": "127066445",
        "affiliation_state": "Irbid"
    },
    {
        "paper_title": "Global Financial Crisis, Smart Lockdown Strategies, and the COVID-19 Spillover Impacts: A Global Perspective Implications From Southeast Asia",
        "publication": "Frontiers in Psychiatry",
        "citied_by": "156",
        "cover_date": "2021-09-03",
        "Abstract": "This present study primarily emphasizes to seek the COVID-19 adverse impacts posing health challenges and global economic crisis. The pandemic (COVID-19) continues to hit the global economies adversely. Pakistan is the 5th-most-populous nation, and recorded positive cases with the third-highest positivity ratio in South Asia, and 26th-highest deaths toll of 21,450 and 29th number of most COVID-19 positive cases with 933,750 worldwide, as of June 6, 2021. The first wave appeared at the end of May 2020, and mid of June reported its peak, which ended by mid-July 2020. Early November 2020 witnessed the second wave with low intensity reached the climax by mid-December. The COVID-19's third wave severely affected the country during mid-March 2021. It exhibited the highest positivity rate, around 20%. New positive patients and deaths toll commenced to skyrocket and reported peak by April 15, 2021. Then situation gradually improved with effective measures and restrictions. The pandemic coronavirus (COVID-19) has affected 220 territories, regions, and countries and resulted in more than 174.116 million infections, deaths, 3.75 million, and 157.157 million positive cases fully recovered from this infectious disease, as of June 7, 2021. The pandemic has caused a severe crisis of healthcare facilities and economic challenges worldwide. Pakistani economy reported GPD's negative growth (–0.05) for the first time over the last 60 years in 2020, which caused a massive financial crisis. The Government's relief package intervened to reduce public mental stress and improve the quality of their lives. IMF reported that Pakistan's GPD bounced back at 4% growth by June 2021. This article determines that economic instability and health burden happened in Pakistan for a longer time than financial disequilibrium that occurred globally. Pakistan encountered this crisis due to its feeble healthcare systems and fragile economy. This study explores adverse health issues and spillover consequences on the economic crisis in Pakistan with global implications. It recommends smart lockdown restrictions in most affected areas to reopen the economic cycle with strict preventive measures to minimize the COVD-19 adverse consequences.",
        "DOI": "10.3389/fpsyt.2021.643783",
        "paper_author": "Wang C.",
        "affiliation_name": "Shanghai Lixin University of Accounting and Finance",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60175853",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The Impact of Corporate Governance on Firm Performance During The COVID-19 Pandemic: Evidence from Malaysia",
        "publication": "Journal of Asian Finance, Economics and Business",
        "citied_by": "156",
        "cover_date": "2021-01-01",
        "Abstract": "The purpose of this study is to evaluate the effect of COVID-19 on corporate governance attributes and firm performance association. This research used a sample of 188 non-financial firms from the Malaysian market for the years 2019-2020. We found that the COVID-19 has affected all firm characteristics including firm performance, governance structure, dividend, liquidity, and leverage level, yet, the difference between prior and post COVID-19 pandemic is not significant. Also, the investigation revealed that board size exerts a significant positive impact on firm performance. After splitting the sample based on year, however, we found that board size does not matter in the uncertain time of the current crisis, while board diversity appeared to be significantly enhancing firm performance in the crisis time compared to the prior year where it has an inverse association with firm performance in both indicators. Board meetings and audit committee meetings seemed to have a significant negative influence on firm performance pre and post-COVID-19. This study contributes to the limited literature by providing the first empirical evidence on the impact of Coronavirus on the firm performance and corporate governance association.",
        "DOI": "10.13106/jafeb.2021.vol8.no2.0943",
        "paper_author": "Khatib S.F.A.",
        "affiliation_name": "Universiti Teknologi Malaysia",
        "affiliation_city": "Johor Bahru",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60021005",
        "affiliation_state": "Johor"
    },
    {
        "paper_title": "Investor attention and global market returns during the COVID-19 crisis",
        "publication": "International Review of Financial Analysis",
        "citied_by": "156",
        "cover_date": "2021-01-01",
        "Abstract": "The financial market response to the COVID-19 pandemic provides the first example of a market crash instigated by a health crisis. As such, the crisis provides a unique setting in which to examine the market response to changes in investor attention. We utilise Google search volume (GSV) as a proxy for investor attention. GSV for the “coronavirus” keyword increases markedly from late-February and peaks in mid-March before declining substantially. Our results are broadly consistent with Da, Engelberg, and Gao (2015), indicating that GSV is primarily a proxy for the attention of retail investors and confirming that investor attention negatively influences global stock returns during this crisis period. A rise in the number of internet searches during the COVID-19 crisis induces a faster rate of information flow into financial markets and so is also associated with higher volatility. The identified relationships are economically and statistically significant even after controlling for the number of COVID-19 cases and macroeconomic effects. Increases in GSV have less impact on government bond yields where the limited role of GSV is likely due to lower participation of retail investors. The results suggest that, rather than searching for information on potential stocks to buy (Barber & Odean, 2008), retail investors are searching for information to resolve uncertainty about household FEARS (Da et al., 2015) during the COVID-19 crisis.",
        "DOI": "10.1016/j.irfa.2020.101616",
        "paper_author": "Smales L.A.",
        "affiliation_name": "The UWA Business School",
        "affiliation_city": "Perth",
        "affiliation_country": "Australia",
        "affiliation_id": "60189723",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Lessons learned from humanitarian logistics to manage supply chain disruptions",
        "publication": "Journal of Supply Chain Management",
        "citied_by": "155",
        "cover_date": "2021-01-01",
        "Abstract": "The coronavirus disease 2019 (COVID-19) outbreak affects not just populations but also global and local economies and supply chains. The outbreak itself has impacted on production lines and manufacturing capacities. In response to the outbreak, policies have been put in place that blocks the movement of people and materials, causing supply chain disruptions. Mainstream supply chain management has been at a loss in responding to these disruptions, mostly due to a dominant focus on minimizing costs for stable operations, while following lean, just-in-time, and zero-inventory approaches. On the other hand, pandemic response supply chains, and their related supply chain disruptions, share many characteristics with disaster response and thereby with humanitarian supply chains. Much can thus be learned from humanitarian supply chains for managing pandemic-related supply chain disruptions. What is more, facing, and managing, supply chain disruptions can be considered the new norm also in light of other disruptive forces such as climate change, or financial or political crises. This article therefore presents lessons learned from humanitarian supply chains that help mitigate and overcome supply chain disruptions. These lessons not only relate to preparedness and mobilization, but also relate to standardization, innovation, and collaboration. Together, they brace organizations, supply chains, and societies, to manage current and future disruptions.",
        "DOI": "10.1111/jscm.12253",
        "paper_author": "Kovács G.",
        "affiliation_name": "Hanken School of Economics",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "117429569",
        "affiliation_state": "DC"
    },
    {
        "paper_title": "Facilitating artificial intelligence powered supply chain analytics through alliance management during the pandemic crises in the B2B context",
        "publication": "Industrial Marketing Management",
        "citied_by": "154",
        "cover_date": "2021-07-01",
        "Abstract": "The COVID-19 pandemic has disrupted global supply chains and exposed weak links in the chains far beyond what most people have witnessed in their living memory. The scale of disruption affects every nation and industry, and the sudden and dramatic changes in demand and supply that have occurred during the pandemic crisis clearly differentiate its impact from other crises. Using the dynamic capabilities view, we studied alliance management capability (AMC) and artificial intelligence (AI) driven supply chain analytics capability (AI-SCAC) as dynamic capabilities, under the moderating effect of environmental dynamism. We tested our four research hypotheses using survey data collected from the Indian auto components manufacturing industry. For data analysis we used Warp PLS 7.0 (a variance-based structural equation modelling tool). We found that alliance management capability under the mediating effect of artificial intelligence-powered supply chain analytics capability enhances the operational and financial performance of the organization. Moreover, we also observed that the alliance management capability has a significant effect on artificial intelligence-powered supply chain analytics capability under the moderating effect of environmental dynamism. The results of our study provide a nuanced understanding of the dynamic capabilities and the relational view of organization. Finally, we noted the limitations of our study and provide numerous research directions that may help answer some of the questions that arise from our study.",
        "DOI": "10.1016/j.indmarman.2021.05.003",
        "paper_author": "Dubey R.",
        "affiliation_name": "Liverpool Business School",
        "affiliation_city": "Liverpool",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60170411",
        "affiliation_state": "Merseyside"
    },
    {
        "paper_title": "Dynamic volatility spillovers across oil and natural gas futures markets based on a time-varying spillover method",
        "publication": "International Review of Financial Analysis",
        "citied_by": "152",
        "cover_date": "2021-07-01",
        "Abstract": "This paper analyzes dynamic volatility spillovers between four major energy commodities (i.e., crude oil, gasoline, heating oil and natural gas) in the oil-natural gas future markets. We construct a time-varying spillover method by combining the TVP-VAR-SV model and the spillover method of Diebold and Yilmaz (2009, 2012, 2014). We use the spillover method to obtain time-varying total, directional and pairwise volatility spillover indices. Our results summarize as follows: (1) The volatility spillover indices present peaks and troughs during some periods, such as shale gas revolution, financial crisis, and oil price crash; (2) After the U.S. shale gas revolution, the size of volatility spillover from natural gas future market has reduced sharply, but volatility doesn't decouple from the other three oil future markets; (3) The directional spillover is asymmetric. The crude oil and heating oil futures market are main net transmitter of volatility risk information, while the gasoline and natural gas futures markets are the net receiver; (4) For natural gas future market, the pairwise volatility spillover from crude oil future market has the most significant influence.",
        "DOI": "10.1016/j.irfa.2021.101790",
        "paper_author": "Gong X.",
        "affiliation_name": "Xiamen University",
        "affiliation_city": "Xiamen",
        "affiliation_country": "China",
        "affiliation_id": "60018205",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "Populism in Place: The Economic Geography of the Globalization Backlash",
        "publication": "International Organization",
        "citied_by": "150",
        "cover_date": "2021-03-01",
        "Abstract": "A populist backlash to globalization has ushered in nationalist governments and challenged core features of the Liberal International Order. Although startling in scope and urgency, the populist wave has been developing in declining regions of wealthy countries for some time. Trade, offshoring, and automation have steadily reduced the number of available jobs and the wages of industrial workers since at least the 1970s. The decline in manufacturing employment initiated the deterioration of social and economic conditions in affected communities, exacerbating inequalities between depressed rural areas and small cities and towns, on the one hand, and thriving cities, on the other. The global financial crisis of 2008 catalyzed these divisions, as communities already in decline suffered deeper and longer economic downturns than metropolitan areas, where superstar knowledge, technology, and service-oriented firms agglomerate. We document many of these trends across the United States and Europe, and demonstrate that populist support is strongest in communities that experienced long-term economic and social decline. Institutional differences in labor markets and electoral rules across developed democracies may explain some of the variation in populists' electoral success. Renewed support for the Liberal International Order may require a rejuvenation of distressed communities and a reduction of stark regional inequalities.",
        "DOI": "10.1017/S0020818320000314",
        "paper_author": "Broz J.L.",
        "affiliation_name": "Center for Commerce and Diplomacy",
        "affiliation_city": "San Diego",
        "affiliation_country": "United States",
        "affiliation_id": "60121515",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "The effect of COVID – 19 pandemic on global stock market volatility: Can economic strength help to manage the uncertainty?",
        "publication": "Journal of Business Research",
        "citied_by": "150",
        "cover_date": "2021-05-01",
        "Abstract": "Stock markets across the world have exhibited varying degrees of volatility following the recent COVID-19 pandemic. We have examined the effect of this pandemic on stock market volatility and whether economic strength, measured by a set of selected country-level economic characteristics and factors such as economic resilience, intensity of capitalism, level of corporate governance, financial development, monetary policy rate and quality of health system, can potentially mitigate the possible detrimental effect of the global pandemic on stock market volatility. Using data from 34 developed and emerging markets, we have found that these country-level economic characteristics and factors do help to reduce the volatility arising due to the virus pandemic. The results of this paper are important as policymakers can use these economic factors to set policy responses to tackle extraordinary heat in the global stock market in order to avoid any possible future financial crisis.",
        "DOI": "10.1016/j.jbusres.2021.01.061",
        "paper_author": "Uddin M.",
        "affiliation_name": "Leeds University Business School",
        "affiliation_city": "Leeds",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60116344",
        "affiliation_state": "West Yorkshire"
    },
    {
        "paper_title": "Provisional COVID-19 infrastructure induces large, rapid increases in cycling",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "148",
        "cover_date": "2021-04-13",
        "Abstract": "The bicycle is a low-cost means of transport linked to low risk of transmission of infectious disease. During the COVID-19 crisis, governments have therefore incentivized cycling by provisionally redistributing street space. We evaluate the impact of this new bicycle infrastructure on cycling traffic using a generalized difference in differences design. We scrape daily bicycle counts from 736 bicycle counters in 106 European cities. We combine these with data on announced and completed pop-up bike lane road work projects. Within 4 mo, an average of 11.5 km of provisional pop-up bike lanes have been built per city and the policy has increased cycling between 11 and 48% on average. We calculate that the new infrastructure will generate between $1 and $7 billion in health benefits per year if cycling habits are sticky.",
        "DOI": "10.1073/pnas.2024399118",
        "paper_author": "Kraus S.",
        "affiliation_name": "Mercator Research Institute on Global Commons and Climate Change",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60159447",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Financing firms in hibernation during the COVID-19 pandemic",
        "publication": "Journal of Financial Stability",
        "citied_by": "148",
        "cover_date": "2021-04-01",
        "Abstract": "The coronavirus (COVID-19) pandemic halted economic activity worldwide, hurting firms and pushing many of them toward bankruptcy. This paper discusses four central issues that have emerged in the academic and policy debates related to firm financing during the downturn. First, the economic crisis triggered by the pandemic is radically different from past crises, with important consequences for optimal policy responses. Second, it is important to preserve firms’ relationships with key stakeholders (e.g., workers, suppliers, customers, and creditors) to avoid inefficient bankruptcies and long-term detrimental economic effects. Third, firms can benefit from “hibernation,” incurring the minimum bare expenses necessary to withstand the pandemic while using credit to remain alive until the crisis subdues. Fourth, the existing legal and regulatory infrastructure is ill-equipped to deal with an exogenous systemic shock like a pandemic. Financial sector policies can help channel credit to firms, but they are hard to implement and entail different trade-offs.",
        "DOI": "10.1016/j.jfs.2020.100837",
        "paper_author": "Didier T.",
        "affiliation_name": "The World Bank, USA",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60112834",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "EMU risk-synchronisation and financial fragility through the prism of dynamic connectedness",
        "publication": "Quarterly Review of Economics and Finance",
        "citied_by": "148",
        "cover_date": "2021-02-01",
        "Abstract": "This study employs dynamic connectedness as a measure of financial risk synchronization considering government bond yields in 11 EMU member states. In particular, large values of the relevant index can be an indication of comparable levels of risk further implying that the common currency area consists of a financially sensible set of countries. By contrast, small connectedness values can be an indication of fragmentation whereupon certain countries are considered to be safer than others. The latter would be detrimental for the EMU as it fuels financial fragility, which practically stipulates that crises occur as a result of self-fulfilling market fears. The results are based on a daily dataset which spans between 1st September 2003 and 31st August 2018. Findings show that fragmentation was present at the height of the European sovereign debt crisis and that the interconnectedness has not yet reverted to its pre-2009 levels. In addition, core countries appear to transmit shocks to periphery countries although, occasionally, there are noteworthy disparities. Further investigating these disparities on a pairwise connectedness level – which helps to identify sensible pairs of countries in terms of financial risk – shows that core countries dominate this exercise, with the exception of the bilateral relation between Italy and Spain. The fact that most periphery countries of our sample are not included in these pairs raises concerns and calls for a more substantial integration.",
        "DOI": "10.1016/j.qref.2020.12.003",
        "paper_author": "Chatziantoniou I.",
        "affiliation_name": "Portsmouth Business School",
        "affiliation_city": "Portsmouth",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60170203",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Investor rewards to environmental responsibility: Evidence from the COVID-19 crisis",
        "publication": "Journal of Corporate Finance",
        "citied_by": "145",
        "cover_date": "2021-06-01",
        "Abstract": "The COVID-19 shock and its unprecedented financial consequences have brought about vast uncertainty concerning the future of climate actions. We study the cross-section of stock returns during the COVID-19 shock to explore investors' views and expectations about environmental issues. The results show that firms with responsible strategies on environmental issues experience better stock returns. This effect is mainly driven by initiatives addressing climate change (e.g., reduction of environmental emissions and energy use), is more pronounced for firms with greater ownership by investors with long-term orientation and is not observed prior to the COVID-19 crisis. Overall, the results indicate that the COVID-19 shock has not distracted investors' attention away from environmental issues but on the contrary led them to reward climate responsibility to a larger extent.",
        "DOI": "10.1016/j.jcorpfin.2021.101948",
        "paper_author": "Garel A.",
        "affiliation_name": "Audencia",
        "affiliation_city": "Nantes",
        "affiliation_country": "France",
        "affiliation_id": "60116071",
        "affiliation_state": "Pays-de-la-Loire"
    },
    {
        "paper_title": "Impact of COVID-19 on mental health and quality of life: Is there any effect? A crosssectional study of the MENA region",
        "publication": "PLoS ONE",
        "citied_by": "143",
        "cover_date": "2021-03-01",
        "Abstract": "The COVID-19 pandemic is a major health crisis that has changed the life of millions globally. The purpose of this study was to assess the effect of the pandemic on mental health and quality of life among the general population in the Middle East and North Africa (MENA) region. A total of 6142 adults from eighteen countries within the MENA region completed an online questionnaire between May and June 2020. Psychological impact was assessed using the Impact of Event Scale-Revised (IES-R) and the social and family support impact was assessed with questions from the Perceived Support Scale (PSS). The IES-R mean score was 29.3 (SD = 14.8), corresponding to mild stressful impact with 30.9% reporting severe psychological impact. Most participants (45%-62%) felt horrified, apprehensive, or helpless due to COVID-19. Furthermore, over 40% reported increased stress from work and financial matters. Higher IES-R scores were found among females, participants aged 26-35 years, those with lower educational level, and participants residing in the North Africa region (p<0.005). About 42% reported receiving increased support from family members, 40.5% were paying more attention to their mental health, and over 40% reported spending more time resting since the pandemic started. The COVID-19 pandemic was associated with mild psychological impact while it also encouraged some positive impact on family support and mental health awareness among adults in the MENA region. Clinical interventions targeted towards vulnerable groups such as females and younger adults are needed.",
        "DOI": "10.1371/journal.pone.0249107",
        "paper_author": "Al Dhaheri A.S.",
        "affiliation_name": "College of Medicine and Health Sciences United Arab Emirates University",
        "affiliation_city": "Al Ain",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60070823",
        "affiliation_state": "Abu Dhabi"
    },
    {
        "paper_title": "Mental health of children and young people during pandemic",
        "publication": "The BMJ",
        "citied_by": "143",
        "cover_date": "2021-03-10",
        "Abstract": "NA",
        "DOI": "10.1136/bmj.n614",
        "paper_author": "Ford T.",
        "affiliation_name": "University of Cambridge",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60031101",
        "affiliation_state": "Cambridgeshire"
    },
    {
        "paper_title": "COVID-19 pandemic effects on nursing education: looking through the lens of a developing country",
        "publication": "International Nursing Review",
        "citied_by": "142",
        "cover_date": "2021-06-01",
        "Abstract": "Background: COVID-19 pandemic has impacted the way things are done in walks of life including nursing education in both developing and developed countries. Nursing schools all over the world as well as in developing countries responded to the pandemic following the guidelines of the World Health Organisation and different countries specific guidelines regarding the pandemic. Aim: This reflective piece aims to describe the effect of COVID-19 on nursing education in developing countries. Result: Face-to-face teaching and learning were converted to virtual remote learning and clinical experiences suspended to protect the students from the pandemic. Specific but broader responses to the pandemic in the Caribbean and other developing countries have been shaped by financial, political and other contextual factors, especially the level of information technology infrastructure development, and the attendant inequities in access to such technology between the rural and urban areas. Internet accessibility, affordability and reliability in certain areas seem to negatively affect the delivery of nursing education during the COVID-19 lockdown. Conclusion and Implications for Nursing and/or Health Policy: The impact of COVID-19 on nursing education in the Caribbean and other parts of the world has shown that if adequate measures are put in place by the way of disaster preparedness and preplanned mitigation strategies, future crises like COVID-19 will have less impact on nursing education. Therefore, health policymakers and nursing regulatory bodies in the developing countries should put policies in place that will help in responding, coping and recovering quickly from future occurrences.",
        "DOI": "10.1111/inr.12663",
        "paper_author": "Agu C.F.",
        "affiliation_name": "The University of the West Indies",
        "affiliation_city": "Kingston",
        "affiliation_country": "Jamaica",
        "affiliation_id": "60071347",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The COVID-19 crisis will exacerbate maternal and child undernutrition and child mortality in low- and middle-income countries",
        "publication": "Nature Food",
        "citied_by": "140",
        "cover_date": "2021-07-01",
        "Abstract": "The economic crisis and food and health system disruptions related to the COVID-19 pandemic threaten to exacerbate undernutrition in low- and middle-income countries (LMICs). We developed pessimistic, moderate and optimistic scenarios for 2020–2022 and used three modelling tools (MIRAGRODEP, the Lives Saved Tool and Optima Nutrition) to estimate the impacts of pandemic-induced disruptions on child stunting, wasting and mortality, maternal anaemia and children born to women with a low body mass index (BMI) in 118 LMICs. We estimated the cost of six nutrition interventions to mitigate excess stunting and child mortality due to the pandemic and to maximize alive and non-stunted children, and used the human capital approach to estimate future productivity losses. By 2022, COVID-19-related disruptions could result in an additional 9.3 million wasted children and 2.6 million stunted children, 168,000 additional child deaths, 2.1 million maternal anaemia cases, 2.1 million children born to women with a low BMI and US$29.7 billion in future productivity losses due to excess stunting and child mortality. An additional US$1.2 billion per year will be needed to mitigate these effects by scaling up nutrition interventions. Governments and donors must maintain nutrition as a priority, continue to support resilient systems and ensure the efficient use of new and existing resources.",
        "DOI": "10.1038/s43016-021-00319-4",
        "paper_author": "Osendarp S.",
        "affiliation_name": "Micronutrient Forum",
        "affiliation_city": "Washington",
        "affiliation_country": "United States",
        "affiliation_id": "126607470",
        "affiliation_state": "DC"
    },
    {
        "paper_title": "Trust and stock market volatility during the COVID-19 crisis",
        "publication": "Finance Research Letters",
        "citied_by": "140",
        "cover_date": "2021-01-01",
        "Abstract": "We investigate if trust affects global stock market volatility during the COVID-19 pandemic. Using a sample of 47 national stock markets, we find the stock markets’ volatility to be significantly lower in high-trust countries (in reaction to COVID-19 case announcements). Both trust in fellow citizens as well as in the countries’ governments are of significant importance.",
        "DOI": "10.1016/j.frl.2020.101873",
        "paper_author": "Engelhardt N.",
        "affiliation_name": "Technische Universität Dortmund",
        "affiliation_city": "Dortmund",
        "affiliation_country": "Germany",
        "affiliation_id": "60032991",
        "affiliation_state": "Nordrhein-Westfalen"
    },
    {
        "paper_title": "The impact of COVID-19 pandemic on bank lending around the world",
        "publication": "Journal of Banking and Finance",
        "citied_by": "139",
        "cover_date": "2021-12-01",
        "Abstract": "We evaluate the influence of the pandemic on global bank lending and identify bank and country characteristics that amplify or weaken the effect of the disease outbreak on bank credit. Using a sample of banks from 125 countries, we apply a difference-in-difference methodology and find that bank lending is weaker in countries that are more affected by the health crisis. This effect depends on the bank's financial conditions, market structure, regulatory and institutional environment, financial intermediary and debt market development, ease of access of corporate firms to debt capital, and the response of the public health sector to the crisis.",
        "DOI": "10.1016/j.jbankfin.2021.106207",
        "paper_author": "Ҫolak G.",
        "affiliation_name": "Hanken - Svenska handelshögskolan",
        "affiliation_city": "Helsinki",
        "affiliation_country": "Finland",
        "affiliation_id": "60002505",
        "affiliation_state": "Uusimaa"
    },
    {
        "paper_title": "Impacts of the COVID-19 pandemic on financial market connectedness",
        "publication": "Finance Research Letters",
        "citied_by": "138",
        "cover_date": "2021-01-01",
        "Abstract": "In this paper, we study the impacts of the COVID-19 pandemic on the connectedness of the Hong Kong financial market. We construct dynamic financial networks based on correlations and partial correlations of stock returns to assess the impacts of COVID-19 and to compare the impacts in the previous financial crises in the past 15 years. Compared to other crises where the network density and clustering can be explained by co-movement with market indices as in normal periods, both network density and clustering are higher in the partial correlation networks during the COVID-19 outbreak.",
        "DOI": "10.1016/j.frl.2020.101864",
        "paper_author": "So M.K.P.",
        "affiliation_name": "Hong Kong University of Science and Technology",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008592",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Hedge and safe haven properties during COVID-19: Evidence from Bitcoin and gold",
        "publication": "Quarterly Review of Economics and Finance",
        "citied_by": "135",
        "cover_date": "2021-11-01",
        "Abstract": "The COVID-19 pandemic has caused an unprecedented human and health crisis. The measures taken to contain the damage caused a global economic slowdown. Investors face liquidity pressures resulting from the general downturn in the financial markets, and might change their risk appetite. This paper reassesses the safe haven property of gold as a traditional asset, and Bitcoin which is gradually imposing itself as a new class of asset with unique characteristics. The empirical results, applied on major world stock market indices and currencies, and based on the multivariate asymmetric dynamic conditional correlation model, show the effectiveness of Bitcoin and gold as hedging assets in reducing the risk of international portfolios. Moreover, the analysis provides evidence that during the COVID-19 pandemic, gold is a weak safe haven for the considered assets, while Bitcoin cannot provide shelter due to its increased variability.",
        "DOI": "10.1016/j.qref.2021.07.006",
        "paper_author": "Chemkha R.",
        "affiliation_name": "FSEG Sfax - Faculté des Sciences Économiques et de Gestion de Sfax",
        "affiliation_city": "Sfax",
        "affiliation_country": "Tunisia",
        "affiliation_id": "60091647",
        "affiliation_state": "Sfax"
    },
    {
        "paper_title": "Mobilising evidence, data, and resources to achieve global maternal and child undernutrition targets and the Sustainable Development Goals: an agenda for action",
        "publication": "The Lancet",
        "citied_by": "135",
        "cover_date": "2021-04-10",
        "Abstract": "As the world counts down to the 2025 World Health Assembly nutrition targets and the 2030 Sustainable Development Goals, millions of women, children, and adolescents worldwide remain undernourished (underweight, stunted, and deficient in micronutrients), despite evidence on effective interventions and increasing political commitment to, and financial investment in, nutrition. The COVID-19 pandemic has crippled health systems, exacerbated household food insecurity, and reversed economic growth, which together could set back improvements in undernutrition across low-income and middle-income countries. This paper highlights how the evidence base for nutrition, health, food systems, social protection, and water, sanitation, and hygiene interventions has evolved since the 2013 Lancet Series on maternal and child nutrition and identifies the priority actions needed to regain and accelerate progress within the next decade. Policies and interventions targeting the first 1000 days of life, including some newly identified since 2013, require renewed commitment, implementation research, and increased funding from both domestic and global actors. A new body of evidence from national and state-level success stories in stunting reduction reinforces the crucial importance of multisectoral actions to address the underlying determinants of undernutrition and identifies key features of enabling political environments. To support these actions, well-resourced nutrition data and information systems are essential. The paper concludes with a call to action for the 2021 Nutrition for Growth Summit to unite global and national nutrition stakeholders around common priorities to tackle a large, unfinished undernutrition agenda—now amplified by the COVID-19 crisis.",
        "DOI": "10.1016/S0140-6736(21)00568-7",
        "paper_author": "Heidkamp R.A.",
        "affiliation_name": "Johns Hopkins Bloomberg School of Public Health",
        "affiliation_city": "Baltimore",
        "affiliation_country": "United States",
        "affiliation_id": "60006183",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "Family Caregiving during the COVID-19 Pandemic",
        "publication": "Gerontologist",
        "citied_by": "134",
        "cover_date": "2021-08-01",
        "Abstract": "Background and Objectives: The coronavirus disease 2019 (COVID-19) pandemic has negatively affected persons with existing chronic health conditions. The pandemic also has the potential to exacerbate the stresses of family caregiving. We compare family caregivers with noncaregivers on physical, psychosocial, and financial well-being outcomes during the pandemic and determine family caregivers most at risk for adverse outcomes. Research Design and Methods: We conducted a cross-sectional online survey of 576 family caregivers and 2,933 noncaregivers from April to May 2020 in Pittsburgh, PA region with a national supplement. Outcome measures included concurrent anxiety, depression, fatigue, sleep disturbance, social participation, and financial well-being and perceived changes due to COVID-19 (loneliness, financial well-being, food security). We also measured sociodemographic, caregiving contextual variables, and COVID-19-related caregiver stressors (COVID Caregiver Risk Index). Results: Controlling for sociodemographics, family caregivers reported higher anxiety, depression, fatigue, sleep disturbance, lower social participation, lower financial well-being, increased food insecurity (all p <. 01), and increased financial worries (p =. 01). Caregivers who reported more COVID-19-related caregiver stressors and disruptions reported more adverse outcomes (all p <. 01). In addition, caregivers who were female, younger, lower income, providing both personal/medical care, and providing care for cognitive/behavioral/emotional problems reported more adverse outcomes. Discussion and Implications: Challenges of caregiving are exacerbated by the COVID-19 pandemic. Family caregivers reported increased duties, burdens, and resulting adverse health, psychosocial, and financial outcomes. Results were generally consistent with caregiver stress-health process models. Family caregivers should receive increased support during this serious public health crisis.",
        "DOI": "10.1093/geront/gnab049",
        "paper_author": "Beach S.R.",
        "affiliation_name": "University of Pittsburgh",
        "affiliation_city": "Pittsburgh",
        "affiliation_country": "United States",
        "affiliation_id": "60015543",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "From challenges to creativity: Enhancing smes’ resilience in the context of covid-19",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "134",
        "cover_date": "2021-06-02",
        "Abstract": "COVID-19 pandemic has brought significant and multiple challenges for SMEs. While SMEs have traditionally faced financial and non-financial crises, the pandemic has brought about additional uncertainties on how to maintain business continuity. The purpose of this paper is to examine how SMEs can mitigate against COVID-19-related crisis by examining the impacts that the pandemic has had on them through a review of 34 articles. The thematic analysis from the literature covered three overarching and inter-related challenges including (i) cost and finance-related challenges, (ii) disruption of activities, and (iii) existential difficulties. The paper’s value lies in addressing the gap between the espoused literature’s claim of the beneficial impact of new technological advancements and SMEs’ ability to survive in the context of the COVID-19 pandemic. The additional value of this paper is a framework of recommendations to help enhance SMEs’ resilience and responsiveness in the context of COVID-19. These recommendations include collaboration, openness, taking advantage of opportunities/victory, and durability.",
        "DOI": "10.3390/su13126542",
        "paper_author": "Zutshi A.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "FinTech and commercial banks' performance in China: A leap forward or survival of the fittest?",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "132",
        "cover_date": "2021-05-01",
        "Abstract": "As the impacts of the COVID-19 pandemic play out globally, the banking industry has been affected in both positive and negative ways, with the crisis creating both opportunities and threats for the collaborations between FinTech and banks. The aim of this study is to investigate the impact of FinTech products (FTPs) on commercial bank's performance in China. Required data are collected with a quantitative approach and two self-designed questionnaires were distributed to customers and employees of commercial banks in China. The gathered data were examined using the structural equation modeling technique. The results of this study reveal that the perceived usefulness (PU) of FTPs has positive and significant impacts on customer satisfaction, low expectation of bank employee assistance, bank's service quality and employee work efficiency. Additionally, the perceived difficulty of use (PD) of FTPs has negative and significant impacts on customer satisfaction and low expectation of assistance. Interestingly, there is a positive and significant relationship between PD and banks' service quality and work efficiency, meaning that the service quality and work efficiency can reduce some shortcomings of using FTPs. This study recognizes the need to enhance the understanding of FTPs on non-financial firm performance. This is the first study that helps commercial banks in China understand the perception of FTPs from both customer and employee perspectives.",
        "DOI": "10.1016/j.techfore.2021.120645",
        "paper_author": "Chen X.",
        "affiliation_name": "Teesside University Business School",
        "affiliation_city": "Middlesbrough",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60159937",
        "affiliation_state": "North Yorkshire"
    },
    {
        "paper_title": "Sustainable vehicle routing problem for coordinated solid waste management",
        "publication": "Journal of Industrial Information Integration",
        "citied_by": "128",
        "cover_date": "2021-09-01",
        "Abstract": "The quick growth of urbanization and population, as well as the transformation of industrial and materials, have pushed the management of municipal solid waste into a crisis especially for developing markets based on the grand challenge of sustainable development. The compounding complexity of the multiple objectives and dynamic problem constraints required to represent coordinated solid waste management (CSWM) problem in practice is a hugely significant issue for vehicle routing problem studies. The purpose is to introduce a new coordinated framework for a practical and efficient vehicle routing problem considering the triple bottom line of sustainability. The CSWM multiple objective functions applied in this study incorporate financial, environmental and social considerations to develop a sustainable vehicle routing problem considering heterogeneous vehicle fleets operating across a multi-echelon logistics network with the optimization goals. An entirely novel development and application of the adaptive memory social engineering optimizer (AMSEO) is introduced and is shown to perform significantly better than the simulated annealing (SA) as well as the social engineering optimizer (SEO) itself. Finally, the potential overall waste disposal cost savings achievable through increased recycling (revealed by framing the logistics problem across several echelons) is of particular significance. The main findings are the practical solutions with the use of sustainability goals for the CSWM and further application and development of the AMSEO in the routing optimization.",
        "DOI": "10.1016/j.jii.2021.100220",
        "paper_author": "Mojtahedi M.",
        "affiliation_name": "UNSW Sydney",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60028333",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Auditing in times of social distancing: the effect of COVID-19 on auditing quality",
        "publication": "International Journal of Accounting and Information Management",
        "citied_by": "126",
        "cover_date": "2021-02-15",
        "Abstract": "Purpose: This paper aims to discuss the theoretical impact of COVID-19 social distancing outbreak on audit quality. Design/methodology/approach: This paper uses a desk study method to explore the possible impact of COVID-19 crisis on five key considerations for audit quality during the pandemic. These include audit fees, going concern assessment, auditor human capital, audit procedures and audit personnel salaries. Findings: As many believe that the COVID-19 outbreak is as yet not a financial crisis, the authors, on the contrary, believe that the effects of the COVID-19 pandemic would be the toughest challenge for auditors and their clients since the 2007–2008 global financial crisis. Specifically, the authors believe that the COVID-19 social distancing can largely affect audit fees, going concern assessment, audit human capital, audit procedures, audit personnel salaries and audit effort, which ultimately can pose a severe impact on audit quality. Practical implications: Due to the implementations of work-from-home strategy, audit firms are highly recommended to invest more in digital programs, including artificial intelligence, blockchain, network security and data function development. This can help them to be more adaptable to working from home experience, which is ultimately expected to enhance the effectiveness and the flexibility of communication between auditors and their clients. Also, the authors recommend stock markets and other governmental bodies to provide temporary relaxations in compliance requirements to corporations. This procedure is expected to help firms that apply work-from-home strategy to report better earnings figures, which is appeared to be positively associated with audit quality. Originality/value: To date, to the best of the authors’ knowledge, there is no academic study that explores the potential impact of the COVID-19 outbreak on audit quality. This paper, therefore, fills an important research gap in the auditing literature. In addition, this paper can be used as a base to construct a research instrument (e.g. questionnaire or interviews) to provide empirical evidence on the potential impact of COVID-19 on audit quality.",
        "DOI": "10.1108/IJAIM-08-2020-0128",
        "paper_author": "Albitar K.",
        "affiliation_name": "Faculty of Business and Law",
        "affiliation_city": "Portsmouth",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60170563",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Determinants of Spillovers between Islamic and Conventional Financial Markets: Exploring the Safe Haven Assets during the COVID-19 Pandemic",
        "publication": "Finance Research Letters",
        "citied_by": "124",
        "cover_date": "2021-11-01",
        "Abstract": "We analyse the impact of the COVID-19 pandemic on the spillovers between conventional and Islamic stock and bond markets. We further analyse comparatively whether gold, oil, Bitcoin prices, and the risk measures VIX and EPU indexes affect the relationships between these different markets during the COVID-19 pandemic outbreak. The results show that the Islamic bonds (Sukuk) demonstrate safe haven properties during this pandemic crisis, while the spillovers between conventional and Islamic stock markets become stronger during the pandemic outbreak. COVID-19, Oil and gold are strong predictors of the conventional-Islamic markets spillovers, while Bitcoin is not a significant determinant of these relationships.",
        "DOI": "10.1016/j.frl.2021.101979",
        "paper_author": "Yarovaya L.",
        "affiliation_name": "Southampton Business School",
        "affiliation_city": "Southampton",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60176937",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Vertical financial disparity, energy prices and emission reduction: Empirical insights from Pakistan",
        "publication": "Journal of Environmental Management",
        "citied_by": "123",
        "cover_date": "2021-09-15",
        "Abstract": "The economic and environmental aspects of energy production have become important due to the increasing complexity energy sector and envoirnmental pollution, warranting to test the connection between financial imbalances, energy prices and carbon emission. The study aims to test the impact of vertical fiscal imbalances (VFI) on energy prices and carbon emission trends by considering the dual-perspectives of environmental regulation and industrial structure. The empirical outcomes indicated that vertical fiscal imbalances limited the environmental quality of Pakistan. Furthermore, VFI also caused environmental degradation by affecting industrial structure. VFI inhibits the intensity of environmental regulation, promotes the upgrade of industrial structures, both of which cause additional carbon emissions. The study suggest to energy ministries and energy regulation offices to revisit the machinism of energy prices determination and revised machanisim should provide a user-friendly assessment to understand the actual costs associated with the rising concern of environmental pollution. By this, envoirnmental protection maximization and optimal energy conservation is expacted to increase. Based on empirical findings, the study extends the suggestion that vertical fiscal imbalances should be considered an active indicator by the key policy makers and other stakeholders for energy prices determination and environmental quality upgradation.",
        "DOI": "10.1016/j.jenvman.2021.112946",
        "paper_author": "Li W.",
        "affiliation_name": "Zhejiang International Studies University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60108785",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Spillovers in higher moments and jumps across US stock and strategic commodity markets",
        "publication": "Resources Policy",
        "citied_by": "123",
        "cover_date": "2021-08-01",
        "Abstract": "This paper examines the dynamics of spillover effects on realized estimators of return distributions across US stock, crude oil and gold markets. Using 5-min data from April 11, 2006 to April 29, 2019, daily realized volatility, realized skewness, realized kurtosis, and jumps are computed. The dynamics of spillovers are revealed using the time-varying parameter vector autoregression (TVP-VAR) model, which reflects the way spillovers are shaped by various crisis periods. The results show that all spillovers seem to intensify during crisis periods. Besides the importance of realized volatility spillovers, spillovers in skewness, kurtosis and jumps are notable, although realized volatility spillovers are relatively stronger. Specifically for realized volatility and kurtosis, the stock index is the main net transmitter, whereas for realized skewness and jumps, oil is the main net transmitter. Gold is a net receiver of all realized higher moments and jumps. The findings suggest the utility of considering spillovers of higher moments and jumps when studying US stock, crude oil, and gold markets, which has implications for portfolio and risk management.",
        "DOI": "10.1016/j.resourpol.2021.102060",
        "paper_author": "Bouri E.",
        "affiliation_name": "Adnan Kassar School of Business",
        "affiliation_city": "Beirut",
        "affiliation_country": "Lebanon",
        "affiliation_id": "60199553",
        "affiliation_state": "Beirut Governorate"
    },
    {
        "paper_title": "Mental health concerns during the COVID-19 pandemic as revealed by helpline calls",
        "publication": "Nature",
        "citied_by": "122",
        "cover_date": "2021-12-02",
        "Abstract": "Mental health is an important component of public health, especially in times of crisis. However, monitoring public mental health is difficult because data are often patchy and low-frequency1–3. Here we complement established approaches by using data from helplines, which offer a real-time measure of ‘revealed’ distress and mental health concerns across a range of topics4–9. We collected data on 8 million calls from 19 countries, focusing on the COVID-19 crisis. Call volumes peaked six weeks after the initial outbreak, at 35% above pre-pandemic levels. The increase was driven mainly by fear (including fear of infection), loneliness and, later in the pandemic, concerns about physical health. Relationship issues, economic problems, violence and suicidal ideation, however, were less prevalent than before the pandemic. This pattern was apparent both during the first wave and during subsequent COVID-19 waves. Issues linked directly to the pandemic therefore seem to have replaced rather than exacerbated underlying anxieties. Conditional on infection rates, suicide-related calls increased when containment policies became more stringent and decreased when income support was extended. This implies that financial relief can allay the distress triggered by lockdown measures and illustrates the insights that can be gleaned from the statistical analysis of helpline data.",
        "DOI": "10.1038/s41586-021-04099-6",
        "paper_author": "Brülhart M.",
        "affiliation_name": "Université de Lausanne (UNIL)",
        "affiliation_city": "Lausanne",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60000239",
        "affiliation_state": "VD"
    },
    {
        "paper_title": "Impact of the coronavirus (COVID-19) pandemic on scientific research and implications for clinical academic training – A review",
        "publication": "International Journal of Surgery",
        "citied_by": "122",
        "cover_date": "2021-02-01",
        "Abstract": "A pneumonia outbreak of unknown aetiology emerged in Wuhan, China in December 2019. The causative organism was identified on 7th January 2020 as a novel coronavirus (nCoV or 2019-nCoV), later renamed severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). The resulting coronavirus disease (COVID-19) has infected over 88 million individuals, resulted in over 1.9 million deaths, and has led to an unprecedented impact on research activities worldwide. Extraordinary challenges have also been imposed on medical and surgical trainees following redeployment to full-time clinical duties. Moreover, the introduction of travel restrictions and strict lockdown measures have forced the closure of many institutions and laboratories working on research unrelated to the pandemic. The lockdown has similarly stifled supply chains and slowed research and development endeavours, whilst research charities have endured significant financial strains that have since reshaped the allocation and availability of funds. However, worldwide scientific adaptation to the COVID-19 pandemic has been observed through unprecedented levels of international collaboration alongside the uprise of remote telecommunication platforms. Although the long-term consequence of the COVID-19 pandemic on research and academic training is difficult to ascertain, the current crises will inevitably shape working and teaching patterns for years to come. To this end, we provide a comprehensive and critical evaluation of the impact of COVID-19 on scientific research and funding, as well as academic medical and surgical training.",
        "DOI": "10.1016/j.ijsu.2020.12.008",
        "paper_author": "Sohrabi C.",
        "affiliation_name": "Barts Health NHS Trust",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60159931",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Time to integrate global climate change and biodiversity science-policy agendas",
        "publication": "Journal of Applied Ecology",
        "citied_by": "120",
        "cover_date": "2021-11-01",
        "Abstract": "There is an increasing recognition that, although the climate change and biodiversity crises are fundamentally connected, they have been primarily addressed independently and a more integrated global approach is essential to tackle these two global challenges. Nature-based Solutions (NbS) are hailed as a pathway for promoting synergies between the climate change and biodiversity agendas. There are, however, uncertainties and difficulties associated with the implementation of NbS, while the evidence regarding their benefits for biodiversity remains limited. We identify five key research areas where incomplete or poor information hinders the development of integrated biodiversity and climate solutions. These relate to refining our understanding of how climate change mitigation and adaptation approaches benefit biodiversity conservation; enhancing our ability to track and predict ecosystems on the move and/or facing collapse; improving our capacity to predict the impacts of climate change on the effectiveness of NbS; developing solutions that match the temporal, spatial and functional scale of the challenges; and developing a comprehensive and practical framework for assessing, and mitigating against, the risks posed by the implementation of NbS. Policy implications. The Conference of the Parties (COP) for the United Nations Framework Convention on Climate Change (COP26) and the Convention on Biological Diversity (COP15) present a clear policy window for developing coherent policy frameworks that align targets across the nexus of biodiversity and climate change. This window should (a) address the substantial and chronic underfunding of global biodiversity conservation, (b) remove financial incentives that negatively impact biodiversity and/or climate change, (c) develop higher levels of integration between the biodiversity and climate change agendas, (d) agree on a monitoring framework that enables the standardised quantification and comparison of biodiversity gains associated with NbS across ecosystems and over time and (e) rethink environmental legislation to better support biodiversity conservation in times of rapid climatic change.",
        "DOI": "10.1111/1365-2664.13985",
        "paper_author": "Pettorelli N.",
        "affiliation_name": "Zoological Society of London Institute of Zoology",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60005453",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Hedging stocks with oil",
        "publication": "Energy Economics",
        "citied_by": "120",
        "cover_date": "2021-01-01",
        "Abstract": "We study the feasibility of hedging stocks with oil. The Dynamic Conditional Correlation (DCC) approach allows for the calculation of optimal hedge ratios and corresponding hedge portfolio returns. Our results show that there are distinct economic benefits from hedging stocks with oil, although the effectiveness of hedging is both time-varying and market-state-dependent. The event of the Global Financial Crisis (GFC) is shown to affect the effectiveness of hedging. During the GFC, a positive jump in the hedge ratios occurs and hedge effectiveness increases. Among a set of common financial and macroeconomic drivers, we identify the implied volatility index VIX as being the most important. During times of global financial uncertainty, investors reduce stock positions more than commodity positions, thus VIX shocks negatively affect the portfolio returns of stock-oil hedges. The results also show that an appreciation of the U.S. dollar against the euro is associated with reduced hedge portfolio returns. From the GFC onwards, we document an increased significance of the gold price and the term spread in explaining hedge portfolio returns.",
        "DOI": "10.1016/j.eneco.2019.06.007",
        "paper_author": "Batten J.A.",
        "affiliation_name": "Universiti Utara Malaysia",
        "affiliation_city": "Sintok",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60002763",
        "affiliation_state": "Kedah"
    },
    {
        "paper_title": "Effects of the COVID-19 pandemic on the US stock market and uncertainty: A comparative assessment between the first and second waves",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "118",
        "cover_date": "2021-06-01",
        "Abstract": "This paper makes the first comparative assessment of the impacts of the first and second waves of the ongoing COVID-19 pandemic for the US stock market and its uncertainty. To this end, we investigate the dynamic conditional correlation and the asymmetric impacts of shocks on the correlation between the US and Chinese stock markets before and during the COVID-19 crisis. Furthermore, we analyze and compare the relationship between the COVID-19 pandemic and US returns and uncertainty during the first and second waves of the pandemic. First, we find that the dynamic correlation approach supports the presence of volatility spillovers (contagion effects) between the two stock markets, especially during the rapid spread phase of COVID-19 in the US. Second, the analysis of news impact correlation surfaces shows that the shocks to the US and Chinese markets have asymmetric effects on the correlation between the two markets. Finally, we find a persistent link between US returns, uncertainty, and the COVID-19 pandemic during the first and second waves of the outbreak. Our results prove that the pandemic has shown harmful consequences for financial markets in general and the US economy in particular.",
        "DOI": "10.1016/j.techfore.2021.120710",
        "paper_author": "Yousfi M.",
        "affiliation_name": "Université de Sousse",
        "affiliation_city": "Sousse",
        "affiliation_country": "Tunisia",
        "affiliation_id": "60058071",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "COVID-19 and a justice framework to guide tourism recovery",
        "publication": "Annals of Tourism Research",
        "citied_by": "118",
        "cover_date": "2021-11-01",
        "Abstract": "NA",
        "DOI": "10.1016/j.annals.2021.103161",
        "paper_author": "Rastegar R.",
        "affiliation_name": "The University of Queensland Business School",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60160279",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Parental stress, food parenting practices and child snack intake during the COVID-19 pandemic",
        "publication": "Appetite",
        "citied_by": "118",
        "cover_date": "2021-06-01",
        "Abstract": "Background: The coronavirus disease 2019 (COVID-19) pandemic has caused unprecedented disruptions to the lives of families. This study aimed to investigate the impact of pandemic-associated stress on food parenting practices including interactions surrounding snacks, and child diet. Methods: Parents (N = 318) of 2–12-year old children completed a cross-sectional online survey assessing current COVID-19-specific stress, pre-COVID-19 stress, financial stress (e.g. food insecurity), food parenting practices, and child snack intake frequency. Structural Equation Modeling was used to model simultaneous paths of relationships and test direct and indirect effects. Results: Stress, including financial hardship, was higher compared with before the crisis. The majority of children had regular mealtimes and irregular snack times. Higher COVID-19-specific stress was associated with more non-nutritive use of food and snacks (e.g. emotional and instrumental feeding), but also more structure and positive interactions (e.g. eating with or engaging with child around mealtimes). Higher COVID-19-specific stress was also associated with greater child intake frequency of sweet and savory snacks, with some evidence for mediation by snack parenting practices. Conclusion: Our findings indicate that stress associated with the COVID-19 pandemic may be linked to child snack intake with potential impacts on child obesity risk, and suggest several modifiable points of intervention within the family context.",
        "DOI": "10.1016/j.appet.2021.105119",
        "paper_author": "Jansen E.",
        "affiliation_name": "Johns Hopkins University School of Medicine",
        "affiliation_city": "Baltimore",
        "affiliation_country": "United States",
        "affiliation_id": "60001117",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "Poverty, Racism, and the Public Health Crisis in America",
        "publication": "Frontiers in Public Health",
        "citied_by": "117",
        "cover_date": "2021-09-06",
        "Abstract": "The purpose of this article is to discuss poverty as a multidimensional factor influencing health. We will also explicate how racism contributes to and perpetuates the economic and financial inequality that diminishes prospects for population health improvement among marginalized racial and ethnic groups. Poverty is one of the most significant challenges for our society in this millennium. Over 40% of the world lives in poverty. The U.S. has one of the highest rates of poverty in the developed world, despite its collective wealth, and the burden falls disproportionately on communities of color. A common narrative for the relatively high prevalence of poverty among marginalized minority communities is predicated on racist notions of racial inferiority and frequent denial of the structural forms of racism and classism that have contributed to public health crises in the United States and across the globe. Importantly, poverty is much more than just a low-income household. It reflects economic well-being, the ability to negotiate society relative to education of an individual, socioeconomic or health status, as well as social exclusion based on institutional policies, practices, and behaviors. Until structural racism and economic injustice can be resolved, the use of evidence-based prevention and early intervention initiatives to mitigate untoward effects of socioeconomic deprivation in communities of color such as the use of social media/culturally concordant health education, social support, such as social networks, primary intervention strategies, and more will be critical to address the persistent racial/ethnic disparities in chronic diseases.",
        "DOI": "10.3389/fpubh.2021.699049",
        "paper_author": "Beech B.M.",
        "affiliation_name": "Tilman J. Fertitta Family College of Medicine",
        "affiliation_city": "Houston",
        "affiliation_country": "United States",
        "affiliation_id": "60126108",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Corporate Social Responsibility Amid Social Distancing During the COVID-19 Crisis: BRICS vs. OECD Countries",
        "publication": "Research in International Business and Finance",
        "citied_by": "117",
        "cover_date": "2021-01-01",
        "Abstract": "This paper compares today's corporate management in developing markets (BRICS countries) vs. developed markets (the OECD countries). The influence of determining a new social corporate management season considering social distancing amid the COVID-19 pandemic on emerging markets' economic growth is ascertained and set apart from corporate management in developing markets. This paper helps clarifying and better understanding the role of corporate social responsibility in the conditions of an economic crisis against the background of the COVID-19 pandemic. This work provides scientific arguments that allow solving critical discussions regarding the advantages (growth of quality of life, an increase of business's competitiveness) and costs (limitation of economic growth, non-commercial use of profit, and increased price for goods and services) of domestic production and consumption. In the long-term, responsible financial practices return all investments and allow countries to better cope with a crisis. The research supplies a new view of corporate social responsibility as a measure of crisis management. It reflects its advantages at a time of social distancing in the conditions of the COVID-19 pandemic. The institutionalization of corporate social responsibility in emerging countries is not predetermined by internal factors (approach to doing business or organizational culture), if not by external factors (market status, state regulation, and consumer awareness). These circumstances prove the high complexity of strengthening corporate social responsibility in developing countries. In the conditions of social distancing – due to the COVID-19 pandemic – corporate social responsibility goes to a new level. In both developing and developed countries, one of the most widespread manifestations of corporate social responsibility is the entrepreneurship's transition to the remote form of activities. This envisages the provision of remote employment for workers and the online purchase of goods and services for consumers.",
        "DOI": "10.1016/j.ribaf.2020.101315",
        "paper_author": "Popkova E.",
        "affiliation_name": "Moscow State Institute of International Relations (MGIMO)",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60032576",
        "affiliation_state": "Moscow Oblast"
    },
    {
        "paper_title": "The coronavirus (COVID-19) pandemic: challenges among Iranian startups",
        "publication": "Journal of Small Business and Entrepreneurship",
        "citied_by": "116",
        "cover_date": "2021-01-01",
        "Abstract": "The coronavirus outbreak has become a global issue with significant effects on capital markets, and the global economy; its impacts are estimated to be even more than the previous global recessions. In this interim, due to the impacts of this pandemic, startups are more prone to fail or succeed faster than ever before; however, the challenges they face are not yet clearly scrutinized, as the pandemic was faster than scholars. This study therefore investigates the main challenges of Iranian startups by interviewing the co-founders of fifteen well-known startups. The findings are analyzed through two-step coding, and findings were discussed in a focus group session to which startup co-founders, policymakers, and scholars were invited. It was revealed that there are six principal types of challenges to be addressed, including financial, human resources management, support measures and mechanisms, marketing, crisis management, as well as some others.",
        "DOI": "10.1080/08276331.2020.1821158",
        "paper_author": "Salamzadeh A.",
        "affiliation_name": "University of Tehran",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60022927",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Oil prices and agricultural commodity markets: Evidence from pre and during COVID-19 outbreak",
        "publication": "Resources Policy",
        "citied_by": "114",
        "cover_date": "2021-10-01",
        "Abstract": "This paper represents an analysis of the spillover effects and time-frequency connectedness between crude oil prices and agricultural commodity markets using both the spillover index of Diebold and Yilmaz (2012) and the wavelet coherence model to evaluate whether the time-varying return spillover index exhibited the intensity and direction of transmission during the Covid-19 outbreak. Overall, the current results shed light on that in comparison with the pre-Covid-19 period, and the return spillover is more apparent during the Covid-19 crisis. However, levels of the intensity of this relationship vary through the period of research, with several intervals witnessing both negative and positive interactions. Further, our findings indicate significant heterogeneity among agriculture commodity markets in the degree of spillover to crude oil prices over time, amplifying our understanding of the economic channels through which the agriculture commodity markets are correlated. More importantly, there exist significant dependent patterns about the information spillovers across the crude oil and agriculture commodity markets might provide prominent implications for portfolio managers, investors, and government agencies.",
        "DOI": "10.1016/j.resourpol.2021.102236",
        "paper_author": "Hung N.T.",
        "affiliation_name": "University of Finance - Marketing",
        "affiliation_city": "Ho Chi Minh City",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60113436",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Learning experiences of women entrepreneurs amidst COVID-19",
        "publication": "International Journal of Gender and Entrepreneurship",
        "citied_by": "113",
        "cover_date": "2021-01-01",
        "Abstract": "Purpose: COVID-19 pandemic triggered unexpected crises, which were beyond the imaginations of a common man. It changed the order of routine life and the business world. In this challenging condition, the survival of the small business was at high risk. Following experiential learning theory, the purpose of this paper is to explore women's entrepreneurial learning obtained during the COVID-19 pandemic, the challenges experienced by them and strategies undertaken to transform businesses. Design/methodology/approach: To explore Pakistani women entrepreneurs' lived experiences and learning during the COVID-19, researchers used a qualitative interview design. The interviewees reported their experiences about the effects of COVID-19 on their business and entrepreneurial learning from such a crisis. Findings: The findings of the study indicate new fractions of knowledge from the novel learning of the female entrepreneurs throughout the experience of the COVID-19. The transformation from manual business dealings and financial transactions to virtual dealing and the online transaction was the addition of novel learning. Furthermore, the analysis provides insights into the challenges experienced by women entrepreneurs, strategies undertaken and lessons learned from COVID-19. The life lessons learned showed the importance of technical skills and their business operations during the crisis. Research limitations/implications: This study is very specific in its context and limitations of this study offers new avenue for research to extend study in different perspectives. First, interviews were conducted from women entrepreneurs running businesses in sub-urban cities of Pakistan, where study can be extended to include both male and female in a comparative study which can expose new dimensions. Second, this study is conducted in the sub-urban areas of the Sindh province of Pakistan, which can be extended to other areas of the country because Pakistan is multicultural and multilingual, which offer different gender specific factors for entrepreneurial activities in general terms but in case of the Covid-19 situation, there exists great variations and social stratifications. Third, this study can be extended to other developing or developed countries or comparative study can provide a new flavor of knowledge. Practical implications: The study's finding offers few implications for the entrepreneurs, societies and government at large. Although the pandemic crisis has had devastating effects on health and lifestyle activities, there is always a ray of coming to innovative approaches to fulfill the entrepreneurial desires and serve the community. Thus, entrepreneurs are encouraged to contribute to the economy as a part of society through their sustainable products and services for the greater good. There is also a need for some social policies to find entrepreneurial ways to deal with the COVID-19 crisis that integrates value co-creation for society (Ratten, 2020b). Government and society should also intervene and play their role to encourage women entrepreneurs to feel a sense of empowerment, contribute to family income, alleviate poverty, create jobs and help in economic growth. Originality/value: This study's unique contribution and origin are to explore the COVID-19-related entrepreneurial learning experiences of women entrepreneurs in a developing country (Pakistan). Moreover, this study theoretically contributes to the development of experiential learning theory by expanding its insights during COVID-19.",
        "DOI": "10.1108/IJGE-09-2020-0153",
        "paper_author": "Afshan G.",
        "affiliation_name": "Sukkur IBA University",
        "affiliation_city": "Sukkur",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60166774",
        "affiliation_state": "Sindh"
    },
    {
        "paper_title": "Perceptions of cruise travel during the COVID-19 pandemic: Market recovery strategies for cruise businesses in North America",
        "publication": "Tourism Management",
        "citied_by": "112",
        "cover_date": "2021-08-01",
        "Abstract": "The study aims to identify consumer perceptions of the cruise industry amid the COVID-19 pandemic and seeks to provide market recovery strategies for cruise businesses. The relationship between perceptions among cruise experience and COVID-19 financial status groups were explored. The results of analyses of data from 759 respondents indicated that travel constraints negatively influence behavioral intention through negativity bias. Further, perceived crisis management positively affects behavioral intention through attitude-trust. New consumers’ behavioral intention is significantly affected by the negativity bias, and the perceived crisis management manipulates the trust of financial-affected consumers.",
        "DOI": "10.1016/j.tourman.2020.104275",
        "paper_author": "Pan T.",
        "affiliation_name": "University of Florida",
        "affiliation_city": "Gainesville",
        "affiliation_country": "United States",
        "affiliation_id": "60013959",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "Analyzing the characteristics of green bond markets to facilitate green finance in the post-covid-19 world",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "111",
        "cover_date": "2021-05-02",
        "Abstract": "The COVID-19 pandemic and the global recessions have reduced the investments in green projects globally that would endanger the achievement of the climate-related goals. Therefore, the post-COVID-19 world needs to adopt the green financial system by introducing new financial instruments. In this regard, green bonds—a type of debt instrument aiming to finance sustainable infrastructure projects—are growing in popularity. While the literature does not contest their effectiveness in fighting climate change, research highlights the high level of risks and low returns associated with this instrument. This study analyzes the green bond markets in different regions with a focus on Asia and the Pacific. It aims to fill the gap in the literature by conducting a comparative study of the characteristics, risks, and returns of green bonds based on the region. The study is based on theoretical background and empirical analysis using the data retrieved from Bloomberg New Energy Finance and the Climate Bonds Initiative. The empirical results are based on several econometrics tests using panel data analysis estimation methods, namely pooled ordinary least squares and generalized least squares random effects estimator. Our findings prove that green bonds in Asia tend to show higher returns but higher risks and higher heterogeneity. Generally, the Asian green bonds market is dominated by the banking sector, representing 60% of all issuance. Given that bonds issued by this sector tend to show lower returns than average, we recommend policies that could increase the rate of return of bonds issued by the banking sector through the use of tax spillover. In the era of post-COVID-19, diversification of issuers, with higher participation from the public sector and de-risking policies, could also be considered.",
        "DOI": "10.3390/su13105719",
        "paper_author": "Taghizadeh-Hesary F.",
        "affiliation_name": "Tokai University",
        "affiliation_city": "Tokyo",
        "affiliation_country": "Japan",
        "affiliation_id": "60009885",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Business risk and the emergence of climate analytics",
        "publication": "Nature Climate Change",
        "citied_by": "110",
        "cover_date": "2021-02-01",
        "Abstract": "Emerging awareness of climate-related financial risk has prompted efforts to integrate knowledge of climate change risks into financial decision-making and disclosures. Assessment of future climate risk requires knowledge of how the climate will change on time and spatial scales that vary between business entities. The rules by which climate science can be used appropriately to inform assessments of how climate change will impact financial risk have not yet been developed. In this Perspective, we summarize the demands by the business and finance community for reliable climate information, and the potential and limitations of such information in the context of what climate models can and cannot currently provide.",
        "DOI": "10.1038/s41558-020-00984-6",
        "paper_author": "Fiedler T.",
        "affiliation_name": "The University of Sydney Business School",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60212023",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Does Energy Productivity and Technological Innovation Limit Trade-Adjusted Carbon Emissions?",
        "publication": "Economic Research-Ekonomska Istrazivanja",
        "citied_by": "109",
        "cover_date": "2021-01-01",
        "Abstract": "The present study aims to examine the effect of energy productivity, international trade, especially by treating exports and imports distinctly with technological innovation and gross domestic product on Consumption-based Carbon emissions for G-7 countries over the period of 1996–2017. This study employed cross-section dependence and slope heterogeneity for evaluating the order of unit root. The cross-sectionally augmented autoregressive distributed lags model (CS-ARDL) is used for evaluating long and short-run relationships among variables; and an augmented mean group and a common correlated mean group test to check for robustness. The findings confirm cointegration relationships with structural breaks (e.g., the 2001 mild recession; the 2008 global financial crisis; the 2011 stock market decline; and the 2014 exports decline in Italy, France, the United Kingdom and Japan) among consumption based carbon emission, energy productivity, exports, imports, gross domestic product, and technological innovation. Further, energy productivity, exports and technological innovation are inversely related to consumption based carbon emission while imports and gross domestic product are positively associated with consumption-based carbon emissions for G-7 countries. The findings recommend the promotion of technological innovation and cleaner production for curbing consumption-based carbon emissions.",
        "DOI": "10.1080/1331677X.2020.1860111",
        "paper_author": "Wahab S.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Social policy in the face of a global pandemic: Policy responses to the COVID-19 crisis",
        "publication": "Social Policy and Administration",
        "citied_by": "108",
        "cover_date": "2021-03-01",
        "Abstract": "How have welfare states responded to the coronavirus pandemic? In this introductory article, we provide a synopsis of papers that comprise this special issue on social policy responses to COVID-19, an overview of some of the key questions they raise, and some provisional answers to these questions. Our conclusions are threefold: first, these social policy responses, while entailing new developments in many countries, nonetheless reflect, at least in part, existing national policy legacies. Second, these responses can be understood as a form of “emergency Keynesianism,” which is characterized by the massive use of deficit spending during economic crises, with the aim of to supporting rather than challenging core capitalist institutions. Third, there are clear differences in terms of the nature of the reforms enacted during the initial phase of the COVID-19 crisis as compared to reforms enacted as a response to the 2008 financial crisis.",
        "DOI": "10.1111/spol.12718",
        "paper_author": "Béland D.",
        "affiliation_name": "Université McGill",
        "affiliation_city": "Montreal",
        "affiliation_country": "Canada",
        "affiliation_id": "60002494",
        "affiliation_state": "QC"
    },
    {
        "paper_title": "COVID-19 pandemic and stock market response: A culture effect",
        "publication": "Journal of Behavioral and Experimental Finance",
        "citied_by": "108",
        "cover_date": "2021-03-01",
        "Abstract": "National culture has been shown to impact the way investors, firm managers, and other financial market participants respond to crisis. To date, however, none has looked at the impact of culture on market responses to disasters. This paper is the first to address the effect of national culture on stock market responses to a global health disaster. We find larger declines and greater volatilities for stock markets in countries with lower individualism and higher uncertainty avoidance during the first three weeks after a country's first COVID-19 case announcement. Our results are robust after controlling for investor fear, cumulative infected cases, the stringency of government response policies, the level of democracy, political corruption, and the 2003 SARS experience, among others.",
        "DOI": "10.1016/j.jbef.2020.100454",
        "paper_author": "Fernandez-Perez A.",
        "affiliation_name": "Auckland University of Technology",
        "affiliation_city": "Auckland",
        "affiliation_country": "New Zealand",
        "affiliation_id": "60023760",
        "affiliation_state": "AUK"
    },
    {
        "paper_title": "Esg ratings and stock performance during the covid-19 crisis",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "107",
        "cover_date": "2021-07-01",
        "Abstract": "We investigate the association between Environmental, Social, and Governance (ESG) ratings and stock performance during the COVID-19 crisis. Although there is mixed evidence in the literature whether ESG is valuable in times of crisis, we find high ESG-rated European firms to be associated with higher abnormal returns and lower stock volatility. After decomposing ESG into its separate components, we find the social score to be the predominant driver of our results. Further, we argue that ESG is value-enhancing in low-trust countries, and in countries with poorer security regulations and where lower disclosure standards prevail.",
        "DOI": "10.3390/su13137133",
        "paper_author": "Engelhardt N.",
        "affiliation_name": "Technische Universität Dortmund",
        "affiliation_city": "Dortmund",
        "affiliation_country": "Germany",
        "affiliation_id": "60032991",
        "affiliation_state": "Nordrhein-Westfalen"
    },
    {
        "paper_title": "Exploring the role of islamic fintech in combating the aftershocks of covid-19: The open social innovation of the islamic financial system",
        "publication": "Journal of Open Innovation: Technology, Market, and Complexity",
        "citied_by": "105",
        "cover_date": "2021-06-01",
        "Abstract": "The purpose of the current study is to investigate the role of the Islamic financial system in recovery post-COVID-19 and the way Fintech can be utilized to combat the economic reverberations created by COVID-19. The global financial crisis of 2008 has established the credentials of the Islamic financial system as a sustainable financial system which can save the long run interests of the average citizens around the world while adding value to the real economy. The basic ethical tenets available in the Islamic financial system make it more suited and readymade to fight the economic aftershocks of a pandemic like COVID-19. The basic principles of ethical Islamic finance have solid connections to financial stability and corporate social responsibility within the wide-reaching business context. With the emergence of Financial technology (Fintech) it has provided a missing impetus to the Islamic financial system to compete on equal ground with its conventional counterpart and prove its mettle. The study uses discourse analysis along with the content analysis to extract content and draw a conclusion. The findings of the study indicate that COVID-19 pandemic has provided the opportunity for the social and open innovation to grow and finance world have turned to open innovation to provide a speedy, timely, reliable, and sustainable solution to the world. The findings of the study provide significant implications for governments and policy makers in efficient application of Fintech and innovative Islamic financial services to fight the economic consequences of the COVID-19 pandemic.",
        "DOI": "10.3390/joitmc7020136",
        "paper_author": "Rabbani M.R.",
        "affiliation_name": "University of Bahrain",
        "affiliation_city": "Zallaq",
        "affiliation_country": "Bahrain",
        "affiliation_id": "60000237",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Explaining the rise and fall of psychological distress during the COVID-19 crisis in the United States: Longitudinal evidence from the Understanding America Study",
        "publication": "British Journal of Health Psychology",
        "citied_by": "103",
        "cover_date": "2021-05-01",
        "Abstract": "Objectives: It has been shown that psychological distress rose rapidly as the COVID-19 pandemic emerged and then recovered to pre-crisis levels as social lockdown restrictions were eased in the United States. The aim of the current study was to investigate psychosocial and behavioural factors that may explain the rise and fall of distress during the initial months of the COVID-19 crisis. Design: This study examined six waves of longitudinal nationally representative data from the Understanding America Study (UAS) collected between March and June 2020 (N = 7,138, observations = 34,125). Methods: Mediation analysis was used to identify whether changes in distress (PHQ-4) during the COVID-19 pandemic were explained by the following factors: perceived infection risk and risk of death, perceived financial risks, lifestyle changes resulting from the virus, perceived discrimination related to the virus, and changes in substance use and employment status. Results: All mediating factors played a role in explaining changes in distress and together accounted for 70% of the increase in distress between 10-18 March and 1-14 April and 46.4% of the decline in distress between 1-14 April and early June 2020. Changes in perceived health risks were most important in explaining changes in distress followed by changes in lifestyle and the perceived financial risks associated with COVID-19. Conclusions: This study provides longitudinal population-based evidence detailing the mediating factors explaining changes in distress during the COVID-19 crisis. Perceived health risks associated with the virus may play a key role in explaining rising and falling levels of psychological distress during the COVID-19 pandemic.",
        "DOI": "10.1111/bjhp.12493",
        "paper_author": "Robinson E.",
        "affiliation_name": "University of Liverpool",
        "affiliation_city": "Liverpool",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020661",
        "affiliation_state": "Merseyside"
    },
    {
        "paper_title": "The Great Recession and Fertility in Europe: A Sub-national Analysis",
        "publication": "European Journal of Population",
        "citied_by": "103",
        "cover_date": "2021-03-01",
        "Abstract": "This study investigates how the changes in labour market conditions and economic growth were associated with fertility before and during the Great Recession in Europe in 2002–2014. In contrast to previous studies, which largely concentrated at the country level, we use data for 251 European regions in 28 European Union (EU) member states prior to the withdrawal of the United Kingdom in January 2020. We apply three-level growth-curve model which allows for a great deal of flexibility in modelling temporal change while controlling for variation in economic conditions across regions and countries. Our findings show that fertility decline was strongly related to unemployment increase; this relationship was significant at different reproductive ages. Deteriorating economic conditions were associated with a stronger decline in fertility during the economic recession as compared with the pre-recession period. This evidence suggests the salience of factors such as broader perception of uncertainty that we could not capture in our models and which rose to prominence during the Great Recession. Furthermore, strongest fertility declines were observed in Southern Europe, Ireland and parts of Central and Eastern Europe, i.e. countries and regions where labour market conditions deteriorated most during the recession period. In Western Europe, and especially in the Nordic countries, fertility rates were not closely associated with the recession indicators.",
        "DOI": "10.1007/s10680-020-09556-y",
        "paper_author": "Matysiak A.",
        "affiliation_name": "University of Warsaw",
        "affiliation_city": "Warsaw",
        "affiliation_country": "Poland",
        "affiliation_id": "60013756",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Anatomy of Corporate Borrowing Constraints",
        "publication": "Quarterly Journal of Economics",
        "citied_by": "102",
        "cover_date": "2021-02-01",
        "Abstract": "Macro-finance analyses commonly link firms' borrowing constraints to the liquidation value of physical assets. For U.S. nonfinancial firms, we show that 20% of debt by value is based on such assets (asset-based lending in creditor parlance), whereas 80% is based predominantly on cash flows from firms' operations (cash flow-based lending). A standard borrowing constraint restricts total debt as a function of cash flows measured using operating earnings (earnings-based borrowing constraints). These features shape firm outcomes on the margin: first, cash flows in the form of operating earnings can directly relax borrowing constraints; second, firms are less vulnerable to collateral damage from asset price declines, and fire sale amplification may be mitigated. Taken together, our findings point to new venues for modeling firms' borrowing constraints in macro-finance studies.",
        "DOI": "10.1093/qje/qjaa030",
        "paper_author": "Lian C.",
        "affiliation_name": "University of California, Berkeley",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60025038",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Can CSR Disclosure Protect Firm Reputation During Financial Restatements?",
        "publication": "Journal of Business Ethics",
        "citied_by": "102",
        "cover_date": "2021-09-01",
        "Abstract": "We investigate the effectiveness of corporate social responsibility (CSR) disclosure in protecting corporate reputation following financial restatements. As expected under legitimacy theory, firms can signal their legitimacy via nonfinancial disclosure after the negative effects of financial restatements. Our results show that restating firms make substantial improvements to overall CSR disclosure quality by changing their standalone reports to a more conservative tone, increasing readability and report length, even though they strategically disclose less forward-looking and sustainability-related content. Such improvements are more pronounced in restating firms with prior low-quality CSR disclosure. Moreover, restating firms with CSR disclosure have smaller forecast errors than non-CSR disclosers, yet the change in CSR disclosure after restatements does not further improve analyst forecast accuracy. Finally, we find that compared with nondisclosers, restating firms with CSR disclosure suffer smaller firm value losses. Overall, the evidence supports the view that consistent CSR reporting alleviates reputational damage and plays an insurance-like or value protection role during crisis periods.",
        "DOI": "10.1007/s10551-020-04527-z",
        "paper_author": "Zhang L.",
        "affiliation_name": "The UWA Business School",
        "affiliation_city": "Perth",
        "affiliation_country": "Australia",
        "affiliation_id": "60189723",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "‘Pandemia’: a reckoning of UK universities’ corporate response to COVID-19 and its academic fallout",
        "publication": "British Journal of Sociology of Education",
        "citied_by": "101",
        "cover_date": "2021-01-01",
        "Abstract": "Universities in the UK, and in other countries like Australia and the USA, have responded to the operational and financial challenges presented by the COVID-19 pandemic by prioritising institutional solvency and enforcing changes to the work practices and profiles of their staff. For academics, an adjustment to institutional life under COVID-19 has been dramatic and resulted in the overwhelming majority making a transition to prolonged remote-working. Many have endured significant work intensification; others have lost–or may soon lose–their jobs. The impact of the pandemic appears transformational and for the most part negative. This article reports the experiences of 1099 UK academics specific to the corporate response of institutional leadership to the COVID-19 crisis. We find articulated a story of universities in the grip of ‘pandemia’ and COVID-19 emboldening processes and protagonists of neoliberal governmentality and market reform that pay little heed to considerations of human health and well-being.",
        "DOI": "10.1080/01425692.2021.1937058",
        "paper_author": "Watermeyer R.",
        "affiliation_name": "University of Bristol",
        "affiliation_city": "Bristol",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020650",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of COVID-19 on households´ income in the EU",
        "publication": "Journal of Economic Inequality",
        "citied_by": "100",
        "cover_date": "2021-09-01",
        "Abstract": "This analysis makes use of economic forecasts for 2020 issued by the European Commission in Autumn 2019 and Spring 2020, and of a counterfactual under a no-policy change assumption, to analyse the impact of the COVID-19 crisis on EU households´ income. Additionally, our analysis assesses the cushioning effect of discretionary fiscal policy measures taken by the EU Member States. We find that the COVID-19 pandemic is likely to affect significantly households’ disposable income in the EU, with lower income households being more severely hit. However, our results show that due to policy intervention, the impact of the crisis is expected to be similar to the one experienced during the 2008–2009 financial crisis. In detail, our results indicate that discretionary fiscal policy measures will play a significant cushioning role, reducing the size of the income loss (from −9.3% to −4.3% for the average equivalised disposable income), its regressivity and mitigating the poverty impact of the pandemic. We conclude that policy interventions are therefore instrumental in cushioning against the impact of the crisis on inequality and poverty.",
        "DOI": "10.1007/s10888-021-09485-8",
        "paper_author": "Almeida V.",
        "affiliation_name": "European Commission Joint Research Centre",
        "affiliation_city": "Brussels",
        "affiliation_country": "Belgium",
        "affiliation_id": "60103695",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The analysis of investment into industries based on portfolio managers",
        "publication": "Acta Montanistica Slovaca",
        "citied_by": "99",
        "cover_date": "2021-01-01",
        "Abstract": "The main goal of each investor when investing capital is to recover funds. The current market brings unlimited opportunities in creating an investment strategy. This strategy is highly dependent on the investor's preferences, his attitude to risk, financial capacity, expected return, self-interest, and many other factors that determine what is best for the investor. For this reason, the submitted work concerns investors who will comply with strict restrictions. In this way, an investment strategy for a selected group of investors can be created. The paper focuses on investors in Slovakia. The art of investment decisions to make the greatest possible return is portfolio management. The studies presented in this work are designed to explore different models and to achieve investor goals to maximise their investment and minimise risk. Investing is a systematic and long-term process where the investor gives up part of his free funds to increase their value and collect the return for them in the future. Investing is effective only if it follows certain rules. Sending a monthly deposit with iron regularity is, in the event of a recession and crisis, the only guarantee of achieving the desired future goal of investing. Mutual funds are a simple way of collective investment, where a person collects money from investors and invests in various assets such as stocks, government bonds, currencies, commodities. Profits from the investment are distributed to all investors who contributed to the fund. These funds are professionally managed by investment specialists based on their market knowledge. A share is equity security representing an equity interest in a joint-stock company. Monetary policy and financial stress significantly affect the ability of the actively managed fund's performance vis-a-vis ETFs performance. This fact must be stated as this is a limitation of the analysis in the presented paper.",
        "DOI": "10.46544/AMS.v26i1.14",
        "paper_author": "Pavolová H.",
        "affiliation_name": "Technická Univerzita v Košiciach",
        "affiliation_city": "Kosice",
        "affiliation_country": "Slovakia",
        "affiliation_id": "60026260",
        "affiliation_state": "Kosice Region"
    },
    {
        "paper_title": "Are safe haven assets really safe during the 2008 global financial crisis and COVID-19 pandemic?",
        "publication": "Global Finance Journal",
        "citied_by": "98",
        "cover_date": "2021-11-01",
        "Abstract": "This study evaluates the safe-haven role of twelve assets against the US stock market during the 2008 global financial crisis (GFC) and the COVID-19 pandemic. Our results show that silver and the Islamic stock index were safe havens during the 2008 GFC, and the Islamic stock index and Tether have been safe havens during COVID-19. We observe that the Islamic stock index and Tether have emerged as strong new safe havens. However, our supplementary analysis reveals that gold and Bitcoin still exhibit safe-haven behavior during severe market downturns. Overall, our findings suggest that safe-haven assets may vary over time.",
        "DOI": "10.1016/j.gfj.2021.100668",
        "paper_author": "Hasan M.B.",
        "affiliation_name": "Islamic University, Kushtia",
        "affiliation_city": "Kushtia",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60028961",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of COVID-19 news, panic and media coverage on the oil and gold prices: An ARDL approach",
        "publication": "Resources Policy",
        "citied_by": "98",
        "cover_date": "2021-08-01",
        "Abstract": "This study investigates whether COVID-19 news, panic and media coverage affect oil and gold prices. Using the ARDL approach over the period January 23, 2020 to June 23, 2020, we find that COVID-19 deaths and panic have negative effects on crude oil price. However, the propaganda created by the media in the long term has a negative impact on oil price. The empirical results show that the COVID-19 new infections, deaths and media coverage have positive effects on the gold price. Our findings prove that oil price is sensitive to bad news unlike gold price. According to our study, gold, which is a hedge against economic and geopolitical crises, is additionally a safe haven during COVID-19 health crisis. Overall, our results also demonstrate that the economic and financial uncertainty affect oil and gold prices negatively during the COVID-19 pandemic. We conclude that the impact of the COVID-19 new infections on oil and gold prices is depending on whether the disease is an epidemic or a pandemic.",
        "DOI": "10.1016/j.resourpol.2021.102061",
        "paper_author": "Atri H.",
        "affiliation_name": "Shaqra University",
        "affiliation_city": "Shaqra",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60110524",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Investing in the Sustainable Development Goals: Mobilization, channeling, and impact",
        "publication": "Journal of International Business Policy",
        "citied_by": "97",
        "cover_date": "2021-03-01",
        "Abstract": "Global investment in the Sustainable Development Goals (SDGs) is falling short of the target to close the $2.5 trillion annual financing gap for developing countries. The COVID-19 shock has exacerbated existing constraints for the SDGs and may undo the progress made in he last 6 years in SDG investment. This poses a risk to delivering on the 2030 Agenda for Sustainable Development. This paper assesses the global trends in both investing in and financing the SDGs, including the myriad of financing instruments launched to respond to the COVID-19 health crisis and its economic and social impacts. It analyses the main challenges for mobilizing funds, channeling investment into SDG sectors, and maximizing positive impact, as well as regulatory dilemmas in promoting SDG investment. The article then elaborates on a set of policy measures for accelerating investment in the SDGs, including four principles for guiding private sector investment, mainstreaming the SDGs into national and international investment policies and promotion strategies, harnessing financial instruments for sustainable development, building special SDGs model zones, and promoting better ESG standards, compliance, and reporting.",
        "DOI": "10.1057/s42214-020-00093-3",
        "paper_author": "Zhan J.X.",
        "affiliation_name": "United Nations Conference on Trade and Development",
        "affiliation_city": "Geneva",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60018622",
        "affiliation_state": "GE"
    },
    {
        "paper_title": "An agent-based model for supply chain recovery in the wake of the COVID-19 pandemic",
        "publication": "Computers and Industrial Engineering",
        "citied_by": "97",
        "cover_date": "2021-08-01",
        "Abstract": "The current COVID-19 pandemic has hugely disrupted supply chains (SCs) in different sectors globally. The global demand for many essential items (e.g., facemasks, food products) has been phenomenal, resulting in supply failure. SCs could not keep up with the shortage of raw materials, and manufacturing firms could not ramp up their production capacity to meet these unparalleled demand levels. This study aimed to examine a set of congruent strategies and recovery plans to minimize the cost and maximize the availability of essential items to respond to global SC disruptions. We used facemask SCs as an example and simulated the current state of its supply and demand using the agent-based modeling method. We proposed two main recovery strategies relevant to building emergency supply and extra manufacturing capacity to mitigate SC disruptions. Our findings revealed that minimizing the risk response time and maximizing the production capacity helped essential item manufacturers meet consumers’ skyrocketing demands and timely supply to consumers, reducing financial shocks to firms. Our study suggested that delayed implementation of the proposed recovery strategies could lead to supply, demand, and financial shocks for essential item manufacturers. This study scrutinized strategies to mitigate the demand–supply crisis of essential items. It further proposed congruent strategies and recovery plans to alleviate the problem in the exceptional disruptive event caused by COVID-19.",
        "DOI": "10.1016/j.cie.2021.107401",
        "paper_author": "Rahman T.",
        "affiliation_name": "UTS Business School",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60189551",
        "affiliation_state": "NSW"
    }
]