[
    {
        "paper_title": "Risk and resilience in family well-being during the COVID-19 pandemic",
        "publication": "American Psychologist",
        "citied_by": "1483",
        "cover_date": "2020-07-01",
        "Abstract": "The COVID-19 pandemic poses an acute threat to the well-being of children and families due to challenges related to social disruption such as financial insecurity, caregiving burden, and confinement-related stress (e.g., crowding, changes to structure, and routine). The consequences of these difficulties are likely to be longstanding, in part because of the ways in which contextual risk permeates the structures and processes of family systems. The current article draws from pertinent literature across topic areas of acute crises and long-term, cumulative risk to illustrate the multitude of ways in which the well-being of children and families may be at risk during COVID-19. The presented conceptual framework is based on systemic models of human development and family functioning and links social disruption due to COVID-19 to child adjustment through a cascading process involving caregiver well-being and family processes (i.e., organization, communication, and beliefs). An illustration of the centrality of family processes in buffering against risk in the context of COVID-19, as well as promoting resilience through shared family beliefs and close relationships, is provided. Finally, clinical and research implications are discussed.",
        "DOI": "10.1037/amp0000660",
        "paper_author": "Prime H.",
        "affiliation_name": "McMaster University",
        "affiliation_city": "Hamilton",
        "affiliation_country": "Canada",
        "affiliation_id": "60031828",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Psychosocial impact of COVID-19",
        "publication": "Diabetes and Metabolic Syndrome: Clinical Research and Reviews",
        "citied_by": "1302",
        "cover_date": "2020-09-01",
        "Abstract": "Background: Along with its high infectivity and fatality rates, the 2019 Corona Virus Disease (COVID-19) has caused universal psychosocial impact by causing mass hysteria, economic burden and financial losses. Mass fear of COVID-19, termed as “coronaphobia”, has generated a plethora of psychiatric manifestations across the different strata of the society. So, this review has been undertaken to define psychosocial impact of COVID-19. Methods: Pubmed and GoogleScholar are searched with the following key terms- “COVID-19”, “SARS-CoV2”, “Pandemic”, “Psychology”, “Psychosocial”, “Psychitry”, “marginalized”, “telemedicine”, “mental health”, “quarantine”, “infodemic”, “social media” and” “internet”. Few news paper reports related to COVID-19 and psychosocial impacts have also been added as per context. Results: Disease itself multiplied by forced quarantine to combat COVID-19 applied by nationwide lockdowns can produce acute panic, anxiety, obsessive behaviors, hoarding, paranoia, and depression, and post-traumatic stress disorder (PTSD) in the long run. These have been fueled by an “infodemic” spread via different platforms of social media. Outbursts of racism, stigmatization, and xenophobia against particular communities are also being widely reported. Nevertheless, frontline healthcare workers are at higher-risk of contracting the disease as well as experiencing adverse psychological outcomes in form of burnout, anxiety, fear of transmitting infection, feeling of incompatibility, depression, increased substance-dependence, and PTSD. Community-based mitigation programs to combat COVID-19 will disrupt children's usual lifestyle and may cause florid mental distress. The psychosocial aspects of older people, their caregivers, psychiatric patients and marginalized communities are affected by this pandemic in different ways and need special attention. Conclusion: For better dealing with these psychosocial issues of different strata of the society, psychosocial crisis prevention and intervention models should be urgently developed by the government, health care personnel and other stakeholders. Apt application of internet services, technology and social media to curb both pandemic and infodemic needs to be instigated. Psychosocial preparedness by setting up mental organizations specific for future pandemics is certainly necessary.",
        "DOI": "10.1016/j.dsx.2020.05.035",
        "paper_author": "Dubey S.",
        "affiliation_name": "Institute of Post Graduate Medical Education &amp; Research",
        "affiliation_city": "Kolkata",
        "affiliation_country": "India",
        "affiliation_id": "60051721",
        "affiliation_state": "WB"
    },
    {
        "paper_title": "Impacts of the COVID-19 pandemic on life of higher education students: A global perspective",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "1214",
        "cover_date": "2020-10-02",
        "Abstract": "The paper presents the most comprehensive and large-scale study to date on how students perceive the impacts of the first wave of COVID-19 crisis in early 2020 on various aspects of their lives on a global level. With a sample of 30,383 students from 62 countries, the study reveals that amid the worldwide lockdown and transition to online learning students were most satisfied with the support provided by teaching staff and their universities’ public relations. Still, deficient computer skills and the perception of a higher workload prevented them from perceiving their own improved performance in the new teaching environment. Students were mainly concerned about issues to do with their future professional career and studies, and experienced boredom, anxiety, and frustration. The pandemic has led to the adoption of particular hygienic behaviours (e.g., wearing masks, washing hands) and discouraged certain daily practices (e.g., leaving home, shaking hands). Students were also more satisfied with the role played by hospitals and universities during the epidemic compared to the governments and banks. The findings also show that students with certain socio-demographic characteristics (male, part-time, first-level, applied sciences, a lower living standard, from Africa or Asia) were significantly less satisfied with their academic work/life during the crisis, whereas female, full-time, first-level students and students faced with financial problems were generally affected more by the pandemic in terms of their emotional life and personal circumstances. Key factors influencing students’ satisfaction with the role of their university are also identified. Policymakers and higher education institutions around the world may benefit from these findings while formulating policy recommendations and strategies to support students during this and any future pandemics.",
        "DOI": "10.3390/su12208438",
        "paper_author": "Aristovnik A.",
        "affiliation_name": "Univerza v Ljubljani",
        "affiliation_city": "Ljubljana",
        "affiliation_country": "Slovenia",
        "affiliation_id": "60031106",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Understanding the value and limits of nature-based solutions to climate change and other global challenges",
        "publication": "Philosophical Transactions of the Royal Society B: Biological Sciences",
        "citied_by": "928",
        "cover_date": "2020-03-16",
        "Abstract": "There is growing awareness that 'nature-based solutions' (NbS) can help to protect us from climate change impacts while slowing further warming, supporting biodiversity and securing ecosystem services. However, the potential of NbS to provide the intended benefits has not been rigorously assessed. There are concerns over their reliability and cost-effectiveness compared to engineered alternatives, and their resilience to climate change. Trade-offs can arise if climate mitigation policy encourages NbS with low biodiversity value, such as afforestation with non-native monocultures. This can result in maladaptation, especially in a rapidly changing world where biodiversity-based resilience and multi-functional landscapes are key. Here, we highlight the rise of NbS in climate policy-focusing on their potential for climate change adaptation as well as mitigation-and discuss barriers to their evidence-based implementation. We outline the major financial and governance challenges to implementing NbS at scale, highlighting avenues for further research. As climate policy turns increasingly towards greenhouse gas removal approaches such as afforestation, we stress the urgent need for natural and social scientists to engage with policy makers. They must ensure that NbS can achieve their potential to tackle both the climate and biodiversity crisis while also contributing to sustainable development. This will require systemic change in the way we conduct research and run our institutions.",
        "DOI": "10.1098/rstb.2019.0120",
        "paper_author": "Seddon N.",
        "affiliation_name": "Oxford Social Sciences Division",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60175816",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "The impact of COVID-19 on small business outcomes and expectations",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "851",
        "cover_date": "2020-07-28",
        "Abstract": "To explore the impact of coronavirus disease 2019 (COVID-19) on small businesses, we conducted a survey of more than 5,800 small businesses between March 28 and April 4, 2020. Several themes emerged. First, mass layoffs and closures had already occurred—just a few weeks into the crisis. Second, the risk of closure was negatively associated with the expected length of the crisis. Moreover, businesses had widely varying beliefs about the likely duration of COVID-related disruptions. Third, many small businesses are financially fragile: The median business with more than $10,000 in monthly expenses had only about 2 wk of cash on hand at the time of the survey. Fourth, the majority of businesses planned to seek funding through the Coronavirus Aid, Relief, and Economic Security (CARES) Act. However, many anticipated problems with accessing the program, such as bureaucratic hassles and difficulties establishing eligibility. Using experimental variation, we also assess take-up rates and business resilience effects for loans relative to grants-based programs.",
        "DOI": "10.1073/pnas.2006991117",
        "paper_author": "Bartik A.W.",
        "affiliation_name": "University of Illinois Urbana-Champaign",
        "affiliation_city": "Urbana",
        "affiliation_country": "United States",
        "affiliation_id": "60000745",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "The impact of the COVID-19 pandemic on suicide rates",
        "publication": "QJM: An International Journal of Medicine",
        "citied_by": "714",
        "cover_date": "2020-01-01",
        "Abstract": "Multiple lines of evidence indicate that the coronavirus disease 2019 (COVID-19) pandemic has profound psychological and social effects. The psychological sequelae of the pandemic will probably persist for months and years to come. Studies indicate that the COVID-19 pandemic is associated with distress, anxiety, fear of contagion, depression and insomnia in the general population and among healthcare professionals. Social isolation, anxiety, fear of contagion, uncertainty, chronic stress and economic difficulties may lead to the development or exacerbation of depressive, anxiety, substance use and other psychiatric disorders in vulnerable populations including individuals with pre-existing psychiatric disorders and people who reside in high COVID-19 prevalence areas. Stress-related psychiatric conditions including mood and substance use disorders are associated with suicidal behavior. COVID-19 survivors may also be at elevated suicide risk. The COVID-19 crisis may increase suicide rates during and after the pandemic. Mental health consequences of the COVID-19 crisis including suicidal behavior are likely to be present for a long time and peak later than the actual pandemic. To reduce suicides during the COVID-19 crisis, it is imperative to decrease stress, anxiety, fears and loneliness in the general population. There should be traditional and social media campaigns to promote mental health and reduce distress. Active outreach is necessary, especially for people with a history of psychiatric disorders, COVID-19 survivors and older adults. Research studies are needed of how mental health consequences can be mitigated during and after the COVID-19 pandemic.",
        "DOI": "10.1093/QJMED/HCAA202",
        "paper_author": "Sher L.",
        "affiliation_name": "VA Medical Center",
        "affiliation_city": null,
        "affiliation_country": "United States",
        "affiliation_id": "60014232",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Feverish stock price reactions to COVID-19",
        "publication": "Review of Corporate Finance Studies",
        "citied_by": "631",
        "cover_date": "2020-11-01",
        "Abstract": "Market reactions to the 2019 novel coronavirus disease (COVID-19) provide new insights into how real shocks and financial policies drive firm value. Initially, internationally oriented firms, especially those more exposed to trade with China, underperformed. As the virus spread to Europe and the United States, corporate debt and cash holdings emerged as important value drivers, relevant even after the Fed intervened in the bond market. The content and tone of conference calls mirror this development over time. Overall, the results illustrate how anticipated real effects from the health crisis, a rare disaster, were amplified through financial channels.",
        "DOI": "10.1093/rcfs/cfaa012",
        "paper_author": "Ramelli S.",
        "affiliation_name": "Universität Zürich",
        "affiliation_city": "Zurich",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60012614",
        "affiliation_state": "ZH"
    },
    {
        "paper_title": "COVID-19 and public transportation: Current assessment, prospects, and research needs",
        "publication": "Journal of Public Transportation",
        "citied_by": "561",
        "cover_date": "2020-01-01",
        "Abstract": "The COVID-19 pandemic poses a great challenge for contemporary public transportation worldwide, resulting from an unprecedented decline in demand and revenue. In this paper, we synthesize the state-of-the-art, up to early June 2020, on key developments regarding public transportation and the COVID-19 pandemic, including the different responses adopted by governments and public transportation agencies around the world, and the research needs pertaining to critical issues that minimize contagion risk in public transportation in the so-called post-lockdown phase. While attempts at adherence to physical distancing (which challenges the very concept of mass public transportation) are looming in several countries, the latest research shows that for closed environments such as public transportation vehicles, the proper use of face masks has significantly reduced the probability of contagion. The economic and social effects of the COVID-19 outbreak in public transportation extend beyond service performance and health risks to financial viability, social equity, and sustainable mobility. There is a risk that if the public transportation sector is perceived as poorly transitioning to post-pandemic conditions, that viewing public transportation as unhealthy will gain ground and might be sustained. To this end, this paper identifies the research needs and outlines a research agenda for the public health implications of alternative strategies and scenarios, specifically measures to reduce crowding in public transportation. The paper provides an overview and an outlook for transit policy makers, planners, and researchers to map the state-of-affairs and research needs related to the impacts of the pandemic crisis on public transportation. Some research needs require urgent attention given what is ultimately at stake in several countries: restoring the ability of public transportation systems to fulfill their societal role.",
        "DOI": "10.5038/2375-0901.22.1.1",
        "paper_author": "Tirachini A.",
        "affiliation_name": "Universidad de Chile",
        "affiliation_city": "Santiago",
        "affiliation_country": "Chile",
        "affiliation_id": "60012464",
        "affiliation_state": "RM"
    },
    {
        "paper_title": "Preventing problematic internet use during the COVID-19 pandemic: Consensus guidance",
        "publication": "Comprehensive Psychiatry",
        "citied_by": "534",
        "cover_date": "2020-07-01",
        "Abstract": "As a response to the COVID-19 pandemic, many governments have introduced steps such as spatial distancing and “staying at home” to curb its spread and impact. The fear resulting from the disease, the ‘lockdown’ situation, high levels of uncertainty regarding the future, and financial insecurity raise the level of stress, anxiety, and depression experienced by people all around the world. Psychoactive substances and other reinforcing behaviors (e.g., gambling, video gaming, watching pornography) are often used to reduce stress and anxiety and/or to alleviate depressed mood. The tendency to use such substances and engage in such behaviors in an excessive manner as putative coping strategies in crises like the COVID-19 pandemic is considerable. Moreover, the importance of information and communications technology (ICT) is even higher in the present crisis than usual. ICT has been crucial in keeping parts of the economy going, allowing large groups of people to work and study from home, enhancing social connectedness, providing greatly needed entertainment, etc. Although for the vast majority ICT use is adaptive and should not be pathologized, a subgroup of vulnerable individuals are at risk of developing problematic usage patterns. The present consensus guidance discusses these risks and makes some practical recommendations that may help diminish them.",
        "DOI": "10.1016/j.comppsych.2020.152180",
        "paper_author": "Király O.",
        "affiliation_name": "Eötvös Loránd Tudományegyetem",
        "affiliation_city": "Budapest",
        "affiliation_country": "Hungary",
        "affiliation_id": "60025187",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Searching for safe-haven assets during the COVID-19 pandemic",
        "publication": "International Review of Financial Analysis",
        "citied_by": "483",
        "cover_date": "2020-10-01",
        "Abstract": "The ongoing COVID-19 pandemic has shaken the global financial system and caused great turmoil. Facing unprecedented risks in the markets, people have increasing needs to find a safe haven for their investments. Given that the nature of this crisis is a combination of multiple problems, it is substantially different from all other financial crises known to us. It is therefore urgent to re-evaluate the safe-haven role of some traditional asset types, namely, gold, cryptocurrency, foreign exchange and commodities. This paper introduces a sequential monitoring procedure to detect changes in the left-quantiles of asset returns, and to assess whether a tail change in the equity index can be offset by introducing a safe-haven asset into a simple mean-variance portfolio. The sample studied covers a training period between August–December 2019 and a testing period of December 2019–March 2020. Furthermore, we calculate the cross-quantilogram between pair-wise asset returns and compare their directional predictability on left-quantiles in both normal market conditions and the COVID-19 period. The main results show that the role of safe haven becomes less effective for most of the assets considered in this paper, while gold and soybean commodity futures remain robust as safe-haven assets during this pandemic.",
        "DOI": "10.1016/j.irfa.2020.101526",
        "paper_author": "Ji Q.",
        "affiliation_name": "Institutes of Science and Development",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60273016",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The COVID-19 crisis as an opportunity for escaping the unsustainable global tourism path",
        "publication": "Tourism Geographies",
        "citied_by": "446",
        "cover_date": "2020-05-26",
        "Abstract": "The COVID-19 pandemic has halted mobility globally on an unprecedented scale, causing the neoliberal market mechanisms of global tourism to be severely disrupted. In turn, this situation is leading to the decline of certain mainstream business formats and, simultaneously, the emergence of others. Based on a review of recent crisis recovery processes, the tourism sector is likely to rebound from this sudden market shock, primarily because of various forms of government interventions. Nevertheless, although policymakers seek to strengthen the resilience of post-pandemic tourism, their subsidies and other initiatives serve to maintain a fundamentally flawed market logic. The crisis has, therefore, brought us to a fork in the road–giving us the perfect opportunity to select a new direction and move forward by adopting a more sustainable path. Specifically, COVID-19 offers public, private, and academic actors a unique opportunity to design and consolidate the transition towards a greener and more balanced tourism. Tourism scholars, for example, can take a leading role in this by redesigning their curriculum to prepare future industry leaders for a more responsible travel and tourism experience.",
        "DOI": "10.1080/14616688.2020.1763445",
        "paper_author": "Ioannides D.",
        "affiliation_name": "Mid Sweden University, Östersund",
        "affiliation_city": "Ostersund",
        "affiliation_country": "Sweden",
        "affiliation_id": "60105080",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Economic Consequences of the COVID-19 Outbreak: the Need for Epidemic Preparedness",
        "publication": "Frontiers in Public Health",
        "citied_by": "437",
        "cover_date": "2020-05-29",
        "Abstract": "COVID-19 is not only a global pandemic and public health crisis; it has also severely affected the global economy and financial markets. Significant reductions in income, a rise in unemployment, and disruptions in the transportation, service, and manufacturing industries are among the consequences of the disease mitigation measures that have been implemented in many countries. It has become clear that most governments in the world underestimated the risks of rapid COVID-19 spread and were mostly reactive in their crisis response. As disease outbreaks are not likely to disappear in the near future, proactive international actions are required to not only save lives but also protect economic prosperity.",
        "DOI": "10.3389/fpubh.2020.00241",
        "paper_author": "Pak A.",
        "affiliation_name": "James Cook University",
        "affiliation_city": "Townsville",
        "affiliation_country": "Australia",
        "affiliation_id": "60019870",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Psychological impact of covid-19 and lockdown among university students in malaysia: Implications and policy recommendations",
        "publication": "International Journal of Environmental Research and Public Health",
        "citied_by": "436",
        "cover_date": "2020-09-01",
        "Abstract": "The COVID-19 pandemic and the lockdown has taken the world by storm. This study examines its impact on the anxiety level of university students in Malaysia during the peak of the crisis and the pertinent characteristics affecting their anxiety. A cross-sectional online survey, using Zung’s self-rating anxiety questionnaire was conducted during the COVID-19 pandemic and lockdown. Out of the 983 respondents, 20.4%, 6.6%, and 2.8% experienced minimal to moderate, marked to severe, and most extreme levels of anxiety. Female gender (OR = 21.456, 95% CI = 1.061, 1.998, p = 0.020), age below 18 years (OR = 4.147, 95% CI = 1.331, 12.918, p = 0.014), age 19 to 25 (OR = 3.398, 95% CI = 1.431, 8.066, p = 0.006), pre-university level of education (OR = 2.882, 95% CI = 1.212, 6.854, p = 0.017), management studies (OR = 2.278, 95% CI = 1.526, 3.399, p < 0.001), and staying alone (OR = 2.208, 95% CI = 1.127, 4.325, p = 0.021) were significantly associated with higher levels of anxiety. The main stressors include financial constraints, remote online teaching and uncertainty about the future with regard to academics and career. Stressors are predominantly financial constraints, remote online learning, and uncertainty related to their academic performance, and future career prospects.",
        "DOI": "10.3390/ijerph17176206",
        "paper_author": "Sundarasen S.",
        "affiliation_name": "Prince Sultan University",
        "affiliation_city": "Riyadh",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60015723",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Impact of COVID-19 pandemic on micro, small, and medium-sized Enterprises operating in Pakistan",
        "publication": "Research in Globalization",
        "citied_by": "423",
        "cover_date": "2020-12-01",
        "Abstract": "The outbreak of coronavirus disease (COVID-19) has severely affected the global and Pakistani economy. Major victims of the COVID-19 outbreak are micro, small, and medium-sized enterprises (MSMEs). This article aims to assess the impact of COVID-19 outbreak on these businesses and provide policy recommendations to help MSMEs in reducing business losses and survive through the crisis. We adopted an exploratory methodology with comprehensively reviewing the available literature, including policy documents, research papers, and reports in the relevant field. Further, to add empirical evidence, we collected data from 184 Pakistani MSMEs by administering an online questionnaire. The data were analyzed through descriptive statistics. The results indicate that most of the participating enterprises have been severely affected and they are facing several issues such as financial, supply chain disruption, decrease in demand, reduction in sales and profit, among others. Besides, over 83% of enterprises were neither prepared nor have any plan to handle such a situation. Further, more than two-thirds of participating enterprises reported that they could not survive if the lockdown lasts more than two months. The findings of our study are consistent with previous studies. Based on the results of the research, different policy recommendations were proposed to ease the adverse effects of the outbreak on MSMEs. Although our suggested policy recommendations may not be sufficient to help MSMEs go through the ongoing crisis, these measures will help them weather the storm.",
        "DOI": "10.1016/j.resglo.2020.100018",
        "paper_author": "Shafi M.",
        "affiliation_name": "Leshan Teachers College",
        "affiliation_city": "Leshan",
        "affiliation_country": "China",
        "affiliation_id": "60083909",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Reset redux: possible evolutionary pathways towards the transformation of tourism in a COVID-19 world",
        "publication": "Tourism Geographies",
        "citied_by": "391",
        "cover_date": "2020-05-26",
        "Abstract": "With international arrivals surpassing 1.5 billion for the first time in 2019 the long-term evolution of tourism demonstrates prolific path dependence with a decade of growth since the global financial crisis. This latest period of unfettered international tourism development has come to an abrupt end as the impact of COVID-19 has brought the sector to a near standstill. As the world grapples with the realities of the global pandemic there is an opportunity to rethink exactly what tourism will look like for the decades ahead. Key concepts in evolutionary economic geography, especially path dependence/creation and institutional inertia/innovation, show variations in pathways for travel and tourism in a COVID-19 world. A path that leads to transformation in tourism can be realized if sufficient institutional innovation occurs on both the demand and supply side of tourism that can foster the emergence of new paths. COVID-19 presents a once in a generation opportunity where the institutional pump is primed for transformation. Whether that leads to a radical transformation of the tourism sector remains to be seen, but the imprint it will leave on both the demand and supply of tourism will have long-term, incremental impacts for years to come and ultimately move us closer towards the transformation of tourism.",
        "DOI": "10.1080/14616688.2020.1760928",
        "paper_author": "Brouder P.",
        "affiliation_name": "Vancouver Island University",
        "affiliation_city": "Nanaimo",
        "affiliation_country": "Canada",
        "affiliation_id": "60101614",
        "affiliation_state": "BC"
    },
    {
        "paper_title": "Alcohol use in times of the COVID 19: Implications for monitoring and policy",
        "publication": "Drug and Alcohol Review",
        "citied_by": "361",
        "cover_date": "2020-05-01",
        "Abstract": "Based on a literature search undertaken to determine the impacts of past public health crises, and a systematic review of the effects of past economic crises on alcohol consumption, two main scenarios—with opposite predictions regarding the impact of the current COVID-19 pandemic on the level and patterns of alcohol consumption—are introduced. The first scenario predicts an increase in consumption for some populations, particularly men, due to distress experienced as a result of the pandemic. A second scenario predicts the opposite outcome, a lowered level of consumption, based on the decreased physical and financial availability of alcohol. With the current restrictions on alcohol availability, it is postulated that, for the immediate future, the predominant scenario will likely be the second, while the distress experienced in the first may become more relevant in the medium- and longer-term future. Monitoring consumption levels both during and after the COVID-19 pandemic will be necessary to better understand the effects of COVID-19 on different groups, as well as to distinguish them from those arising from existing alcohol control policies.",
        "DOI": "10.1111/dar.13074",
        "paper_author": "Rehm J.",
        "affiliation_name": "Technische Universität Dresden",
        "affiliation_city": "Dresden",
        "affiliation_country": "Germany",
        "affiliation_id": "60018353",
        "affiliation_state": "Sachsen"
    },
    {
        "paper_title": "Child Maltreatment during the COVID-19 Pandemic: Consequences of Parental Job Loss on Psychological and Physical Abuse Towards Children",
        "publication": "Child Abuse and Neglect",
        "citied_by": "349",
        "cover_date": "2020-12-01",
        "Abstract": "Background: Job loss resulting from the COVID-19 pandemic presents significant risk for child abuse. Protective factors, such as reframing coping, may mitigate the risk of job loss on child maltreatment. Objective: The current study investigated factors associated with child maltreatment during the COVID-19 pandemic, including parental job loss, and whether cognitive reframing moderated associations between job loss and child maltreatment. Method: A community sample of 342 parents (62% mothers) of 4- to 10-year-olds (M = 7.38, SD = 2.01; 57.3% male) living in the United States completed online questionnaires regarding experiences with COVID-19, the Parent-Child Conflict Tactics Scale, and the Family Crisis Oriented Personal Evaluation Scales. Results: Two logistic regression analyses evaluated predictors of whether parents psychologically maltreated or physically abused their children during the pandemic controlling for maltreating history, parental depressive symptoms, financial stability, parent age, parent gender, child age, and child gender. Parents who lost their jobs (OR = 4.86, 95% CI [1.19, 19.91], p =.03), were more depressed (OR = 1.05, 95% CI [1.02, 1.08], p <.01), and previously psychologically maltreated their children (OR = 111.94, 95% CI [28.54, 439.01], p <.001) were more likely to psychologically maltreat during the pandemic. Regarding physical abuse, a significant interaction between job loss and reframing coping emerged (OR = 0.76, 95% CI [0.59, 0.99], p =.04). Among parents who lost their jobs, the probability of physical abuse decreased as reframing coping increased. Conclusions: Job loss during the COVID-19 pandemic is a significant risk factor for child maltreatment. Reframing coping may be an important buffer of this association on physical abuse and presents implications for maltreatment prevention.",
        "DOI": "10.1016/j.chiabu.2020.104709",
        "paper_author": "Lawson M.",
        "affiliation_name": "The University of Texas at San Antonio",
        "affiliation_city": "San Antonio",
        "affiliation_country": "United States",
        "affiliation_id": "60003212",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "The Coronavirus crisis in B2B settings: Crisis uniqueness and managerial implications based on social exchange theory",
        "publication": "Industrial Marketing Management",
        "citied_by": "313",
        "cover_date": "2020-07-01",
        "Abstract": "The current Coronavirus crisis is having disastrous effects for most B2B firms around the world. The decline in sales provokes intra-organizational and inter-organizational tension, requiring a new approach for managing firms' business operations. Particularly, the direct threat to human beings places the attention of managers on the individual. This study investigates the main differences between prior “traditional” financial-based crises and the practices that managers can adopt to navigate and survive the Coronavirus crisis from a social exchange theory (SET) view. The authors identify eight crisis-comparative dimensions to consider to successfully prevail: (1) formation, (2) focus, (3) temporality, (4) government jurisdiction, (5) preparedness, (6) normality, (7) business, and (8) operational deployment. In addition, the study results propose four intertwined areas to classify the managerial practices: (1) digital transformation, (2) decision-making processes, (3) leadership, and (4) emotions and stress.",
        "DOI": "10.1016/j.indmarman.2020.05.004",
        "paper_author": "Mora Cortez R.",
        "affiliation_name": "Syddansk Universitet",
        "affiliation_city": "Odense",
        "affiliation_country": "Denmark",
        "affiliation_id": "60019160",
        "affiliation_state": "Syddanmark"
    },
    {
        "paper_title": "Aggregated COVID-19 suicide incidences in India: Fear of COVID-19 infection is the prominent causative factor",
        "publication": "Psychiatry Research",
        "citied_by": "287",
        "cover_date": "2020-08-01",
        "Abstract": "Many Indian COVID-19 suicide cases are turning the press-media attention and flooding in the social media platforms although, no particular studies assessed the COVID-19 suicide causative factors to a large extent. Therefore, the present study presents 69 COVID-19 suicide cases (aged 19 to 65 years; 63 cases were males). The suicide causalities are included as follows – fear of COVID-19 infection (n=21), followed by financial crisis (n=19), loneliness, social boycott and pressure to be quarantine, COVID-19 positive, COVID-19 work-related stress, unable to come back home due to lockdown, unavailability of alcohol etc. Considering the extreme psychological impacts related to COVID-19, there emerges a need for countrywide extensive tele-mental health care services.",
        "DOI": "10.1016/j.psychres.2020.113145",
        "paper_author": "Dsouza D.D.",
        "affiliation_name": "Manipal College of Health professions",
        "affiliation_city": "Manipal",
        "affiliation_country": "India",
        "affiliation_id": "60121990",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "The effect of the COVID-19 lockdown on parents: A call to adopt urgent measures.",
        "publication": "Psychological Trauma: Theory, Research, Practice, and Policy",
        "citied_by": "281",
        "cover_date": "2020-01-01",
        "Abstract": "The COVID-19 health crisis is strongly affecting the mental health of the general population. In particular, the pandemic may be producing psychological distress and collateral concerns for parents in lockdown, due to unstable financial circumstances, school closures, and suspended educational services for children. A call for measures to increase family-based interventions during the emergency is urgently needed to forestall psychopathological trajectories and prevent the exacerbation of vulnerable conditions. (PsycInfo Database Record (c) 2020 APA, all rights reserved)",
        "DOI": "10.1037/tra0000672",
        "paper_author": "Fontanesi L.",
        "affiliation_name": "University of G. d'Annunzio Chieti and Pescara",
        "affiliation_city": "Chieti",
        "affiliation_country": "Italy",
        "affiliation_id": "60004638",
        "affiliation_state": "CH"
    },
    {
        "paper_title": "Does corporate social responsibility reduce financial distress risk?",
        "publication": "Economic Modelling",
        "citied_by": "279",
        "cover_date": "2020-09-01",
        "Abstract": "This paper examines how corporate social responsibility (CSR) affects the level of financial distress risk (FDR). Using a sample of 1201 US-listed firms during 1991–2012, our results indicate that firms with higher CSR levels have lower FDR, suggesting that a better CSR performance makes firms more creditworthy and have better access to financing, which is rewarded with less financial defaults. This finding is robust to using alternative proxies of FDR, to controlling for potential endogeneity, and is mainly driven by the community, diversity, employee relations, and environmental dimensions of CSR. Moreover, this relationship is more prevalent in firms with strong governance mechanisms and high product market competition. It is also more exacerbated for less distressed firms and during non-crisis periods. Overall, our findings suggest that the adoption of CSR practices comes with less distress and default risks, likely leading to a more attractive corporate environment, better financial stability and more crisis-resilient economies.",
        "DOI": "10.1016/j.econmod.2020.05.012",
        "paper_author": "Boubaker S.",
        "affiliation_name": "EM Normandie",
        "affiliation_city": "Le Havre",
        "affiliation_country": "France",
        "affiliation_id": "60032545",
        "affiliation_state": "Normandie"
    },
    {
        "paper_title": "Regional determinants of China's consumption-based emissions in the economic transition",
        "publication": "Environmental Research Letters",
        "citied_by": "272",
        "cover_date": "2020-07-01",
        "Abstract": "China has entered the economic transition in the post-financial crisis era, with unprecedented new features that significantly lead to a decline in its carbon emissions. However, regional disparity implies different trajectories in regional decarbonisation. Here, we construct multi-regional input-output tables (MRIO) for 2012 and 2015 and quantitatively evaluate the regional disparity in decarbonisation and the driving forces during 2012-2015. We found China's consumption-based emissions peaked in 2013, largely driven by a peak in consumption-based emissions from developing regions. Declined intensity and industrial structures are determinants due to the economic transition. The rise of the Southwest and Central regions of China have become a new feature, driving up emissions embodied in trade and have reinforced the pattern of carbon flows in the post-financial crisis period. Export-related emissions have bounced up after years of decline, attributed to soaring export volume and export structure in the Southeast and North of the country. The disparity in developing regions has become the new feature in shaping China's economy and decarbonisation.",
        "DOI": "10.1088/1748-9326/ab794f",
        "paper_author": "Zheng H.",
        "affiliation_name": "University of East Anglia",
        "affiliation_city": "Norwich",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60000112",
        "affiliation_state": "Norfolk"
    },
    {
        "paper_title": "Global financial crisis and rising connectedness in the international commodity markets",
        "publication": "International Review of Financial Analysis",
        "citied_by": "247",
        "cover_date": "2020-03-01",
        "Abstract": "This paper documents a dramatic change in the nature of connectedness in global commodity prices following the 2008 global financial crisis. We show that co-dependence in price-changes among seven major commodity classes goes from a pre-crisis average of 14.82% to a strikingly larger average of 47.87% in the period following the crisis, and which has endured until now. Dynamic swings in price co-movements of such a scale present a clear concern for financial investors and are of immediate interest to a wider policy-maker audience. Of particular interest is the empirical behavior of the food commodity price index, whose contribution to the system dynamics rises from less than 20% in the period up to 2008, to more than 80% after. To dispel any concern that these finding may be method-specific, we demonstrate their invariance to modeling procedure by providing analogous-results using a pairwise Granger causality analysis, as well as different sub-sampling choices.",
        "DOI": "10.1016/j.irfa.2018.08.003",
        "paper_author": "Zhang D.",
        "affiliation_name": "Southwestern University of Finance and Economics",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60018540",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Blockchain as a confidence machine: The problem of trust &amp; challenges of governance",
        "publication": "Technology in Society",
        "citied_by": "244",
        "cover_date": "2020-08-01",
        "Abstract": "Blockchain technology was created as a response to the trust crisis that swept the world in the wake of the 2008 financial crisis. Bitcoin and other blockchain-based systems were presented as a “trustless” alternative to existing financial institutions and even governments. Yet, while the trustless nature of blockchain technology has been heavily questioned, little research has been done as to what blockchain technologies actually bring to the table in place of trust. This article draws from the extensive academic discussion on the concepts of “trust” and “confidence” to argue that blockchain technology is not a ‘trustless technology’ but rather a ‘confidence machine’. First, the article provides a review of the multifaceted conceptualisations of trust and confidence, and the relationship between these two concepts. Second, the claim is made that blockchain technology relies on cryptographic rules, mathematics, and game-theoretical incentives in order to increase confidence in the operations of a computational system. Yet, such an increase in confidence ultimately relies on the proper operation and governance of the underlying blockchain-based network, which requires trusting a variety of actors. Third, the article turns to legal, constitutional and polycentric governance theory to explore the governance challenges of blockchain-based systems, in light of the tension between procedural confidence and trust.",
        "DOI": "10.1016/j.techsoc.2020.101284",
        "paper_author": "De Filippi P.",
        "affiliation_name": "Centre d’Études et de Recherches de Sciences Administratives et Politiques (CERSA)",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60275620",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "Covid-19 school closure-related changes to the professional life of a k–12 teacher",
        "publication": "Education Sciences",
        "citied_by": "238",
        "cover_date": "2020-06-01",
        "Abstract": "The COVID-19 pandemic forced K–12 school closures in spring 2020 to protect the well-being of society. The unplanned and unprecedented disruption to education changed the work of many teachers suddenly, and in many aspects. This case study examines the COVID-19 school closure-related changes to the professional life of a secondary school teacher in rural Alaska (United States), who had to teach his students online. A descriptive and explanatory single case study methodology was used to describe subsequent impacts on instructional practices and workload. Qualitative and quantitative data sources include participant observations, semi-structured interviews, artifacts (e.g., lesson plans, schedules, online time), and open-ended conversations. The results of this study demonstrate an increase and change in workload for the teacher and that online education can support learning for many students but needs to be carefully designed and individualized to not deepen inequality and social divides. The forced move to online learning may have been the catalyst to create a new, more effective hybrid model of educating students in the future. Not one single model for online learning will provide equitable educational opportunities for all and virtual learning cannot be seen as a cheap fix for the ongoing financial crisis in funding education.",
        "DOI": "10.3390/educsci10060165",
        "paper_author": "Kaden U.",
        "affiliation_name": "University of Alaska Fairbanks",
        "affiliation_city": "Fairbanks",
        "affiliation_country": "United States",
        "affiliation_id": "60011976",
        "affiliation_state": "AK"
    },
    {
        "paper_title": "COVID-19: Impact analysis and recommendations for power sector operation",
        "publication": "Applied Energy",
        "citied_by": "232",
        "cover_date": "2020-12-01",
        "Abstract": "The demand of electricity has been reduced significantly due to the recent COVID-19 pandemic. Governments around the world were compelled to reduce the business activity in response to minimize the threat of coronavirus. This on-going situation due to COVID-19 has changed the lifestyle globally as people are mostly staying home and working from home if possible. Hence, there is a significant increase in residential load demand while there is a substantial decrease in commercial and industrial loads. This devastating situation creates new challenges in the technical and financial activities of the power sector and hence most of the utilities around the world initiated a disaster management plan to tackle this ongoing challenges/threats. Therefore, this study aims to investigate the global scenarios of power systems during COVID-19 along with the socio-economic and technical issues faced by the utilities. Then, this study further scrutinized the Indian power system as a case study and explored scenarios, issues and challenges currently being faced to manage the consumer load demand, including the actions taken by the utilities/power sector for the smooth operation of the power system. Finally, a set of recommendations are presented to support the government/policymakers/utilities around the world not only to overcome the current crisis but also to overcome future unforeseeable pandemic alike scenario.",
        "DOI": "10.1016/j.apenergy.2020.115739",
        "paper_author": "Madurai Elavarasan R.",
        "affiliation_name": "Electrical and Automotive Parts Manufacturing Unit",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "124999137",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The Effect of COVID-19 on Mental Health and Wellbeing in a Representative Sample of Australian Adults",
        "publication": "Frontiers in Psychiatry",
        "citied_by": "225",
        "cover_date": "2020-10-06",
        "Abstract": "There is minimal knowledge about the impact of large-scale epidemics on community mental health, particularly during the acute phase. This gap in knowledge means we are critically ill-equipped to support communities as they face the unprecedented COVID-19 pandemic. This study aimed to provide data urgently needed to inform government policy and resource allocation now and in other future crises. The study was the first to survey a representative sample from the Australian population at the early acute phase of the COVID-19 pandemic. Depression, anxiety, and psychological wellbeing were measured with well-validated scales (PHQ-9, GAD-7, WHO-5). Using linear regression, we tested for associations between mental health and exposure to COVID-19, impacts of COVID-19 on work and social functioning, and socio-demographic factors. Depression and anxiety symptoms were substantively elevated relative to usual population data, including for individuals with no existing mental health diagnosis. Exposure to COVID-19 had minimal association with mental health outcomes. Recent exposure to the Australian bushfires was also unrelated to depression and anxiety, although bushfire smoke exposure correlated with reduced psychological wellbeing. In contrast, pandemic-induced impairments in work and social functioning were strongly associated with elevated depression and anxiety symptoms, as well as decreased psychological wellbeing. Financial distress due to the pandemic, rather than job loss per se, was also a key correlate of poorer mental health. These findings suggest that minimizing disruption to work and social functioning, and increasing access to mental health services in the community, are important policy goals to minimize pandemic-related impacts on mental health and wellbeing. Innovative and creative strategies are needed to meet these community needs while continuing to enact vital public health strategies to control the spread of COVID-19.",
        "DOI": "10.3389/fpsyt.2020.579985",
        "paper_author": "Dawel A.",
        "affiliation_name": "School of Medicine and Psychology",
        "affiliation_city": "Canberra",
        "affiliation_country": "Australia",
        "affiliation_id": "60281380",
        "affiliation_state": "ACT"
    },
    {
        "paper_title": "COVID-19’s disasters are perilous than Global Financial Crisis: A rumor or fact?",
        "publication": "Finance Research Letters",
        "citied_by": "222",
        "cover_date": "2020-10-01",
        "Abstract": "This investigation employed the Asymmetric Power GARCH model and found that COVID-19 substantially harms the US and Japan's market returns. Moreover, COVID-19 has influenced the variance of the US, Germany, and Italy's stock markets more than the Global Financial Crises (GFC). However, GFC indicated a more significant impact on the financial volatility of the Nikkei 225 index and SSEC than COVID-19. The study confirmed the leverage effect for the S&P 500, Nasdaq Composite Index, DAX 30, Nikkei 225, FTSE MIB, and SSEC. The analysis authenticated that the health crisis that befell due to COVID-19 have imperatively originated the financial crisis globally; however, the Asian markets still make available better prospects for portfolio optimization.",
        "DOI": "10.1016/j.frl.2020.101669",
        "paper_author": "Shehzad K.",
        "affiliation_name": "School of Economics &amp; Management",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60128747",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "When Going Digital Becomes a Necessity: Ensuring Older Adults’ Needs for Information, Services, and Social Inclusion During COVID-19",
        "publication": "Journal of Aging and Social Policy",
        "citied_by": "220",
        "cover_date": "2020-07-03",
        "Abstract": "Older adults are in triple jeopardy during COVID-19: compared with younger people, older adults are (1) more likely to develop serious conditions and experience higher mortality; (2) less likely to obtain high quality information or services online; and (3) more likely to experience social isolation and loneliness. Hybrid solutions, coupling online and offline strategies, are invaluable in ensuring the inclusion of vulnerable populations. Most of these solutions require no new inventions. Finding the financial resources for a rapid, well-coordinated implementation is the biggest challenge. Setting up the requisite support systems and digital infrastructure is important for the present and future pandemics.",
        "DOI": "10.1080/08959420.2020.1771237",
        "paper_author": "Xie B.",
        "affiliation_name": "The University of Texas at Austin",
        "affiliation_city": "Austin",
        "affiliation_country": "United States",
        "affiliation_id": "60013372",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "COVID-19: Lessons for the climate change emergency",
        "publication": "Science of the Total Environment",
        "citied_by": "219",
        "cover_date": "2020-11-10",
        "Abstract": "The ongoing COVID-19 outbreak pandemic is now a global crisis. It has caused 9+ million confirmed cases and 400,000+ deaths at the time of writing and triggered unprecedented preventative measures that have confined a substantial portion of the global population and established ‘social distancing’ as a new global behavioral norm. The COVID-19 crisis has affected all aspects of everyday life and work, and heavily impacted the global economy. This crisis also offers unprecedented insights into how the global climate crisis may be managed, as there are many parallels between the COVID-19 crisis and what we expect from the imminent global climate emergency. Reflecting upon the challenges of today's crisis may help us better prepare for the future. Here we compile a list, by no means comprehensive, of the similarities and differences between the two crises, and the lessons we can learn from them: (i) High momentum trends, (ii) Irreversible changes, (iii) Social and spatial inequality, (iv) Weakening of international solidarity, and (v) Less costly to prevent than to cure.",
        "DOI": "10.1016/j.scitotenv.2020.140563",
        "paper_author": "Manzanedo R.D.",
        "affiliation_name": "Harvard Forest",
        "affiliation_city": "Petersham",
        "affiliation_country": "United States",
        "affiliation_id": "60007624",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "The importance of urban natural areas and urban ecosystem services during the COVID- 19 pandemic",
        "publication": "PLoS ONE",
        "citied_by": "213",
        "cover_date": "2020-12-01",
        "Abstract": "Urban, peri-urban forests and other natural areas provide a wide range of material and nonmaterial benefits to people known as ecosystem services. Access to these areas has been linked to benefits for physical and mental health of local populations. In the spring of 2020, the COVID-19 global pandemic forced many governments to impose a set of restrictions including the closure of businesses, cancelation of public events and schooling, social distancing, limitations on the size of social gatherings, and travel restrictions. During this period of restrictions, we conducted a study assessing the importance of urban and peri-urban forests and other natural areas to people living in and around the city of Burlington, Vermont, USA. We evaluated the self-reported use and changes in personal importance related to these natural areas before and during the period of restrictions. We received over 400 responses to our field survey. The results show that 69.0% of the respondents had increased or greatly increased their visitation rate to our natural areas and urban forests, and 80.6% of respondents considered that the importance of these areas, and access to them, either increased or greatly increased. Moreover 25.8% of the sample had either never, or very rarely accessed their local natural areas before the pandemic, but 69.2% of the first time or infrequent visitors reported that having access to these areas during COVID-19 as 'very important'. People reported that these areas were important for a wide range of activities from exercise to birding, but also reported values related to reducing stress in a time of global chaos. Our results indicate the increasing demand and value of such areas in times of crisis such as COVID-19. Experts in zoonotic disease predict the potential for more frequent pandemic events, thus predicating the importance for continued funding for, maintenance of, and improved access to, natural areas to our largely urban civilization. Copyright:",
        "DOI": "10.1371/journal.pone.0243344",
        "paper_author": "Grima N.",
        "affiliation_name": "The University of Vermont",
        "affiliation_city": "Burlington",
        "affiliation_country": "United States",
        "affiliation_id": "60009500",
        "affiliation_state": "VT"
    },
    {
        "paper_title": "Sustaining enterprise operations and productivity during the COVID-19 pandemic: \"Enterprise effectiveness and sustainability model\"",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "213",
        "cover_date": "2020-08-01",
        "Abstract": "The research explores key factors impacting enterprise operational sustainability and the ability to transcend adversity during different stages of a crisis, such as the COVID-19 pandemic. The current study draws from the Theory of Crisis Management Teams, the Stakeholder Theory, and the Distributed Cognition Theory to build an \"Enterprise Effectiveness and Sustainability Model during Pandemic.\" Existing theoretical background joint with contemporary success case studies helped to identify the essential aspects and strategies enterprises should employ to survive and thrive during crisis and post-crisis. We have conceptualized an innovative approach to COVID-19 from the perspective of organizational characteristics, operations, digital transformation, and financial planning. The findings suggest that enterprises having distributed leadership, workforce and adaptive culture sustain business operations during a pandemic. Furthermore, resilient enterprises allow for more informed and decentralized decision-making. Prosperous organizations leverage Internet and Communication Technology (ICT) and integrate Intranet, social media, and online communication platforms into their daily business routines, as this helps to establish trust and build bonds with employees, stakeholders, and customers during and post-crisis. Finally, balancing between the stockpiling of resources and resiliency is crucial in anticipation of a crisis. Therefore, we conclude that enterprises with financial contingency plans sustain their business operations during a pandemic.",
        "DOI": "10.3390/su12155981",
        "paper_author": "Obrenovic B.",
        "affiliation_name": "Jiangsu University",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60017482",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Do financial technology firms influence bank performance?",
        "publication": "Pacific Basin Finance Journal",
        "citied_by": "211",
        "cover_date": "2020-09-01",
        "Abstract": "We develop a hypothesis that the growth of financial technology (FinTech) negatively influences bank performance. We study the Indonesia market, where FinTech growth has been impressive. Using a sample of 41 banks and data on FinTech firms, we show that the growth of FinTech firms negatively influences bank performance. We test our hypothesis through multiple additional tests and robustness tests, such as sensitivity to bank characteristics, effects of the Global Financial Crisis, and the use of alternative estimators. Our main conclusion that FinTech negatively predicts bank performance holds.",
        "DOI": "10.1016/j.pacfin.2019.101210",
        "paper_author": "Phan D.H.B.",
        "affiliation_name": "La Trobe Business School",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60185896",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Co-movements and spillovers of oil and renewable firms under extreme conditions: New evidence from negative WTI prices during COVID-19",
        "publication": "Energy Economics",
        "citied_by": "209",
        "cover_date": "2020-10-01",
        "Abstract": "We test for the existence of volatility spillovers and co-movements among energy-focused corporations during the outbreak of the COVID-19 pandemic, inclusive of the April 2020 events where West Texas Intermediate (WTI) oil future prices became negative. Employing the spillover index approach of Diebold and Yilmaz (2012); as well as developing a DCC-FIGARCH conditional correlation framework and using estimated spillover indices built on a generalised vector autoregressive framework in which forecast-error variance decompositions are invariant to the variable ordering, we examine the sectoral transmission mechanisms of volatility shocks and contagion throughout the energy sector. Among several results, we find positive and economically meaningful spillovers from falling oil prices to both renewable energy and coal markets. However, this result is only found for the narrow portion of our sample surrounding the negative WTI event. We interpret our results being directly attributed to a sharp drop in global oil, gas and coal demand, rather than because of a sudden increase in oil supply. While investors observed the US fracking industry losing market share to coal, they also viewed renewables as more reliable mechanism to generate long-term, stable and low-cost supply.",
        "DOI": "10.1016/j.eneco.2020.104978",
        "paper_author": "Corbet S.",
        "affiliation_name": "DCU Business School",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60116848",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "Unlocking challenges and opportunities presented by COVID-19 pandemic for cross-cutting disruption in agri-food and green deal innovations: Quo Vadis?",
        "publication": "Science of the Total Environment",
        "citied_by": "207",
        "cover_date": "2020-12-15",
        "Abstract": "COVID-19 pandemic is on a trajectory to cause catastrophic global upheaval with the potential to alter geopolitical and socio-economic norms. Many countries are frantically responding with staggering financial stimulus recovery initiatives. This opinion-paper reviews challenges, opportunities, and potential solutions for the post-COVID-19 era that focuses on intensive sustaining of agri-food supply chain in tandem with meeting the high demand for new green deal innovation. For example, the development of wet peatland innovation, known as Paludiculture, can intensively sustain and blend agri-food and green innovations that will help support COVID-19 pandemic transitioning. The future looks bright for the creation of new sustainability multi-actor innovation hubs that will support, connect, and enable businesses to recover and pivot beyond the COVID-19 pandemic. The nexus between first ‘Green Deal’ initiative supporting 64 selected European Startups and SMEs (European Innovation Council) and 43 Irish Disruptive Technology projects are addressed in the context of cross-cutting developments and relevance to COVID-19. Candidate areas for future consideration will focus on climate action, digitization, manufacturing, and sustainable food production, security, and waste mitigation. Recommendations are also provided to facilitate community transitioning, training, enterprise, and employment to low carbon economy.",
        "DOI": "10.1016/j.scitotenv.2020.141362",
        "paper_author": "Rowan N.J.",
        "affiliation_name": "Technological University of the Shannon: Midlands Midwest (TUS)",
        "affiliation_city": "Limerick",
        "affiliation_country": "Ireland",
        "affiliation_id": "60268372",
        "affiliation_state": "Munster"
    },
    {
        "paper_title": "Exploring COVID-19 stress and its factors in Bangladesh: A perception-based study",
        "publication": "Heliyon",
        "citied_by": "207",
        "cover_date": "2020-07-01",
        "Abstract": "Background: The COVID-19 pandemic has aggregated mental health sufferings throughout the entire world. Suicide completions are the extreme consequences of COVID-19 related psychological burdens, which was reported in many countries including Bangladesh. However, there are lack of study assessing COVID-19 related human stress and its’ associations with other relevant factors affecting quality of life in the country, and which were explored in the present study. Methods: An online based survey was carried out among 340 Bangladeshi adult populations (65.90% male; mean age 26.23 ± 6.39) by utilizing the socio-demographics, possible human stress due to COVID-19 pandemic and its consequences. Dataset were analysed through a set of statistical tools e.g., T-test, one-way ANOVA, Pearson's Correlation Matrix (PCM), Principal Component Analysis (PCA), and Cluster Analysis (CA). Results: About 85.60% of the participants are in COVID-19-related stress, which results in sleep shortness, short temper, and chaos in family. Fear of COVID-19 infection (i.e., self and/or family member(s), and/or relatives), hampering scheduled study plan and future career, and financial difficulties are identified as the main causes of human stress. Results of PCM explain the relationship among the factors of human stress, and found economic hardship and food crisis are linked together causes stress of mass people, while hamper of formal education and future plan create stress of career seeker. T-test, and one-way ANOVA illustrate demographic characteristics (i.e., occupation, age, gender, and marital status) have significant effects on elevated mental stress. Moreover, PCA and CA results revealed significant interface among the respondents’ perception and factors of human stress, which matched with the existing scenario of the country. Conclusions: Considering the present findings, it is essential to introduce time-oriented policy, and implement care monitoring plans in the country, which may help in managing the pandemic as well as nurturing the public mental health to combat COVID-19 related psychological challenges.",
        "DOI": "10.1016/j.heliyon.2020.e04399",
        "paper_author": "Islam S.M.D.U.",
        "affiliation_name": "Jahangirnagar University",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60029276",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A time–frequency analysis of the impact of the Covid-19 induced panic on the volatility of currency and cryptocurrency markets",
        "publication": "Journal of Behavioral and Experimental Finance",
        "citied_by": "194",
        "cover_date": "2020-12-01",
        "Abstract": "We apply wavelet analyses to examine the impact of the Covid-19 fueled panic on the volatility of major fiat and cryptocurrency markets during January–May, 2020. There is high coherence between moves of the Coronavirus Panic Index and the price moves in Euro, British pound, and Renminbi currencies as well as movements of the Bloomberg Galaxy Crypto Index. The main conclusions for each index pair are quite similar and corroborate with our thesis that the cross-currency hedge strategies, which could work under normal market conditions, are likely to fail during the periods of global crisis, e.g., such as the Covid-19 pandemic. However, we document some important differences in currency markets behavior, which potentially could be used to design effective cross-currency hedges capable of withstanding adverse impacts of global financial and economic turmoil. Our findings could be of use for future development of financial policies and currency markets regulation rules.",
        "DOI": "10.1016/j.jbef.2020.100404",
        "paper_author": "Umar Z.",
        "affiliation_name": "Zayed University",
        "affiliation_city": "Dubai",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60070818",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Any port in a storm: Cryptocurrency safe-havens during the COVID-19 pandemic",
        "publication": "Economics Letters",
        "citied_by": "193",
        "cover_date": "2020-09-01",
        "Abstract": "Controlling for the polarity and subjectivity of social media data based on the development of the COVID-19 outbreak, we analyse the relationships between the largest cryptocurrencies and such time-varying realisation as to the scale of the economic shock centralised within the rapidly-escalating pandemic. We find evidence of significant growth in both returns and volumes traded, indicating that large cryptocurrencies acted as a store of value during this period of exceptional financial market stress. Further, cryptocurrency returns are found to be significantly influenced by negative sentiment relating to COVID-19. While not only providing diversification benefits for investors, results suggest that these digital assets acted as a safe-haven similar to that of precious metals during historiccrises.",
        "DOI": "10.1016/j.econlet.2020.109377",
        "paper_author": "Corbet S.",
        "affiliation_name": "DCU Business School",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60116848",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "Psychosocial and Socio-Economic Crisis in Bangladesh Due to COVID-19 Pandemic: A Perception-Based Assessment",
        "publication": "Frontiers in Public Health",
        "citied_by": "190",
        "cover_date": "2020-06-26",
        "Abstract": "Background: The spread of the COVID-19 pandemic, the partial lockdown, the disease intensity, weak governance in the healthcare system, insufficient medical facilities, unawareness, and the sharing of misinformation in the mass media has led to people experiencing fear and anxiety. The present study intended to conduct a perception-based analysis to get an idea of people's psychosocial and socio-economic crisis, and the possible environmental crisis, amidst the COVID-19 pandemic in Bangladesh. Methods: A perception-based questionnaire was put online for Bangladeshi citizens of 18 years and/or older. The sample size was 1,066 respondents. Datasets were analyzed through a set of statistical techniques including principal component and hierarchical cluster analysis. Results: There was a positive significant association between fear of the COVID-19 outbreak with the struggling healthcare system (p < 0.05) of the country. Also, there was a negative association between the fragile health system of Bangladesh and the government's ability to deal with the pandemic (p < 0.05), revealing the poor governance in the healthcare system. A positive association of shutdown and social distancing with the fear of losing one's own or a family members' life, influenced by a lack of healthcare treatment (p < 0.05), reveals that, due to the decision of shutting down normal activities, people may be experiencing mental and economic stress. However, a positive association of the socio-economic impact of the shutdown with poor people's suffering, the price hike of basic essentials, the hindering of formal education (p < 0.05), and the possibility of a severe socio-economic and health crisis will be aggravated. Moreover, there is a possibility of a climate change-induced disaster and infectious diseases like dengue during/after the COVID-19 situation, which will create severe food insecurity (p < 0.01) and a further healthcare crisis. Conclusions: The partial lockdown in Bangladesh due to the COVID-19 pandemic increased community transmission and worsened the healthcare crisis, economic burden, and loss of GDP despite the resuming of industrial operations. In society, it has created psychosocial and socio-economic insecurity among people due to the loss of lives and livelihoods. The government should take proper inclusive steps for risk assessment, communications, and financial stimulus toward the public to alleviate their fear and anxiety, and to take proper action to boost mental health and well-being.",
        "DOI": "10.3389/fpubh.2020.00341",
        "paper_author": "Bodrud-Doza M.",
        "affiliation_name": "Bangladesh Rural Advancement Committee",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60018391",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Entrepreneurial uncertainty during the Covid-19 crisis: Mapping the temporal dynamics of entrepreneurial finance",
        "publication": "Journal of Business Venturing Insights",
        "citied_by": "190",
        "cover_date": "2020-11-01",
        "Abstract": "This paper illustrates how chronic uncertainty caused by crisis events affects the availability of entrepreneurial sources of finance for start-ups and small and medium-sized enterprises (SMEs). To explore this line of argument, this paper examines Crunchbase real-time data examining entrepreneurial finance investments in China during unfolding Covid-19 crisis. The paper shows that these equity investments slumped dramatically in the immediate aftermath of the Covid-19 virus, resulting in a year on year decrease of 60% in the total volume of investment raised between quarter 1 in 2019 and quarter 1 in 2020. Importantly, the paper found early-stage seed investments falling the steepest, suggesting nascent start-ups are those most heavily affected by the crisis. While the global financial crisis heavily hit debt markets, the relational nature of equity investments may mean entrepreneurial finance is even more susceptible to major upheaval caused by the Covid-19 crisis. Overall, enterprise policy makers need to become better attuned at monitoring real-time data sources to mitigate chronic entrepreneurial uncertainty via strategic policy responses.",
        "DOI": "10.1016/j.jbvi.2020.e00174",
        "paper_author": "Brown R.",
        "affiliation_name": "School of Management",
        "affiliation_city": "St Andrews",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60160412",
        "affiliation_state": "Fife"
    },
    {
        "paper_title": "Time and frequency connectedness among oil shocks, electricity and clean energy markets",
        "publication": "Energy Economics",
        "citied_by": "189",
        "cover_date": "2020-09-01",
        "Abstract": "This paper examines the time and frequency connectedness among electricity, carbon and clean energy markets, and oil price demand and supply shocks. In doing so, we use the spillover method proposed by Diebold and Yilmaz (2012) and its extension in the frequency domain by Baruník and Křehlík (2018). We find increased connectedness during the global financial crisis as well as in the shale oil revolution period. The total connectedness is also higher in the short-run compared to the long-run. Due to their low connectedness, electricity futures can act as a risk diversifier and safe-haven asset against oil shocks. Net pairwise directional connectedness among oil shocks and the clean energy index is higher during the shale oil revolution. These results have important implications for investors with different investment time horizons.",
        "DOI": "10.1016/j.eneco.2020.104914",
        "paper_author": "Naeem M.A.",
        "affiliation_name": "Massey Business School",
        "affiliation_city": "Palmerston North",
        "affiliation_country": "New Zealand",
        "affiliation_id": "60121473",
        "affiliation_state": "MWT"
    },
    {
        "paper_title": "An evolutionary analysis of green finance sustainability based on multi-agent game",
        "publication": "Journal of Cleaner Production",
        "citied_by": "189",
        "cover_date": "2020-10-01",
        "Abstract": "Green finance development, which enhances innovation capacity and economic green transformation, helps people deal with the challenges of climate change, ecological crisis and energy security. It is important to achieve sustainable and balanced development for green finance. In this paper, an evolutionary game model is built with four participants, which include governments, financial institutions, enterprises, and consumers. Analogue simulation is applied to analyze the influences of each parameter on changes and development in green financial market. Equilibrium strategy and influence mechanism of participating entities are investigated. The result shows that: first, the integrity of the green financial system has a positive impact on sustainability developments and cleaner production. Second, it is critical to strengthen the government regulation, slash financial institutions and enterprises’ green finance production cost, increase the compensation for consumer pollution, and reduce the supervision cost of government. Accordingly, to integrity green financial system, governments, financial institutions, enterprises, and consumers needs participation and cooperation among each other.",
        "DOI": "10.1016/j.jclepro.2020.121799",
        "paper_author": "Cui H.",
        "affiliation_name": "North China Electric Power University (Baoding)",
        "affiliation_city": "Baoding",
        "affiliation_country": "China",
        "affiliation_id": "60108757",
        "affiliation_state": "Hebei"
    },
    {
        "paper_title": "Determinants of renewable energy production in transition economies: A panel data approach",
        "publication": "Energy",
        "citied_by": "184",
        "cover_date": "2020-01-15",
        "Abstract": "Over the past several years, the analysis of the determinants of renewable energy production has become an increasingly popular topic in academic research and governmental policy around the globe. However, many questions about these factors, especially in the transition economies in Central and Eastern Europe and the Caucasus and Central Asia, remain unanswered. To address this gap, this paper presents novel empirical evidence on the primary economic and political factors shaping transitions to a low carbon economy via renewable energy generation in post-socialist countries. Using extensive data from 27 transition economies over the years 1990–2014, it has been found that higher economic growth and rising level of unemployment and government debt acted as stimulators of renewable energy generation. The implementation of the Kyoto Protocol also led to the significant increase in renewables utilization. Furthermore, increasing CO2 emissions per capita, the implementation of the competition policy and deteriorating competitiveness within the energy market significantly limited production of energy from renewable sources. The findings also suggest that since the beginning of the last global financial crisis in 2007 reinforcement of competition within energy market and additional public funding had a much stronger role to play as factors stimulating renewables deployment.",
        "DOI": "10.1016/j.energy.2019.116583",
        "paper_author": "Przychodzen W.",
        "affiliation_name": "University of Roehampton",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026761",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Banks as lenders of first resort: Evidence from the COVID-19 crisis",
        "publication": "Review of Corporate Finance Studies",
        "citied_by": "181",
        "cover_date": "2020-11-01",
        "Abstract": "In March 2020, banks faced the largest increase in liquidity demands ever observed. Firms drew funds on a massive scale from preexisting credit lines in anticipation of cash flow and financial disruptions stemming from the advent of the COVID-19 crisis. The increase in liquidity demands was concentrated at the largest banks, who serve the largest firms. Precrisis financial condition did not constrain large banks’ liquidity supply. Coincident inflows of funds from both the Federal Reserve’s liquidity injection programs and depositors, along with strong preshock bank capital, explain why banks were able to accommodate these liquidity demands.",
        "DOI": "10.1093/rcfs/cfaa009",
        "paper_author": "Li L.",
        "affiliation_name": "Federal Reserve Board",
        "affiliation_city": null,
        "affiliation_country": null,
        "affiliation_id": "125429254",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital approaches to remote pediatric health care delivery during the COVID-19 pandemic: Existing evidence and a call for further research",
        "publication": "JMIR Pediatrics and Parenting",
        "citied_by": "174",
        "cover_date": "2020-01-01",
        "Abstract": "The global spread of the coronavirus disease (COVID-19) outbreak poses a public health threat and has affected people worldwide in various unprecedented ways, both personally and professionally. There is no question that the current global COVID-19 crisis, now more than ever, is underscoring the importance of leveraging digital approaches to optimize pediatric health care delivery in the era of this pandemic. In this perspective piece, we highlight some of the available digital approaches that have been and can continue to be used to streamline remote pediatric patient care in the era of the COVID-19 pandemic, including but not limited to telemedicine. JMIR Pediatrics and Parenting is currently publishing a COVID-19 special theme issue in which investigators can share their interim and final research data related to digital approaches to remote pediatric health care delivery in different settings. The COVID-19 pandemic has rapidly transformed health care systems worldwide, with significant variations and innovations in adaptation. There has been rapid expansion of the leveraging and optimization of digital approaches to health care delivery, particularly integrated telemedicine and virtual health. Digital approaches have played and will play major roles as invaluable and reliable resources to overcome restrictions and challenges imposed during the COVID-19 pandemic and to increase access to effective, accessible, and consumer-friendly care for more patients and families. However, a number of challenges remain to be addressed, and further research is needed. Optimizing digital approaches to health care delivery and integrating them into the public health response will be an ongoing process during the current COVID-19 outbreak and during other possible future pandemics. Regulatory changes are essential to support the safe and wide adoption of these approaches. Involving all relevant stakeholders in addressing current and future challenges as well as logistical, technological, and financial barriers will be key for success. Future studies should consider evaluating the following research areas related to telemedicine and other digital approaches: cost-effectiveness and return on investment; impact on quality of care; balance in use and number of visits needed for the management of both acute illness and chronic health conditions; system readiness for further adoption in other settings, such as inpatient services, subspecialist consultations, and rural areas; ongoing user-centered evaluations, with feedback from patients, families, and health care providers; strategies to optimize health equity and address disparities in access to care related to race and ethnicity, socioeconomic status, immigration status, and rural communities; privacy and security concerns for protected health information with Health Insurance Portability and Accountability Act (HIPAA)-secured programs; confidentiality issues for some specific populations, especially adolescents and those in need of mental health services; early detection of exposure to violence and child neglect; and integration of training into undergraduate and graduate medical education and subspecialty fellowships. Addressing these research areas is essential to understanding the benefits, sustainability, safety, and optimization strategies of telemedicine and other digital approaches as key parts of modern health care delivery. These efforts will inform long-term adoption of these approaches with expanded dissemination and implementation efforts.",
        "DOI": "10.2196/20049",
        "paper_author": "Badawy S.M.",
        "affiliation_name": "Children's Memorial Hospital",
        "affiliation_city": "Chicago",
        "affiliation_country": "United States",
        "affiliation_id": "60017031",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "Unemployment and psychological distress among young people during the covid‐19 pandemic: Psychological resources and risk factors",
        "publication": "International Journal of Environmental Research and Public Health",
        "citied_by": "173",
        "cover_date": "2020-10-01",
        "Abstract": "In the wake of COVID‐19, unemployment and its potential deleterious consequences have attracted renewed interest. We examined (1) the association between unemployment, occurring upon the coronavirus outbreak, and psychological distress among Israeli young people (20–35‐ years‐old); (2) the associations between various psychological resources/risk factors and psychological distress; and (3) whether these resources and risk factors were moderators in the unemployment‐psychological distress link. A real‐time survey based on snowball sampling was conducted during the month of April 2020 (N = 390). We employed hierarchical linear models to explore associations between unemployment, psychological resources, risk factors, and psychological distress. Unemployment was independently associated with greater psychological distress. Perceived trust, optimism, and sense of mastery decreased psychological distress, whereas financial strain and loneliness during the crisis increased this distress. The effect of unemployment on psychological distress did not depend on participants’ resource and risk factor levels. Policymakers must develop and extend health initiatives aimed at alleviating the mental health consequences of COVID‐19‐related unemployment and promote labor market interventions to help young job seekers integrate into employment. These measures, which are in line with the UN sustainable development goals, should be seen as an important route to promote public health.",
        "DOI": "10.3390/ijerph17197163",
        "paper_author": "Achdut N.",
        "affiliation_name": "Ben-Gurion University of the Negev",
        "affiliation_city": "Beer-Sheva",
        "affiliation_country": "Israel",
        "affiliation_id": "60027161",
        "affiliation_state": "Southern District"
    },
    {
        "paper_title": "Current response and management decisions of the European Union to the COVID-19 outbreak: A review",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "173",
        "cover_date": "2020-05-01",
        "Abstract": "COVID-19 has proven to be a formidable challenge for many countries in the European Union to manage effectively. The European Union has implemented numerous strategies to face emerging issues. Member States have adopted measures such as the closure of borders and significant limitations on the mobility of people to mitigate the spread of the virus. An unprecedented crisis coordination effort between Member States has facilitated the ability to purchase equipment, personal protective equipment, and other medical supplies. Attention has also been focused on providing substantive money for research to find a vaccine and promote effective treatment therapies. Financial support has been made available to protect worker salaries and businesses to help facilitate a return to a functional economy. Lessons learned to date from COVID-19 in the European Union are many; the current crisis highlights the need to think about future pandemics from a population-based management approach and apply outside the box critical thinking. Due to the complexity, intensity, and frequency of complex disasters, global leaders in healthcare, government, and business will need to pivot from siloed approaches to decision-making to embrace multidisciplinary and transdisciplinary levels of cooperation. This cooperation requires courage and leadership to recognize that changes are necessary to avoid making the same mistakes we have planned countless times on avoiding. This study focuses on the European Union's initial response to the COVID-19 pandemic, starting with how the European Union first learned and processed the global information arising out of China, followed by the incremental population-based medicine/management decisions made that currently are defining the European Union's capacity and capability. The capacity to organize, deliver, and monitor care to a specific clinical population under a population-based management target includes strict social distancing strategies, contact testing and tracing, testing for the virus antigen and its antibodies, isolation, and treatment modalities such as new mitigating medications, and finally, a vaccine.",
        "DOI": "10.3390/su12093838",
        "paper_author": "Goniewicz K.",
        "affiliation_name": "Polish Air Force University",
        "affiliation_city": "Deblin",
        "affiliation_country": "Poland",
        "affiliation_id": "60272131",
        "affiliation_state": "LU"
    },
    {
        "paper_title": "COVID-19 Place Confinement, Pro-Social, Pro-environmental Behaviors, and Residents’ Wellbeing: A New Conceptual Framework",
        "publication": "Frontiers in Psychology",
        "citied_by": "171",
        "cover_date": "2020-09-01",
        "Abstract": "Residents’ wellbeing in the present COVID-19 global health crisis requires a deeper understanding to determine appropriate management strategies to promote sustainable behaviors and contribute to human and planetary health. Residents’ behavior can have a profound influence in contributing to personal and global community’s health by responding effectively to emergency strategies in disease outbreaks such as the Coronavirus. It is evident that an understanding of residents’ behavior(s) pre COVID-19 across fields have relied on over-simplistic models, many of which will need to be revisited. Our interaction with people and nature while respecting social distancing has profound positive impacts on our physical, mental, emotional, and spiritual wellbeing. The current health pandemic has called that people be confined in their homes across many nations as a means to control the spread of the virus and save lives. This calls for research exploring the mechanisms; this paper develops and proposes a conceptual framework suggesting that place confinement promotes pro-social and household pro-environmental behaviors which could become habitual and contribute further to our people’s and our planet’s health. The proposed model concerns socio-economically favored social sectors whose survival is not as threatened by the pandemic as the poor sectors where wellbeing (and mental health) are at high risk. Some evidence shows that human connectedness to place may contribute to engagement in desirable behaviors. Interaction with other members of the household can help create meanings leading to collective actions promoting psychological wellbeing. Promoting hygienic behaviors in the household (frequent hand washing) while at the same time being conscious not to keep the water flowing when not required would contribute to a range of benefits (health, financial, biospheric, altruistic) and promote wellbeing. Engaging in pro-social behaviors may result in positive effects on psychological wellbeing, reducing mental distress giving rise to a sense of attachment and belongingness, trust and overall life satisfaction. Engaging people in low-effort pro-environmental behavior to maintain some levels of physical activity and biological harmony with natural environmental settings (e.g., gardening) may help reduce anxiety and distress. This is the first study exploring the interplay of relationships between place confinement, pro-social behavior, household pro-environmental behaviors, place attachment as a multi-dimensional construct and presenting their relationships to residents’ wellbeing. Behavioral change interventions are proposed to promote lifestyle change for people’s wellbeing and broader societal benefits.",
        "DOI": "10.3389/fpsyg.2020.02248",
        "paper_author": "Ramkissoon H.",
        "affiliation_name": "UiT Norges Arktiske Universitet",
        "affiliation_city": "Tromso",
        "affiliation_country": "Norway",
        "affiliation_id": "60021255",
        "affiliation_state": "Troms Og Finnmark"
    },
    {
        "paper_title": "Sleep and circadian rhythm in response to the COVID-19 pandemic",
        "publication": "Canadian Journal of Public Health",
        "citied_by": "167",
        "cover_date": "2020-10-01",
        "Abstract": "This commentary highlights the critical role of sleep as a public health issue, particularly during a stressful life period such as the COVID-19 pandemic, and provides evidence-based practical guidelines to manage sleep disturbances during this crisis. The COVID-19 pandemic and the imposed social confinement have produced significant stress, anxiety, and worries about health and the fear of being infected, jobs and financial problems, and uncertainty about the future. The incidence of sleep disturbances has also increased dramatically during this period. Aside from stress and anxiety, two other factors are likely to contribute to increased sleep disturbances during this crisis. First, alterations of our daily routines such as arising at a specific time, showing up at work, eating, exercising, and engaging in social and leisure activities at relatively fixed times are all important timekeepers for our sleep-wake cycles to remain synchronized with the day (light) and night (dark) cycles. Alterations of these timekeepers, combined with reduced daylight exposure, also essential to keep our biological clock synchronized, are likely to disrupt sleep and circadian rhythms. Sleep plays a fundamental role for mental and physical health, and adequate sleep duration and quality are essential for coping with major life events such as the COVID-19 pandemic. Public health education is warranted to keep the population well informed about the importance of sleep and healthy sleep practices in order to cope with the pandemic and prevent or minimize long-term adverse outcomes.",
        "DOI": "10.17269/s41997-020-00382-7",
        "paper_author": "Morin C.M.",
        "affiliation_name": "Université Laval",
        "affiliation_city": "Quebec",
        "affiliation_country": "Canada",
        "affiliation_id": "60032619",
        "affiliation_state": "QC"
    },
    {
        "paper_title": "On the efficiency of foreign exchange markets in times of the COVID-19 pandemic",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "166",
        "cover_date": "2020-12-01",
        "Abstract": "We employ multifractal detrended fluctuation analysis (MF-DFA) to provide a first look at the efficiency of forex markets during the initial period of the ongoing coronavirus disease 2019 (COVID-19), which has disrupted the global financial markets. We use high-frequency (5-min interval) data of six major currencies traded in forex markets during the period October 1, 2019 to 31 March 31, 2020. Before applying MF-DFA, we examine the inner dynamics of multifractality through seasonal and trend decompositions using loess. Overall, the results confirm the presence of multifractality in forex markets, which demonstrates, in particular, (i) a decline in the efficiency of forex markets during the COVID-19 outbreak and (ii) heterogeneous effects on the strength of multifractality of exchange rate returns under investigation. The largest effect is observed for the Australian dollar, which shows the highest (lowest) efficiency before (during) the COVID-19 pandemic, assessed in terms of low (high) multifractality. The Canadian dollar and the Swiss Franc exhibit the highest efficiency during the COVID-19 outbreak. Our findings may help policymakers shape a comprehensive response to improve forex market efficiency during such a black swan event.",
        "DOI": "10.1016/j.techfore.2020.120261",
        "paper_author": "Aslam F.",
        "affiliation_name": "COMSATS University Islamabad",
        "affiliation_city": "Islamabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60089631",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of COVID-19 pandemic upon stability and sequential irregularity of equity and cryptocurrency markets",
        "publication": "Chaos, Solitons and Fractals",
        "citied_by": "165",
        "cover_date": "2020-09-01",
        "Abstract": "We explore the evolution of the informational efficiency in 45 cryptocurrency markets and 16 international stock markets before and during COVID-19 pandemic. The measures of Largest Lyapunov Exponent (LLE) based on the Rosenstein's method and Approximate Entropy (ApEn), which are robust to small samples, are applied to price time series in order to estimate degrees of stability and irregularity in cryptocurrency and international stock markets. The amount of regularity infers on the unpredictability of fluctuations. The t-test and F-test are performed on estimated LLE and ApEn. In total, 36 statistical tests are performed to check for differences between time periods (pre- versus during COVID-19 pandemic samples) on the one hand, as well as check for differences between markets (cryptocurrencies versus stocks), on the other hand. During the COVID-19 pandemic period it was found that (a) the level of stability in cryptocurrency markets has significantly diminished while the irregularity level significantly augmented, (b) the level of stability in international equity markets has not changed but gained more irregularity, (c) cryptocurrencies became more volatile, (d) the variability in stability and irregularity in equities has not been affected, (e) cryptocurrency and stock markets exhibit a similar degree of stability in price dynamics, whilst finally (f) cryptocurrency exhibit a low level of regularity compared to international equity markets. We find that cryptos showed more instability and more irregularity during the COVID-19 pandemic compared to international stock markets. Thus, from an informational efficiency perspective, investing in digital assets during big crises as the COVID-19 pandemic, could be considered riskier as opposed to equities.",
        "DOI": "10.1016/j.chaos.2020.109936",
        "paper_author": "Lahmiri S.",
        "affiliation_name": "John Molson School of Business",
        "affiliation_city": "Montreal",
        "affiliation_country": "Canada",
        "affiliation_id": "60116755",
        "affiliation_state": "QC"
    },
    {
        "paper_title": "Bouncing forward: a resilience approach to dealing with COVID-19 and future systemic shocks",
        "publication": "Environment Systems and Decisions",
        "citied_by": "164",
        "cover_date": "2020-06-01",
        "Abstract": "Policy questions are often framed in popular discussion as situations where pulling the right levers will get the economy and society back on track after shocks and crises. This approach ignores how systems interact and how their systemic properties shape socioeconomic outcomes, leading to an over-emphasis on a limited set of characteristics, notably efficiency. We argue that this emphasis on efficiency in the operation, management and outcomes of various economic and social systems is not a conscious collective choice, but rather the response of the whole system to the incentives that individual components face. This has brought much of the world to rely upon complex, nested, and interconnected systems to deliver goods and services around the globe. While this approach has many benefits, the Covid-19 crisis shows how it has also reduced the resilience of key systems to shocks, and allowed failures to cascade from one system to others. This paper reviews the impact of COVID-19 on socioeconomic systems, discusses the notion of resilience, and provides specific recommendations on both integrating resilience analytics for recovery from the current crisis as well as on building resilient infrastructure to address future systemic challenges.",
        "DOI": "10.1007/s10669-020-09776-x",
        "paper_author": "Hynes W.",
        "affiliation_name": "L'Organisation de Coopération et de Développement Economiques",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60009357",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "The static and dynamic connectedness of environmental, social, and governance investments: International evidence",
        "publication": "Economic Modelling",
        "citied_by": "158",
        "cover_date": "2020-12-01",
        "Abstract": "We investigate the connectedness of the most significant global equity indices that comprise companies with the highest environmental, social, and governance (ESG) performance. Motivated by the rapid growth of socially responsible investing during the last two decades, we examine whether these investments are prone to similar exogenous economic and financial shocks as their conventional counterparts. Employing a variety of influential macroeconomic and financial variables over the period 10/1/2007–4/15/2020, we document statistically significant and consistent transmissions between the employed equity indices throughout the sample period. In particular, the connectedness exhibits dynamic patterns during three periods: the European sovereign debt crisis, the systemic Greek problems, and the outbreak of the coronavirus pandemic. We also find that developed equity markets are the shock transmitters to Asian and other emerging markets. Our results highlight the risk of contagion and the diminishing portfolio diversification benefits of these equity indices during turbulent periods.",
        "DOI": "10.1016/j.econmod.2020.08.007",
        "paper_author": "Umar Z.",
        "affiliation_name": "Zayed University",
        "affiliation_city": "Dubai",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60070818",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Managing Technological, Sociopolitical, and Institutional Change in the New Normal",
        "publication": "Journal of Management Studies",
        "citied_by": "153",
        "cover_date": "2020-05-01",
        "Abstract": "A New Normal environment for business has emerged in the years after the 2008 financial crisis based on numerous changes in the world's economic, technological, demographic, and sociopolitical factors. This combination of changes has created a New Normal environment for firms with major implications for managers, strategists, and entrepreneurs alike. It has resulted in an environment with new challenges and opportunities that are considerably different from what firms had to contend with in the years previous. In this paper, we present the main changes that characterize the current New Normal business environment and highlight some key implications for strategy and management. Then, we present the nine articles in this special issue dealing with different dimensions of this new environment for firms. Subsequently, we outline some future research questions that could help to advance our knowledge of the New Normal environment and its implications for firms and management theories. In examining the New Normal, it is important to be reminded that the world is indeed round and even small actions on one side of the globe can have a major impact on organizations on the other side of the globe.",
        "DOI": "10.1111/joms.12569",
        "paper_author": "Ahlstrom D.",
        "affiliation_name": "Chinese University of Hong Kong",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60002798",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Loss and grief amidst COVID-19: A path to adaptation and resilience",
        "publication": "Brain, Behavior, and Immunity",
        "citied_by": "151",
        "cover_date": "2020-07-01",
        "Abstract": "The COVID-19 pandemic has posed an extreme threat to global health and become a leading cause of death worldwide. Loss, as a more encompassing theme, interweaves many aspects of people's life in this challenging time. Failure to address the pressing needs of those experiencing loss and grief may result in poor mental and physical health. Recognizing the uniqueness of each individual and their loss and grief will provide opportunities to develop tailored strategies that facilitate functional adaptation to loss and promote mental health and wellbeing in this crisis.",
        "DOI": "10.1016/j.bbi.2020.04.053",
        "paper_author": "Zhai Y.",
        "affiliation_name": "Pennsylvania State University",
        "affiliation_city": "University Park",
        "affiliation_country": "United States",
        "affiliation_id": "60001439",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Narrative economics: How Stories Go Viral &amp; Drive Major Economic Events",
        "publication": "Narrative economics: How Stories Go Viral and Drive Major Economic Events",
        "citied_by": "147",
        "cover_date": "2020-01-01",
        "Abstract": "In a world in which internet troll farms attempt to influence foreign elections, can we afford to ignore the power of viral stories to affect economies? In this groundbreaking book, Nobel Prize-winning economist and New York Times bestselling author Robert Shiller offers a new way to think about the economy and economic change. Using a rich array of historical examples and data, Shiller argues that studying popular stories that affect individual and collective economic behavior-what he calls “narrative economics”-has the potential to vastly improve our ability to predict, prepare for, and lessen the damage of financial crises, recessions, depressions, and other major economic events. Spread through the public in the form of popular stories, ideas can go viral and move markets-whether it’s the belief that tech stocks can only go up, that housing prices never fall, or that some firms are too big to fail. Whether true or false, stories like these-transmitted by word of mouth, by the news media, and increasingly by social media-drive the economy by driving our decisions about how and where to invest, how much to spend and save, and more. But despite the obvious importance of such stories, most economists have paid little attention to them. Narrative Economics sets out to change that by laying the foundation for a way of understanding how stories help propel economic events that have had led to war, mass unemployment, and increased inequality. The stories people tell-about economic confidence or panic, housing booms, the American dream, or Bitcoin-affect economic outcomes. Narrative Economics explains how we can begin to take these stories seriously. It may be Robert Shiller’s most important book to date.",
        "DOI": "NA",
        "paper_author": "Shiller R.J.",
        "affiliation_name": "Yale University",
        "affiliation_city": "New Haven",
        "affiliation_country": "United States",
        "affiliation_id": "60005455",
        "affiliation_state": "CT"
    },
    {
        "paper_title": "The economic impact of the COVID-19 pandemic on radiology practices",
        "publication": "Radiology",
        "citied_by": "146",
        "cover_date": "2020-09-01",
        "Abstract": "The coronavirus 2019 (COVID-19) pandemic will have a profound impact on radiology practices across the country. Policy measures adopted to slow the transmission of disease are decreasing the demand for imaging independent of COVID-19. Hospital preparations to expand crisis capacity are further diminishing the amount of appropriate medical imaging that can be safely performed. Although economic recessions generally tend to result in decreased health care expenditures, radiology groups have never experienced an economic shock that is simultaneously exacerbated by the need to restrict the availability of imaging. Outpatient-heavy practices will feel the biggest impact of these changes, but all imaging volumes will decrease. Anecdotal experience suggests that radiology practices should anticipate 50%–70% decreases in imaging volume that will last a minimum of 3–4 months, depending on the location of practice and the severity of the COVID-19 pandemic in each region. The Coronavirus Aid, Relief, and Economic Security, or CARES, Act provides multiple means of direct and indirect aid to health care providers and small businesses. The final allocation of this funding is not yet clear, and it is likely that additional congressional action will be necessary to stabilize health care markets. Administrators and practice leaders must be proactive with practice modifications and financial maneuvers that can position them to emerge from this pandemic in the most viable economic position. It is possible that this crisis will have lasting effects on the structure of the radiology field.",
        "DOI": "10.1148/radiol.2020201495",
        "paper_author": "Cavallo J.J.",
        "affiliation_name": "Yale-New Haven Hospital",
        "affiliation_city": "New Haven",
        "affiliation_country": "United States",
        "affiliation_id": "60015232",
        "affiliation_state": "CT"
    },
    {
        "paper_title": "COVID 19 pandemic: Mental health challenges of internal migrant workers of India",
        "publication": "Asian Journal of Psychiatry",
        "citied_by": "144",
        "cover_date": "2020-12-01",
        "Abstract": "COVID- 19, a biomedical disease has serious physical and tremendous mental health implications as the rapidly spreading pandemic. One of the most vulnerable, but neglected, an occupational community of internal migrant workers is prone for development of psychological ill-effects due to double whammy impact of COVID-19 crisis and concomitant adverse occupational scenario. Permutations and combinations of the factors viz susceptibility for new viral infections, potential to act as vectors of transmission of infection, high prevalence of pre-existing physical health morbidities such as occupational pneumoconiosis, tuberculosis, HIV infections, pre-existing psychological morbidities, adverse psychosocial factors like absence of family support and caretaker during the crisis, their limitations to follow the rules and regulations of personal safety during the COVID 19 crisis, social exclusion, and inability to timely access the psychiatric services; all give rise to the peri-traumatic psychological distress to internal migrant workers. Superadded, is the blow of financial constraints due to loss of work, absence or suspension of occupational safety and health-related basic laws with associated occupational hazards, which make this occupational group highly vulnerable for the development of psychological illnesses. We attempt to draw the attention of mental health professionals, general medical practitioners and occupational health policymakers to the various, interrelated and interdependent predisposing and causative factors for the development of psychological ill-effects amongst internal migrant workers with the interventions needed to address it, from an occupational health perspective angle.",
        "DOI": "10.1016/j.ajp.2020.102254",
        "paper_author": "Choudhari R.",
        "affiliation_name": "National Institute of Occupational Health India",
        "affiliation_city": "Ahmedabad",
        "affiliation_country": "India",
        "affiliation_id": "60028151",
        "affiliation_state": "GJ"
    },
    {
        "paper_title": "COVID-19 Outbreak in Colombia: An Analysis of Its Impacts on Transport Systems",
        "publication": "Journal of Advanced Transportation",
        "citied_by": "143",
        "cover_date": "2020-01-01",
        "Abstract": "The global COVID-19 outbreak has demanded drastic actions and policies from the governments and local authorities to stem the spread of the virus. Most of the measures involve behavioural changes from citizens to reduce their social contact to a minimum. Thus, these actions influence individual activity patterns and transport systems in different ways. This paper studies the short-term impacts on the transport system caused by the different policies adopted by the Colombian government and local authorities to contain the COVID-19 spread. Using official and secondary data concerning the seven most populated cities in Colombia, we analyse the impacts on three components of the transport system: air transport, freight transport, and urban transport. Results show that national policies and local decisions have decreased the demand for motorised trips across the cities, diminishing congestion levels, reducing transit ridership, and creating a reduction in transport externalities. The country banned air transport for passengers and only allowed air cargo for medical and necessary supplies, which will have negative consequences for the economics of the airline industry. During the first three months of the COVID-19, freight was the most resilient transport component. However, freight trips diminished around 38%, affecting mainly the supply chain of nonessential products. During the pandemic, governments need to provide subsidies to maintain the system supply to avoid crowdedness and promote active transport by allocating less-used street space to cyclists and pedestrians. In the short term, transportation service providers will face a financial crisis, deepened by the pandemic, which will require government assistance for their recovery.",
        "DOI": "10.1155/2020/8867316",
        "paper_author": "Arellana J.",
        "affiliation_name": "Universidad del Norte",
        "affiliation_city": "Barranquilla",
        "affiliation_country": "Colombia",
        "affiliation_id": "60054319",
        "affiliation_state": "Atlantico"
    },
    {
        "paper_title": "Regional Resilience in Times of a Pandemic Crisis: The Case of COVID-19 in China",
        "publication": "Tijdschrift voor Economische en Sociale Geografie",
        "citied_by": "143",
        "cover_date": "2020-07-01",
        "Abstract": "The notion of resilience to analyse how fast systems recover from shocks has been increasingly taken up in economic geography, in which there is a burgeoning literature on regional resilience. Regional resilience is a place-sensitive, multi-layered and multi-scalar, conflict-ridden and highly contingent process. The nature of shocks is one important impact factor on regional resilience. Arguably, so far, most literature on regional resilience has dealt with the financial crisis in 2008/2009. In this research note, we will analyse both the particular characteristics of the current COVID-19 crisis, as well as its effects on regional recovery and potential resilience in China, where it started. We conclude that a complex combination of the characteristics of the current COVID-19 crisis, the institutional experience of dealing with previous pandemic and epidemic crises, government support schemes, as well as regional industrial structures, might potentially affect the recovery and resilience rates of Chinese regions.",
        "DOI": "10.1111/tesg.12447",
        "paper_author": "Gong H.",
        "affiliation_name": "Christian-Albrechts-Universität zu Kiel",
        "affiliation_city": "Kiel",
        "affiliation_country": "Germany",
        "affiliation_id": "60012345",
        "affiliation_state": "Schleswig-Holstein"
    },
    {
        "paper_title": "Dynamic co-movement between oil and stock markets in oil-importing and oil-exporting countries: Two types of wavelet analysis",
        "publication": "Energy Economics",
        "citied_by": "141",
        "cover_date": "2020-08-01",
        "Abstract": "This study explores the dynamic co-movement between oil and six stock markets (China, India, Japan, Saudi Arabia, Russia, and Canada) by using two types of wavelet analysis (wavelet multi-scale decomposition and wavelet coherence). The main empirical results are as follows: (1) Maximal overlap discrete wavelet transform analysis shows that there are feedback relationships between the price movement of oil and stock markets in all six countries in the wavelet-based decomposition at the D4, D5, and D6 scales. (2) The pairs of oil and stock returns show high overall co-movement at the 16- to 128-week scale based on continuous wavelet transform analysis. The wavelet coherence and phase plots show that the pairs of oil and oil-importing stock market returns have high co-movement for the period between 2007 and 2012 (especially during the global financial crisis of 2008). In addition, the wavelet coherence and phase plots show that the pairs of oil and oil-exporting stock market returns have high co-movement from 2007 to 2017. (3) Oil price returns lead the stock returns of Saudi Arabia, Russia and Canada from 2007 to 2017 at the 16- to 128-week scale. The stock prices are more influenced by oil prices in oil-exporting countries than in oil-importing countries. This evidence implies that the economic structure of oil-exporting countries depends strongly on crude oil production. (4) From the results of the wavelet-based Granger causality test, there is a lead-lag causality linkage in which the oil price leads stock market indices from 27 to 30 weeks (189–210 days). The implications of these findings are discussed.",
        "DOI": "10.1016/j.eneco.2020.104835",
        "paper_author": "Jiang Z.",
        "affiliation_name": "Hankuk University of Foreign Studies",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60007830",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The global financial crisis and the capital structure of firms: Was the impact more severe among SMEs and non-listed firms?",
        "publication": "Journal of Corporate Finance",
        "citied_by": "138",
        "cover_date": "2020-02-01",
        "Abstract": "Using a dataset covering about 276,998 firms across 75 countries over the period 2004–2011, this paper examines the short-run evolution of firms' capital structures following the start of the global financial crisis and its immediate aftermath, comparing the experience of already levered SMEs, large non-listed firms, and listed companies. We find that firm leverage and debt maturity declined both in advanced economies and in developing countries, even in those that did not experience a crisis. The deleveraging and maturity reduction were particularly significant for non-listed firms, including both SMEs as well as large non-listed companies. For SMEs, these effects were larger in countries with less efficient legal systems, weaker information sharing mechanisms, less developed financial sectors, and with more restrictions on bank entry. In contrast, there is weaker evidence of a significant decline in leverage and debt maturity among listed companies which are typically much larger than other firms and likely to benefit from the “spare tire” of easier access to capital market financing. Though our results are robust to many changes in sample and specification, we cannot rule out that survivorship bias and attrition could affect our estimates to some degree.",
        "DOI": "10.1016/j.jcorpfin.2019.101514",
        "paper_author": "Demirgüç-Kunt A.",
        "affiliation_name": "The World Bank, USA",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60112834",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Safe but Lonely? Loneliness, Anxiety, and Depression Symptoms and COVID-19",
        "publication": "Frontiers in Psychology",
        "citied_by": "136",
        "cover_date": "2020-12-04",
        "Abstract": "Background: The COVID-19 pandemic has led governments worldwide to implement unprecedented response strategies. While crucial to limiting the spread of the virus, “social distancing” may lead to severe psychological consequences, especially in lonely individuals. Methods: We used cross-sectional (n = 380) and longitudinal (n = 74) designs to investigate the links between loneliness, anxiety, and depression symptoms (ADS) and COVID-19 risk perception and affective response in young adults who implemented social distancing during the first 2 weeks of the state of epidemic threat in Poland. Results: Loneliness was correlated with ADS and with affective response to COVID-19’s threat to health. However, increased worry about the social isolation and heightened risk perception for financial problems was observed in lonelier individuals. The cross-lagged influence of the initial affective response to COVID-19 on subsequent levels of loneliness was also found. Conclusion: The reciprocal connections between loneliness and COVID-19 response may be of crucial importance for ADS during the COVID-19 crisis.",
        "DOI": "10.3389/fpsyg.2020.579181",
        "paper_author": "Okruszek Ł.",
        "affiliation_name": "Polish Academy of Sciences",
        "affiliation_city": "Warsaw",
        "affiliation_country": "Poland",
        "affiliation_id": "60014383",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Generation rent and the financialization of housing: a comparative exploration of the growth of the private rental sector in Ireland, the UK and Spain",
        "publication": "Housing Studies",
        "citied_by": "136",
        "cover_date": "2020-04-20",
        "Abstract": "This article analyses the growth of the private rental sector over recent years through a comparative analysis of three classic homeowner societies: Ireland, the UK and Spain. The article argues that theories of financialization provide a useful framework for understanding ‘generation rent’. In particular, the cyclical nature of credit markets tends to undermine homeownership over the medium term. This contributes to and intensifies the wider set of policy changes associated with neoliberalism. The article also accounts for the divergent experiences of our three case study countries within their common trajectory. It does so through an analytical focus on the interaction between global aspects of financialization and more nationally based ones, such as mortgage markets, as well as on how both are mediated by national policy regimes. The article thus aims to contribute to the emerging literature seeking to explain ‘generation rent’ and explore its significance, and more broadly to political economy approaches to housing system change.",
        "DOI": "10.1080/02673037.2019.1632813",
        "paper_author": "Byrne M.",
        "affiliation_name": "University College Dublin",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60005141",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "Do employee-friendly firms invest more efficiently? Evidence from labor investment efficiency",
        "publication": "Journal of Corporate Finance",
        "citied_by": "133",
        "cover_date": "2020-12-01",
        "Abstract": "We investigate the impact of employee treatment on labor investment efficiency. We provide evidence that employee-friendly treatment is significantly associated with lower deviations of labor investment from the level justified by economic fundamentals, i.e., higher labor investment efficiency. The effect of employee treatment on labor investment efficiency is stronger for firms that are human-capital-intensive, with more skilled labor and knowledge capital, and those that face higher product market competition. Using the 2008–2009 financial crisis as an external shock and applying the difference-in-difference method, we also show that employee-friendly firms have higher labor investment efficiency in the post-financial crisis period, but experience more inefficient labor investments during the crisis. Our results are robust to placebo tests, selection bias, propensity score matching, alternative explanations, alternative proxies for both employee treatment and labor investment efficiency as well as the adjustment for using residuals as dependent variables, additional control variables, and various approaches in addressing endogeneity issues.",
        "DOI": "10.1016/j.jcorpfin.2020.101744",
        "paper_author": "Cao Z.",
        "affiliation_name": "Nanjing Audit University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60089945",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Personal economic anxiety in response to COVID-19",
        "publication": "Personality and Individual Differences",
        "citied_by": "133",
        "cover_date": "2020-12-01",
        "Abstract": "The economic effects of COVID-19 have been far-reaching. Using a sample of adults from the United States (n = 513), the present study examined demographic and individual correlates of anxiety about financial hardship on March 17th, 2020, the day after historic stock market drops in response to the emerging COVID-19 crisis. Confirmatory factor analysis models determined that a unidimensional approach best accounted for covariation among types of economic anxiety. Zero-order and semi-partial correlations with economic anxiety were estimated. Younger adults tended to report greater anxiety than older adults. Black respondents reported significantly more anxiety, whereas respondents without children living at home reported less anxiety. Low collective self-esteem, low conscientiousness, and low openness to experience were associated with greater economic anxiety. High neuroticism, perceived vulnerability to disease, and belongingness stemming from large group activities also were associated with greater anxiety. The current study provides a first glance at individual differences in understanding who may experience economic anxiety due to the COVID-19 pandemic.",
        "DOI": "10.1016/j.paid.2020.110233",
        "paper_author": "Mann F.D.",
        "affiliation_name": "University of Minnesota Twin Cities",
        "affiliation_city": "Minneapolis",
        "affiliation_country": "United States",
        "affiliation_id": "60029445",
        "affiliation_state": "MN"
    },
    {
        "paper_title": "Fintech in COVID-19 and beyond: What factors are affecting customers’ choice of fintech applications?",
        "publication": "Journal of Open Innovation: Technology, Market, and Complexity",
        "citied_by": "132",
        "cover_date": "2020-12-01",
        "Abstract": "Accessing financial services is considered one of the main challenges facing communities during crises. This research studies the role of using FinTech applications to build resilience during the COVID-19 pandemic. The research empirically examines the factors affecting Jordanian citizens’ intention to use FinTech applications. The sample of the research comprised 500 potential FinTech service users in Jordan. Based on the research conceptual model, five hypotheses were developed and tested using structural equation modeling techniques (SEM-PLS). The research results indicate that perceived benefits and social norms significantly affect the intention to use FinTech applications. However, it has been found that perceived technology risks do not significantly affect the intention to use FinTech applications. Moreover, the results also indicate that customer trust is significantly mediating the relationship between perceived risks and intention to use FinTech applications. FinTech service providers should insure that their products are easy to use, fulfill needs and protect consumers’ data in order to ensure trust, hence positively influencing consumer adoption.",
        "DOI": "10.3390/joitmc6040153",
        "paper_author": "Al Nawayseh M.K.",
        "affiliation_name": "School of Business University of Jordan",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60199636",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Industry volatility and economic uncertainty due to the COVID-19 pandemic: Evidence from wavelet coherence analysis",
        "publication": "Finance Research Letters",
        "citied_by": "132",
        "cover_date": "2020-11-01",
        "Abstract": "This study investigates the impact of economic uncertainty due to the coronavirus (COVID-19) pandemic on the industrial economy in the US in terms of the interdependence and causality relationship. We apply wavelet coherence analysis to economic policy uncertainty (EPU) data and monthly sector volatility of the S&P 500 index from January 2008 to May 2020. The results reveal that EPU in terms of COVID-19 has influenced the sector volatility more than the global financial crisis (GFC) for all sectors. Furthermore, EPU leads the volatility of all sectors during COVID-19 pandemic, while some sector's volatilities lead EPU during the GFC.",
        "DOI": "10.1016/j.frl.2020.101783",
        "paper_author": "Choi S.Y.",
        "affiliation_name": "Gachon University",
        "affiliation_city": "Seongnam",
        "affiliation_country": "South Korea",
        "affiliation_id": "60199632",
        "affiliation_state": "Gyeonggi-do"
    },
    {
        "paper_title": "The COVID-19 pandemic and its implications for rural economies",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "132",
        "cover_date": "2020-05-01",
        "Abstract": "This paper presents a rapid assessment of current and likely future impacts of the COVID-19 outbreak on rural economies given their socio-economic characteristics. Drawing principally on current evidence for the UK, as well as lessons from the 2001 Foot and Mouth Disease outbreak and the 2007/8 financial crises, it outlines the likely key demand and supply effects, paying attention to the situation for agriculture as well as discussing the implications for rural communities. A distinction is made between the effects on businesses offering goods and services for out-of-home as opposed to in-home consumption. Gendered dimensions are also noted as likely business and household strategies for coping and adaptation. The paper concludes with a brief mapping of a research agenda for studying the longer-term effects of COVID-19 on rural economies.",
        "DOI": "10.3390/SU12103973",
        "paper_author": "Phillipson J.",
        "affiliation_name": "Newcastle University",
        "affiliation_city": "Newcastle",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60006222",
        "affiliation_state": "Tyne and Wear"
    },
    {
        "paper_title": "Financial crisis prediction model using ant colony optimization",
        "publication": "International Journal of Information Management",
        "citied_by": "132",
        "cover_date": "2020-02-01",
        "Abstract": "Financial decisions are often based on classification models which are used to assign a set of observations into predefined groups. Different data classification models were developed to foresee the financial crisis of an organization using their historical data. One important step towards the development of accurate financial crisis prediction (FCP) model involves the selection of appropriate variables (features) which are relevant for the problems at hand. This is termed as feature selection problem which helps to improve the classification performance. This paper proposes an Ant Colony Optimization (ACO) based financial crisis prediction (FCP) model which incorporates two phases: ACO based feature selection (ACO-FS) algorithm and ACO based data classification (ACO-DC) algorithm. The proposed ACO-FCP model is validated using a set of five benchmark dataset includes both qualitative and quantitative. For feature selection design, the developed ACO-FS method is compared with three existing feature selection algorithms namely genetic algorithm (GA), Particle Swarm Optimization (PSO) algorithm and Grey Wolf Optimization (GWO) algorithm. In addition, a comparison of classification results is also made between ACO-DC and state of art methods. Experimental analysis shows that the ACO-FCP ensemble model is superior and more robust than its counterparts. In consequence, this study strongly recommends that the proposed ACO-FCP model is highly competitive than traditional and other artificial intelligence techniques.",
        "DOI": "10.1016/j.ijinfomgt.2018.12.001",
        "paper_author": "J U.",
        "affiliation_name": "Pondicherry University",
        "affiliation_city": "Puducherry",
        "affiliation_country": "India",
        "affiliation_id": "60013919",
        "affiliation_state": "PY"
    },
    {
        "paper_title": "COVID-19 impacts and recovery strategies: The case of the hospitality industry in Spain",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "130",
        "cover_date": "2020-10-02",
        "Abstract": "The health crisis caused by the pandemic COVID-19 has been of such magnitude that the drop-off in economic and tourist activity in most countries is generating an economic crisis with consequences that are still difficult to measure. The present work analyses the origins and evolution of the coronavirus pandemic and reviews the literature related to the impacts and recovery strategies that were implemented in previous crisis situations affecting the hotel industry. In order to focus the study on one country, Spain was selected based on tourism indicators, the importance of tourism for this country and the importance of Spain as a leader in international tourist destinations. The influence of the pandemic on the Spanish tourism sector and, more specifically, on its hospitality industry is explored in depth. In addition, the main initiatives to support the tourism and hospitality sector that have been undertaken at the global, European and national levels are highlighted and, finally, the response and recovery strategies of the five largest Spanish hotel chains to guarantee a COVID-19-free stay in their facilities and to recover the accommodation activity are discussed.",
        "DOI": "10.3390/su12208599",
        "paper_author": "Rodríguez-Antón J.M.",
        "affiliation_name": "Universidad Autónoma de Madrid",
        "affiliation_city": "Madrid",
        "affiliation_country": "Spain",
        "affiliation_id": "60026796",
        "affiliation_state": "Madrid"
    },
    {
        "paper_title": "Time-varying co-movements between energy market and global financial markets: Implication for portfolio diversification and hedging strategies",
        "publication": "Energy Economics",
        "citied_by": "130",
        "cover_date": "2020-08-01",
        "Abstract": "This study explores the time patterns of volatility spillovers between energy market and stock prices of seven major global financial markets including clean energy, energy, information technology corporations, equity markets and United States economic policy index over the period vary from December 28, 2000 to December 31, 2018. We employ a time domain connectedness measures of Diebold and Yilmaz (DY, 2009, 2012 and 2014) to examine spillover mechanism of volatility shocks across future markets. Optimal weights and hedge ratios are calculated for portfolio diversification and risk management. The main findings of the study conclude that oil shocks are exogenous and contribution of oil market volatility to global financial markets is insignificant. The returns of World Stock Index and World Energy Index are major transmitters of volatility to clean energy market. Moreover, the impact of energy market become strong in global financial market when data is divided into pre, during and post financial crisis periods. Finally, the hedge ratios are volatile over time and their maximum value is observed during the financial crisis period of 2008–09. The optimal portfolio between energy and stock prices are heavily weighted to the stock markets.",
        "DOI": "10.1016/j.eneco.2020.104847",
        "paper_author": "Elsayed A.H.",
        "affiliation_name": "Durham University",
        "affiliation_city": "Durham",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60022175",
        "affiliation_state": "County Durham"
    },
    {
        "paper_title": "Real GDP growth rates and healthcare spending - Comparison between the G7 and the EM7 countries",
        "publication": "Globalization and Health",
        "citied_by": "129",
        "cover_date": "2020-07-16",
        "Abstract": "Background: Accelerated globalisation has substantially contributed to the rise of emerging markets worldwide. The G7 and Emerging Markets Seven (EM7) behaved in significantly different macroeconomic ways before, during, and after the 2008 Global Crisis. Average real GDP growth rates remained substantially higher among the EM7, while unemployment rates changed their patterns after the crisis. Since 2017, however, approximately one half of the worldwide economic growth is attributable to the EM7, and only a quarter to the G7. This paper aims to analyse the association between the health spending and real GDP growth in the G7 and the EM7 countries. Results: In terms of GDP growth, the EM7 exhibited a higher degree of resilience during the 2008 crisis, compared to the G7. Unemployment in the G7 nations was rising significantly, compared to pre-recession levels, but, in the EM7, it remained traditionally high. In the G7, the austerity (measured as a percentage of GDP) significantly decreased the public health expenditure, even more so than in the EM7. Out-of-pocket health expenditure grew at a far more concerning pace in the EM7 compared to the G7 during the crisis, exposing the vulnerability of households living close to the poverty line. Regression analysis demonstrated that, in the G7, real GDP growth had a positive impact on out-of-pocket expenditure, measured as a percentage of current health expenditure, expressed as a percentage of GDP (CHE). In the EM7, it negatively affected CHE, CHE per capita, and out-of-pocket expenditure per capita. Conclusion: The EM7 countries demonstrated stronger endurance, withstanding the consequences of the crisis as compared to the G7 economies. Evidence of this was most visible in real growth and unemployment rates, before, during and after the crisis. It influenced health spending patterns in both groups, although they tended to diverge instead of converge in several important areas.",
        "DOI": "10.1186/s12992-020-00590-3",
        "paper_author": "Jakovljevic M.",
        "affiliation_name": "Faculty of Medical Sciences, University of Kragujevac",
        "affiliation_city": "Kragujevac",
        "affiliation_country": "Serbia",
        "affiliation_id": "60068810",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Financial geography III: The financialization of the city",
        "publication": "Progress in Human Geography",
        "citied_by": "128",
        "cover_date": "2020-06-01",
        "Abstract": "This report discusses the financialization of urban governance and the built environment as an explicit state strategy, focusing on municipal finance and the use of financial products by the local state and (semi-)public sector. A number of lessons can be drawn regarding the temporality and spatiality of financializing ‘the urban’. Firstly, the financial crisis that started in 2007 has not resulted in a definancialization of the city. Secondly, despite a number of common trends, the literature also highlights the diversity of experiences. Yet it would be too easy to conclude that the financialization of the land, housing and real estate is exclusively a Global North phenomenon, as it extends into the Global South. Finally, the literature notes an emerging gentrification-touristification-financialization nexus. The role of the state in all of this is variegated and often ambiguous.",
        "DOI": "10.1177/0309132519853922",
        "paper_author": "Aalbers M.B.",
        "affiliation_name": "KU Leuven",
        "affiliation_city": "Leuven",
        "affiliation_country": "Belgium",
        "affiliation_id": "60025063",
        "affiliation_state": "Vlaams-Brabant"
    },
    {
        "paper_title": "COVID-19 Interconnectedness: Health Inequity, the Climate Crisis, and Collective Trauma",
        "publication": "Family Process",
        "citied_by": "126",
        "cover_date": "2020-09-01",
        "Abstract": "The COVID-19 pandemic brings to the forefront the complex interconnected dilemmas of globalization, health equity, economic security, environmental justice, and collective trauma, severely impacting the marginalized and people of color in the United States. This lack of access to and the quality of healthcare, affordable housing, and lack of financial resources also continue to have a more significant impact on documented and undocumented immigrants. This paper aims at examining these critical issues and developing a framework for family therapists to address these challenges by focusing on four interrelated dimensions: cultural values, social determinants of health, collective trauma, and the ethical and moral responsibility of family therapists. Given the fact that family therapists may unwittingly function as the best ally of an economic and political system that perpetuates institutionalized racism and class discrimination, we need to utilize a set of principles, values, and practices that are not just palliative or after the fact but bring forth into the psychotherapeutic and policy work a politics of care. Therefore, a strong call to promote and advocate for the broader continuum of health and critical thinking preparing professionals to meet the challenges of health equity, as well as economic and environmental justice, is needed. The issues discussed in this paper are specific to the United States despite their relevance to family therapy as a field. We are mindful not to generalize the United States' reality to the rest of the world, recognizing that issues discussed in this paper could potentially contribute to international discourse.",
        "DOI": "10.1111/famp.12572",
        "paper_author": "Watson M.F.",
        "affiliation_name": "Drexel University",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60014662",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Preventing carbon emission retaliatory rebound post-COVID-19 requires expanding free trade and improving energy efficiency",
        "publication": "Science of the Total Environment",
        "citied_by": "125",
        "cover_date": "2020-12-01",
        "Abstract": "Existing studies have shown that the COVID-19 pandemic caused a sharp drop in carbon emissions in 2020. A recent example of the impact of sudden extreme events on carbon emissions occurred in the 2008 global financial crisis, in which carbon emissions droped in 2009, but jumped in 2010. This study is aimed to discuss how to prevent the retaliatory growth of carbon emissions post COVID-19 through learning the lessons from analysis of short-term and long-term drivers of carbon emissions. This study explored the short-term (annual) effects (population scale. affluence level, carbon intensity, energy intensity) of changes in carbon emissions by decomposing carbon emissions in the world, different income groups and selected countries before and after the 2008 financial crisis using LMDI technique. In addition, this study explored the long-term effects (energy consumption per capita, energy structure, energy intensity, foreign direct investment, and trade openness) of changes in carbon emissions by decomposing carbon emission in the world and different income groups from 1990 to 2014 using VAR technique. The decomposition results of short-term drivers of carbon emission uncovered that the deterioration in energy efficiency (increase in energy intensity) was the main reason for the retaliatory rebound in carbon emissions post-2008 financial crisis, especially in high-income countries. The decomposition results of long-term drivers of carbon emission uncovered that trade openness contributed to reduce carbon emission in the world and the incomes groups in the long term, although trade openness led to increase in carbon emission in developing countries in the short term. To prevent retaliatory rebound of carbon emissions, what we should learn two lessons from the decomposition of carbon emission: improving energy efficiency, and expanding trade openness. Unfortunately, energy efficiency has been neglected in the economic recovery plans to respond to COVID-19 of various countries, especially developed countries, and worse, trade protectionism is on the rise, especially in developed countries. Therefore, we are pessimistic about preventing a retaliatory rebound in carbon emissions post-COVID-19 for now.",
        "DOI": "10.1016/j.scitotenv.2020.141158",
        "paper_author": "Wang Q.",
        "affiliation_name": "China University of Petroleum (East China)",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60105111",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Cooperative financial institutions: A review of the literature",
        "publication": "International Review of Financial Analysis",
        "citied_by": "125",
        "cover_date": "2020-10-01",
        "Abstract": "Financial cooperatives play an important role in the financial systems of many countries. They act as a safe haven for deposits and are major sources of credit for households and small- and medium-sized firms. A not-for-profit orientation (in many cases) and a focus on maximising benefits to members have ensured the enduring popularity and sustainability of financial cooperatives. This is particularly evident since the global financial crisis when financial cooperatives continued to extend credit to members as many profit-orientated commercial banks restricted credit to households and firms. The overarching theme of the first part of this review is the structural and behavioural characteristics of financial cooperatives. In this part we consider, the origin and diffusion of financial cooperatives, network arrangements, the business model, relationship banking, balancing the interest of members, tax treatment and regulatory framework. The second part has performance and contribution to the real economy as the overarching theme. In this part we consider, efficiency and sustainability, mergers, acquisitions and failures, the benefits (and challenges) of FinTech and the contribution of financial cooperatives to the real economy including during times of crisis. The paper concludes with a summary of what we now know (and do not know) about financial cooperatives and provides suggestions as to where future research may usefully concentrate.",
        "DOI": "10.1016/j.irfa.2020.101520",
        "paper_author": "McKillop D.",
        "affiliation_name": "Queen's Management School",
        "affiliation_city": "Belfast",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60177646",
        "affiliation_state": "Northern Ireland"
    },
    {
        "paper_title": "The Covid-19 economic crisis: dangerously unique",
        "publication": "Business Economics",
        "citied_by": "124",
        "cover_date": "2020-10-01",
        "Abstract": "The Covid-19 crisis is unique in several respects. This devastating recession does not have an economic origin, will dance largely to the tune of non-economic factors, and is truly global. The policy response has been equally unique, in terms of speed, size and scope, eliciting an unprecedented concerted effort combining monetary, fiscal and prudential policies. This has contained the fallout. At the time of writing, financial markets have rebounded to the point of looking exuberant, but it all feels more like a truce than a peace treaty. The crisis is transitioning from the liquidity to the solvency phase in a context of limited and shrinking room for policy manoeuvre. All this raises difficult near- and longer-term challenges. Rebuilding policy buffers in all policy areas is likely to be the policy challenge of the decade ahead.",
        "DOI": "10.1057/s11369-020-00184-2",
        "paper_author": "Borio C.",
        "affiliation_name": "Bank for International Settlements",
        "affiliation_city": "Basel",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60005819",
        "affiliation_state": "BS"
    },
    {
        "paper_title": "Herding behaviour in energy stock markets during the Global Financial Crisis, SARS, and ongoing COVID-19*",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "123",
        "cover_date": "2020-12-01",
        "Abstract": "Environmental change created worldwide interest in investing in renewable energy. Less reliance on fossil fuels would have a substantial influence on investors for alternative energy, especially renewable energy. The literature has concentrated on empirical studies of herding behaviour in finance, but not in renewable energy. This paper fills the gap by investigating herding in renewable energy, using daily closing prices in renewable and fossil fuel energy stock returns in the USA, Europe, and Asia, for March 24, 2000–May 29, 2020, which covers the Global Financial Crisis (GFC) (2007–2009), the coronavirus crises of SARS (2003). And the ongoing COVID-19 (2019–2020) pandemic. The paper shows that: (1) for low extreme oil returns, investors are more likely to display herding in the stock market; (2) for SARS and COVID-19, herding is more likely during extremely high oil returns after the GFC; and (3) herding is more likely during periods of extremely low oil returns during the coronavirus crises. These results suggest that after the GFC, investors are more sensitive to asset losses, so they will be more likely to display herding in the stock market. However, during SARS and COVID-19, investors panic so they may unwisely sell their assets. There are strong cross-sector herding spillover effects from US fossil fuel energy to renewable energy, especially before the GFC, while the US fossil fuel energy market has a significant influence on the Europe and Asia renewable energy returns during COVID-19. During SARS, which was not a pandemic, US fossil fuels only had an impact on US renewable energy returns.",
        "DOI": "10.1016/j.rser.2020.110349",
        "paper_author": "Chang C.L.",
        "affiliation_name": "National Chung Hsing University",
        "affiliation_city": "Taichung",
        "affiliation_country": "Taiwan",
        "affiliation_id": "60017511",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The dynamics among entrepreneurship, innovation, and economic growth in the Eurozone countries",
        "publication": "Journal of Policy Modeling",
        "citied_by": "123",
        "cover_date": "2020-09-01",
        "Abstract": "Economic growth in the Eurozone has been lacklustre over the last two decades due to increased global competition from economic players in other regions, economic and financial crisis, and political uncertainties within the zone. To increase the global competitiveness of the region, the European Union launched the Europe 2020 Strategy to raise the level of entrepreneurship and innovation, which are purported to be key drivers of economic growth. The main purpose of this paper is to investigate whether this assertion is true. Thus, the paper investigates the Granger causal relationships among entrepreneurship development, innovation, and economic growth for a sample of the Eurozone countries for the period 2001–2016. Using a vector error-correction model, the study finds that in the long run, both entrepreneurship and innovation stimulate economic growth. In the short run, strong causal links exist but are not always uniform. The results reveal that Eurozone countries should indeed base their growth strategies on policies that promote innovation and policies that create incentives for entrepreneurship.",
        "DOI": "10.1016/j.jpolmod.2020.01.004",
        "paper_author": "Pradhan R.P.",
        "affiliation_name": "Vinod Gupta School of Management",
        "affiliation_city": "Kharagpur",
        "affiliation_country": "India",
        "affiliation_id": "60212786",
        "affiliation_state": "WB"
    },
    {
        "paper_title": "Dependences and volatility spillovers between the oil and stock markets: New evidence from the copula and VAR-BEKK-GARCH models",
        "publication": "International Review of Financial Analysis",
        "citied_by": "120",
        "cover_date": "2020-03-01",
        "Abstract": "This paper examines the dynamic relationship between the oil market and stock markets from two perspectives: dependence between the crude oil market (WTI) and stock markets of the US and China, and volatility spillovers between them during 1991–2016. We further analyze structural breaks of market dependences and consider the extent of their influence on such relationships. Our vine-copula results show that the dependences between the three paired markets, WTI-US, WTI-China and US-China, vary dynamically across the six identified structural break periods. In particular, the dependence between WTI-US is stronger and more volatile than that between WTI-China during most of the periods. The dependence between US-China remains at a lower level in the earlier periods, but increases in the final period. Our VAR-BEKK-GARCH results demonstrate distinctive volatility spillovers across these periods, with varying directionality, in response to the structural changes. Overall, our results indicate that the oil market stimulates rapid and continual fluctuations in market dependences, which become manifest most acutely in the aftermath of the Financial Crisis of 2007–08, demonstrating the increasing interdependence between the oil and stock markets. Further, the growing influence of China on the dynamics of these relationships, in the period following the Great Recession, presents evidence that it begins to assume an increasingly important role in global economic recovery.",
        "DOI": "10.1016/j.irfa.2018.11.007",
        "paper_author": "Yu L.",
        "affiliation_name": "Beijing University of Chemical Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60021843",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Challenges for the islamic finance and banking in post COVID era and the role of Fintech",
        "publication": "Journal of Economic Cooperation and Development",
        "citied_by": "119",
        "cover_date": "2020-01-01",
        "Abstract": "Novel Corona Virus (COVID-19) pandemic has created a huge disruption in the finance world and it poses another challenge to Islamic finance after the global financial crisis to provide an alternative and sustainable finance. Islamic finance has a large market share in industries such as, microfinance, small and medium enterprises, and retail lending. They are the worst hit during the ongoing pandemic. The magnitude of the ongoing financial crisis is expected to be different from the global financial crisis of 2008; therefore, it poses different challenges for Islamic finance and banking. It requires a different set of financial services, strategies, and technologies to overcome this challenge. Against such a backdrop, the present study aims to analyze the challenges posed by COVID-19 to the Islamic finance and how disruptive technological innovation called Fintech can be utilized to address those challenges. The study also presents a critical analysis of the Islamic finance and the role of Islamic finance in creating a more sustainable financial system post COVID.",
        "DOI": "NA",
        "paper_author": "Hassan M.K.",
        "affiliation_name": "University of New Orleans",
        "affiliation_city": "New Orleans",
        "affiliation_country": "United States",
        "affiliation_id": "60022758",
        "affiliation_state": "LA"
    },
    {
        "paper_title": "Financial development and carbon emissions in China since the recent world financial crisis: Evidence from a spatial-temporal analysis and a spatial Durbin model",
        "publication": "Science of the Total Environment",
        "citied_by": "119",
        "cover_date": "2020-05-01",
        "Abstract": "China's financial development boomed after the recent world financial crisis in 2007. Financial development may affect an economy and hence carbon emissions significantly. No research has examined their relationship since this crisis up to now. Against this background, the effect of financial development on carbon intensity in China from 2007 to 2016 is investigated. The spatial and temporal patterns, and the dynamic evolution of both China's provincial carbon emissions and financial development were firstly investigated. Then a Spatial Durbin Model was employed to explore the effects of financial development, since this crisis, on carbon intensity, controlling related variables. The results show that financial development will significantly increase the local province's emissions but significantly decrease adjacent areas' emissions to a larger extent, so that the overall effect is that financial development will curb carbon emissions. The paper concludes that carbon emission reductions in China since 2007 may not be caused by the financial resources being channeled into the research and development of emission-reduction technologies or into high value-added firms. Hence, it is suggested that measures be taken to channel financial resources into the right projects and firms.",
        "DOI": "10.1016/j.scitotenv.2020.136771",
        "paper_author": "Liu H.",
        "affiliation_name": "North China Electric Power University (Baoding)",
        "affiliation_city": "Baoding",
        "affiliation_country": "China",
        "affiliation_id": "60108757",
        "affiliation_state": "Hebei"
    },
    {
        "paper_title": "COVID-19 drives consumer behaviour and agro-food markets towards healthier and more sustainable patterns",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "118",
        "cover_date": "2020-10-02",
        "Abstract": "This study examines the extant state of research into our understanding of the impact of the coronavirus pandemic in its early stages on food-purchasing behaviour. As such, it includes a summary and categorisation of the findings, extending to consumption preferences worldwide. After the indiscriminate stockpiling of food, which was witnessed in many countries following the implementation of the lockdown, the impact of COVID-19 (COronaVIrus Disease-2019) on consumer habits has inversely varied in function of personal attitudes, individual and household experiences, and characteristics. Specific contexts, and the financial, economic, and logistic nature of these contexts, have also been found to be of relevance in examining the research relating to the coronavirus pandemic and food-purchasing behaviour. Concurrent with the pandemic, some worldwide trends have emerged—home cooking has been rediscovered, leading to an increase in the demand for staple foodstuffs, and purchases from small, local retailers and online food shopping have been accorded preferential treatment. Despite price volatility and concern about future household incomes, a significant proportion of consumers have shifted to buying healthier, more sustainable food. Moreover, food wastage has seen a notable decrease in volume. Such an occasion should be strategically exploited by manufacturers and retailers in satisfying this consumer demand. Finally, the COVID-19 crisis would seem to offer an unparalleled opportunity to re-engineer the agro-food market by driving the transition toward more sustainable supply and production patterns. Thus, stronger and more equitable partnerships between farmers, manufacturers, retailers, and citizens may be in the process of being forged.",
        "DOI": "10.3390/su12208366",
        "paper_author": "Borsellino V.",
        "affiliation_name": "Università degli Studi di Palermo",
        "affiliation_city": "Palermo",
        "affiliation_country": "Italy",
        "affiliation_id": "60017697",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Decisions effectiveness of FDI investment biases at real estate industry: Empirical evidence from Dubai smart city projects",
        "publication": "International Journal of Scientific and Technology Research",
        "citied_by": "118",
        "cover_date": "2020-03-01",
        "Abstract": "Dubai has proved as most economically active among the seven emirates of UAE and it has grown to be an important trade and investment center in the Middle East. In the last two decades, the international investment community has been attracted by the (Sheikh Mohammed bin Rashid Al Maktoum) ruler of Dubai for its infrastructural development. The purpose of the study is to analyze the international investor's behavior at Real Estate Industry in Dubai. Major real estate international investors have been listed in RERA and from 331 investors 131 investors has been accessible for conducting analysis. The multi-stage process has been used for sampling and for analyzing the investor behavior bivariate model has been used in the study. The result shows the significant relationship between FDI investor behavior and the investment performance of real estate projects in Dubai. Results also concluded that Dubai is a less risky place for investment due to study flow of FDI since last few years. Investors from Saudi-Arabia, Japan, UK USA and all over the world get high dividend-yielding return on the investment at the real estate sector in Dubai, except the period of global financial crises.",
        "DOI": "NA",
        "paper_author": "Joghee S.",
        "affiliation_name": "Skyline University College",
        "affiliation_city": "Sharjah",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60113212",
        "affiliation_state": "Sharjah"
    },
    {
        "paper_title": "Social and Psychophysiological Consequences of the COVID-19 Pandemic: An Extensive Literature Review",
        "publication": "Frontiers in Psychology",
        "citied_by": "116",
        "cover_date": "2020-12-16",
        "Abstract": "The Coronavirus Disease 2019 (COVID-19) pandemic, now a global health crisis, has surprised health authorities around the world. Recent studies suggest that the measures taken to curb the spread of the COVID-19 outbreak have generated issues throughout the population. Thus, it is necessary to establish and identify the possible risk factors related to the psychosocial and psychophysiological strain during the COVID-19 outbreak. The present extensive literature review assesses the social, psychological, and physiological consequences of COVID-19, reviewing the impact of quarantine measures, isolation, vast human loss, social and financial consequences in the family’s economies, and its impact on the psychological health of the population. We also discussed the effect of psychophysiological factors, considering the impact of physical inactivity and modifications in nutritional habits, at psychological and physiological levels. The present review includes an actualized to date bibliography, articles for which were methodologically analyzed to verify they met the standards of quality and scientific accuracy. Authors understand the pandemic as a multifactorial event for which only a profound and extensive analysis would lead to better compression and efficient intervention in the near future.",
        "DOI": "10.3389/fpsyg.2020.580225",
        "paper_author": "Clemente-Suárez V.J.",
        "affiliation_name": "Universidad Europea de Madrid",
        "affiliation_city": "Villaviciosa de Odon",
        "affiliation_country": "Spain",
        "affiliation_id": "60028356",
        "affiliation_state": "Madrid"
    },
    {
        "paper_title": "Financial crisis, bank diversification, and financial stability: OECD countries",
        "publication": "International Review of Economics and Finance",
        "citied_by": "116",
        "cover_date": "2020-01-01",
        "Abstract": "Using a sample of commercial banks based in OECD countries, we investigate the effect of bank diversification on financial stability and find a significantly nonlinear (i.e., inverted U-shaped) relationship. These findings suggest that a moderate degree of bank diversification increases bank stability, but excessive diversification has an adverse effect. Furthermore, we find that this relationship has a temporal dimension. For example, bank diversification decreased the variance of bank stability prior to the financial crisis but increased its variance during the crisis. Thus, during crisis periods, it is better for banks to concentrate on traditional intermediation functions (i.e., deposits and loans) rather than diversifying their activities and investments. Further, the results suggest that although most regulators worldwide encourage diversification to reduce bank risk, bank diversification may exacerbate bank financial instability or increase the risk of financial market collapse when idiosyncratic events, such as financial crises occur.",
        "DOI": "10.1016/j.iref.2019.08.009",
        "paper_author": "Kim H.",
        "affiliation_name": "Chungbuk National University",
        "affiliation_city": "Cheongju",
        "affiliation_country": "South Korea",
        "affiliation_id": "60004739",
        "affiliation_state": "Chungcheongbuk-do"
    },
    {
        "paper_title": "Benefiting from economic crisis? Strategic orientation effects, trade-offs, and configurations with resource availability on SME performance",
        "publication": "International Entrepreneurship and Management Journal",
        "citied_by": "116",
        "cover_date": "2020-03-01",
        "Abstract": "While there is growing interest in exploring strategic orientations, their interaction, and impact on firm performance, most research has been conducted within stable economic environments. Taking into consideration economic instability, it is timely to develop a more nuanced understanding of how economic crises may affect key strategic orientation prescriptions. In this research, we examine entrepreneurial and market orientations as means through which firms may operate within an economic crisis to seize available opportunities. Additionally, we consider how increasing financial resource availability during macro-economic constraint may affect these relationships. Based on a rare, and robust national random sample of 612 Russian small to medium-sized enterprises (SMEs) collected during a recent period of economic crisis in 2015–2016, our results reveal a positive effect of entrepreneurial orientation and a non-significant effect of market orientation. Moreover, we demonstrate how financial resource availability in concert with firms’ strategic orientations yields distinctly more, and less, productive configurations.",
        "DOI": "10.1007/s11365-018-0499-2",
        "paper_author": "Beliaeva T.",
        "affiliation_name": "Graduate School of Management, St. Petersburg State University",
        "affiliation_city": "Saint Petersburg",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60116539",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Note: Mayday, Mayday, Mayday! Responding to environmental shocks: Insights on global airlines’ responses to COVID-19",
        "publication": "Transportation Research Part E: Logistics and Transportation Review",
        "citied_by": "115",
        "cover_date": "2020-11-01",
        "Abstract": "The COVID-19 pandemic in 2019/2020 ushered in a new turbulent and chaotic global environment where governments not only placed temporary restrictions on people's movements, but also mandated limits on business activities. However, lacking in the contemporary scholarly discourse is a deeper understanding of how businesses respond to such pandemics. In this research note (RN), a conceptual framework of firms’ responses is advanced. Using the global airline industry, the analysis delineates a host of internally generated and externally imposed firms’ strategic and tactical responses to the pandemic including in-flight service changes, flight cancellations, seeking emergency aids and financial supports, and firm closures. The analysis demonstrates that in responding to the crisis, many airlines sought to minimise erosion of long-developed knowledge, market capabilities, route networks, access to airports, customer base and relationships/trust with customers prior to COVID-19 to equip them for recovery. The wider implications for academics, managers and governments are outlined as the effects of COVID-19 continue to unfold.",
        "DOI": "10.1016/j.tre.2020.102098",
        "paper_author": "Amankwah-Amoah J.",
        "affiliation_name": "Kent Business School",
        "affiliation_city": "Canterbury",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60162124",
        "affiliation_state": "Kent"
    },
    {
        "paper_title": "The pass-through effects of oil price shocks on China's inflation: A time-varying analysis",
        "publication": "Energy Economics",
        "citied_by": "115",
        "cover_date": "2020-02-01",
        "Abstract": "Using a time-varying parameter structural vector autoregression with stochastic volatility (TVP-SVAR-SV) model, we decompose the structural shocks of oil price fluctuations into four types: oil supply shocks, global demand shocks, domestic demand shocks and oil-specific demand shocks. We then analyze the time-varying effects of these oil price shocks on China's inflation at the import, production and consumption stages using monthly data from January 1999 to December 2016. The results show that the pass-through effects of the four types of oil price shocks on China's inflation at each stage are time-varying and that there are significant differences at different time horizons and points in time. The analysis of the variance decomposition shows that the effects of oil price shocks on China's inflation at each stage are incomplete and decrease along the price chain. The increase in oil prices driven by oil-specific demand shocks is the most important cause of China's inflation at the import and production stages during the full sample period, while China's inflation at the consumption stage is mainly affected by domestic demand shocks. In addition, the inflationary effects of oil price shocks have been dramatically weaker since the international financial crisis compared with before the crisis.",
        "DOI": "10.1016/j.eneco.2020.104695",
        "paper_author": "Chen J.",
        "affiliation_name": "Central South University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60017060",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "Touristification, transnational gentrification and urban change in Lisbon: The neighbourhood of Alfama",
        "publication": "Urban Studies",
        "citied_by": "115",
        "cover_date": "2020-11-01",
        "Abstract": "The Great Recession (2008–2014) and the consequent crises in both the national financial and production systems have led the Portuguese administration to adopt tourism and urban rehabilitation as new pivotal sectors to overcome the critical crisis-derived impacts on the economy and society. Moreover, both national and local administrations have deployed a range of legislative initiatives to attract transnational real estate investment and new high-income residents to the country, including generous tax benefits and residency permits for large foreign investors. This is of greater relevance in the historic neighbourhoods of Lisbon city centre, as in the case of Alfama, which has recently been transformed into one of the most important urban hotspots in the country for both local and transnational real estate investors. By focusing on this historic quarter of Lisbon, this paper examines how processes of gentrification and studentification occurring in the area since the late 1990s and early 2000s have been disrupted by recent processes of touristification and Airbnbisation in Alfama, transforming the entire neighbourhood into an ‘outdoor hotel’. The paper concludes by suggesting that, while urban touristification appears today as a new reproduction mechanism of glocal financial capital, the Airbnbisation of former lower-class central urban areas of post-recession southern European cities emerges as the newest, most aggressive form of urban accumulation by dispossession and spatial displacement against the working and middle-lower classes (both locals and migrants) of the ‘tourist city’.",
        "DOI": "10.1177/0042098019883734",
        "paper_author": "Sequera J.",
        "affiliation_name": "Universidad de Valladolid",
        "affiliation_city": "Valladolid",
        "affiliation_country": "Spain",
        "affiliation_id": "60024695",
        "affiliation_state": "Valladolid"
    },
    {
        "paper_title": "The impacts of social and economic crises on tourist behaviour and expenditure: an evolutionary approach",
        "publication": "Current Issues in Tourism",
        "citied_by": "115",
        "cover_date": "2020-03-18",
        "Abstract": "Regardless of type, level and magnitude, a crisis has an effect on the tourism sector. Although numerous studies have investigated tourism crises, most of them concentrate on the increase and decrease in tourist arrival numbers. However, to date, little is known about the evolutionary differences in tourist behaviour caused by different types of crisis. This study investigates the underlying influence of financial and health-related crises on tourist profile, purpose of visit and expenditure patterns in Hong Kong's inbound tourism industry. The results indicate a variation in tourists’ sensitivity before, during and after crises in short- and long-haul markets. This difference is apparent in terms of age, purpose of visit and expenditure patterns in tourists. We found that the nature and phases of crises do not invariably influence tourists. Implications and suggestions for future research are also discussed.",
        "DOI": "10.1080/13683500.2018.1546674",
        "paper_author": "Senbeto D.L.",
        "affiliation_name": "The Hong Kong Polytechnic University",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008928",
        "affiliation_state": "Hong Kong"
    },
    {
        "paper_title": "Sustainability reporting and bank performance after financial crisis: Evidence from developed and developing countries",
        "publication": "Competitiveness Review",
        "citied_by": "114",
        "cover_date": "2020-01-01",
        "Abstract": "Purpose: This study aims to examine the relationship between sustainability reporting and bank performance after financial crisis in developed and developing countries. Design/methodology/approach: This study examines 882 banks from developed and developing countries covering 11 years after the 2008 financial crisis. The independent variable is environmental, social and governance (ESG) scores. The dependent variables are return on assets, return on equity and Tobin’s Q. This study uses bank- and country-specific control variables to measure the relationship between sustainability reporting and bank performance. Findings: The findings deduced from the empirical results demonstrate that ESG improves banks’ accounting and market-based performance in developed countries, supporting value creation theory. Using pooling regression and instrumental variable – generalized method of moments, this study finds that ESG weakens banks’ performance in developed and developing countries. Originality/value: To the best of the author’s knowledge, this is the first study to investigate and compare the impact of sustainability reporting on banks’ performance in developed and developing countries. The study found similarities in the impact of sustainability reporting and the improvement of banks’ current and future performance.",
        "DOI": "10.1108/CR-04-2019-0040",
        "paper_author": "Buallay A.",
        "affiliation_name": "Brunel University London",
        "affiliation_city": "Uxbridge",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020623",
        "affiliation_state": "Middlesex"
    },
    {
        "paper_title": "EU environmental policy in times of crisis",
        "publication": "Journal of European Public Policy",
        "citied_by": "114",
        "cover_date": "2020-01-02",
        "Abstract": "The European Union (EU) has been buffeted by a range of crises since 2007, not least the economic and financial crisis. One potential victim of this economic malaise is environmental policy ambition. It is well-established that during economic crises environmental policy slips down the agenda with long term consequences for environmental quality. The EU has sought to cast itself as a global environmental leader but that leadership has in large part rested upon its ability to set ambitious policy goals at home. The future environmental policy trajectory and leadership of the EU may be under threat as the Union struggles to emerge from the economic crisis. This article presents a comprehensive and robust analysis of all environmental policy outputs adopted by the EU over a ten-year period covering the crisis. This legislative analysis is supplemented by interviews with policy stakeholders. The article finds evidence of waning ambition over the period under analysis but a range of explanatory variables emerges from the interviews, which suggests that the diminution in EU environmental policy ambition is driven by a mix of factors and maybe likely to persist over the longer term.",
        "DOI": "10.1080/13501763.2018.1561741",
        "paper_author": "Burns C.",
        "affiliation_name": "The University of Sheffield",
        "affiliation_city": "Sheffield",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60001881",
        "affiliation_state": "South Yorkshire"
    },
    {
        "paper_title": "Trade credit research before and after the global financial crisis of 2008 – A bibliometric overview",
        "publication": "Research in International Business and Finance",
        "citied_by": "113",
        "cover_date": "2020-12-01",
        "Abstract": "This study presents an overview of the state-of-the-art in trade credit research by examining 1191 publications between 1955 and 2019. Applying bibliometrics and econometrics, the study compares the extant research across the three sub-domains of banking and finance, production and operations, and accounting. Findings suggest that the financial emergency in the global market had resulted in a watershed moment in trade credit research. About 69 % of the literature was found to have emerged after the global economic crisis of 2008. A network analysis grouped the trade credit articles into four major and four minor clusters. The banking and financing cluster exhibited the highest growth followed by the production and operation cluster while the perspectives of accounting are yet to gain traction. Conversely, reputation of the publishing hub, empirical studies, and the production and operational dimensions of the research positively and significantly influence citations. Alongside a thorough introspection, the study also provides new areas to direct the course of future research.",
        "DOI": "10.1016/j.ribaf.2020.101287",
        "paper_author": "Pattnaik D.",
        "affiliation_name": "Malaviya National Institute of Technology Jaipur",
        "affiliation_city": "Jaipur",
        "affiliation_country": "India",
        "affiliation_id": "60017757",
        "affiliation_state": "RJ"
    },
    {
        "paper_title": "COVID-19 and the Politics of Crisis",
        "publication": "International Organization",
        "citied_by": "112",
        "cover_date": "2020-12-01",
        "Abstract": "The COVID-19 pandemic presents an opportunity to refocus scholarly attention on the politics of crisis. Crises that abruptly upend political and economic relations are important and increasing in frequency. However, the division of international relations into international political economy (IPE) and international security has contributed to the relative neglect of non-militarized crises like pandemics. Crises are defined by threat, uncertainty, and time pressure: understanding them requires a careful examination of how these variables affect political and economic outcomes. Drawing on often disparate literatures on finance, energy and climate change, natural disasters, pandemics, and violent conflict, I propose a broad research program around the politics of crisis, focusing on puzzles related to causes, responses, and transformations.",
        "DOI": "10.1017/S0020818320000375",
        "paper_author": "Lipscy P.Y.",
        "affiliation_name": "University of Toronto",
        "affiliation_city": "Toronto",
        "affiliation_country": "Canada",
        "affiliation_id": "60016849",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "China's coal consumption in a globalizing world: Insights from Multi-Regional Input-Output and structural decomposition analysis",
        "publication": "Science of the Total Environment",
        "citied_by": "111",
        "cover_date": "2020-04-01",
        "Abstract": "The growth of global carbon emissions is largely driven by coal-burning in China. China has consumed approximately half of global coal; as such, limiting its coal demand is important for curbing carbon emissions in the country and around the world. Developing effective approaches to limit China's coal demand requires comprehensively understanding the trajectory and drivers shaping its coal footprint in the globalized world. Past studies have investigated production-based coal consumption within China's sovereign territory boundary, but have not addressed consumption-based coal consumption and the globalization background. To fill this research gap, this study conducted a multi-regional input-output analysis – structural decomposition analysis to analyze China's coal footprint in a globalized world. The results show a continued rise in the influence of globalization on China's coal consumption, despite the 1997 Asian financial crisis and 2008–09 global economic crisis lowering of global trade. The percentage of other countries’ coal demand on China's production-based coal footprint increased from 20% in 1995 to nearly 30% in 2011, through a global transfer of virtual coal through trade. Virtual coal refers to the coal consumed to support production activities. Meanwhile, the impact of other countries’ coal supply on China's consumption-based coal footprint increased from less than 2% in 1995 to more than 4% in 2011. However, the decomposition results showed that domestic demand was the leading contributor to Chinese production-based and consumption-based coal footprint. This was offset by the domestic coal intensity effect. To cut China's coal, strategies to cap its total coal consumption should be considered in a globalized world. Improving energy intensity is an effective approach for the country; China should be leveraging the globalized world, rather than serving as the world's factory through high coal consumption and exports.",
        "DOI": "10.1016/j.scitotenv.2019.134790",
        "paper_author": "Wang Q.",
        "affiliation_name": "China University of Petroleum (East China)",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60105111",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Impact of economic policy uncertainty shocks on China's financial conditions",
        "publication": "Finance Research Letters",
        "citied_by": "111",
        "cover_date": "2020-07-01",
        "Abstract": "This study explores the effect of global economic policy uncertainty (EPU) shocks on China's financial conditions index (CFCI) and analyzes the sources of uncertainty shocks. The results of the spillover index showed that the spillover effects of global EPU on CFCI were concentrated in the crisis periods, but mostly insignificant effect in the normal periods. The uncertainty shocks emanating from China itself were the major sources of China's financial markets volatility and the US EPU appeared to be the most significant exogenous cause of the fall of CFCI. The source of long-term uncertainty shocks changed over time.",
        "DOI": "10.1016/j.frl.2019.101303",
        "paper_author": "Li Z.",
        "affiliation_name": "Guangzhou University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60025345",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "What the COVID-19 pandemic tells us about the need to develop resilience in the nursing workforce",
        "publication": "Nursing Management",
        "citied_by": "110",
        "cover_date": "2020-06-02",
        "Abstract": "Most research on resilience in healthcare systems such as the NHS is based on organisational crises, such as nurse shortages, an ageing workforce and financial restrictions. However, nursing can learn lessons from the past to consider how to become more resilient, particularly considering the 2020 COVID-19 pandemic. This article briefly looks at previous pandemics and disasters that have affected healthcare systems, as well as the 2020 COVID-19 pandemic, and considers how nurse leaders can support staff and show organisational resilience during such emergencies. The article also discusses how nurse leaders can develop their own resilience.",
        "DOI": "10.7748/nm.2020.e1933",
        "paper_author": "Duncan D.",
        "affiliation_name": "Queen's University Belfast",
        "affiliation_city": "Belfast",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60029738",
        "affiliation_state": "Northern Ireland"
    },
    {
        "paper_title": "How connected is the global sovereign credit risk network?",
        "publication": "Journal of Banking and Finance",
        "citied_by": "110",
        "cover_date": "2020-04-01",
        "Abstract": "This paper estimates the global network structure of sovereign credit risk by applying the Diebold-Yilmaz connectedness methodology on sovereign credit default swaps (SCDSs). The level of credit risk connectedness among sovereigns, which is quite high, is comparable to the connectedness among stock markets and foreign exchange markets. In the aftermath of the recent financial crises that originated in developed countries, emerging market countries have played a crucial role in the transmission of sovereign credit risk, while developed countries and debt-ridden developing countries have played marginal roles. Secondary regressions show that both trade and capital flows are important determinants of pairwise connectedness across countries. The capital flows became increasingly important after 2013, while the effect of trade flows decreased during the crisis and did not recover afterwards.",
        "DOI": "10.1016/j.jbankfin.2020.105761",
        "paper_author": "Bostanci G.",
        "affiliation_name": "University of Pennsylvania",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60006297",
        "affiliation_state": "PA"
    }
]