[
    {
        "paper_title": "Financial Fraud: A Review of Anomaly Detection Techniques and Recent Advances",
        "publication": "Expert Systems with Applications",
        "citied_by": "230",
        "cover_date": "2022-05-01",
        "Abstract": "With the rise of technology and the continued economic growth evident in modern society, acts of fraud have become much more prevalent in the financial industry, costing institutions and consumers hundreds of billions of dollars annually. Fraudsters are continuously evolving their approaches to exploit the vulnerabilities of the current prevention measures in place, many of whom are targeting the financial sector. These crimes include credit card fraud, healthcare and automobile insurance fraud, money laundering, securities and commodities fraud and insider trading. On their own, fraud prevention systems do not provide adequate security against these criminal acts. As such, the need for fraud detection systems to detect fraudulent acts after they have already been committed and the potential cost savings of doing so is more evident than ever. Anomaly detection techniques have been intensively studied for this purpose by researchers over the last couple of decades, many of which employed statistical, artificial intelligence and machine learning models. Supervised learning algorithms have been the most popular types of models studied in research up until recently. However, supervised learning models are associated with many challenges that have been and can be addressed by semi-supervised and unsupervised learning models proposed in recently published literature. This survey aims to investigate and present a thorough review of the most popular and effective anomaly detection techniques applied to detect financial fraud, with a focus on highlighting the recent advancements in the areas of semi-supervised and unsupervised learning.",
        "DOI": "10.1016/j.eswa.2021.116429",
        "paper_author": "Hilal W.",
        "affiliation_name": "McMaster University",
        "affiliation_city": "Hamilton",
        "affiliation_country": "Canada",
        "affiliation_id": "60031828",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Big data: A game changer for insurance industry",
        "publication": "Big Data: A Game Changer for Insurance Industry",
        "citied_by": "112",
        "cover_date": "2022-07-19",
        "Abstract": "Big data - unstructured and/or structured data being used to influence underwriting, rating, pricing, forms, marketing and claims handling and incentivize risk reduction - is a relatively recent development in the insurance industry, the data sets previously being too impossibly great to analyse through traditional methods. However, with the global capacity to collect and store data growing alongside advancements in AI and machine learning technology, insurers need to seriously evaluate their technology stacks to ensure they can remain competitive and respond to growing customer demand. Striking a balance between the technical characteristics of the subject and the practical aspects of decision making, spanning from fraud analytics in claims management, to customer analytics, to risk analytics in solvency, the comprehensive coverage presented makes Big Data an invaluable resource for any insurance professional. Providing high quality academic research, Emerald Studies in Finance, Insurance, and Risk Management provides a platform for authors to explore, analyse and discuss current and new financial models and theories, and engage with innovative research on an international scale. Subjects of interest may include banking, accounting, auditing, compliance, sustainability, behaviour, management, and business economics.",
        "DOI": "10.1108/978-1-80262-605-62022100",
        "paper_author": "Sood K.",
        "affiliation_name": "Chitkara University, Punjab",
        "affiliation_city": "Rajpura",
        "affiliation_country": "India",
        "affiliation_id": "60113205",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "The role of data science in healthcare advancements: applications, benefits, and future prospects",
        "publication": "Irish Journal of Medical Science",
        "citied_by": "97",
        "cover_date": "2022-08-01",
        "Abstract": "Data science is an interdisciplinary field that extracts knowledge and insights from many structural and unstructured data, using scientific methods, data mining techniques, machine-learning algorithms, and big data. The healthcare industry generates large datasets of useful information on patient demography, treatment plans, results of medical examinations, insurance, etc. The data collected from the Internet of Things (IoT) devices attract the attention of data scientists. Data science provides aid to process, manage, analyze, and assimilate the large quantities of fragmented, structured, and unstructured data created by healthcare systems. This data requires effective management and analysis to acquire factual results. The process of data cleansing, data mining, data preparation, and data analysis used in healthcare applications is reviewed and discussed in the article. The article provides an insight into the status and prospects of big data analytics in healthcare, highlights the advantages, describes the frameworks and techniques used, briefs about the challenges faced currently, and discusses viable solutions. Data science and big data analytics can provide practical insights and aid in the decision-making of strategic decisions concerning the health system. It helps build a comprehensive view of patients, consumers, and clinicians. Data-driven decision-making opens up new possibilities to boost healthcare quality.",
        "DOI": "10.1007/s11845-021-02730-z",
        "paper_author": "Subrahmanya S.V.G.",
        "affiliation_name": "Manipal Institute of Technology",
        "affiliation_city": "Manipal",
        "affiliation_country": "India",
        "affiliation_id": "60028079",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Ranking the importance of demographic, socioeconomic, and underlying health factors on US COVID-19 deaths: A geographical random forest approach",
        "publication": "Health and Place",
        "citied_by": "89",
        "cover_date": "2022-03-01",
        "Abstract": "A growing number of studies show that the uneven spatial distribution of COVID-19 deaths is related to demographic and socioeconomic disparities across space. However, most studies fail to assess the relative importance of each factor to COVID-19 death rate and, more importantly, how this importance varies spatially. Here, we assess the variables that are more important locally using Geographical Random Forest (GRF), a local non-linear regression method. Through GRF, we estimated the non-linear relationships between the COVID-19 death rate and 29 socioeconomic and health-related factors during the first year of the pandemic in the USA (county level). GRF outputs are compared to global (Random Forest and OLS) and local (Geographically Weighted Regression) models. Results show that GRF outperforms all models and that the importance of variables highly varies by location. For example, lack of health insurance is the most important factor in one-third (34.86%) of the US counties. Most of these counties are (concentrated mainly in the Midwest region and South region). On the other hand, no leisure-time physical activity is the most important primary factor for 19.86% of the US counties. These counties are found in California, Oregon, Washington, and parts of the South region. Understanding the location-based characteristics and spatial patterns of socioeconomic and health factors linked to COVID-19 deaths is paramount for policy designing and decision making. In this way, interventions can be designed and implemented based on the most important factors locally, avoiding thus general guidelines addressed for the entire nation.",
        "DOI": "10.1016/j.healthplace.2022.102744",
        "paper_author": "Grekousis G.",
        "affiliation_name": "Sun Yat-Sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60021182",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Optimal feature extraction and classification-oriented medical insurance prediction model: machine learning integrated with the internet of things",
        "publication": "International Journal of Computers and Applications",
        "citied_by": "72",
        "cover_date": "2022-01-01",
        "Abstract": "This paper plans to develop an effective machine learning system integrated with the Internet of Things (IoT) to predict the health insurance amount. IoT in healthcare enables interoperability, machine-to-machine communication, information exchange, and data movement that make healthcare service delivery effective. The model includes three phases (a) Feature Extraction, and (b) Weighted Feature Extraction, and (c) Prediction. The feature extraction process computes two statistical measures: First Order Statistics like mean, median, standard deviation, the maximum value of entire data, and minimum value of entire data, and Second-Order Statistics like Kurtosis, skewness, correlation, and entropy. The prediction process deploys a renowned machine learning algorithm called Neural Network (NN). As the main contribution, the weighted feature vector is developed here, where the weight optimally tuned by Modified Whale Optimization Algorithm (WOA). Also, the contribution relies on NN, where the training algorithm replaced with the same modified WOA for weight update. The modified WOA developed here is termed as Fitness dependent Randomized Whale Optimization Algorithm (FR-WOA). At last, the valuable experimental analysis using three datasets confirms the efficient performance of the suggested model.",
        "DOI": "10.1080/1206212X.2020.1733307",
        "paper_author": "Chowdhury S.",
        "affiliation_name": "Vels Institute of Science, Technology &amp; Advanced Studies",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60105237",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Insurance fraud detection: Evidence from artificial intelligence and machine learning",
        "publication": "Research in International Business and Finance",
        "citied_by": "65",
        "cover_date": "2022-12-01",
        "Abstract": "This study proposes a framework for fraud detection in the auto insurance industry by using predictive models. The feature selection is performed utilizing a publicly available car insurance dataset and uncovers the most influential feature through Boruta algorithm. Three predictive models (logistic regression, support vector machine, and naïve Bayes) are applied for developing a fraud detection mechanism. Six metrics are computed from the confusion matrix to assess the performance of the predictive model. The results reveal that the support vector machine outperforms in terms of accuracy, and the logistic regression achieves the highest f-measure score. Each influential feature's ranking is performed, and it is revealed that the fault, base policy, and age of the policyholder are the most influential features. The findings of this study are beneficial for fraud detection in the auto insurance industry. Additionally, the underlying framework holds a functionality for real-time problem-solving in the auto insurance industry.",
        "DOI": "10.1016/j.ribaf.2022.101744",
        "paper_author": "Aslam F.",
        "affiliation_name": "COMSATS University Islamabad",
        "affiliation_city": "Islamabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60089631",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Causal mediation analysis with double machine learning",
        "publication": "Econometrics Journal",
        "citied_by": "57",
        "cover_date": "2022-05-01",
        "Abstract": "This paper combines causal mediation analysis with double machine learning for a data-driven control of observed confounders in a high-dimensional setting. The average indirect effect of a binary treatment and the unmediated direct effect are estimated based on efficient score functions, which are robust with respect to misspecifications of the outcome, mediator, and treatment models. This property is key for selecting these models by double machine learning, which is combined with data splitting to prevent overfitting. We demonstrate that the effect estimators are asymptotically normal and n-1/2-consistent under specific regularity conditions and investigate the finite sample properties of the suggested methods in a simulation study when considering lasso as machine learner. We also provide an empirical application to the US National Longitudinal Survey of Youth, assessing the indirect effect of health insurance coverage on general health operating via routine checkups as mediator, as well as the direct effect.",
        "DOI": "10.1093/ectj/utac003",
        "paper_author": "Farbmacher H.",
        "affiliation_name": "TUM School of Management, Munich",
        "affiliation_city": "Munich",
        "affiliation_country": "Germany",
        "affiliation_id": "60117649",
        "affiliation_state": "Bayern"
    },
    {
        "paper_title": "Ethical Conundrums in the Application of Artificial Intelligence (AI) in Healthcare—A Scoping Review of Reviews",
        "publication": "Journal of Personalized Medicine",
        "citied_by": "54",
        "cover_date": "2022-11-01",
        "Abstract": "Background: With the availability of extensive health data, artificial intelligence has an inordinate capability to expedite medical explorations and revamp healthcare.Artificial intelligence is set to reform the practice of medicine soon. Despite the mammoth advantages of artificial intelligence in the medical field, there exists inconsistency in the ethical and legal framework for the application of AI in healthcare. Although research has been conducted by various medical disciplines investigating the ethical implications of artificial intelligence in the healthcare setting, the literature lacks a holistic approach. Objective: The purpose of this review is to ascertain the ethical concerns of AI applications in healthcare, to identify the knowledge gaps and provide recommendations for an ethical and legal framework. Methodology: Electronic databases Pub Med and Google Scholar were extensively searched based on the search strategy pertaining to the purpose of this review. Further screening of the included articles was done on the grounds of the inclusion and exclusion criteria. Results: The search yielded a total of 1238 articles, out of which 16 articles were identified to be eligible for this review. The selection was strictly based on the inclusion and exclusion criteria mentioned in the manuscript. Conclusion: Artificial intelligence (AI) is an exceedingly puissant technology, with the prospect of advancing medical practice in the years to come. Nevertheless, AI brings with it a colossally abundant number of ethical and legal problems associated with its application in healthcare. There are manifold stakeholders in the legal and ethical issues revolving around AI and medicine. Thus, a multifaceted approach involving policymakers, developers, healthcare providers and patients is crucial to arrive at a feasible solution for mitigating the legal and ethical problems pertaining to AI in healthcare.",
        "DOI": "10.3390/jpm12111914",
        "paper_author": "Prakash S.",
        "affiliation_name": "Panimalar Medical College Hospital &amp; Research Institute",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "123435842",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Density of states prediction for materials discovery via contrastive learning from probabilistic embeddings",
        "publication": "Nature Communications",
        "citied_by": "51",
        "cover_date": "2022-12-01",
        "Abstract": "Machine learning for materials discovery has largely focused on predicting an individual scalar rather than multiple related properties, where spectral properties are an important example. Fundamental spectral properties include the phonon density of states (phDOS) and the electronic density of states (eDOS), which individually or collectively are the origins of a breadth of materials observables and functions. Building upon the success of graph attention networks for encoding crystalline materials, we introduce a probabilistic embedding generator specifically tailored to the prediction of spectral properties. Coupled with supervised contrastive learning, our materials-to-spectrum (Mat2Spec) model outperforms state-of-the-art methods for predicting ab initio phDOS and eDOS for crystalline materials. We demonstrate Mat2Spec’s ability to identify eDOS gaps below the Fermi energy, validating predictions with ab initio calculations and thereby discovering candidate thermoelectrics and transparent conductors. Mat2Spec is an exemplar framework for predicting spectral properties of materials via strategically incorporated machine learning techniques.",
        "DOI": "10.1038/s41467-022-28543-x",
        "paper_author": "Kong S.",
        "affiliation_name": "Cornell Ann S. Bowers College of Computing and Information Science",
        "affiliation_city": "Ithaca",
        "affiliation_country": "United States",
        "affiliation_id": "60278093",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "A novel fraud detection and prevention method for healthcare claim processing using machine learning and blockchain technology",
        "publication": "Decision Analytics Journal",
        "citied_by": "48",
        "cover_date": "2022-09-01",
        "Abstract": "Healthcare fraud is a global problem affecting both developing and developed countries. It is the deliberate attempt of the perpetrators to take undue advantage of the inefficiencies in current healthcare systems. Fraud tends to deny legitimate beneficiaries of universal health coverage, especially those under health insurance protection. In this work, we propose using machine learning techniques and blockchain technology to detect and prevent fraud in healthcare, especially in claims processing. A decision tree classification algorithm is adopted to classify the original claims dataset. The extracted knowledge is programmed in the Ethereum blockchain smart contract to detect and prevent healthcare fraud. The comparative experimental results show that the best performing tool achieves a classification accuracy of 97.96% and a sensitivity of 98.09%. This means that the proposed system enhances the blockchain smart contract's ability to detect fraud with an accuracy of 97.96%.",
        "DOI": "10.1016/j.dajour.2022.100122",
        "paper_author": "Amponsah A.A.",
        "affiliation_name": "University of Energy and Natural Resources",
        "affiliation_city": "Sunyani",
        "affiliation_country": "Ghana",
        "affiliation_id": "60187532",
        "affiliation_state": "Bono"
    },
    {
        "paper_title": "Toilet-based continuous health monitoring using urine",
        "publication": "Nature Reviews Urology",
        "citied_by": "48",
        "cover_date": "2022-04-01",
        "Abstract": "Regular health monitoring can result in early detection of disease, accelerate the delivery of medical care and, therefore, considerably improve patient outcomes for countless medical conditions that affect public health. A substantial unmet need remains for technologies that can transform the status quo of reactive health care to preventive, evidence-based, person-centred care. With this goal in mind, platforms that can be easily integrated into people’s daily lives and identify a range of biomarkers for health and disease are desirable. However, urine — a biological fluid that is produced in large volumes every day and can be obtained with zero pain, without affecting the daily routine of individuals, and has the most biologically rich content — is discarded into sewers on a regular basis without being processed or monitored. Toilet-based health-monitoring tools in the form of smart toilets could offer preventive home-based continuous health monitoring for early diagnosis of diseases while being connected to data servers (using the Internet of Things) to enable collection of the health status of users. In addition, machine learning methods can assist clinicians to classify, quantify and interpret collected data more rapidly and accurately than they were able to previously. Meanwhile, challenges associated with user acceptance, privacy and test frequency optimization should be considered to facilitate the acceptance of smart toilets in society.",
        "DOI": "10.1038/s41585-021-00558-x",
        "paper_author": "Tasoglu S.",
        "affiliation_name": "Koç Üniversitesi",
        "affiliation_city": "Istanbul",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60006369",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A robust framework for handling health care information based on machine learning and big data engineering techniques",
        "publication": "International Journal of Healthcare Management",
        "citied_by": "44",
        "cover_date": "2022-01-01",
        "Abstract": "Confidentiality and security breaches remain significant concerns for electronic healthcare systems even though many relevant rules, principles, and compliance standards are in place to protect health information. It is now essential to use strategies revolving around big data to enhance the dependability of healthcare delivery due to the ever-increasing number of data generated within the healthcare sector. Even though big data processing methods and platforms have been incorporated into the data management designs for medical systems, these designs have trouble addressing urgent situations. Today, it is difficult to predict how big data and ML will affect the healthcare sectors. As a result, a clinical healthcare data warehouse environment utilizing big data analytics and ML is provided in this analysis. Quick digital access to all types of vital data, including patient histories, scan records, insurance claims, and payment history, is guaranteed by healthcare data warehouse systems. This clinical healthcare data warehouse environment can improve an individual's quality of care and monitor the patient's health status in real-time by using ML algorithms and Big data analytics. The effectiveness of the ML technique's performance is measured in terms of accuracy, specificity, sensitivity, precision, recall and Receiver Operating Characteristics (RoC).",
        "DOI": "10.1080/20479700.2022.2157071",
        "paper_author": "Praveen S.P.",
        "affiliation_name": "P.V.P.Siddhartha Institute Of Technology",
        "affiliation_city": "Vijayawada",
        "affiliation_country": "India",
        "affiliation_id": "60114321",
        "affiliation_state": "AP"
    },
    {
        "paper_title": "Disruptive Technologies and Digitalization in Insurance: Improving the Value Chain of Insurance",
        "publication": "Proceedings - 2022 3rd International Conference on Computation, Automation and Knowledge Management, ICCAKM 2022",
        "citied_by": "40",
        "cover_date": "2022-01-01",
        "Abstract": "Advancement in technology in the digital era is changing the way businesses used to work. Technology is bringing new opportunities on one hand for the companies and challenges on the other hand that should be carefully delt with. Expectations of the customers are changing with the advancement of technology. Today the customer is becoming more tech oriented and prefers product that are tech savvy too. The distribution of the products has also changed drastically. Many digital channels have emerged in the past few years that aims to provide faster services to the customers and helps in saving cost.The challenges get further compounded with the happening of the COVID-19 Pandemic. The operations of the organizations are getting digitalized and the speed with which these are getting transformed is phenomenal. Emerging technologies like Artificial Intelligence (AI), Machine Learning (ML), Virtual Reality (VR), Augmented Reality (AR), Internet of Things (IoT), Robotic Process Automation (RPA) and Block chain are playing a bigger role in these transformations. Insurance industry is also leveraging the benefits of these technologies especially in improving the value chain of insurance. The objectives of the study were to highlight the process of Digitalization in Insurance; to identify the Disruptive and emerging technologies used by the insurer; and to highlight the role of disruptive technologies in improving the value chain of insurers. This paper highlights the way insurance industry is getting digitalized and how these technologies can improve the value chain of insurance. The paper will help understand the various issues in the value chain of insurance and how the emerging technologies can help the insurers in improving their processes leading to the improvements in their value chain.",
        "DOI": "10.1109/ICCAKM54721.2022.9990452",
        "paper_author": "Singh G.",
        "affiliation_name": "Amity University",
        "affiliation_city": "Noida",
        "affiliation_country": "India",
        "affiliation_id": "60076774",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "Improving the Forecasting of Winter Wheat Yields in Northern China with Machine Learning–Dynamical Hybrid Subseasonal-to-Seasonal Ensemble Prediction",
        "publication": "Remote Sensing",
        "citied_by": "40",
        "cover_date": "2022-04-01",
        "Abstract": "Subseasonal-to-seasonal (S2S) prediction of winter wheat yields is crucial for farmers and decision-makers to reduce yield losses and ensure food security. Recently, numerous researchers have utilized machine learning (ML) methods to predict crop yield, using observational climate variables and satellite data. Meanwhile, some studies also illustrated the potential of state-of-the-art dynamical atmospheric prediction in crop yield forecasting. However, the potential of coupling both methods has not been fully explored. Herein, we aimed to establish a skilled ML–dynamical hybrid model for crop yield forecasting (MHCF v1.0), which hybridizes ML and a global dynamical atmospheric prediction system, and applied it to northern China at the S2S time scale. In this study, we adopted three mainstream machining learning algorithms (XGBoost, RF, and SVR) and the multiple linear regression (MLR) model, and three major datasets, including satellite data from MOD13C1, observational climate data from CRU, and S2S atmospheric prediction data from IAP CAS, used to predict winter wheat yield from 2005 to 2014, at the grid level. We found that, among the four models examined in this work, XGBoost reached the highest skill with the S2S prediction as inputs, scoring R2 of 0.85 and RMSE of 0.78 t/ha 3–4 months, leading the winter wheat harvest. Moreover, the results demonstrated that crop yield forecasting with S2S dynamical predictions generally outperforms that with observational climate data. Our findings highlighted that the coupling of ML and S2S dynamical atmospheric prediction provided a useful tool for yield forecasting, which could guide agricultural practices, policy-making and agricultural insurance.",
        "DOI": "10.3390/rs14071707",
        "paper_author": "Cao J.",
        "affiliation_name": "Central China Normal University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60010591",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Financial Risk Management and Explainable, Trustworthy, Responsible AI",
        "publication": "Frontiers in Artificial Intelligence",
        "citied_by": "37",
        "cover_date": "2022-02-28",
        "Abstract": "This perspective paper is based on several sessions by the members of the Round Table AI at FIRM1, with input from a number of external and international speakers. Its particular focus lies on the management of the model risk of productive models in banks and other financial institutions. The models in view range from simple rules-based approaches to Artificial Intelligence (AI) or Machine learning (ML) models with a high level of sophistication. The typical applications of those models are related to predictions and decision making around the value chain of credit risk (including accounting side under IFRS9 or related national GAAP approaches), insurance risk or other financial risk types. We expect more models of higher complexity in the space of anti-money laundering, fraud detection and transaction monitoring as well as a rise of AI/ML models as alternatives to current methods in solving some of the more intricate stochastic differential equations needed for the pricing and/or valuation of derivatives. The same type of model is also successful in areas unrelated to risk management, such as sales optimization, customer lifetime value considerations, robo-advisory, and other fields of applications. The paper refers to recent related publications from central banks, financial supervisors and regulators as well as other relevant sources and working groups. It aims to give practical advice for establishing a risk-based governance and testing framework for the mentioned model types and discusses the use of recent technologies, approaches, and platforms to support the establishment of responsible, trustworthy, explainable, auditable, and manageable AI/ML in production. In view of the recent EU publication on AI, also referred to as the EU Artificial Intelligence Act (AIA), we also see a certain added value for this paper as an instigator of further thinking outside of the financial services sector, in particular where “High Risk” models according to the mentioned EU consultation are concerned.",
        "DOI": "10.3389/frai.2022.779799",
        "paper_author": "Fritz-Morgenthal S.",
        "affiliation_name": "Bain &amp; Company Inc.",
        "affiliation_city": "Frankfurt am Main",
        "affiliation_country": "Germany",
        "affiliation_id": "121925606",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Article Machine Learning-Based Regression Framework to Predict Health Insurance Premiums",
        "publication": "International Journal of Environmental Research and Public Health",
        "citied_by": "36",
        "cover_date": "2022-07-01",
        "Abstract": "Artificial intelligence (AI) and machine learning (ML) in healthcare are approaches to make people’s lives easier by anticipating and diagnosing diseases more swiftly than most medical experts. There is a direct link between the insurer and the policyholder when the distance between an insurance business and the consumer is reduced to zero with the use of technology, especially digital health insurance. In comparison with traditional insurance, AI and machine learning have altered the way insurers create health insurance policies and helped consumers receive services faster. Insurance businesses use ML to provide clients with accurate, quick, and efficient health insurance coverage. This research trained and evaluated an artificial intelligence network-based regression-based model to predict health insurance premiums. The authors predicted the health insurance cost incurred by individuals on the basis of their features. On the basis of various parameters, such as age, gender, body mass index, number of children, smoking habits, and geolocation, an artificial neural network model was trained and evaluated. The experimental results displayed an accuracy of 92.72%, and the authors analyzed the model’s performance using key performance metrics.",
        "DOI": "10.3390/ijerph19137898",
        "paper_author": "Kaushik K.",
        "affiliation_name": "University of Petroleum and Energy Studies",
        "affiliation_city": "Dehradun",
        "affiliation_country": "India",
        "affiliation_id": "60107631",
        "affiliation_state": "UK"
    },
    {
        "paper_title": "The Potential For Bias In Machine Learning And Opportunities For Health Insurers To Address It",
        "publication": "Health Affairs",
        "citied_by": "33",
        "cover_date": "2022-02-01",
        "Abstract": "As the use of machine learning algorithms in health care continues to expand, there are growing concerns about equity, fairness, and bias in the ways in which machine learning models are developed and used in clinical and business decisions. We present a guide to the data ecosystem used by health insurers to highlight where bias can arise along machine learning pipelines. We suggest mechanisms for identifying and dealing with bias and discuss challenges and opportunities to increase fairness through analytics in the health insurance industry.",
        "DOI": "10.1377/hlthaff.2021.01287",
        "paper_author": "Gervasi S.S.",
        "affiliation_name": "Independence Blue Cross",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "100353047",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Incorporating FAT and privacy aware AI modeling approaches into business decision making frameworks",
        "publication": "Decision Support Systems",
        "citied_by": "33",
        "cover_date": "2022-04-01",
        "Abstract": "We present a formal approach to build and evaluate AI systems that include principles of Fairness, Accountability and Transparency (FAT), which are extremely important in various domains where AI models are used, yet their utilization in business settings is scant. We develop and instantiate a FAT-based framework with a privacy-constrained dataset and build a model to demonstrate the balance among these 3 dimensions. These principles are gaining prominence with higher awareness of privacy and fairness in business and society. Our results indicate that FAT can co-exist in a well-designed system. Our contribution lies in presenting and evaluating a functional, FAT-based machine learning model in an affinity prediction scenario. Contrary to common belief, we show that explainable AI/ML systems need not have a major negative impact on predictive performance. Our approach is applicable in a variety of fields such as insurance, health diagnostics, government funds allocation and other business settings. Our work has broad policy implications as well, by making AI and AI-based decisions more ethical, less controversial, and hence, trustworthy. Our work contributes to emerging AI policy perspectives worldwide.",
        "DOI": "10.1016/j.dss.2021.113715",
        "paper_author": "Zhdanov D.",
        "affiliation_name": "J. Mack Robinson College of Business",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60098091",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "Artificial Intelligence for Cardiac Diseases Diagnosis and Prediction Using ECG Images on Embedded Systems",
        "publication": "Biomedicines",
        "citied_by": "32",
        "cover_date": "2022-08-01",
        "Abstract": "The electrocardiogram (ECG) provides essential information about various human cardiac conditions. Several studies have investigated this topic in order to detect cardiac abnormalities for prevention purposes. Nowadays, there is an expansion of new smart signal processing methods, such as machine learning and its sub-branches, such as deep learning. These popular techniques help analyze and classify the ECG signal in an efficient way. Our study aims to develop algorithmic models to analyze ECG tracings to predict cardiovascular diseases. The direct impact of this work is to save lives and improve medical care with less expense. As health care and health insurance costs increase in the world, the direct impact of this work is saving lives and improving medical care. We conducted numerous experiments to optimize deep-learning parameters. We found the same validation accuracy value of about 0.95 for both MobileNetV2 and VGG16 algorithms. After implementation on Raspberry Pi, our results showed a small decrease in accuracy (0.94 and 0.90 for MobileNetV2 and VGG16 algorithms, respectively). Therefore, the main purpose of the present research work is to improve, in an easy and cheaper way, real-time monitoring using smart mobile tools (mobile phones, smart watches, connected T-shirts, etc.).",
        "DOI": "10.3390/biomedicines10082013",
        "paper_author": "Mhamdi L.",
        "affiliation_name": "Biotechnology Institute of Monastir",
        "affiliation_city": "Monastir",
        "affiliation_country": "Tunisia",
        "affiliation_id": "112852358",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Contextualization and Exploration of Local Feature Importance Explanations to Improve Understanding and Satisfaction of Non-Expert Users",
        "publication": "International Conference on Intelligent User Interfaces, Proceedings IUI",
        "citied_by": "32",
        "cover_date": "2022-03-22",
        "Abstract": "The increasing usage of complex Machine Learning models for decision-making has raised interest in explainable artificial intelligence (XAI). In this work, we focus on the effects of providing accessible and useful explanations to non-expert users. More specifically, we propose generic XAI design principles for contextualizing and allowing the exploration of explanations based on local feature importance. To evaluate the effectiveness of these principles for improving users' objective understanding and satisfaction, we conduct a controlled user study with 80 participants using 4 different versions of our XAI system, in the context of an insurance scenario. Our results show that the contextualization principles we propose significantly improve user's satisfaction and is close to have a significant impact on user's objective understanding. They also show that the exploration principles we propose improve user's satisfaction. On the other hand, the interaction of these principles does not appear to bring improvement on both dimensions of users' understanding.",
        "DOI": "10.1145/3490099.3511139",
        "paper_author": "Bove C.",
        "affiliation_name": "Sorbonne Université",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60001422",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "Machine learning for predicting readmission risk among the frail: Explainable AI for healthcare",
        "publication": "Patterns",
        "citied_by": "32",
        "cover_date": "2022-01-14",
        "Abstract": "Healthcare costs due to unplanned readmissions are high and negatively affect health and wellness of patients. Hospital readmission is an undesirable outcome for elderly patients. Here, we present readmission risk prediction using five machine learning approaches for predicting 30-day unplanned readmission for elderly patients (age ≥ 50 years). We use a comprehensive and curated set of variables that include frailty, comorbidities, high-risk medications, demographics, hospital, and insurance utilization to build these models. We conduct a large-scale study with electronic health record (her) data with over 145,000 observations from 76,000 patients. Findings indicate that the category boost (CatBoost) model outperforms other models with a mean area under the curve (AUC) of 0.79. We find that prior readmissions, discharge to a rehabilitation facility, length of stay, comorbidities, and frailty indicators were all strong predictors of 30-day readmission. We present in-depth insights using Shapley additive explanations (SHAP), the state of the art in machine learning explainability.",
        "DOI": "10.1016/j.patter.2021.100395",
        "paper_author": "Mohanty S.D.",
        "affiliation_name": "The University of North Carolina at Greensboro",
        "affiliation_city": "Greensboro",
        "affiliation_country": "United States",
        "affiliation_id": "60018474",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Explainable Artificial Intelligence (XAI) in Insurance",
        "publication": "Risks",
        "citied_by": "30",
        "cover_date": "2022-12-01",
        "Abstract": "Explainable Artificial Intelligence (XAI) models allow for a more transparent and understandable relationship between humans and machines. The insurance industry represents a fundamental opportunity to demonstrate the potential of XAI, with the industry’s vast stores of sensitive data on policyholders and centrality in societal progress and innovation. This paper analyses current Artificial Intelligence (AI) applications in insurance industry practices and insurance research to assess their degree of explainability. Using search terms representative of (X)AI applications in insurance, 419 original research articles were screened from IEEE Xplore, ACM Digital Library, Scopus, Web of Science and Business Source Complete and EconLit. The resulting 103 articles (between the years 2000–2021) representing the current state-of-the-art of XAI in insurance literature are analysed and classified, highlighting the prevalence of XAI methods at the various stages of the insurance value chain. The study finds that XAI methods are particularly prevalent in claims management, underwriting and actuarial pricing practices. Simplification methods, called knowledge distillation and rule extraction, are identified as the primary XAI technique used within the insurance value chain. This is important as the combination of large models to create a smaller, more manageable model with distinct association rules aids in building XAI models which are regularly understandable. XAI is an important evolution of AI to ensure trust, transparency and moral values are embedded within the system’s ecosystem. The assessment of these XAI foci in the context of the insurance industry proves a worthwhile exploration into the unique advantages of XAI, highlighting to industry professionals, regulators and XAI developers where particular focus should be directed in the further development of XAI. This is the first study to analyse XAI’s current applications within the insurance industry, while simultaneously contributing to the interdisciplinary understanding of applied XAI. Advancing the literature on adequate XAI definitions, the authors propose an adapted definition of XAI informed by the systematic review of XAI literature in insurance.",
        "DOI": "10.3390/risks10120230",
        "paper_author": "Owens E.",
        "affiliation_name": "University of Limerick",
        "affiliation_city": "Limerick",
        "affiliation_country": "Ireland",
        "affiliation_id": "60009602",
        "affiliation_state": "Munster"
    },
    {
        "paper_title": "Insurtech Fostering Automated Insurance Process using Deep Learning Approach",
        "publication": "Proceedings of 2nd International Conference on Innovative Practices in Technology and Management, ICIPTM 2022",
        "citied_by": "30",
        "cover_date": "2022-01-01",
        "Abstract": "The COVID-19 pandemic comes up with an opportunity for many industries to remake themselves strategically financially and operationally as per the changing needs of the markets. Application of various technologies is helping industries in moving forward and embrace the fifth Industrial Revolution. Technologies like big data analysis, artificial intelligence, fiber optics, image recognition, drones, are playing an important in the growth of industrial service sectors. Technology has transformed every industry of the countries and needless to say, the Insurance industry is no exception here. The term 'Insurtech' has been around since at least 2010, but its reach and influence have accelerated in the past few years and it will continue to with the advancement in big data, AI, IoT, wearable devices and nanotechnologies. In most basic term, Insurtech is applications of various technologies in the insurance industry. From both product and process perspectives, Insurtech is transforming the insurance industry. It is helping the Insurance Industry to become more customer-centric and create operational excellence. Now with Insurtech applications great results were seen in fraud detection rates, effective access to insurance services, low-cost to the customers and the company, increase in operational efficiencies and enhancement in customer experience. This paper discusses about digital growth and development in insurance sector and the ways the Insurtech is transforming the Insurance industry to a greater extent. Also focus of paper is on how insurtech is fostering the automation of insurance process using deep learning and other technologies.",
        "DOI": "10.1109/ICIPTM54933.2022.9753891",
        "paper_author": "Agarwal S.",
        "affiliation_name": "Chitkara University, Punjab",
        "affiliation_city": "Rajpura",
        "affiliation_country": "India",
        "affiliation_id": "60113205",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Please be polite: Towards building a politeness adaptive dialogue system for goal-oriented conversations",
        "publication": "Neurocomputing",
        "citied_by": "30",
        "cover_date": "2022-07-14",
        "Abstract": "Politeness embalms interactions, putting the parties in conversation at ease. Even the most well-intended communication can fall through if there is a manifestation of rudeness. Complementarily, even the most angst-prone situation can be communicated with much less hurt if lathered with politeness. In this paper, we propose a novel task named as Politeness Adaptive Dialogue System (PADS) to incorporate politeness feedback of agents’ actions according to user's mood and demands. As there is no politeness labeled conversational data available, we annotate the recently released MultiDoGO dataset having six domains with appropriate politeness labels. The proposed end-to-end dialogue system comprises of a transformer-based politeness classifier that interacts with a reinforced learning framework with four different politeness-oriented reward algorithms, forcing the agent to adapt to polite actions upon encountering the user's dissatisfaction in the dialogue. We train and evaluate PADS by building six different user simulators, each corresponding to a domain. Quantitative and qualitative analysis show that our proposed politeness based reward algorithms improve the task success rate and reduce the dialogue length with state-of-the-art results.",
        "DOI": "10.1016/j.neucom.2022.04.029",
        "paper_author": "Mishra K.",
        "affiliation_name": "Indian Institute of Technology Patna",
        "affiliation_city": "Patna",
        "affiliation_country": "India",
        "affiliation_id": "60104342",
        "affiliation_state": "BR"
    },
    {
        "paper_title": "Crop-type mapping and acreage estimation in smallholding plots using Sentinel-2 images and machine learning algorithms: Some comparisons",
        "publication": "Egyptian Journal of Remote Sensing and Space Science",
        "citied_by": "30",
        "cover_date": "2022-02-01",
        "Abstract": "Crop acreage analysis and yield estimation are of prime importance in field-level agricultural monitoring and management. This enables prudent decision making during any crop failure event and for ensuing crop insurance. The free availability of the high resolution Sentinel-2 satellite datasets has created new possibilities for mapping and monitoring agricultural lands in this regard. In the present study conducted on the Tamluk Subdivision of the Purba Medinipur District of West Bengal, the heterogeneous crop area was mapped according to the respective crop type, using Sentinel-2 multi-spectral images and two machine learning algorithms- K Nearest Neighbour (KNN) and Random Forest (RF). Plot-level field information was collected from different cropland types to frame the training and validation datasets (comprising 70% and 30% of the total dataset, respectively) for cropland classification and accuracy assessment. Through this, the major summer crop acreage was identified (Boro rice, vegetables and betel vine- the three main crops in the study area). The extracted maps had an overall accuracy of 97.16% and 97.22%, respectively, in the KNN and RF classifications, with respective Kappa index values of 95.99% and 96.08%, and the RF method proved to be more accurate. This study was particularly useful in mapping the betel leaf acreage herein since scant information exists for this crop and it is cultivated by many smallholder farmers in the region. The methods used in this paper can be readily applied elsewhere for accurately enumerating the respective crop acreages.",
        "DOI": "10.1016/j.ejrs.2022.01.004",
        "paper_author": "Hudait M.",
        "affiliation_name": "Presidency University, Kolkata",
        "affiliation_city": "Kolkata",
        "affiliation_country": "India",
        "affiliation_id": "60023609",
        "affiliation_state": "WB"
    }
]