[
    {
        "paper_title": "ESHRE guideline: endometriosis",
        "publication": "Human Reproduction Open",
        "citied_by": "718",
        "cover_date": "2022-01-01",
        "Abstract": "Study question: How should endometriosis be diagnosed and managed based on the best available evidence from published literature? Summary Answer: The current guideline provides 109 recommendations on diagnosis, treatments for pain and infertility, management of disease recurrence, asymptomatic or extrapelvic disease, endometriosis in adolescents and postmenopausal women, prevention and the association with cancer. What is known already: Endometriosis is a chronic condition with a plethora of presentations in terms of not only the occurrence of lesions, but also the presence of signs and symptoms. The most important symptoms include pain and infertility. Study design, size, duration: The guideline was developed according to the structured methodology for development of ESHRE guidelines. After formulation of key questions by a group of experts, literature searches and assessments were performed. Papers published up to 1 December 2020 and written in English were included in the literature review. Participants/materials, setting, methods: Based on the collected evidence, recommendations were formulated and discussed within specialist subgroups and then presented to the core guideline development group (GDG) until consensus was reached. A stakeholder review was organized after finalization of the draft. The final version was approved by the GDG and the ESHRE Executive Committee. Main Results and the role of chance: This guideline aims to help clinicians to apply best care for women with endometriosis. Although studies mostly focus on women of reproductive age, the guideline also addresses endometriosis in adolescents and postmenopausal women. The guideline outlines the diagnostic process for endometriosis, which challenges laparoscopy and histology as gold standard diagnostic tests. The options for treatment of endometriosis-associated pain symptoms include analgesics, medical treatments and surgery. Non-pharmacological treatments are also discussed. For management of endometriosis-associated infertility, surgical treatment and/or medically assisted reproduction are feasible. While most of the more recent studies confirm previous ESHRE recommendations, there are five topics in which significant changes to recommendations were required and changes in clinical practice are to be expected. Limitations, reasons for caution: The guideline describes different management options but, based on existing evidence, no firm recommendations could be formulated on the most appropriate treatments. Also, for specific clinical issues, such as asymptomatic endometriosis or extrapelvic endometriosis, the evidence is too scarce to make evidence-based recommendations. Wider Implications of the findings: The guideline provides clinicians with clear advice on best practice in endometriosis care, based on the best evidence currently available. In addition, a list of research recommendations is provided to stimulate further studies in endometriosis. Study funding/competing interest(S): The guideline was developed and funded by ESHRE, covering expenses associated with the guideline meetings, with the literature searches and with the dissemination of the guideline. The guideline group members did not receive payments. C.M.B. reports grants from Bayer Healthcare and the European Commission; Participation on a Data Safety Monitoring Board or Advisory Board with ObsEva (Data Safety Monitoring Group) and Myovant (Scientific Advisory Group). A.B. reports grants from FEMaLE executive board member and European Commission Horizon 2020 grant; consulting fees from Ethicon Endo Surgery, Medtronic; honoraria for lectures from Ethicon; and support for meeting attendance from Gedeon Richter; A.H. reports grants from MRC, NIHR, CSO, Roche Diagnostics, Astra Zeneca, Ferring; Consulting fees from Roche Diagnostics, Nordic Pharma, Chugai and Benevolent Al Bio Limited all paid to the institution; a pending patent on Serum endometriosis biomarker; he is also Chair of TSC for STOP-OHSS and CERM trials. O.H. reports consulting fees and speaker's fees from Gedeon Richter and Bayer AG; support for attending meetings from Gedeon-Richter, and leadership roles at the Finnish Society for Obstetrics and Gynecology and the Nordic federation of the societies of obstetrics and gynecology. L.K. reports consulting fees from Gedeon Richter, AstraZeneca, Novartis, Dr KADE/Besins, Palleos Healthcare, Roche, Mithra; honoraria for lectures from Gedeon Richter, AstraZeneca, Novartis, Dr KADE/Besins, Palleos Healthcare, Roche, Mithra; support for attending meetings from Gedeon Richter, AstraZeneca, Novartis, Dr KADE/Besins, Palleos Healthcare, Roche, Mithra; he also has a leadership role in the German Society of Gynecological Endocrinology (DGGEF). M.K. reports grants from French Foundation for Medical Research (FRM), Australian Ministry of Health, Medical Research Future Fund and French National Cancer Institute; support for meeting attendance from European Society for Gynaecological Endoscopy (ESGE), European Congress on Endometriosis (EEC) and ESHRE; She is an advisory Board Member, FEMaLe Project (Finding Endometriosis Using Machine Learning), Scientific Committee Chair for the French Foundation for Research on Endometriosis and Scientific Committee Chair for the ComPaRe-Endometriosis cohort. A.N. reports grants from Merck SA and Ferring; speaker fees from Merck SA and Ferring; support for meeting attendance from Merck SA; Participation on a Data Safety Monitoring Board or Advisory Board with Nordic Pharma and Merck SA; she also is a board member of medical advisory board, Endometriosis Society, the Netherlands (patients advocacy group) and an executive board member of the World Endometriosis Society. E.S. reports grants from National Institute for Health Research UK, Rosetrees Trust, Barts and the London Charity; Royalties from De Gruyter (book editor); consulting fees from Hologic; speakers fees from Hologic, Johnson & Johnson, Medtronic, Intuitive, Olympus and Karl Storz; Participation in the Medicines for Women's Health Expert Advisory Group with Medicines and Healthcare Products Regulatory Agency (MHRA); he is also Ambassador for the World Endometriosis Society. C.T. reports grants from Merck SA; Consulting fees from Gedeon Richter, Nordic Pharma and Merck SA; speaker fees from Merck SA, all paid to the institution; and support for meeting attendance from Ferring, Gedeon Richter and Merck SA. The other authors have no conflicts of interest to declare. Disclaimer: This guideline represents the views of ESHRE, which were achieved after careful consideration of the scientific evidence available at the time of preparation. In the absence of scientific evidence on certain aspects, a consensus between the relevant ESHRE stakeholders has been obtained. Adherence to these clinical practice guidelines does not guarantee a successful or specific outcome, nor does it establish a standard of care. Clinical practice guidelines do not replace the need for application of clinical judgement to each individual presentation, nor variations based on locality and facility type. ESHRE makes no warranty, express or implied, regarding the clinical practice guidelines and specifically excludes any warranties of merchantability and fitness for a particular use or purpose.",
        "DOI": "10.1093/hropen/hoac009",
        "paper_author": "Becker C.M.",
        "affiliation_name": "University of Oxford Medical Sciences Division",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60002634",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "A comprehensive survey of clustering algorithms: State-of-the-art machine learning applications, taxonomy, challenges, and future research prospects",
        "publication": "Engineering Applications of Artificial Intelligence",
        "citied_by": "513",
        "cover_date": "2022-04-01",
        "Abstract": "Clustering is an essential tool in data mining research and applications. It is the subject of active research in many fields of study, such as computer science, data science, statistics, pattern recognition, artificial intelligence, and machine learning. Several clustering techniques have been proposed and implemented, and most of them successfully find excellent quality or optimal clustering results in the domains mentioned earlier. However, there has been a gradual shift in the choice of clustering methods among domain experts and practitioners alike, which is precipitated by the fact that most traditional clustering algorithms still depend on the number of clusters provided a priori. These conventional clustering algorithms cannot effectively handle real-world data clustering analysis problems where the number of clusters in data objects cannot be easily identified. Also, they cannot effectively manage problems where the optimal number of clusters for a high-dimensional dataset cannot be easily determined. Therefore, there is a need for improved, flexible, and efficient clustering techniques. Recently, a variety of efficient clustering algorithms have been proposed in the literature, and these algorithms produced good results when evaluated on real-world clustering problems. This study presents an up-to-date systematic and comprehensive review of traditional and state-of-the-art clustering techniques for different domains. This survey considers clustering from a more practical perspective. It shows the outstanding role of clustering in various disciplines, such as education, marketing, medicine, biology, and bioinformatics. It also discusses the application of clustering to different fields attracting intensive efforts among the scientific community, such as big data, artificial intelligence, and robotics. This survey paper will be beneficial for both practitioners and researchers. It will serve as a good reference point for researchers and practitioners to design improved and efficient state-of-the-art clustering algorithms.",
        "DOI": "10.1016/j.engappai.2022.104743",
        "paper_author": "Ezugwu A.E.",
        "affiliation_name": "University of KwaZulu-Natal",
        "affiliation_city": "Durban",
        "affiliation_country": "South Africa",
        "affiliation_id": "60010499",
        "affiliation_state": "KwaZulu-Natal"
    },
    {
        "paper_title": "Exosomes as a new frontier of cancer liquid biopsy",
        "publication": "Molecular Cancer",
        "citied_by": "465",
        "cover_date": "2022-12-01",
        "Abstract": "Liquid biopsy, characterized by minimally invasive detection through biofluids such as blood, saliva, and urine, has emerged as a revolutionary strategy for cancer diagnosis and prognosis prediction. Exosomes are a subset of extracellular vesicles (EVs) that shuttle molecular cargoes from donor cells to recipient cells and play a crucial role in mediating intercellular communication. Increasing studies suggest that exosomes have a great promise to serve as novel biomarkers in liquid biopsy, since large quantities of exosomes are enriched in body fluids and are involved in numerous physiological and pathological processes. However, the further clinical application of exosomes has been greatly restrained by the lack of high-quality separation and component analysis methods. This review aims to provide a comprehensive overview on the conventional and novel technologies for exosome isolation, characterization and content detection. Additionally, the roles of exosomes serving as potential biomarkers in liquid biopsy for the diagnosis, treatment monitoring, and prognosis prediction of cancer are summarized. Finally, the prospects and challenges of applying exosome-based liquid biopsy to precision medicine are evaluated.",
        "DOI": "10.1186/s12943-022-01509-9",
        "paper_author": "Yu D.",
        "affiliation_name": "Jiangsu University",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60017482",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Application of explainable artificial intelligence for healthcare: A systematic review of the last decade (2011–2022)",
        "publication": "Computer Methods and Programs in Biomedicine",
        "citied_by": "361",
        "cover_date": "2022-11-01",
        "Abstract": "Background and objectives: Artificial intelligence (AI) has branched out to various applications in healthcare, such as health services management, predictive medicine, clinical decision-making, and patient data and diagnostics. Although AI models have achieved human-like performance, their use is still limited because they are seen as a black box. This lack of trust remains the main reason for their low use in practice, especially in healthcare. Hence, explainable artificial intelligence (XAI) has been introduced as a technique that can provide confidence in the model's prediction by explaining how the prediction is derived, thereby encouraging the use of AI systems in healthcare. The primary goal of this review is to provide areas of healthcare that require more attention from the XAI research community. Methods: Multiple journal databases were thoroughly searched using PRISMA guidelines 2020. Studies that do not appear in Q1 journals, which are highly credible, were excluded. Results: In this review, we surveyed 99 Q1 articles covering the following XAI techniques: SHAP, LIME, GradCAM, LRP, Fuzzy classifier, EBM, CBR, rule-based systems, and others. Conclusion: We discovered that detecting abnormalities in 1D biosignals and identifying key text in clinical notes are areas that require more attention from the XAI research community. We hope this is review will encourage the development of a holistic cloud system for a smart city.",
        "DOI": "10.1016/j.cmpb.2022.107161",
        "paper_author": "Loh H.W.",
        "affiliation_name": "Singapore University of Social Sciences",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60121755",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Review of Feature Selection Methods for Machine Learning-Based Disease Risk Prediction",
        "publication": "Frontiers in Bioinformatics",
        "citied_by": "330",
        "cover_date": "2022-01-01",
        "Abstract": "Machine learning has shown utility in detecting patterns within large, unstructured, and complex datasets. One of the promising applications of machine learning is in precision medicine, where disease risk is predicted using patient genetic data. However, creating an accurate prediction model based on genotype data remains challenging due to the so-called “curse of dimensionality” (i.e., extensively larger number of features compared to the number of samples). Therefore, the generalizability of machine learning models benefits from feature selection, which aims to extract only the most “informative” features and remove noisy “non-informative,” irrelevant and redundant features. In this article, we provide a general overview of the different feature selection methods, their advantages, disadvantages, and use cases, focusing on the detection of relevant features (i.e., SNPs) for disease risk prediction.",
        "DOI": "10.3389/fbinf.2022.927312",
        "paper_author": "Pudjihartono N.",
        "affiliation_name": "Liggins Institute",
        "affiliation_city": "Auckland",
        "affiliation_country": "New Zealand",
        "affiliation_id": "60112784",
        "affiliation_state": "AUK"
    },
    {
        "paper_title": "Perspectives in machine learning for wildlife conservation",
        "publication": "Nature Communications",
        "citied_by": "312",
        "cover_date": "2022-12-01",
        "Abstract": "Inexpensive and accessible sensors are accelerating data acquisition in animal ecology. These technologies hold great potential for large-scale ecological understanding, but are limited by current processing approaches which inefficiently distill data into relevant information. We argue that animal ecologists can capitalize on large datasets generated by modern sensors by combining machine learning approaches with domain knowledge. Incorporating machine learning into ecological workflows could improve inputs for ecological models and lead to integrated hybrid modeling tools. This approach will require close interdisciplinary collaboration to ensure the quality of novel approaches and train a new generation of data scientists in ecology and conservation.",
        "DOI": "10.1038/s41467-022-27980-y",
        "paper_author": "Tuia D.",
        "affiliation_name": "École Polytechnique Fédérale de Lausanne",
        "affiliation_city": "Lausanne",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60028186",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital pathology and artificial intelligence in translational medicine and clinical practice",
        "publication": "Modern Pathology",
        "citied_by": "287",
        "cover_date": "2022-01-01",
        "Abstract": "Traditional pathology approaches have played an integral role in the delivery of diagnosis, semi-quantitative or qualitative assessment of protein expression, and classification of disease. Technological advances and the increased focus on precision medicine have recently paved the way for the development of digital pathology-based approaches for quantitative pathologic assessments, namely whole slide imaging and artificial intelligence (AI)–based solutions, allowing us to explore and extract information beyond human visual perception. Within the field of immuno-oncology, the application of such methodologies in drug development and translational research have created invaluable opportunities for deciphering complex pathophysiology and the discovery of novel biomarkers and drug targets. With an increasing number of treatment options available for any given disease, practitioners face the growing challenge of selecting the most appropriate treatment for each patient. The ever-increasing utilization of AI-based approaches substantially expands our understanding of the tumor microenvironment, with digital approaches to patient stratification and selection for diagnostic assays supporting the identification of the optimal treatment regimen based on patient profiles. This review provides an overview of the opportunities and limitations around implementing AI-based methods in biomarker discovery and patient selection and discusses how advances in digital pathology and AI should be considered in the current landscape of translational medicine, touching on challenges this technology may face if adopted in clinical settings. The traditional role of pathologists in delivering accurate diagnoses or assessing biomarkers for companion diagnostics may be enhanced in precision, reproducibility, and scale by AI-powered analysis tools.",
        "DOI": "10.1038/s41379-021-00919-2",
        "paper_author": "Baxi V.",
        "affiliation_name": "Bristol-Myers Squibb",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60002717",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Self-supervised learning in medicine and healthcare",
        "publication": "Nature Biomedical Engineering",
        "citied_by": "266",
        "cover_date": "2022-12-01",
        "Abstract": "The development of medical applications of machine learning has required manual annotation of data, often by medical experts. Yet, the availability of large-scale unannotated data provides opportunities for the development of better machine-learning models. In this Review, we highlight self-supervised methods and models for use in medicine and healthcare, and discuss the advantages and limitations of their application to tasks involving electronic health records and datasets of medical images, bioelectrical signals, and sequences and structures of genes and proteins. We also discuss promising applications of self-supervised learning for the development of models leveraging multimodal datasets, and the challenges in collecting unbiased data for their training. Self-supervised learning may accelerate the development of medical artificial intelligence.",
        "DOI": "10.1038/s41551-022-00914-1",
        "paper_author": "Krishnan R.",
        "affiliation_name": "Stanford Engineering",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60141508",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Identification of neoantigens for individualized therapeutic cancer vaccines",
        "publication": "Nature Reviews Drug Discovery",
        "citied_by": "265",
        "cover_date": "2022-04-01",
        "Abstract": "Somatic mutations in cancer cells can generate tumour-specific neoepitopes, which are recognized by autologous T cells in the host. As neoepitopes are not subject to central immune tolerance and are not expressed in healthy tissues, they are attractive targets for therapeutic cancer vaccines. Because the vast majority of cancer mutations are unique to the individual patient, harnessing the full potential of this rich source of targets requires individualized treatment approaches. Many computational algorithms and machine-learning tools have been developed to identify mutations in sequence data, to prioritize those that are more likely to be recognized by T cells and to design tailored vaccines for every patient. In this Review, we fill the gaps between the understanding of basic mechanisms of T cell recognition of neoantigens and the computational approaches for discovery of somatic mutations and neoantigen prediction for cancer immunotherapy. We present a new classification of neoantigens, distinguishing between guarding, restrained and ignored neoantigens, based on how they confer proficient antitumour immunity in a given clinical context. Such context-based differentiation will contribute to a framework that connects neoantigen biology to the clinical setting and medical peculiarities of cancer, and will enable future neoantigen-based therapies to provide greater clinical benefit.",
        "DOI": "10.1038/s41573-021-00387-y",
        "paper_author": "Lang F.",
        "affiliation_name": "Helmholtz Institute for Translational Oncology (HI-TRON)",
        "affiliation_city": "Mainz",
        "affiliation_country": "Germany",
        "affiliation_id": "112567375",
        "affiliation_state": "D-55131"
    },
    {
        "paper_title": "Harnessing multimodal data integration to advance precision oncology",
        "publication": "Nature Reviews Cancer",
        "citied_by": "257",
        "cover_date": "2022-02-01",
        "Abstract": "Advances in quantitative biomarker development have accelerated new forms of data-driven insights for patients with cancer. However, most approaches are limited to a single mode of data, leaving integrated approaches across modalities relatively underdeveloped. Multimodal integration of advanced molecular diagnostics, radiological and histological imaging, and codified clinical data presents opportunities to advance precision oncology beyond genomics and standard molecular techniques. However, most medical datasets are still too sparse to be useful for the training of modern machine learning techniques, and significant challenges remain before this is remedied. Combined efforts of data engineering, computational methods for analysis of heterogeneous data and instantiation of synergistic data models in biomedical research are required for success. In this Perspective, we offer our opinions on synthesizing complementary modalities of data with emerging multimodal artificial intelligence methods. Advancing along this direction will result in a reimagined class of multimodal biomarkers to propel the field of precision oncology in the coming decade.",
        "DOI": "10.1038/s41568-021-00408-3",
        "paper_author": "Boehm K.M.",
        "affiliation_name": "Memorial Sloan-Kettering Cancer Center",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60009343",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Has the Future Started? The Current Growth of Artificial Intelligence, Machine Learning, and Deep Learning",
        "publication": "Iraqi Journal for Computer Science and Mathematics",
        "citied_by": "206",
        "cover_date": "2022-01-01",
        "Abstract": "In the modern era, many terms related to artificial intelligence, machine learning, and deep learning are widely used in domains such as business, healthcare, industries, and military. In these fields, the accurate prediction and analysis of data are crucial, regardless of how large the data are. However, using big data is confusing due to the rapid growth and massive development in public life, which requires a tremendous human effort in order to deal with such type of data and extract worthy information from it. Thus, the role of artificial intelligence begins in analyzing big data based on scientific techniques, especially in machine learning, whereby it can identify patterns of decision-making and reduce human intervention. In this regard, the significance role of artificial intelligence, machine learning and deep learning is growing rapidly. In this article, the authors decide to highlight these sciences by discussing how to develop and apply them in many decision-making domains. In addition, the influence of artificial intelligence in healthcare and the gains this science provides in the face of the COVID-19 pandemic are highlighted. This article concludes that these sciences have a significant impact, especially in healthcare, as well as the ability to grow and improve their methodology in decision-making. Additionally, artificial intelligence is a vital science, especially in the face of COVID-19.",
        "DOI": "10.52866/ijcsm.2022.01.01.013",
        "paper_author": "Aggarwal K.",
        "affiliation_name": "Maharishi Markandeshwar (Deemed to be University), Mullana",
        "affiliation_city": "Ambala",
        "affiliation_country": "India",
        "affiliation_id": "60094525",
        "affiliation_state": "HR"
    },
    {
        "paper_title": "Redefining critical illness",
        "publication": "Nature Medicine",
        "citied_by": "192",
        "cover_date": "2022-06-01",
        "Abstract": "Research and practice in critical care medicine have long been defined by syndromes, which, despite being clinically recognizable entities, are, in fact, loose amalgams of heterogeneous states that may respond differently to therapy. Mounting translational evidence—supported by research on respiratory failure due to severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection—suggests that the current syndrome-based framework of critical illness should be reconsidered. Here we discuss recent findings from basic science and clinical research in critical care and explore how these might inform a new conceptual model of critical illness. De-emphasizing syndromes, we focus on the underlying biological changes that underpin critical illness states and that may be amenable to treatment. We hypothesize that such an approach will accelerate critical care research, leading to a richer understanding of the pathobiology of critical illness and of the key determinants of patient outcomes. This, in turn, will support the design of more effective clinical trials and inform a more precise and more effective practice at the bedside.",
        "DOI": "10.1038/s41591-022-01843-x",
        "paper_author": "Maslove D.M.",
        "affiliation_name": "Queen’s University",
        "affiliation_city": "Kingston",
        "affiliation_country": "Canada",
        "affiliation_id": "60016005",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Amelioration of Alzheimer’s disease pathology by mitophagy inducers identified via machine learning and a cross-species workflow",
        "publication": "Nature Biomedical Engineering",
        "citied_by": "185",
        "cover_date": "2022-01-01",
        "Abstract": "A reduced removal of dysfunctional mitochondria is common to aging and age-related neurodegenerative pathologies such as Alzheimer’s disease (AD). Strategies for treating such impaired mitophagy would benefit from the identification of mitophagy modulators. Here we report the combined use of unsupervised machine learning (involving vector representations of molecular structures, pharmacophore fingerprinting and conformer fingerprinting) and a cross-species approach for the screening and experimental validation of new mitophagy-inducing compounds. From a library of naturally occurring compounds, the workflow allowed us to identify 18 small molecules, and among them two potent mitophagy inducers (Kaempferol and Rhapontigenin). In nematode and rodent models of AD, we show that both mitophagy inducers increased the survival and functionality of glutamatergic and cholinergic neurons, abrogated amyloid-β and tau pathologies, and improved the animals’ memory. Our findings suggest the existence of a conserved mechanism of memory loss across the AD models, this mechanism being mediated by defective mitophagy. The computational–experimental screening and validation workflow might help uncover potent mitophagy modulators that stimulate neuronal health and brain homeostasis.",
        "DOI": "10.1038/s41551-021-00819-5",
        "paper_author": "Xie C.",
        "affiliation_name": "The First Affiliated Hospital of Wenzhou Medical University",
        "affiliation_city": "Wenzhou",
        "affiliation_country": "China",
        "affiliation_id": "60122342",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Acute respiratory distress syndrome in adults: diagnosis, outcomes, long-term sequelae, and management",
        "publication": "The Lancet",
        "citied_by": "180",
        "cover_date": "2022-10-01",
        "Abstract": "Acute respiratory distress syndrome (ARDS) is characterised by acute hypoxaemic respiratory failure with bilateral infiltrates on chest imaging, which is not fully explained by cardiac failure or fluid overload. ARDS is defined by the Berlin criteria. In this Series paper the diagnosis, management, outcomes, and long-term sequelae of ARDS are reviewed. Potential limitations of the ARDS definition and evidence that could inform future revisions are considered. Guideline recommendations, evidence, and uncertainties in relation to ARDS management are discussed. The future of ARDS strives towards a precision medicine approach, and the framework of treatable traits in ARDS diagnosis and management is explored.",
        "DOI": "10.1016/S0140-6736(22)01439-8",
        "paper_author": "Gorman E.A.",
        "affiliation_name": "Queen's University Belfast",
        "affiliation_city": "Belfast",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60029738",
        "affiliation_state": "Northern Ireland"
    },
    {
        "paper_title": "Deep Neural Networks for Medical Image Segmentation",
        "publication": "Journal of Healthcare Engineering",
        "citied_by": "180",
        "cover_date": "2022-01-01",
        "Abstract": "Image segmentation is a branch of digital image processing which has numerous applications in the field of analysis of images, augmented reality, machine vision, and many more. The field of medical image analysis is growing and the segmentation of the organs, diseases, or abnormalities in medical images has become demanding. The segmentation of medical images helps in checking the growth of disease like tumour, controlling the dosage of medicine, and dosage of exposure to radiations. Medical image segmentation is really a challenging task due to the various artefacts present in the images. Recently, deep neural models have shown application in various image segmentation tasks. This significant growth is due to the achievements and high performance of the deep learning strategies. This work presents a review of the literature in the field of medical image segmentation employing deep convolutional neural networks. The paper examines the various widely used medical image datasets, the different metrics used for evaluating the segmentation tasks, and performances of different CNN based networks. In comparison to the existing review and survey papers, the present work also discusses the various challenges in the field of segmentation of medical images and different state-of-the-art solutions available in the literature.",
        "DOI": "10.1155/2022/9580991",
        "paper_author": "Malhotra P.",
        "affiliation_name": "Chitkara University, Punjab",
        "affiliation_city": "Rajpura",
        "affiliation_country": "India",
        "affiliation_id": "60113205",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Real-world data: a brief review of the methods, applications, challenges and opportunities",
        "publication": "BMC Medical Research Methodology",
        "citied_by": "174",
        "cover_date": "2022-12-01",
        "Abstract": "Background: The increased adoption of the internet, social media, wearable devices, e-health services, and other technology-driven services in medicine and healthcare has led to the rapid generation of various types of digital data, providing a valuable data source beyond the confines of traditional clinical trials, epidemiological studies, and lab-based experiments. Methods: We provide a brief overview on the type and sources of real-world data and the common models and approaches to utilize and analyze real-world data. We discuss the challenges and opportunities of using real-world data for evidence-based decision making This review does not aim to be comprehensive or cover all aspects of the intriguing topic on RWD (from both the research and practical perspectives) but serves as a primer and provides useful sources for readers who interested in this topic. Results and Conclusions: Real-world hold great potential for generating real-world evidence for designing and conducting confirmatory trials and answering questions that may not be addressed otherwise. The voluminosity and complexity of real-world data also call for development of more appropriate, sophisticated, and innovative data processing and analysis techniques while maintaining scientific rigor in research findings, and attentions to data ethics to harness the power of real-world data.",
        "DOI": "10.1186/s12874-022-01768-6",
        "paper_author": "Liu F.",
        "affiliation_name": "University of Notre Dame",
        "affiliation_city": "Notre Dame",
        "affiliation_country": "United States",
        "affiliation_id": "60021508",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Circulating biomarkers in the diagnosis and management of hepatocellular carcinoma",
        "publication": "Nature Reviews Gastroenterology and Hepatology",
        "citied_by": "172",
        "cover_date": "2022-10-01",
        "Abstract": "Hepatocellular carcinoma (HCC) is one of the most prevalent and lethal causes of cancer-related death worldwide. The treatment of HCC remains challenging and is largely predicated on early diagnosis. Surveillance of high-risk groups using abdominal ultrasonography, with or without serum analysis of α-fetoprotein (AFP), can permit detection of early, potentially curable tumours, but is limited by its insensitivity. Reviewed here are two current approaches that aim to address this limitation. The first is to use old re-emerged empirically derived biomarkers such as AFP, now applied within statistical models. The second is to use circulating nucleic acid biomarkers, which include cell-free DNA (for example, circulating tumour DNA, cell-free mitochondrial DNA and cell-free viral DNA) and cell-free RNA, applying modern molecular biology-based technologies and machine learning techniques closely allied to the underlying biology of cancer. Taken together, these approaches are likely to be complementary. Both hold considerable promise for achieving earlier diagnosis as well as offering additional functionalities including improved monitoring of therapy and prediction of response thereto.",
        "DOI": "10.1038/s41575-022-00620-y",
        "paper_author": "Johnson P.",
        "affiliation_name": "University of Liverpool",
        "affiliation_city": "Liverpool",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020661",
        "affiliation_state": "Merseyside"
    },
    {
        "paper_title": "Comprehensive metabolomics expands precision medicine for triple-negative breast cancer",
        "publication": "Cell Research",
        "citied_by": "172",
        "cover_date": "2022-05-01",
        "Abstract": "Metabolic reprogramming is a hallmark of cancer. However, systematic characterizations of metabolites in triple-negative breast cancer (TNBC) are still lacking. Our study profiled the polar metabolome and lipidome in 330 TNBC samples and 149 paired normal breast tissues to construct a large metabolomic atlas of TNBC. Combining with previously established transcriptomic and genomic data of the same cohort, we conducted a comprehensive analysis linking TNBC metabolome to genomics. Our study classified TNBCs into three distinct metabolomic subgroups: C1, characterized by the enrichment of ceramides and fatty acids; C2, featured with the upregulation of metabolites related to oxidation reaction and glycosyl transfer; and C3, having the lowest level of metabolic dysregulation. Based on this newly developed metabolomic dataset, we refined previous TNBC transcriptomic subtypes and identified some crucial subtype-specific metabolites as potential therapeutic targets. The transcriptomic luminal androgen receptor (LAR) subtype overlapped with metabolomic C1 subtype. Experiments on patient-derived organoid and xenograft models indicate that targeting sphingosine-1-phosphate (S1P), an intermediate of the ceramide pathway, is a promising therapy for LAR tumors. Moreover, the transcriptomic basal-like immune-suppressed (BLIS) subtype contained two prognostic metabolomic subgroups (C2 and C3), which could be distinguished through machine-learning methods. We show that N-acetyl-aspartyl-glutamate is a crucial tumor-promoting metabolite and potential therapeutic target for high-risk BLIS tumors. Together, our study reveals the clinical significance of TNBC metabolomics, which can not only optimize the transcriptomic subtyping system, but also suggest novel therapeutic targets. This metabolomic dataset can serve as a useful public resource to promote precision treatment of TNBC.",
        "DOI": "10.1038/s41422-022-00614-0",
        "paper_author": "Xiao Y.",
        "affiliation_name": "Fudan University Shanghai Cancer Center",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60108904",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Metasurface-enabled on-chip multiplexed diffractive neural networks in the visible",
        "publication": "Light: Science and Applications",
        "citied_by": "171",
        "cover_date": "2022-12-01",
        "Abstract": "Replacing electrons with photons is a compelling route toward high-speed, massively parallel, and low-power artificial intelligence computing. Recently, diffractive networks composed of phase surfaces were trained to perform machine learning tasks through linear optical transformations. However, the existing architectures often comprise bulky components and, most critically, they cannot mimic the human brain for multitasking. Here, we demonstrate a multi-skilled diffractive neural network based on a metasurface device, which can perform on-chip multi-channel sensing and multitasking in the visible. The polarization multiplexing scheme of the subwavelength nanostructures is applied to construct a multi-channel classifier framework for simultaneous recognition of digital and fashionable items. The areal density of the artificial neurons can reach up to 6.25 × 106 mm−2 multiplied by the number of channels. The metasurface is integrated with the mature complementary metal-oxide semiconductor imaging sensor, providing a chip-scale architecture to process information directly at physical layers for energy-efficient and ultra-fast image processing in machine vision, autonomous driving, and precision medicine.",
        "DOI": "10.1038/s41377-022-00844-2",
        "paper_author": "Luo X.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "A blood atlas of COVID-19 defines hallmarks of disease severity and specificity",
        "publication": "Cell",
        "citied_by": "171",
        "cover_date": "2022-03-03",
        "Abstract": "Treatment of severe COVID-19 is currently limited by clinical heterogeneity and incomplete description of specific immune biomarkers. We present here a comprehensive multi-omic blood atlas for patients with varying COVID-19 severity in an integrated comparison with influenza and sepsis patients versus healthy volunteers. We identify immune signatures and correlates of host response. Hallmarks of disease severity involved cells, their inflammatory mediators and networks, including progenitor cells and specific myeloid and lymphocyte subsets, features of the immune repertoire, acute phase response, metabolism, and coagulation. Persisting immune activation involving AP-1/p38MAPK was a specific feature of COVID-19. The plasma proteome enabled sub-phenotyping into patient clusters, predictive of severity and outcome. Systems-based integrative analyses including tensor and matrix decomposition of all modalities revealed feature groupings linked with severity and specificity compared to influenza and sepsis. Our approach and blood atlas will support future drug development, clinical trial design, and personalized medicine approaches for COVID-19.",
        "DOI": "10.1016/j.cell.2022.01.012",
        "paper_author": "Ahern D.J.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Breast cancer detection using deep learning: Datasets, methods, and challenges ahead",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "164",
        "cover_date": "2022-10-01",
        "Abstract": "Breast Cancer (BC) is the most commonly diagnosed cancer and second leading cause of mortality among women. About 1 in 8 US women (about 13%) will develop invasive BC throughout their lifetime. Early detection of this life-threatening disease not only increases the survival rate but also reduces the treatment cost. Fortunately, advancements in radiographic imaging like “Mammograms”, “Computed Tomography (CT)”, “Magnetic Resonance Imaging (MRI)”, “3D Mammography”, and “Histopathological Imaging (HI)” have made it feasible to diagnose this life-taking disease at an early stage. However, the analysis of radiographic images and Histopathological images is done by experienced radiologists and pathologists, respectively. The process is not only costly but also error-prone. Over the last ten years, Computer Vision and Machine Learning (ML) have transformed the world in every way possible. Deep learning (DL), a subfield of ML has shown outstanding results in a variety of fields, particularly in the biomedical industry, because of its ability to handle large amounts of data. DL techniques automatically extract the features by analyzing the high dimensional and correlated data efficiently. The potential and ability of DL models have also been utilized and evaluated in the identification and prognosis of BC, utilizing radiographic and Histopathological images, and have performed admirably. However, AI has shown good claims in retrospective studies only. External validations are needed for translating these cutting-edge AI tools as a clinical decision maker. The main aim of this research work is to present the critical analysis of the research and findings already done to detect and classify BC using various imaging modalities including “Mammography”, “Histopathology”, “Ultrasound”, “PET/CT”, “MRI”, and “Thermography”. At first, a detailed review of the past research papers using Machine Learning, Deep Learning and Deep Reinforcement Learning for BC classification and detection is carried out. We also review the publicly available datasets for the above-mentioned imaging modalities to make future research more accessible. Finally, a critical discussion section has been included to elaborate open research difficulties and prospects for future study in this emerging area, demonstrating the limitations of Deep Learning approaches.",
        "DOI": "10.1016/j.compbiomed.2022.106073",
        "paper_author": "din N.M.u.",
        "affiliation_name": "Islamic University of Science and Technology",
        "affiliation_city": "Awantipora",
        "affiliation_country": "India",
        "affiliation_id": "60115213",
        "affiliation_state": "JK"
    },
    {
        "paper_title": "A review in radiomics: Making personalized medicine a reality via routine imaging",
        "publication": "Medicinal Research Reviews",
        "citied_by": "164",
        "cover_date": "2022-01-01",
        "Abstract": "Radiomics is the quantitative analysis of standard-of‑care medical imaging; the information obtained can be applied within clinical decision support systems to create diagnostic, prognostic, and/or predictive models. Radiomics analysis can be performed by extracting hand-crafted radiomics features or via deep learning algorithms. Radiomics has evolved tremendously in the last decade, becoming a bridge between imaging and precision medicine. Radiomics exploits sophisticated image analysis tools coupled with statistical elaboration to extract the wealth of information hidden inside medical images, such as computed tomography (CT), magnetic resonance (MR), and/or Positron emission tomography (PET) scans, routinely performed in the everyday clinical practice. Many efforts have been devoted in recent years to the standardization and validation of radiomics approaches, to demonstrate their usefulness and robustness beyond any reasonable doubts. However, the booming of publications and commercial applications of radiomics approaches warrant caution and proper understanding of all the factors involved to avoid “scientific pollution” and overly enthusiastic claims by researchers and clinicians alike. For these reasons the present review aims to be a guidebook of sorts, describing the process of radiomics, its pitfalls, challenges, and opportunities, along with its ability to improve clinical decision-making, from oncology and respiratory medicine to pharmacological and genotyping studies.",
        "DOI": "10.1002/med.21846",
        "paper_author": "Guiot J.",
        "affiliation_name": "Centre Hospitalier Universitaire de Liege",
        "affiliation_city": "Liege",
        "affiliation_country": "Belgium",
        "affiliation_id": "60016829",
        "affiliation_state": "WLG"
    },
    {
        "paper_title": "Artificial intelligence in cancer target identification and drug discovery",
        "publication": "Signal Transduction and Targeted Therapy",
        "citied_by": "163",
        "cover_date": "2022-12-01",
        "Abstract": "Artificial intelligence is an advanced method to identify novel anticancer targets and discover novel drugs from biology networks because the networks can effectively preserve and quantify the interaction between components of cell systems underlying human diseases such as cancer. Here, we review and discuss how to employ artificial intelligence approaches to identify novel anticancer targets and discover drugs. First, we describe the scope of artificial intelligence biology analysis for novel anticancer target investigations. Second, we review and discuss the basic principles and theory of commonly used network-based and machine learning-based artificial intelligence algorithms. Finally, we showcase the applications of artificial intelligence approaches in cancer target identification and drug discovery. Taken together, the artificial intelligence models have provided us with a quantitative framework to study the relationship between network characteristics and cancer, thereby leading to the identification of potential anticancer targets and the discovery of novel drug candidates.",
        "DOI": "10.1038/s41392-022-00994-0",
        "paper_author": "You Y.",
        "affiliation_name": "Sichuan University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60016521",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Information fusion as an integrative cross-cutting enabler to achieve robust, explainable, and trustworthy medical artificial intelligence",
        "publication": "Information Fusion",
        "citied_by": "154",
        "cover_date": "2022-03-01",
        "Abstract": "Medical artificial intelligence (AI) systems have been remarkably successful, even outperforming human performance at certain tasks. There is no doubt that AI is important to improve human health in many ways and will disrupt various medical workflows in the future. Using AI to solve problems in medicine beyond the lab, in routine environments, we need to do more than to just improve the performance of existing AI methods. Robust AI solutions must be able to cope with imprecision, missing and incorrect information, and explain both the result and the process of how it was obtained to a medical expert. Using conceptual knowledge as a guiding model of reality can help to develop more robust, explainable, and less biased machine learning models that can ideally learn from less data. Achieving these goals will require an orchestrated effort that combines three complementary Frontier Research Areas: (1) Complex Networks and their Inference, (2) Graph causal models and counterfactuals, and (3) Verification and Explainability methods. The goal of this paper is to describe these three areas from a unified view and to motivate how information fusion in a comprehensive and integrative manner can not only help bring these three areas together, but also have a transformative role by bridging the gap between research and practical applications in the context of future trustworthy medical AI. This makes it imperative to include ethical and legal aspects as a cross-cutting discipline, because all future solutions must not only be ethically responsible, but also legally compliant.",
        "DOI": "10.1016/j.inffus.2021.10.007",
        "paper_author": "Holzinger A.",
        "affiliation_name": "Medizinische Universität Graz",
        "affiliation_city": "Graz",
        "affiliation_country": "Austria",
        "affiliation_id": "60006224",
        "affiliation_state": "Styria"
    },
    {
        "paper_title": "Artificial intelligence and machine learning in precision and genomic medicine",
        "publication": "Medical Oncology",
        "citied_by": "153",
        "cover_date": "2022-08-01",
        "Abstract": "The advancement of precision medicine in medical care has led behind the conventional symptom-driven treatment process by allowing early risk prediction of disease through improved diagnostics and customization of more effective treatments. It is necessary to scrutinize overall patient data alongside broad factors to observe and differentiate between ill and relatively healthy people to take the most appropriate path toward precision medicine, resulting in an improved vision of biological indicators that can signal health changes. Precision and genomic medicine combined with artificial intelligence have the potential to improve patient healthcare. Patients with less common therapeutic responses or unique healthcare demands are using genomic medicine technologies. AI provides insights through advanced computation and inference, enabling the system to reason and learn while enhancing physician decision making. Many cell characteristics, including gene up-regulation, proteins binding to nucleic acids, and splicing, can be measured at high throughput and used as training objectives for predictive models. Researchers can create a new era of effective genomic medicine with the improved availability of a broad range of datasets and modern computer techniques such as machine learning. This review article has elucidated the contributions of ML algorithms in precision and genome medicine.",
        "DOI": "10.1007/s12032-022-01711-1",
        "paper_author": "Quazi S.",
        "affiliation_name": "GenLab Biosolutions Private Limited",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "125727140",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Federated learning enables big data for rare cancer boundary detection",
        "publication": "Nature Communications",
        "citied_by": "151",
        "cover_date": "2022-12-01",
        "Abstract": "Although machine learning (ML) has shown promise across disciplines, out-of-sample generalizability is concerning. This is currently addressed by sharing multi-site data, but such centralization is challenging/infeasible to scale due to various limitations. Federated ML (FL) provides an alternative paradigm for accurate and generalizable ML, by only sharing numerical model updates. Here we present the largest FL study to-date, involving data from 71 sites across 6 continents, to generate an automatic tumor boundary detector for the rare disease of glioblastoma, reporting the largest such dataset in the literature (n = 6, 314). We demonstrate a 33% delineation improvement for the surgically targetable tumor, and 23% for the complete tumor extent, over a publicly trained model. We anticipate our study to: 1) enable more healthcare studies informed by large diverse data, ensuring meaningful results for rare diseases and underrepresented populations, 2) facilitate further analyses for glioblastoma by releasing our consensus model, and 3) demonstrate the FL effectiveness at such scale and task-complexity as a paradigm shift for multi-site collaborations, alleviating the need for data-sharing.",
        "DOI": "10.1038/s41467-022-33407-5",
        "paper_author": "Pati S.",
        "affiliation_name": "University of Pennsylvania",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60006297",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "A Useful Guide to Lectin Binding: Machine-Learning Directed Annotation of 57 Unique Lectin Specificities",
        "publication": "ACS Chemical Biology",
        "citied_by": "147",
        "cover_date": "2022-11-18",
        "Abstract": "Glycans are critical to every facet of biology and medicine, from viral infections to embryogenesis. Tools to study glycans are rapidly evolving; however, the majority of our knowledge is deeply dependent on binding by glycan binding proteins (e.g., lectins). The specificities of lectins, which are often naturally isolated proteins, have not been well-defined, making it difficult to leverage their full potential for glycan analysis. Herein, we use a combination of machine learning algorithms and expert annotation to define lectin specificity for this important probe set. Our analysis uses comprehensive glycan microarray analysis of commercially available lectins we obtained using version 5.0 of the Consortium for Functional Glycomics glycan microarray (CFGv5). This data set was made public in 2011. We report the creation of this data set and its use in large-scale evaluation of lectin-glycan binding behaviors. Our motif analysis was performed by integrating 68 manually defined glycan features with systematic probing of computational rules for significant binding motifs using mono- and disaccharides and linkages. Combining machine learning with manual annotation, we create a detailed interpretation of glycan-binding specificity for 57 unique lectins, categorized by their major binding motifs: mannose, complex-type N-glycan, O-glycan, fucose, sialic acid and sulfate, GlcNAc and chitin, Gal and LacNAc, and GalNAc. Our work provides fresh insights into the complex binding features of commercially available lectins in current use, providing a critical guide to these important reagents.",
        "DOI": "10.1021/acschembio.1c00689",
        "paper_author": "Bojar D.",
        "affiliation_name": "Göteborgs Universitet",
        "affiliation_city": "Gothenburg",
        "affiliation_country": "Sweden",
        "affiliation_id": "60016437",
        "affiliation_state": "Vastra Gotaland"
    },
    {
        "paper_title": "A knowledge graph to interpret clinical proteomics data",
        "publication": "Nature Biotechnology",
        "citied_by": "146",
        "cover_date": "2022-05-01",
        "Abstract": "Implementing precision medicine hinges on the integration of omics data, such as proteomics, into the clinical decision-making process, but the quantity and diversity of biomedical data, and the spread of clinically relevant knowledge across multiple biomedical databases and publications, pose a challenge to data integration. Here we present the Clinical Knowledge Graph (CKG), an open-source platform currently comprising close to 20 million nodes and 220 million relationships that represent relevant experimental data, public databases and literature. The graph structure provides a flexible data model that is easily extendable to new nodes and relationships as new databases become available. The CKG incorporates statistical and machine learning algorithms that accelerate the analysis and interpretation of typical proteomics workflows. Using a set of proof-of-concept biomarker studies, we show how the CKG might augment and enrich proteomics data and help inform clinical decision-making.",
        "DOI": "10.1038/s41587-021-01145-6",
        "paper_author": "Santos A.",
        "affiliation_name": "Det Sundhedsvidenskabelige Fakultet",
        "affiliation_city": "Copenhagen",
        "affiliation_country": "Denmark",
        "affiliation_id": "60013332",
        "affiliation_state": "Hovedstaden"
    },
    {
        "paper_title": "Rituximab versus tocilizumab in rheumatoid arthritis: synovial biopsy-based biomarker analysis of the phase 4 R4RA randomized trial",
        "publication": "Nature Medicine",
        "citied_by": "145",
        "cover_date": "2022-06-01",
        "Abstract": "Patients with rheumatoid arthritis (RA) receive highly targeted biologic therapies without previous knowledge of target expression levels in the diseased tissue. Approximately 40% of patients do not respond to individual biologic therapies and 5–20% are refractory to all. In a biopsy-based, precision-medicine, randomized clinical trial in RA (R4RA; n = 164), patients with low/absent synovial B cell molecular signature had a lower response to rituximab (anti-CD20 monoclonal antibody) compared with that to tocilizumab (anti-IL6R monoclonal antibody) although the exact mechanisms of response/nonresponse remain to be established. Here, in-depth histological/molecular analyses of R4RA synovial biopsies identify humoral immune response gene signatures associated with response to rituximab and tocilizumab, and a stromal/fibroblast signature in patients refractory to all medications. Post-treatment changes in synovial gene expression and cell infiltration highlighted divergent effects of rituximab and tocilizumab relating to differing response/nonresponse mechanisms. Using ten-by-tenfold nested cross-validation, we developed machine learning algorithms predictive of response to rituximab (area under the curve (AUC) = 0.74), tocilizumab (AUC = 0.68) and, notably, multidrug resistance (AUC = 0.69). This study supports the notion that disease endotypes, driven by diverse molecular pathology pathways in the diseased tissue, determine diverse clinical and treatment–response phenotypes. It also highlights the importance of integration of molecular pathology signatures into clinical algorithms to optimize the future use of existing medications and inform the development of new drugs for refractory patients.",
        "DOI": "10.1038/s41591-022-01789-0",
        "paper_author": "Rivellese F.",
        "affiliation_name": "Barts and The London School of Medicine and Dentistry",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60021435",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Graph representation learning in biomedicine and healthcare",
        "publication": "Nature Biomedical Engineering",
        "citied_by": "135",
        "cover_date": "2022-12-01",
        "Abstract": "Networks—or graphs—are universal descriptors of systems of interacting elements. In biomedicine and healthcare, they can represent, for example, molecular interactions, signalling pathways, disease co-morbidities or healthcare systems. In this Perspective, we posit that representation learning can realize principles of network medicine, discuss successes and current limitations of the use of representation learning on graphs in biomedicine and healthcare, and outline algorithmic strategies that leverage the topology of graphs to embed them into compact vectorial spaces. We argue that graph representation learning will keep pushing forward machine learning for biomedicine and healthcare applications, including the identification of genetic variants underlying complex traits, the disentanglement of single-cell behaviours and their effects on health, the assistance of patients in diagnosis and treatment, and the development of safe and effective medicines.",
        "DOI": "10.1038/s41551-022-00942-x",
        "paper_author": "Li M.M.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Clinical trial design in the era of precision medicine",
        "publication": "Genome Medicine",
        "citied_by": "135",
        "cover_date": "2022-12-01",
        "Abstract": "Recent rapid biotechnological breakthroughs have led to the identification of complex and unique molecular features that drive malignancies. Precision medicine has exploited next-generation sequencing and matched targeted therapy/immunotherapy deployment to successfully transform the outlook for several fatal cancers. Tumor and liquid biopsy genomic profiling and transcriptomic, immunomic, and proteomic interrogation can now all be leveraged to optimize therapy. Multiple new trial designs, including basket and umbrella trials, master platform trials, and N-of-1 patient-centric studies, are beginning to supplant standard phase I, II, and III protocols, allowing for accelerated drug evaluation and approval and molecular-based individualized treatment. Furthermore, real-world data, as well as exploitation of digital apps and structured observational registries, and the utilization of machine learning and/or artificial intelligence, may further accelerate knowledge acquisition. Overall, clinical trials have evolved, shifting from tumor type-centered to gene-directed and histology-agnostic trials, with innovative adaptive designs and personalized combination treatment strategies tailored to individual biomarker profiles. Some, but not all, novel trials now demonstrate that matched therapy correlates with superior outcomes compared to non-matched therapy across tumor types and in specific cancers. To further improve the precision medicine paradigm, the strategy of matching drugs to patients based on molecular features should be implemented earlier in the disease course, and cancers should have comprehensive multi-omic (genomics, transcriptomics, proteomics, immunomic) tumor profiling. To overcome cancer complexity, moving from drug-centric to patient-centric individualized combination therapy is critical. This review focuses on the design, advantages, limitations, and challenges of a spectrum of clinical trial designs in the era of precision oncology.",
        "DOI": "10.1186/s13073-022-01102-1",
        "paper_author": "Fountzilas E.",
        "affiliation_name": "St. Luke's Hospital",
        "affiliation_city": "Thessaloniki",
        "affiliation_country": "Greece",
        "affiliation_id": "112025088",
        "affiliation_state": "Thessaloniki"
    },
    {
        "paper_title": "Machine Learning and Artificial Intelligence in Pharmaceutical Research and Development: a Review",
        "publication": "AAPS Journal",
        "citied_by": "134",
        "cover_date": "2022-02-01",
        "Abstract": "Over the past decade, artificial intelligence (AI) and machine learning (ML) have become the breakthrough technology most anticipated to have a transformative effect on pharmaceutical research and development (R&D). This is partially driven by revolutionary advances in computational technology and the parallel dissipation of previous constraints to the collection/processing of large volumes of data. Meanwhile, the cost of bringing new drugs to market and to patients has become prohibitively expensive. Recognizing these headwinds, AI/ML techniques are appealing to the pharmaceutical industry due to their automated nature, predictive capabilities, and the consequent expected increase in efficiency. ML approaches have been used in drug discovery over the past 15–20 years with increasing sophistication. The most recent aspect of drug development where positive disruption from AI/ML is starting to occur, is in clinical trial design, conduct, and analysis. The COVID-19 pandemic may further accelerate utilization of AI/ML in clinical trials due to an increased reliance on digital technology in clinical trial conduct. As we move towards a world where there is a growing integration of AI/ML into R&D, it is critical to get past the related buzz-words and noise. It is equally important to recognize that the scientific method is not obsolete when making inferences about data. Doing so will help in separating hope from hype and lead to informed decision-making on the optimal use of AI/ML in drug development. This manuscript aims to demystify key concepts, present use-cases and finally offer insights and a balanced view on the optimal use of AI/ML methods in R&D. Graphical abstract: [Figure not available: see fulltext.].",
        "DOI": "10.1208/s12248-021-00644-3",
        "paper_author": "Kolluri S.",
        "affiliation_name": "Teva Pharmaceutical Industries Ltd.",
        "affiliation_city": "Petah Tiqwa",
        "affiliation_country": "Israel",
        "affiliation_id": "60088746",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The health digital twin to tackle cardiovascular disease—a review of an emerging interdisciplinary field",
        "publication": "npj Digital Medicine",
        "citied_by": "130",
        "cover_date": "2022-12-01",
        "Abstract": "Potential benefits of precision medicine in cardiovascular disease (CVD) include more accurate phenotyping of individual patients with the same condition or presentation, using multiple clinical, imaging, molecular and other variables to guide diagnosis and treatment. An approach to realising this potential is the digital twin concept, whereby a virtual representation of a patient is constructed and receives real-time updates of a range of data variables in order to predict disease and optimise treatment selection for the real-life patient. We explored the term digital twin, its defining concepts, the challenges as an emerging field, and potentially important applications in CVD. A mapping review was undertaken using a systematic search of peer-reviewed literature. Industry-based participants and patent applications were identified through web-based sources. Searches of Compendex, EMBASE, Medline, ProQuest and Scopus databases yielded 88 papers related to cardiovascular conditions (28%, n = 25), non-cardiovascular conditions (41%, n = 36), and general aspects of the health digital twin (31%, n = 27). Fifteen companies with a commercial interest in health digital twin or simulation modelling had products focused on CVD. The patent search identified 18 applications from 11 applicants, of which 73% were companies and 27% were universities. Three applicants had cardiac-related inventions. For CVD, digital twin research within industry and academia is recent, interdisciplinary, and established globally. Overall, the applications were numerical simulation models, although precursor models exist for the real-time cyber-physical system characteristic of a true digital twin. Implementation challenges include ethical constraints and clinical barriers to the adoption of decision tools derived from artificial intelligence systems.",
        "DOI": "10.1038/s41746-022-00640-7",
        "paper_author": "Coorey G.",
        "affiliation_name": "Faculty of Medicine and Health",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60010710",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Head and neck tumor segmentation in PET/CT: The HECKTOR challenge",
        "publication": "Medical Image Analysis",
        "citied_by": "129",
        "cover_date": "2022-04-01",
        "Abstract": "This paper relates the post-analysis of the first edition of the HEad and neCK TumOR (HECKTOR) challenge. This challenge was held as a satellite event of the 23rd International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI) 2020, and was the first of its kind focusing on lesion segmentation in combined FDG-PET and CT image modalities. The challenge's task is the automatic segmentation of the Gross Tumor Volume (GTV) of Head and Neck (H&N) oropharyngeal primary tumors in FDG-PET/CT images. To this end, the participants were given a training set of 201 cases from four different centers and their methods were tested on a held-out set of 53 cases from a fifth center. The methods were ranked according to the Dice Score Coefficient (DSC) averaged across all test cases. An additional inter-observer agreement study was organized to assess the difficulty of the task from a human perspective. 64 teams registered to the challenge, among which 10 provided a paper detailing their approach. The best method obtained an average DSC of 0.7591, showing a large improvement over our proposed baseline method and the inter-observer agreement, associated with DSCs of 0.6610 and 0.61, respectively. The automatic methods proved to successfully leverage the wealth of metabolic and structural properties of combined PET and CT modalities, significantly outperforming human inter-observer agreement level, semi-automatic thresholding based on PET images as well as other single modality-based methods. This promising performance is one step forward towards large-scale radiomics studies in H&N cancer, obviating the need for error-prone and time-consuming manual delineation of GTVs.",
        "DOI": "10.1016/j.media.2021.102336",
        "paper_author": "Oreiller V.",
        "affiliation_name": "University of Applied Sciences Western Switzerland",
        "affiliation_city": "Delemont",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60101868",
        "affiliation_state": "JU"
    },
    {
        "paper_title": "Collaborative Federated Learning for Healthcare: Multi-Modal COVID-19 Diagnosis at the Edge",
        "publication": "IEEE Open Journal of the Computer Society",
        "citied_by": "128",
        "cover_date": "2022-01-01",
        "Abstract": "Despite significant improvements over the last few years, cloud-based healthcare applications continue to suffer from poor adoption due to their limitations in meeting stringent security, privacy, and quality of service requirements (such as low latency). The edge computing trend, along with techniques for distributed machine learning such as federated learning, has gained popularity as a viable solution in such settings. In this paper, we leverage the capabilities of edge computing in medicine by evaluating the potential of intelligent processing of clinical data at the edge. We utilized the emerging concept of clustered federated learning (CFL) for an automatic COVID-19 diagnosis. We evaluate the performance of the proposed framework under different experimental setups on two benchmark datasets. Promising results are obtained on both datasets resulting in comparable results against the central baseline where the specialized models (i.e., each on a specific image modality) are trained with central data, and improvements of 16% and 11% in overall F1-Scores have been achieved over the trained model trained (using multi-modal COVID-19 data) in the CFL setup on X-ray and Ultrasound datasets, respectively. We also discussed the associated challenges, technologies, and techniques available for deploying ML at the edge in such privacy and delay-sensitive applications.",
        "DOI": "10.1109/OJCS.2022.3206407",
        "paper_author": "Qayyum A.",
        "affiliation_name": "Information Technology University",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60105219",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Applications of Explainable Artificial Intelligence in Diagnosis and Surgery",
        "publication": "Diagnostics",
        "citied_by": "128",
        "cover_date": "2022-02-01",
        "Abstract": "In recent years, artificial intelligence (AI) has shown great promise in medicine. However, explainability issues make AI applications in clinical usages difficult. Some research has been conducted into explainable artificial intelligence (XAI) to overcome the limitation of the black-box nature of AI methods. Compared with AI techniques such as deep learning, XAI can provide both decision-making and explanations of the model. In this review, we conducted a survey of the recent trends in medical diagnosis and surgical applications using XAI. We have searched articles published between 2019 and 2021 from PubMed, IEEE Xplore, Association for Computing Machinery, and Google Scholar. We included articles which met the selection criteria in the review and then extracted and analyzed relevant information from the studies. Additionally, we provide an experimental showcase on breast cancer diagnosis, and illustrate how XAI can be applied in medical XAI applications. Finally, we summarize the XAI methods utilized in the medical XAI applications, the challenges that the researchers have met, and discuss the future research directions. The survey result indicates that medical XAI is a promising research direction, and this study aims to serve as a reference to medical experts and AI scientists when designing medical XAI applications.",
        "DOI": "10.3390/diagnostics12020237",
        "paper_author": "Zhang Y.",
        "affiliation_name": "University of Nottingham Ningbo China",
        "affiliation_city": "Ningbo",
        "affiliation_country": "China",
        "affiliation_id": "60104720",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Survey on Machine Learning in Speech Emotion Recognition and Vision Systems Using a Recurrent Neural Network (RNN)",
        "publication": "Archives of Computational Methods in Engineering",
        "citied_by": "115",
        "cover_date": "2022-05-01",
        "Abstract": "This is a survey paper that aims to give reviews about that finest architectures of machine learning, the use of algorithms and the applications of the system and speech and vision processes. The current technology poses vast areas of research in the field of architectures and algorithms which are used in machine learning, they can further be used for the planning new ideas and recreation of speech system and vision systems intelligently. The level of personal computing and its commercialization is at an all-time high. The machine learning can used for learning and training using large sets of sensor data and computing through clouds, also not to forget the mobile and embedded technology which is even more sophisticated. The survey is presented by giving a detailed background and the evolving nature of the most used models of deep learning which are used effectively in the vision and speech systems. The survey aims to give a perspective into the large scale research at the industrial level, it also highlights the efforts taken for future focus and upcoming demands of the intelligent use of speech and vision processes. The demand in a strong, robust and high intelligent system is that of lower latency and fidelity to be high. This is mostly seen in hardware devices with limited resources like automobiles, robots and mobile phones. These points are kept in mind and a detail of the major challenges and success rates especially in machine learning with platforms that have limited resources. The restrictions are in memory, life of the battery and the capacity of processing. The conclusion is based on the applications which are fast emerging based on the usage of speech and vision systems. Examples include effective evaluation, smart and quick system transportation and correct medicine prescriptions. This paper promise to deliver a comprehensive survey emphasizing on the demands of speech and vision systems with the view of both hardware and software systems. The technologies which are discussed in machine learning are fast gaining access and aim to revolutionize the areas of research and development in speech and vision systems.",
        "DOI": "10.1007/s11831-021-09647-x",
        "paper_author": "Yadav S.P.",
        "affiliation_name": "ABES Institute of Technology",
        "affiliation_city": "Ghaziabad",
        "affiliation_country": "India",
        "affiliation_id": "60114983",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "Natural product drug discovery in the artificial intelligence era",
        "publication": "Chemical Science",
        "citied_by": "112",
        "cover_date": "2022-02-14",
        "Abstract": "Natural products (NPs) are primarily recognized as privileged structures to interact with protein drug targets. Their unique characteristics and structural diversity continue to marvel scientists for developing NP-inspired medicines, even though the pharmaceutical industry has largely given up. High-performance computer hardware, extensive storage, accessible software and affordable online education have democratized the use of artificial intelligence (AI) in many sectors and research areas. The last decades have introduced natural language processing and machine learning algorithms, two subfields of AI, to tackle NP drug discovery challenges and open up opportunities. In this article, we review and discuss the rational applications of AI approaches developed to assist in discovering bioactive NPs and capturing the molecular \"patterns\"of these privileged structures for combinatorial design or target selectivity.",
        "DOI": "10.1039/d1sc04471k",
        "paper_author": "Saldívar-González F.I.",
        "affiliation_name": "Universidad Nacional Autónoma de México",
        "affiliation_city": "Mexico",
        "affiliation_country": "Mexico",
        "affiliation_id": "60032442",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Machine learning and conventional statistics: making sense of the differences",
        "publication": "Knee Surgery, Sports Traumatology, Arthroscopy",
        "citied_by": "107",
        "cover_date": "2022-03-01",
        "Abstract": "The application of machine learning (ML) to the field of orthopaedic surgery is rapidly increasing, but many surgeons remain unfamiliar with the nuances of this novel technique. With this editorial, we address a fundamental topic—the differences between ML techniques and traditional statistics. By doing so, we aim to further familiarize the reader with the new opportunities available thanks to the ML approach.",
        "DOI": "10.1007/s00167-022-06896-6",
        "paper_author": "Ley C.",
        "affiliation_name": "University of Luxembourg",
        "affiliation_city": "Esch-sur-Alzette",
        "affiliation_country": "Luxembourg",
        "affiliation_id": "60072562",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Network-based machine learning approach to predict immunotherapy response in cancer patients",
        "publication": "Nature Communications",
        "citied_by": "104",
        "cover_date": "2022-12-01",
        "Abstract": "Immune checkpoint inhibitors (ICIs) have substantially improved the survival of cancer patients over the past several years. However, only a minority of patients respond to ICI treatment (~30% in solid tumors), and current ICI-response-associated biomarkers often fail to predict the ICI treatment response. Here, we present a machine learning (ML) framework that leverages network-based analyses to identify ICI treatment biomarkers (NetBio) that can make robust predictions. We curate more than 700 ICI-treated patient samples with clinical outcomes and transcriptomic data, and observe that NetBio-based predictions accurately predict ICI treatment responses in three different cancer types—melanoma, gastric cancer, and bladder cancer. Moreover, the NetBio-based prediction is superior to predictions based on other conventional ICI treatment biomarkers, such as ICI targets or tumor microenvironment-associated markers. This work presents a network-based method to effectively select immunotherapy-response-associated biomarkers that can make robust ML-based predictions for precision oncology.",
        "DOI": "10.1038/s41467-022-31535-6",
        "paper_author": "Kong J.H.",
        "affiliation_name": "Pohang University of Science and Technology",
        "affiliation_city": "Pohang",
        "affiliation_country": "South Korea",
        "affiliation_id": "60032330",
        "affiliation_state": "Gyeongsangbuk-do"
    },
    {
        "paper_title": "Applications of artificial intelligence in dentistry: A comprehensive review",
        "publication": "Journal of Esthetic and Restorative Dentistry",
        "citied_by": "104",
        "cover_date": "2022-01-01",
        "Abstract": "Objective: To perform a comprehensive review of the use of artificial intelligence (AI) and machine learning (ML) in dentistry, providing the community with a broad insight on the different advances that these technologies and tools have produced, paying special attention to the area of esthetic dentistry and color research. Materials and methods: The comprehensive review was conducted in MEDLINE/PubMed, Web of Science, and Scopus databases, for papers published in English language in the last 20 years. Results: Out of 3871 eligible papers, 120 were included for final appraisal. Study methodologies included deep learning (DL; n = 76), fuzzy logic (FL; n = 12), and other ML techniques (n = 32), which were mainly applied to disease identification, image segmentation, image correction, and biomimetic color analysis and modeling. Conclusions: The insight provided by the present work has reported outstanding results in the design of high-performance decision support systems for the aforementioned areas. The future of digital dentistry goes through the design of integrated approaches providing personalized treatments to patients. In addition, esthetic dentistry can benefit from those advances by developing models allowing a complete characterization of tooth color, enhancing the accuracy of dental restorations. Clinical significance: The use of AI and ML has an increasing impact on the dental profession and is complementing the development of digital technologies and tools, with a wide application in treatment planning and esthetic dentistry procedures.",
        "DOI": "10.1111/jerd.12844",
        "paper_author": "Carrillo-Perez F.",
        "affiliation_name": "Universidad de Granada",
        "affiliation_city": "Granada",
        "affiliation_country": "Spain",
        "affiliation_id": "60027844",
        "affiliation_state": "Granada"
    },
    {
        "paper_title": "Massively parallel pooled screening reveals genomic determinants of nanoparticle delivery",
        "publication": "Science",
        "citied_by": "101",
        "cover_date": "2022-07-22",
        "Abstract": "To accelerate the translation of cancer nanomedicine, we used an integrated genomic approach to improve our understanding of the cellular processes that govern nanoparticle trafficking. We developed a massively parallel screen that leverages barcoded, pooled cancer cell lines annotated with multiomic data to investigate cell association patterns across a nanoparticle library spanning a range of formulations with clinical potential. We identified both materials properties and cell-intrinsic features that mediate nanoparticle-cell association. Using machine learning algorithms, we constructed genomic nanoparticle trafficking networks and identified nanoparticle-specific biomarkers. We validated one such biomarker: gene expression of SLC46A3, which inversely predicts lipid-based nanoparticle uptake in vitro and in vivo. Our work establishes the power of integrated screens for nanoparticle delivery and enables the identification and utilization of biomarkers to rationally design nanoformulations.",
        "DOI": "10.1126/science.abm5551",
        "paper_author": "Boehnke N.",
        "affiliation_name": "Massachusetts Institute of Technology",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60022195",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Artificial intelligence applications in Latin American higher education: a systematic review",
        "publication": "International Journal of Educational Technology in Higher Education",
        "citied_by": "101",
        "cover_date": "2022-12-01",
        "Abstract": "Over the last decade, there has been great research interest in the application of artificial intelligence (AI) in various fields, such as medicine, finance, and law. Recently, there has been a research focus on the application of AI in education, where it has great potential. Therefore, a systematic review of the literature on AI in education is therefore necessary. This article considers its usage and applications in Latin American higher education institutions. After identifying the studies dedicated to educational innovations brought about by the application of AI techniques, this review examines AI applications in three educational processes: learning, teaching, and administration. Each study is analyzed for the AI techniques used, such as machine learning, deep learning, and natural language processing, the AI tools and algorithms that are applied, and the main education topic. The results reveal that the main AI applications in education are: predictive modelling, intelligent analytics, assistive technology, automatic content analysis, and image analytics. It is further demonstrated that AI applications help to address important education issues (e.g., detecting students at risk of dropping out) and thereby contribute to ensuring quality education. Finally, the article presents the lessons learned from the review concerning the application of AI technologies in higher education in the Latin American context.",
        "DOI": "10.1186/s41239-022-00326-w",
        "paper_author": "Salas-Pilco S.Z.",
        "affiliation_name": "Central China Normal University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60010591",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Predicting sepsis severity at first clinical presentation: The role of endotypes and mechanistic signatures",
        "publication": "eBioMedicine",
        "citied_by": "101",
        "cover_date": "2022-01-01",
        "Abstract": "Background: Inter-individual variability during sepsis limits appropriate triage of patients. Identifying, at first clinical presentation, gene expression signatures that predict subsequent severity will allow clinicians to identify the most at-risk groups of patients and enable appropriate antibiotic use. Methods: Blood RNA-Seq and clinical data were collected from 348 patients in four emergency rooms (ER) and one intensive-care-unit (ICU), and 44 healthy controls. Gene expression profiles were analyzed using machine learning and data mining to identify clinically relevant gene signatures reflecting disease severity, organ dysfunction, mortality, and specific endotypes/mechanisms. Findings: Gene expression signatures were obtained that predicted severity/organ dysfunction and mortality in both ER and ICU patients with accuracy/AUC of 77–80%. Network analysis revealed these signatures formed a coherent biological program, with specific but overlapping mechanisms/pathways. Given the heterogeneity of sepsis, we asked if patients could be assorted into discrete groups with distinct mechanisms (endotypes) and varying severity. Patients with early sepsis could be stratified into five distinct and novel mechanistic endotypes, named Neutrophilic-Suppressive/NPS, Inflammatory/INF, Innate-Host-Defense/IHD, Interferon/IFN, and Adaptive/ADA, each based on ∼200 unique gene expression differences, and distinct pathways/mechanisms (e.g., IL6/STAT3 in NPS). Endotypes had varying overall severity with two severe (NPS/INF) and one relatively benign (ADA) groupings, consistent with reanalysis of previous endotype studies. A 40 gene-classification tool (accuracy=96%) and several gene-pairs (accuracy=89–97%) accurately predicted endotype status in both ER and ICU validation cohorts. Interpretation: The severity and endotype signatures indicate that distinct immune signatures precede the onset of severe sepsis and lethality, providing a method to triage early sepsis patients.",
        "DOI": "10.1016/j.ebiom.2021.103776",
        "paper_author": "Baghela A.",
        "affiliation_name": "The University of British Columbia",
        "affiliation_city": "Vancouver",
        "affiliation_country": "Canada",
        "affiliation_id": "60010365",
        "affiliation_state": "BC"
    },
    {
        "paper_title": "Innovations in Genomics and Big Data Analytics for Personalized Medicine and Health Care: A Review",
        "publication": "International Journal of Molecular Sciences",
        "citied_by": "99",
        "cover_date": "2022-05-01",
        "Abstract": "Big data in health care is a fast-growing field and a new paradigm that is transforming case-based studies to large-scale, data-driven research. As big data is dependent on the advancement of new data standards, technology, and relevant research, the future development of big data applications holds foreseeable promise in the modern day health care revolution. Enormously large, rapidly growing collections of biomedical omics-data (genomics, proteomics, transcriptomics, metabolomics, glycomics, etc.) and clinical data create major challenges and opportunities for their analysis and interpretation and open new computational gateways to address these issues. The design of new robust algorithms that are most suitable to properly analyze this big data by taking into account individual variability in genes has enabled the creation of precision (personalized) medicine. We reviewed and highlighted the significance of big data analytics for personalized medicine and health care by focusing mostly on machine learning perspectives on personalized medicine, genomic data models with respect to personalized medicine, the application of data mining algorithms for personalized medicine as well as the challenges we are facing right now in big data analytics.",
        "DOI": "10.3390/ijms23094645",
        "paper_author": "Hassan M.",
        "affiliation_name": "University of Lahore",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60070610",
        "affiliation_state": "Punjab"
    },
    {
        "paper_title": "Multi-omics approaches for biomarker discovery in early ovarian cancer diagnosis",
        "publication": "eBioMedicine",
        "citied_by": "98",
        "cover_date": "2022-05-01",
        "Abstract": "Ovarian cancer (OC) is a heterogeneous disease with the highest mortality rate and the poorest prognosis among gynecological malignancies. Because of the absence of specific early symptoms, most OC patients are often diagnosed at late stages. Thus, improved biomarkers of OC for use in research and clinical practice are urgently needed. The last decade has seen increasingly rapid advances in sequencing and biotechnological methodologies. Consequently, multiple omics technologies, including genomic/transcriptomic sequencings and proteomic/metabolomic mass spectra, have been widely applied to analyze tissue- and liquid-derived samples from OC patients. The integration of multi-omics data has increased our knowledge of the disease and identified valuable OC biomarkers. In this review, we summarize the recent advances and perspectives in the use of multi-omics technologies in OC research and highlight potential applications of multi-omics for identifying novel biomarkers and improving clinical assessments.",
        "DOI": "10.1016/j.ebiom.2022.104001",
        "paper_author": "Xiao Y.",
        "affiliation_name": "Peking University Third Hospital",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60121975",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Validation and utility of ARDS subphenotypes identified by machine-learning models using clinical data: an observational, multicohort, retrospective analysis",
        "publication": "The Lancet Respiratory Medicine",
        "citied_by": "97",
        "cover_date": "2022-04-01",
        "Abstract": "Background: Two acute respiratory distress syndrome (ARDS) subphenotypes (hyperinflammatory and hypoinflammatory) with distinct clinical and biological features and differential treatment responses have been identified using latent class analysis (LCA) in seven individual cohorts. To facilitate bedside identification of subphenotypes, clinical classifier models using readily available clinical variables have been described in four randomised controlled trials. We aimed to assess the performance of these models in observational cohorts of ARDS. Methods: In this observational, multicohort, retrospective study, we validated two machine-learning clinical classifier models for assigning ARDS subphenotypes in two observational cohorts of patients with ARDS: Early Assessment of Renal and Lung Injury (EARLI; n=335) and Validating Acute Lung Injury Markers for Diagnosis (VALID; n=452), with LCA-derived subphenotypes as the gold standard. The primary model comprised only vital signs and laboratory variables, and the secondary model comprised all predictors in the primary model, with the addition of ventilatory variables and demographics. Model performance was assessed by calculating the area under the receiver operating characteristic curve (AUC) and calibration plots, and assigning subphenotypes using a probability cutoff value of 0·5 to determine sensitivity, specificity, and accuracy of the assignments. We also assessed the performance of the primary model in EARLI using data automatically extracted from an electronic health record (EHR; EHR-derived EARLI cohort). In Large Observational Study to Understand the Global Impact of Severe Acute Respiratory Failure (LUNG SAFE; n=2813), a multinational, observational ARDS cohort, we applied a custom classifier model (with fewer variables than the primary model) to determine the prognostic value of the subphenotypes and tested their interaction with the positive end-expiratory pressure (PEEP) strategy, with 90-day mortality as the dependent variable. Findings: The primary clinical classifier model had an area under receiver operating characteristic curve (AUC) of 0·92 (95% CI 0·90–0·95) in EARLI and 0·88 (0·84–0·91) in VALID. Performance of the primary model was similar when using exclusively EHR-derived predictors compared with manually curated predictors (AUC=0·88 [95% CI 0·81–0·94] vs 0·92 [0·88–0·97]). In LUNG SAFE, 90-day mortality was higher in patients assigned the hyperinflammatory subphenotype than in those with the hypoinflammatory phenotype (414 [57%] of 725 vs 694 [33%] of 2088; p<0·0001). There was a significant treatment interaction with PEEP strategy and ARDS subphenotype (p=0·041), with lower 90-day mortality in the high PEEP group of patients with the hyperinflammatory subphenotype (hyperinflammatory subphenotype: 169 [54%] of 313 patients in the high PEEP group vs 127 [62%] of 205 patients in the low PEEP group; hypoinflammatory subphenotype: 231 [34%] of 675 patients in the high PEEP group vs 233 [32%] of 734 patients in the low PEEP group). Interpretation: Classifier models using clinical variables alone can accurately assign ARDS subphenotypes in observational cohorts. Application of these models can provide valuable prognostic information and could inform management strategies for personalised treatment, including application of PEEP, once prospectively validated. Funding: US National Institutes of Health and European Society of Intensive Care Medicine.",
        "DOI": "10.1016/S2213-2600(21)00461-6",
        "paper_author": "Maddali M.V.",
        "affiliation_name": "Stanford University School of Medicine",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60032838",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Demystifying Supervised Learning in Healthcare 4.0: A New Reality of Transforming Diagnostic Medicine",
        "publication": "Diagnostics",
        "citied_by": "96",
        "cover_date": "2022-10-01",
        "Abstract": "The global healthcare sector continues to grow rapidly and is reflected as one of the fastest-growing sectors in the fourth industrial revolution (4.0). The majority of the healthcare industry still uses labor-intensive, time-consuming, and error-prone traditional, manual, and manpower-based methods. This review addresses the current paradigm, the potential for new scientific discoveries, the technological state of preparation, the potential for supervised machine learning (SML) prospects in various healthcare sectors, and ethical issues. The effectiveness and potential for innovation of disease diagnosis, personalized medicine, clinical trials, non-invasive image analysis, drug discovery, patient care services, remote patient monitoring, hospital data, and nanotechnology in various learning-based automation in healthcare along with the requirement for explainable artificial intelligence (AI) in healthcare are evaluated. In order to understand the potential architecture of non-invasive treatment, a thorough study of medical imaging analysis from a technical point of view is presented. This study also represents new thinking and developments that will push the boundaries and increase the opportunity for healthcare through AI and SML in the near future. Nowadays, SML-based applications require a lot of data quality awareness as healthcare is data-heavy, and knowledge management is paramount. Nowadays, SML in biomedical and healthcare developments needs skills, quality data consciousness for data-intensive study, and a knowledge-centric health management system. As a result, the merits, demerits, and precautions need to take ethics and the other effects of AI and SML into consideration. The overall insight in this paper will help researchers in academia and industry to understand and address the future research that needs to be discussed on SML in the healthcare and biomedical sectors.",
        "DOI": "10.3390/diagnostics12102549",
        "paper_author": "Roy S.",
        "affiliation_name": "Jio Institute",
        "affiliation_city": "Navi Mumbai",
        "affiliation_country": "India",
        "affiliation_id": "60272364",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "Graph Convolutional Networks for Drug Response Prediction",
        "publication": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
        "citied_by": "96",
        "cover_date": "2022-01-01",
        "Abstract": "Background: Drug response prediction is an important problem in computational personalized medicine. Many machine-learning-based methods, especially deep learning-based ones, have been proposed for this task. However, these methods often represent the drugs as strings, which are not a natural way to depict molecules. Also, interpretation (e.g., what are the mutation or copy number aberration contributing to the drug response) has not been considered thoroughly. Methods: In this study, we propose a novel method, GraphDRP, based on graph convolutional network for the problem. In GraphDRP, drugs were represented in molecular graphs directly capturing the bonds among atoms, meanwhile cell lines were depicted as binary vectors of genomic aberrations. Representative features of drugs and cell lines were learned by convolution layers, then combined to represent for each drug-cell line pair. Finally, the response value of each drug-cell line pair was predicted by a fully-connected neural network. Four variants of graph convolutional networks were used for learning the features of drugs. Results: We found that GraphDRP outperforms tCNNS in all performance measures for all experiments. Also, through saliency maps of the resulting GraphDRP models, we discovered the contribution of the genomic aberrations to the responses. Conclusion: Representing drugs as graphs can improve the performance of drug response prediction. Availability of data and materials: Data and source code can be downloaded athttps://github.com/hauldhut/GraphDRP.",
        "DOI": "10.1109/TCBB.2021.3060430",
        "paper_author": "Nguyen T.",
        "affiliation_name": "National Economics University Hanoi",
        "affiliation_city": "Hanoi",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60071407",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Integrated multimodal artificial intelligence framework for healthcare applications",
        "publication": "npj Digital Medicine",
        "citied_by": "94",
        "cover_date": "2022-12-01",
        "Abstract": "Artificial intelligence (AI) systems hold great promise to improve healthcare over the next decades. Specifically, AI systems leveraging multiple data sources and input modalities are poised to become a viable method to deliver more accurate results and deployable pipelines across a wide range of applications. In this work, we propose and evaluate a unified Holistic AI in Medicine (HAIM) framework to facilitate the generation and testing of AI systems that leverage multimodal inputs. Our approach uses generalizable data pre-processing and machine learning modeling stages that can be readily adapted for research and deployment in healthcare environments. We evaluate our HAIM framework by training and characterizing 14,324 independent models based on HAIM-MIMIC-MM, a multimodal clinical database (N = 34,537 samples) containing 7279 unique hospitalizations and 6485 patients, spanning all possible input combinations of 4 data modalities (i.e., tabular, time-series, text, and images), 11 unique data sources and 12 predictive tasks. We show that this framework can consistently and robustly produce models that outperform similar single-source approaches across various healthcare demonstrations (by 6–33%), including 10 distinct chest pathology diagnoses, along with length-of-stay and 48 h mortality predictions. We also quantify the contribution of each modality and data source using Shapley values, which demonstrates the heterogeneity in data modality importance and the necessity of multimodal inputs across different healthcare-relevant tasks. The generalizable properties and flexibility of our Holistic AI in Medicine (HAIM) framework could offer a promising pathway for future multimodal predictive systems in clinical and operational healthcare settings.",
        "DOI": "10.1038/s41746-022-00689-4",
        "paper_author": "Soenksen L.R.",
        "affiliation_name": "Massachusetts Institute of Technology",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60022195",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Gut microbiota-derived ursodeoxycholic acid from neonatal dairy calves improves intestinal homeostasis and colitis to attenuate extended-spectrum β-lactamase-producing enteroaggregative Escherichia coli infection",
        "publication": "Microbiome",
        "citied_by": "93",
        "cover_date": "2022-12-01",
        "Abstract": "Background: Antimicrobials are often used to prevent and treat diarrhea induced by enteroaggregative Escherichia coli (EAEC) in young ruminants. However, drug overuse or misuse accelerates the spread of multidrug-resistant extended-spectrum β-lactamase (ESBL)-producing E. coli. Thus, supplementary foods as alternatives to antibiotics are needed to prevent colibacillus diarrhea in neonatal dairy calves. Ursodeoxycholic acid (UDCA), a therapeutic bile acid, helps alleviate colitis. However, how UDCA helps alleviate ESBL-EAEC-induced clinical symptoms and colitis remains unclear. Results: We investigated the microbial profiles and metabolites of healthy and diarrheic neonatal calves to determine microbial and metabolite biomarkers in early-life development. Both the gut microbiota communities and their associated metabolites differed between healthy and diarrheic calves. Commensal Butyricicoccus, Faecalibacterium, Ruminococcus, Collinsella, and Coriobacterium were key microbial markers that distinguished healthy and diarrheic gut microbiomes. Random forest machine-learning algorithm and Spearman correlation results indicated that enriched UDCA, short-chain fatty acids (SCFAs), and other prebiotics were strongly positively correlated with these five bacterial genera. We explored the effect of ursodiol on bacterial growth, cell adherence, and lipopolysaccharide-treated Caco-2 cells. Adding ursodiol induced direct antibacterial effects, suppressed proinflammatory effects, and reduced cell integrity damage. Oral ursodiol delivery to neonatal mice exhibited significant antibacterial effects and helped maintain colonic barrier integrity in mouse models of peritonitis sepsis and oral infection. UDCA supplementation attenuated colitis and recovered colonic SCFA production. To validate this, we performed fecal microbiota transplantations to inoculate ESBL-EAEC-infected neonatal mice. Microbiotas from UDCA-treated neonatal mice ameliorated colitis and hindgut commensal bacterial damage compared with that of the microbiotas from the control and placebo mice, as evidenced by colonization of abundant bacteria, including Oscillospiraceae, Ruminococcaceae, Lachnospiraceae, and Clostridia_UCG-014, and upregulated SCFA production. Conclusions: This study provided the first evidence that UDCA could confer diarrhea resistance in ESBL-EAEC-infected newborn dairy calves. UDCA blocked bacterial growth and invasion both in vitro and in vivo, alleviated commensal bacterial dysbiosis during ESBL-EAEC infection in neonatal mouse models of sepsis and colitis via the TGR5-NF-κB axis, and upregulated SCFA production in the hindgut digesta. Our findings provide insight into the UDCA-mediated remission of ESBL-EAEC infections and the potential role of UDCA as an antibiotic alternative. [MediaObject not available: see fulltext.]",
        "DOI": "10.1186/s40168-022-01269-0",
        "paper_author": "He Z.",
        "affiliation_name": "China Agricultural University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60013551",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Crops yield prediction based on machine learning models: Case of West African countries",
        "publication": "Smart Agricultural Technology",
        "citied_by": "91",
        "cover_date": "2022-12-01",
        "Abstract": "Global agricultural production, in particular, is of increasing concern to the major international organizations in charge of nutrition. The rising demand for food globally due to unprecedented population growth has led to food insecurity in some populated regions such as Africa. Another contributing factor to global food insecurity is climate change and its variability. World and African agricultural production in particular are of increasing concern to the major international organizations in charge of nutrition. The World Food Program has reported that high population growth worldwide, especially in Africa in recent years, is leading to increased food security. Moreover, farmers and agricultural decision-makers need advanced tools to help them make quick decisions that will impact the quality of agricultural yields. Climate change has been a major phenomenon in recent decades all over the world. An impact of climate change has been observed on the quality of agricultural production. The arrival of big data technology has led to new powerful analytical tools like machine learning, which have proven themselves in many areas such as medicine, finance, and biology. In this work, we propose a prediction system based on machine learning to predict the yield of six crops, namely: rice, maize, cassava, seed cotton, yams, and bananas, at the country-level in the area of West African countries throughout the year. We combined climatic data, weather data, agricultural yields, and chemical data to help decision-makers and farmers predict the annual crop yields in their country. We used a decision tree, multivariate logistic regression, and k-nearest neighbor models to build our system. We had promising results with both models when using three machine learning models. We applied a hyper-parameter tuning technique throughout cross-validation to get a better model that does not face overfitting. We found that the decision tree model performs well with a coefficient of determination(R2) of 95.3% while the K-Nearest Neighbor model and logistic regression perform respectively with R2=93.15% and R2=89.78%. We also study the correlation between the predicted results and the expected results. We found that the prediction results of the decision tree model and the K-Nearest Neighbor model are correlated to the expected data, which proves the efficacy of the model.",
        "DOI": "10.1016/j.atech.2022.100049",
        "paper_author": "Cedric L.S.",
        "affiliation_name": "African Institute for Mathematical Sciences",
        "affiliation_city": "Senegal",
        "affiliation_country": "Rwanda",
        "affiliation_id": "130150088",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The promise of the gut microbiome as part of individualized treatment strategies",
        "publication": "Nature Reviews Gastroenterology and Hepatology",
        "citied_by": "89",
        "cover_date": "2022-01-01",
        "Abstract": "Variability in disease presentation, progression and treatment response has been a central challenge in medicine. Although variability in host factors and genetics are important, it has become evident that the gut microbiome, with its vast genetic and metabolic diversity, must be considered in moving towards individualized treatment. In this Review, we discuss six broad disease groups: infectious disease, cancer, metabolic disease, cardiovascular disease, autoimmune or inflammatory disease, and allergic and atopic diseases. We highlight current knowledge on the gut microbiome in disease pathogenesis and prognosis, efficacy, and treatment-related adverse events and its promise for stratifying existing treatments and as a source of novel therapies. The Review is not meant to be comprehensive for each disease state but rather highlights the potential implications of the microbiome as a tool to individualize treatment strategies in clinical practice. Although early, the outlook is optimistic but challenges need to be overcome before clinical implementation, including improved understanding of underlying mechanisms, longitudinal studies with multiple data layers reflecting gut microbiome and host response, standardized approaches to testing and reporting, and validation in larger cohorts. Given progress in the microbiome field with concurrent basic and clinical studies, the microbiome will likely become an integral part of clinical care within the next decade.",
        "DOI": "10.1038/s41575-021-00499-1",
        "paper_author": "Schupack D.A.",
        "affiliation_name": "Mayo Clinic",
        "affiliation_city": "Rochester",
        "affiliation_country": "United States",
        "affiliation_id": "60005558",
        "affiliation_state": "MN"
    },
    {
        "paper_title": "A manifesto on explainability for artificial intelligence in medicine",
        "publication": "Artificial Intelligence in Medicine",
        "citied_by": "88",
        "cover_date": "2022-11-01",
        "Abstract": "The rapid increase of interest in, and use of, artificial intelligence (AI) in computer applications has raised a parallel concern about its ability (or lack thereof) to provide understandable, or explainable, output to users. This concern is especially legitimate in biomedical contexts, where patient safety is of paramount importance. This position paper brings together seven researchers working in the field with different roles and perspectives, to explore in depth the concept of explainable AI, or XAI, offering a functional definition and conceptual framework or model that can be used when considering XAI. This is followed by a series of desiderata for attaining explainability in AI, each of which touches upon a key domain in biomedicine.",
        "DOI": "10.1016/j.artmed.2022.102423",
        "paper_author": "Combi C.",
        "affiliation_name": "Università degli Studi di Verona",
        "affiliation_city": "Verona",
        "affiliation_country": "Italy",
        "affiliation_id": "60032256",
        "affiliation_state": "VR"
    },
    {
        "paper_title": "Multi-Modal Physiological Signals Based Squeeze-and-Excitation Network With Domain Adversarial Learning for Sleep Staging",
        "publication": "IEEE Sensors Journal",
        "citied_by": "88",
        "cover_date": "2022-02-15",
        "Abstract": "Sleep staging is the basis of sleep medicine for diagnosing psychiatric and neurodegenerative diseases. However, the existing sleep staging methods ignore the fact that multi-modal physiological signals are heterogeneous, and different modalities contribute to sleep staging with distinct impacts on specific stages. Therefore, how to model the heterogeneity of multi-modal signals and adaptively utilize the multi-modal signals for sleep staging remains challenging. Moreover, existing methods suffer from the individual variance of physiological signals. How to generalize the sleep staging model for the variance among subjects is also challenging. To address the above challenges, we propose the multi-modal physiological signals based Squeeze-and-Excitation Network with Domain Adversarial Learning (SEN-DAL) to capture the features of electroencephalogram (EEG) and electrooculogram (EOG) for sleep staging. The SEN-DAL is made up of two independent feature extraction networks for modeling the heterogeneity, a Multi-modal Squeeze-and-Excitation feature fusion module for adaptively utilizing the multi-modal signals, and a Domain Adversarial Learning module to extract subject-invariant sleep feature. Experiments demonstrate that the SEN-DAL is superior to the baseline models on a public sleep staging dataset, reaching an F1-Score of 82.1%, which is similar to human experts. Through the ablation experiments, we found that the proposed mechanisms, including modal-independent feature extraction, adaptive utilization of multi-modal signals, and domain adversarial learning, are effective for sleep staging tasks. The code of SEN-DAL is available at https://github.com/xiyangcai/SEN-DAL.",
        "DOI": "10.1109/JSEN.2022.3140383",
        "paper_author": "Jia Z.",
        "affiliation_name": "Beijing Jiaotong University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022381",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Integrated meta-omics reveals new ruminal microbial features associated with feed efficiency in dairy cattle",
        "publication": "Microbiome",
        "citied_by": "87",
        "cover_date": "2022-12-01",
        "Abstract": "Background: As the global population continues to grow, competition for resources between humans and livestock has been intensifying. Increasing milk protein production and improving feed efficiency are becoming increasingly important to meet the demand for high-quality dairy protein. In a previous study, we found that milk protein yield in dairy cows was associated with the rumen microbiome. The objective of this study was to elucidate the potential microbial features that underpins feed efficiency in dairy cows using metagenomics, metatranscriptomics, and metabolomics. Results: Comparison of metagenomic and metatranscriptomic data revealed that the latter was a better approach to uncover the associations between rumen microbial functions and host performance. Co-occurrence network analysis of the rumen microbiome revealed differential microbial interaction patterns between the animals with different feed efficiency, with high-efficiency animals having more and stronger associations than low-efficiency animals. In the rumen of high-efficiency animals, Selenomonas and members of the Succinivibrionaceae family positively interacted with each other, functioning as keystone members due to their essential ecological functions and active carbohydrate metabolic functions. At the metabolic level, analysis using random forest machine learning suggested that six ruminal metabolites (all derived from carbohydrates) could be used as metabolic markers that can potentially differentiate efficient and inefficient microbiomes, with an accuracy of prediction of 95.06%. Conclusions: The results of the current study provided new insights into the new ruminal microbial features associated with feed efficiency in dairy cows, which may improve the ability to select animals for better performance in the dairy industry. The fundamental knowledge will also inform future interventions to improve feed efficiency in dairy cows. [MediaObject not available: see fulltext.].",
        "DOI": "10.1186/s40168-022-01228-9",
        "paper_author": "Xue M.Y.",
        "affiliation_name": "College of Animal Sciences at Zhejiang University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60117777",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Efficient Machine Learning Technique for Tumor Classification Based on Gene Expression Data",
        "publication": "8th International Conference on Advanced Computing and Communication Systems, ICACCS 2022",
        "citied_by": "86",
        "cover_date": "2022-01-01",
        "Abstract": "In bioinformatics research, cancer classification is a crucial domain. The use of microarray technology to identify specific illnesses is common. A small number of genes uncovered in clinical applications can lead to low-cost medicines that can help estimate a patient's survival time or diagnose cancer. Because there are more genes and fewer samples in microarray data, high dimensionality is a serious concern. The genes in the microarray data were evaluated using F-statistics, T-Statistics, and Signal-to-Noise Ratio (SNR) in this study. The top-m rated genes are analyzed using optimization approaches to retrieve useful information. The genetic algorithm (GA), particle swarm optimization (PSO), cuckoo search (CS), and shuffling frog leaping with rapid flying are among the methods employed (SFLLF). Classification is done using the Support vector machine (SVM), the K-Nearest Neighbor classifier (KNN), and the Naive Bayes classifier (NBC). Lung Cancer Michigan, AMLALL, Colon Tumour, Lung Harvard2, and others are among the datasets utilized for experimental analysis. The classifiers are assessed using a 5-fold cross-validation approach. The findings demonstrate that the suggested two-step feature selection approaches are effective in selecting relevant genes from microarray data for cancer classification.",
        "DOI": "10.1109/ICACCS54159.2022.9785294",
        "paper_author": "Venkatesan C.",
        "affiliation_name": "HKBK College of Engineering",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "60283221",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Precision medicine in stroke: Towards personalized outcome predictions using artificial intelligence",
        "publication": "Brain",
        "citied_by": "85",
        "cover_date": "2022-02-01",
        "Abstract": "Stroke ranks among the leading causes for morbidity and mortality worldwide. New and continuously improving treatment options such as thrombolysis and thrombectomy have revolutionized acute stroke treatment in recent years. Following modern rhythms, the next revolution might well be the strategic use of the steadily increasing amounts of patient-related data for generating models enabling individualized outcome predictions. Milestones have already been achieved in several health care domains, as big data and artificial intelligence have entered everyday life. The aim of this review is to synoptically illustrate and discuss how artificial intelligence approaches may help to compute single-patient predictions in stroke outcome research in the acute, subacute and chronic stage. We will present approaches considering demographic, clinical and electrophysiological data, as well as data originating from various imaging modalities and combinations thereof. We will outline their advantages, disadvantages, their potential pitfalls and the promises they hold with a special focus on a clinical audience. Throughout the review we will highlight methodological aspects of novel machine-learning approaches as they are particularly crucial to realize precision medicine. We will finally provide an outlook on how artificial intelligence approaches might contribute to enhancing favourable outcomes after stroke.",
        "DOI": "10.1093/brain/awab439",
        "paper_author": "Bonkhoff A.K.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Dual sensing signal decoupling based on tellurium anisotropy for VR interaction and neuro-reflex system application",
        "publication": "Nature Communications",
        "citied_by": "84",
        "cover_date": "2022-12-01",
        "Abstract": "Anisotropy control of the electronic structure in inorganic semiconductors is an important step in developing devices endowed with multi-function. Here, we demonstrate that the intrinsic anisotropy of tellurium nanowires can be used to modulate the electronic structure and piezoelectric polarization and decouple pressure and temperature difference signals, and realize VR interaction and neuro-reflex applications. The architecture design of the device combined with self-locking effect can eliminate dependence on displacement, enabling a single device to determine the hardness and thermal conductivity of materials through a simple touch. We used a bimodal Te-based sensor to develop a wearable glove for endowing real objects to the virtual world, which greatly improves VR somatosensory feedback. In addition, we successfully achieved stimulus recognition and neural-reflex in a rabbit sciatic nerve model by integrating the sensor signals using a deep learning technique. In view of in-/ex-vivo feasibility, the bimodal Te-based sensor would be considered a novel sensing platform for a wide range application of metaverse, AI robot, and electronic medicine.",
        "DOI": "10.1038/s41467-022-33716-9",
        "paper_author": "Li L.",
        "affiliation_name": "Institute of Semiconductors Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60021170",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Technological Approach to Mind Everywhere: An Experimentally-Grounded Framework for Understanding Diverse Bodies and Minds",
        "publication": "Frontiers in Systems Neuroscience",
        "citied_by": "84",
        "cover_date": "2022-03-24",
        "Abstract": "Synthetic biology and bioengineering provide the opportunity to create novel embodied cognitive systems (otherwise known as minds) in a very wide variety of chimeric architectures combining evolved and designed material and software. These advances are disrupting familiar concepts in the philosophy of mind, and require new ways of thinking about and comparing truly diverse intelligences, whose composition and origin are not like any of the available natural model species. In this Perspective, I introduce TAME—Technological Approach to Mind Everywhere—a framework for understanding and manipulating cognition in unconventional substrates. TAME formalizes a non-binary (continuous), empirically-based approach to strongly embodied agency. TAME provides a natural way to think about animal sentience as an instance of collective intelligence of cell groups, arising from dynamics that manifest in similar ways in numerous other substrates. When applied to regenerating/developmental systems, TAME suggests a perspective on morphogenesis as an example of basal cognition. The deep symmetry between problem-solving in anatomical, physiological, transcriptional, and 3D (traditional behavioral) spaces drives specific hypotheses by which cognitive capacities can increase during evolution. An important medium exploited by evolution for joining active subunits into greater agents is developmental bioelectricity, implemented by pre-neural use of ion channels and gap junctions to scale up cell-level feedback loops into anatomical homeostasis. This architecture of multi-scale competency of biological systems has important implications for plasticity of bodies and minds, greatly potentiating evolvability. Considering classical and recent data from the perspectives of computational science, evolutionary biology, and basal cognition, reveals a rich research program with many implications for cognitive science, evolutionary biology, regenerative medicine, and artificial intelligence.",
        "DOI": "10.3389/fnsys.2022.768201",
        "paper_author": "Levin M.",
        "affiliation_name": "Tufts University",
        "affiliation_city": "Medford",
        "affiliation_country": "United States",
        "affiliation_id": "60023143",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "From promise to practice: towards the realisation of AI-informed mental health care",
        "publication": "The Lancet Digital Health",
        "citied_by": "83",
        "cover_date": "2022-11-01",
        "Abstract": "In this Series paper, we explore the promises and challenges of artificial intelligence (AI)-based precision medicine tools in mental health care from clinical, ethical, and regulatory perspectives. The real-world implementation of these tools is increasingly considered the prime solution for key issues in mental health, such as delayed, inaccurate, and inefficient care delivery. Similarly, machine-learning-based empirical strategies are becoming commonplace in psychiatric research because of their potential to adequately deconstruct the biopsychosocial complexity of mental health disorders, and hence to improve nosology of prognostic and preventive paradigms. However, the implementation steps needed to translate these promises into practice are currently hampered by multiple interacting challenges. These obstructions range from the current technology-distant state of clinical practice, over the lack of valid real-world databases required to feed data-intensive AI algorithms, to model development and validation considerations being disconnected from the core principles of clinical utility and ethical acceptability. In this Series paper, we provide recommendations on how these challenges could be addressed from an interdisciplinary perspective to pave the way towards a framework for mental health care, leveraging the combined strengths of human intelligence and AI.",
        "DOI": "10.1016/S2589-7500(22)00153-4",
        "paper_author": "Koutsouleris N.",
        "affiliation_name": "Klinikum der Universität München",
        "affiliation_city": "Munich",
        "affiliation_country": "Germany",
        "affiliation_id": "60000291",
        "affiliation_state": "Bayern"
    },
    {
        "paper_title": "Radiomics-based Machine-learning Models Can Detect Pancreatic Cancer on Prediagnostic Computed Tomography Scans at a Substantial Lead Time Before Clinical Diagnosis",
        "publication": "Gastroenterology",
        "citied_by": "83",
        "cover_date": "2022-11-01",
        "Abstract": "Background & Aims: Our purpose was to detect pancreatic ductal adenocarcinoma (PDAC) at the prediagnostic stage (3–36 months before clinical diagnosis) using radiomics-based machine-learning (ML) models, and to compare performance against radiologists in a case-control study. Methods: Volumetric pancreas segmentation was performed on prediagnostic computed tomography scans (CTs) (median interval between CT and PDAC diagnosis: 398 days) of 155 patients and an age-matched cohort of 265 subjects with normal pancreas. A total of 88 first-order and gray-level radiomic features were extracted and 34 features were selected through the least absolute shrinkage and selection operator–based feature selection method. The dataset was randomly divided into training (292 CTs: 110 prediagnostic and 182 controls) and test subsets (128 CTs: 45 prediagnostic and 83 controls). Four ML classifiers, k-nearest neighbor (KNN), support vector machine (SVM), random forest (RM), and extreme gradient boosting (XGBoost), were evaluated. Specificity of model with highest accuracy was further validated on an independent internal dataset (n = 176) and the public National Institutes of Health dataset (n = 80). Two radiologists (R4 and R5) independently evaluated the pancreas on a 5-point diagnostic scale. Results: Median (range) time between prediagnostic CTs of the test subset and PDAC diagnosis was 386 (97–1092) days. SVM had the highest sensitivity (mean; 95% confidence interval) (95.5; 85.5–100.0), specificity (90.3; 84.3–91.5), F1-score (89.5; 82.3–91.7), area under the curve (AUC) (0.98; 0.94–0.98), and accuracy (92.2%; 86.7–93.7) for classification of CTs into prediagnostic versus normal. All 3 other ML models, KNN, RF, and XGBoost, had comparable AUCs (0.95, 0.95, and 0.96, respectively). The high specificity of SVM was generalizable to both the independent internal (92.6%) and the National Institutes of Health dataset (96.2%). In contrast, interreader radiologist agreement was only fair (Cohen's kappa 0.3) and their mean AUC (0.66; 0.46–0.86) was lower than each of the 4 ML models (AUCs: 0.95–0.98) (P < .001). Radiologists also recorded false positive indirect findings of PDAC in control subjects (n = 83) (7% R4, 18% R5). Conclusions: Radiomics-based ML models can detect PDAC from normal pancreas when it is beyond human interrogation capability at a substantial lead time before clinical diagnosis. Prospective validation and integration of such models with complementary fluid-based biomarkers has the potential for PDAC detection at a stage when surgical cure is a possibility.",
        "DOI": "10.1053/j.gastro.2022.06.066",
        "paper_author": "Mukherjee S.",
        "affiliation_name": "Mayo Clinic",
        "affiliation_city": "Rochester",
        "affiliation_country": "United States",
        "affiliation_id": "60005558",
        "affiliation_state": "MN"
    },
    {
        "paper_title": "Data Augmentation and Transfer Learning for Brain Tumor Detection in Magnetic Resonance Imaging",
        "publication": "IEEE Access",
        "citied_by": "82",
        "cover_date": "2022-01-01",
        "Abstract": "The exponential growth of deep learning networks has allowed us to tackle complex tasks, even in fields as complicated as medicine. However, using these models requires a large corpus of data for the networks to be highly generalizable and with high performance. In this sense, data augmentation methods are widely used strategies to train networks with small data sets, being vital in medicine due to the limited access to data. A clear example of this is magnetic resonance imaging in pathology scans associated with cancer. In this vein, we compare the effect of several conventional data augmentation schemes on the ResNet50 network for brain tumor detection. In addition, we included our strategy based on principal component analysis. The training was performed with the network trained from zeros and transfer-learning, obtained from the ImageNet dataset. The investigation allowed us to achieve an F1 detection score of 92.34%. The score was achieved with the ResNet50 network through the proposed method and implementing the learning transfer. In addition, it was also concluded that the proposed method is different from the other conventional methods with a significance level of 0.05 through the Kruskal Wallis test statistic.",
        "DOI": "10.1109/ACCESS.2022.3154061",
        "paper_author": "Anaya-Isaza A.",
        "affiliation_name": "Pontificia Universidad Javeriana",
        "affiliation_city": "Bogota",
        "affiliation_country": "Colombia",
        "affiliation_id": "60033545",
        "affiliation_state": "Distrito Capital"
    },
    {
        "paper_title": "Evaluation and Mitigation of Racial Bias in Clinical Machine Learning Models: Scoping Review",
        "publication": "JMIR Medical Informatics",
        "citied_by": "80",
        "cover_date": "2022-05-01",
        "Abstract": "Background: Racial bias is a key concern regarding the development, validation, and implementation of machine learning (ML) models in clinical settings. Despite the potential of bias to propagate health disparities, racial bias in clinical ML has yet to be thoroughly examined and best practices for bias mitigation remain unclear. Objective: Our objective was to perform a scoping review to characterize the methods by which the racial bias of ML has been assessed and describe strategies that may be used to enhance algorithmic fairness in clinical ML. Methods: A scoping review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-analyses (PRISMA) Extension for Scoping Reviews. A literature search using PubMed, Scopus, and Embase databases, as well as Google Scholar, identified 635 records, of which 12 studies were included. Results: Applications of ML were varied and involved diagnosis, outcome prediction, and clinical score prediction performed on data sets including images, diagnostic studies, clinical text, and clinical variables. Of the 12 studies, 1 (8%) described a model in routine clinical use, 2 (17%) examined prospectively validated clinical models, and the remaining 9 (75%) described internally validated models. In addition, 8 (67%) studies concluded that racial bias was present, 2 (17%) concluded that it was not, and 2 (17%) assessed the implementation of bias mitigation strategies without comparison to a baseline model. Fairness metrics used to assess algorithmic racial bias were inconsistent. The most commonly observed metrics were equal opportunity difference (5/12, 42%), accuracy (4/12, 25%), and disparate impact (2/12, 17%). All 8 (67%) studies that implemented methods for mitigation of racial bias successfully increased fairness, as measured by the authors’ chosen metrics. Preprocessing methods of bias mitigation were most commonly used across all studies that implemented them. Conclusions: The broad scope of medical ML applications and potential patient harms demand an increased emphasis on evaluation and mitigation of racial bias in clinical ML. However, the adoption of algorithmic fairness principles in medicine remains inconsistent and is limited by poor data availability and ML model reporting. We recommend that researchers and journal editors emphasize standardized reporting and data availability in medical ML studies to improve transparency and facilitate evaluation for racial bias.",
        "DOI": "10.2196/36388",
        "paper_author": "Huang J.",
        "affiliation_name": "Northwestern University Feinberg School of Medicine",
        "affiliation_city": "Chicago",
        "affiliation_country": "United States",
        "affiliation_id": "60013227",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "Radiomics in prostate cancer: an up-to-date review",
        "publication": "Therapeutic Advances in Urology",
        "citied_by": "79",
        "cover_date": "2022-01-01",
        "Abstract": "Prostate cancer (PCa) is the most common worldwide diagnosed malignancy in male population. The diagnosis, the identification of aggressive disease, and the post-treatment follow-up needs a more comprehensive and holistic approach. Radiomics is the extraction and interpretation of images phenotypes in a quantitative manner. Radiomics may give an advantage through advancements in imaging modalities and through the potential power of artificial intelligence techniques by translating those features into clinical outcome prediction. This article gives an overview on the current evidence of methodology and reviews the available literature on radiomics in PCa patients, highlighting its potential for personalized treatment and future applications.",
        "DOI": "10.1177/17562872221109020",
        "paper_author": "Ferro M.",
        "affiliation_name": "Istituto Europeo di Oncologia",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60030442",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Clinical Applications of Artificial Intelligence—An Updated Overview",
        "publication": "Journal of Clinical Medicine",
        "citied_by": "78",
        "cover_date": "2022-04-01",
        "Abstract": "Artificial intelligence has the potential to revolutionize modern society in all its aspects. Encouraged by the variety and vast amount of data that can be gathered from patients (e.g., medical images, text, and electronic health records), researchers have recently increased their interest in developing AI solutions for clinical care. Moreover, a diverse repertoire of methods can be chosen towards creating performant models for use in medical applications, ranging from disease prediction, diagnosis, and prognosis to opting for the most appropriate treatment for an individual patient. In this respect, the present paper aims to review the advancements reported at the convergence of AI and clinical care. Thus, this work presents AI clinical applications in a comprehensive manner, discussing the recent literature studies classified according to medical specialties. In addition, the challenges and limitations hindering AI integration in the clinical setting are further pointed out.",
        "DOI": "10.3390/jcm11082265",
        "paper_author": "Busnatu Ș.",
        "affiliation_name": "Universitatea de Medicina si Farmacie Carol Davila din Bucuresti",
        "affiliation_city": "Bucharest",
        "affiliation_country": "Romania",
        "affiliation_id": "60033150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Personalized Blood Pressure Estimation Using Photoplethysmography: A Transfer Learning Approach",
        "publication": "IEEE Journal of Biomedical and Health Informatics",
        "citied_by": "77",
        "cover_date": "2022-01-01",
        "Abstract": "In this paper, we present a personalized deep learning approach to estimate blood pressure (BP) using the photoplethysmogram (PPG) signal. We propose a hybrid neural network architecture consisting of convolutional, recurrent, and fully connected layers that operates directly on the raw PPG time series and provides BP estimation every 5 seconds. To address the problem of limited personal PPG and BP data for individuals, we propose a transfer learning technique that personalizes specific layers of a network pre-trained with abundant data from other patients. We use the MIMIC III database which contains PPG and continuous BP data measured invasively via an arterial catheter to develop and analyze our approach. Our transfer learning technique, namely BP-CRNN-Transfer, achieves a mean absolute error (MAE) of 3.52 and 2.20 mmHg for SBP and DBP estimation, respectively, outperforming existing methods. Our approach satisfies both the BHS and AAMI blood pressure measurement standards for SBP and DBP. Moreover, our results demonstrate that as little as 50 data samples per person are required to train accurate personalized models. We carry out Bland-Altman and correlation analysis to compare our method to the invasive arterial catheter, which is the gold-standard BP measurement method.",
        "DOI": "10.1109/JBHI.2021.3085526",
        "paper_author": "Leitner J.",
        "affiliation_name": "Electrical and Computer Engineering Department",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60121655",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Application of photoplethysmography signals for healthcare systems: An in-depth review",
        "publication": "Computer Methods and Programs in Biomedicine",
        "citied_by": "76",
        "cover_date": "2022-04-01",
        "Abstract": "Background and objectives: Photoplethysmography (PPG) is a device that measures the amount of light absorbed by the blood vessel, blood, and tissues, which can, in turn, translate into various measurements such as the variation in blood flow volume, heart rate variability, blood pressure, etc. Hence, PPG signals can produce a wide variety of biological information that can be useful for the detection and diagnosis of various health problems. In this review, we are interested in the possible health disorders that can be detected using PPG signals. Methods: We applied PRISMA guidelines to systematically search various journal databases and identified 43 PPG studies that fit the criteria of this review. Results: Twenty-five health issues were identified from these studies that were classified into six categories: cardiac, blood pressure, sleep health, mental health, diabetes, and miscellaneous. Various routes were employed in these PPG studies to perform the diagnosis: machine learning, deep learning, and statistical routes. The studies were reviewed and summarized. Conclusions: We identified limitations such as poor standardization of sampling frequencies and lack of publicly available PPG databases. We urge that future work should consider creating more publicly available databases so that a wide spectrum of health problems can be covered. We also want to promote the use of PPG signals as a potential precision medicine tool in both ambulatory and hospital settings.",
        "DOI": "10.1016/j.cmpb.2022.106677",
        "paper_author": "Loh H.W.",
        "affiliation_name": "Singapore University of Social Sciences",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60121755",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial Intelligence in the Diagnosis of Oral Diseases: Applications and Pitfalls",
        "publication": "Diagnostics",
        "citied_by": "75",
        "cover_date": "2022-05-01",
        "Abstract": "Background: Machine learning (ML) is a key component of artificial intelligence (AI). The terms machine learning, artificial intelligence, and deep learning are erroneously used interchangeably as they appear as monolithic nebulous entities. This technology offers immense possibilities and opportunities to advance diagnostics in the field of medicine and dentistry. This necessitates a deep understanding of AI and its essential components, such as machine learning (ML), artificial neural networks (ANN), and deep learning (DP). Aim: This review aims to enlighten clinicians regarding AI and its applications in the diagnosis of oral diseases, along with the prospects and challenges involved. Review results: AI has been used in the diagnosis of various oral diseases, such as dental caries, maxillary sinus diseases, periodontal diseases, salivary gland diseases, TMJ disorders, and oral cancer through clinical data and diagnostic images. Larger data sets would enable AI to predict the occurrence of precancerous conditions. They can aid in population-wide surveillance and decide on referrals to specialists. AI can efficiently detect microfeatures beyond the human eye and augment its predictive power in critical diagnosis. Conclusion: Although studies have recognized the benefit of AI, the use of artificial intelligence and machine learning has not been integrated into routine dentistry. AI is still in the research phase. The coming decade will see immense changes in diagnosis and healthcare built on the back of this research. Clinical significance: This paper reviews the various applications of AI in dentistry and illuminates the shortcomings faced while dealing with AI research and suggests ways to tackle them. Overcoming these pitfalls will aid in integrating AI seamlessly into dentistry.",
        "DOI": "10.3390/diagnostics12051029",
        "paper_author": "Patil S.",
        "affiliation_name": "Jazan University",
        "affiliation_city": "Jizan",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60106293",
        "affiliation_state": "Jazan"
    },
    {
        "paper_title": "Transfer learning using freeze features for Alzheimer neurological disorder detection using ADNI dataset",
        "publication": "Multimedia Systems",
        "citied_by": "75",
        "cover_date": "2022-02-01",
        "Abstract": "Machine learning and deep learning play a crucial role in identification of various diseases like neurological, skin, eyes, blood and cancers. The deep learning algorithms can be performed promising for prediction of Alzheimer’s disease using MRI scans. Alzheimer disease becoming more common in the people (age 65 years or above). The disease becomes severe before the symptoms appear and causes brain disorder that cannot be cured by medicines and other therapies and treatments. So the early diagnosis is necessary to slow down its progression. Detection and prevention of Alzheimer disease is one of the active research area for the researchers nowadays. In this paper, we employed architectures of convoutional networks using freeze features extracted from source data set ImageNet for binary and ternary classification. All experiments were carried out using Alzheimer’s disease national initiative (ADNI) data set consisting of MRI scans. The performance of proposed system demonstrates for classification of Alzheimer’s disease versus mild cognitive impairment, normal controls versus mild cognitive impairment, and cognitive normal versus Alzheimer’s disease. The results of proposed study show that VGG architecture outperforms the state-of-the-art techniques and number of architectures of conveNet (AlexNet, GoogLeNet, ResNet, DenseNet, Inceptionv3, InceptionResNet) in Alzheimer’s disease detection, and achieves an identification test set accuracy of 99.27% (MCI/AD), 98.89% (AD/CN) and 97.06% (MCI/CN).",
        "DOI": "10.1007/s00530-021-00797-3",
        "paper_author": "Naz S.",
        "affiliation_name": "Government Postgraduate College",
        "affiliation_city": "Abbottabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "120418773",
        "affiliation_state": "KPK"
    },
    {
        "paper_title": "Role of Artificial Intelligence in Radiogenomics for Cancers in the Era of Precision Medicine",
        "publication": "Cancers",
        "citied_by": "73",
        "cover_date": "2022-06-01",
        "Abstract": "Radiogenomics, a combination of “Radiomics” and “Genomics,” using Artificial Intelligence (AI) has recently emerged as the state-of-the-art science in precision medicine, especially in oncology care. Radiogenomics syndicates large-scale quantifiable data extracted from radiological medical images enveloped with personalized genomic phenotypes. It fabricates a prediction model through various AI methods to stratify the risk of patients, monitor therapeutic approaches, and assess clinical outcomes. It has recently shown tremendous achievements in prognosis, treatment planning, survival prediction, heterogeneity analysis, reoccurrence, and progression-free survival for human cancer study. Although AI has shown immense performance in oncology care in various clinical aspects, it has several challenges and limitations. The proposed review provides an overview of radiogenomics with the viewpoints on the role of AI in terms of its promises for computa-tional as well as oncological aspects and offers achievements and opportunities in the era of precision medicine. The review also presents various recommendations to diminish these obstacles.",
        "DOI": "10.3390/cancers14122860",
        "paper_author": "Saxena S.",
        "affiliation_name": "International Institute of Information Technology, Bhubaneswar",
        "affiliation_city": "Bhubaneswar",
        "affiliation_country": "India",
        "affiliation_id": "60104039",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "Machine learning meets omics: Applications and perspectives",
        "publication": "Briefings in Bioinformatics",
        "citied_by": "73",
        "cover_date": "2022-01-01",
        "Abstract": "The innovation of biotechnologies has allowed the accumulation of omics data at an alarming rate, thus introducing the era of 'big data'. Extracting inherent valuable knowledge from various omics data remains a daunting problem in bioinformatics. Better solutions often need some kind of more innovative methods for efficient handlings and effective results. Recent advancements in integrated analysis and computational modeling of multi-omics data helped address such needs in an increasingly harmonious manner. The development and application of machine learning have largely advanced our insights into biology and biomedicine and greatly promoted the development of therapeutic strategies, especially for precision medicine. Here, we propose a comprehensive survey and discussion on what happened, is happening and will happen when machine learning meets omics. Specifically, we describe how artificial intelligence can be applied to omics studies and review recent advancements at the interface between machine learning and the ever-widest range of omics including genomics, transcriptomics, proteomics, metabolomics, radiomics, as well as those at the single-cell resolution. We also discuss and provide a synthesis of ideas, new insights, current challenges and perspectives of machine learning in omics.",
        "DOI": "10.1093/bib/bbab460",
        "paper_author": "Li R.",
        "affiliation_name": "School of Basic Medical Sciences",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60029003",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Interpretation of radiomics features–A pictorial review",
        "publication": "Computer Methods and Programs in Biomedicine",
        "citied_by": "73",
        "cover_date": "2022-03-01",
        "Abstract": "Radiomics is a newcomer field that has opened new windows for precision medicine. It is related to extraction of a large number of quantitative features from medical images, which may be difficult to detect visually. Underlying tumor biology can change physical properties of tissues, which affect patterns of image pixels and radiomics features. The main advantage of radiomics is that it can characterize the whole tumor non-invasively, even after a single sampling from an image. Therefore, it can be linked to a “digital biopsy”. Physicians need to know about radiomics features to determine how their values correlate with the appearance of lesions and diseases. Indeed, physicians need practical references to conceive of basics and concepts of each radiomics feature without knowing their sophisticated mathematical formulas. In this review, commonly used radiomics features are illustrated with practical examples to help physicians in their routine diagnostic procedures.",
        "DOI": "10.1016/j.cmpb.2021.106609",
        "paper_author": "Abbasian Ardakani A.",
        "affiliation_name": "Shahid Beheshti University of Medical Sciences",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60018934",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Machine learning in pharmacometrics: Opportunities and challenges",
        "publication": "British Journal of Clinical Pharmacology",
        "citied_by": "73",
        "cover_date": "2022-02-01",
        "Abstract": "The explosive growth in medical devices, imaging and diagnostics, computing, and communication and information technologies in drug development and healthcare has created an ever-expanding data landscape that the pharmacometrics (PMX) research community must now traverse. The tools of machine learning (ML) have emerged as a powerful computational approach in other data-rich disciplines but its effective utilization in the pharmaceutical sciences and PMX modelling is in its infancy. ML-based methods can complement PMX modelling by enabling the information in diverse sources of big data, e.g. population-based public databases and disease-specific clinical registries, to be harnessed because they are capable of efficiently identifying salient variables associated with outcomes and delineating their interdependencies. ML algorithms are computationally efficient, have strong predictive capabilities and can enable learning in the big data setting. ML algorithms can be viewed as providing a computational bridge from big data to complement PMX modelling. This review provides an overview of the strengths and weaknesses of ML approaches vis-à-vis population methods, assesses current research into ML applications in the pharmaceutical sciences and provides perspective for potential opportunities and strategies for the successful integration and utilization of ML in PMX.",
        "DOI": "10.1111/bcp.14801",
        "paper_author": "McComb M.",
        "affiliation_name": "University at Buffalo, The State University of New York",
        "affiliation_city": "Buffalo",
        "affiliation_country": "United States",
        "affiliation_id": "60032083",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Algorithmic fairness in computational medicine",
        "publication": "eBioMedicine",
        "citied_by": "72",
        "cover_date": "2022-10-01",
        "Abstract": "Machine learning models are increasingly adopted for facilitating clinical decision-making. However, recent research has shown that machine learning techniques may result in potential biases when making decisions for people in different subgroups, which can lead to detrimental effects on the health and well-being of specific demographic groups such as vulnerable ethnic minorities. This problem, termed algorithmic bias, has been extensively studied in theoretical machine learning recently. However, the impact of algorithmic bias on medicine and methods to mitigate this bias remain topics of active discussion. This paper presents a comprehensive review of algorithmic fairness in the context of computational medicine, which aims at improving medicine with computational approaches. Specifically, we overview the different types of algorithmic bias, fairness quantification metrics, and bias mitigation methods, and summarize popular software libraries and tools for bias evaluation and mitigation, with the goal of providing reference and insights to researchers and practitioners in computational medicine.",
        "DOI": "10.1016/j.ebiom.2022.104250",
        "paper_author": "Xu J.",
        "affiliation_name": "University of Florida",
        "affiliation_city": "Gainesville",
        "affiliation_country": "United States",
        "affiliation_id": "60013959",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "Causal machine learning for healthcare and precision medicine",
        "publication": "Royal Society Open Science",
        "citied_by": "71",
        "cover_date": "2022-08-03",
        "Abstract": "Causal machine learning (CML) has experienced increasing popularity in healthcare. Beyond the inherent capabilities of adding domain knowledge into learning systems, CML provides a complete toolset for investigating how a system would react to an intervention (e.g. outcome given a treatment). Quantifying effects of interventions allows actionable decisions to be made while maintaining robustness in the presence of confounders. Here, we explore how causal inference can be incorporated into different aspects of clinical decision support systems by using recent advances in machine learning. Throughout this paper, we use Alzheimer's disease to create examples for illustrating how CML can be advantageous in clinical scenarios. Furthermore, we discuss important challenges present in healthcare applications such as processing high-dimensional and unstructured data, generalization to out-of-distribution samples and temporal relationships, that despite the great effort from the research community remain to be solved. Finally, we review lines of research within causal representation learning, causal discovery and causal reasoning which offer the potential towards addressing the aforementioned challenges.",
        "DOI": "10.1098/rsos.220638",
        "paper_author": "Sanchez P.",
        "affiliation_name": "The University of Edinburgh",
        "affiliation_city": "Edinburgh",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60027272",
        "affiliation_state": "Scotland"
    },
    {
        "paper_title": "Advancing pharmacy and healthcare with virtual digital technologies",
        "publication": "Advanced Drug Delivery Reviews",
        "citied_by": "71",
        "cover_date": "2022-03-01",
        "Abstract": "Digitalisation of the healthcare sector promises to revolutionise patient healthcare globally. From the different technologies, virtual tools including artificial intelligence, blockchain, virtual, and augmented reality, to name but a few, are providing significant benefits to patients and the pharmaceutical sector alike, ranging from improving access to clinicians and medicines, as well as improving real-time diagnoses and treatments. Indeed, it is envisioned that such technologies will communicate together in real-time, as well as with their physical counterparts, to create a large-scale, cyber healthcare system. Despite the significant benefits that virtual-based digital health technologies can bring to patient care, a number of challenges still remain, ranging from data security to acceptance within the healthcare sector. This review provides a timely account of the benefits and challenges of virtual health interventions, as well an outlook on how such technologies can be transitioned from research-focused towards real-world healthcare and pharmaceutical applications to transform treatment pathways for patients worldwide.",
        "DOI": "10.1016/j.addr.2021.114098",
        "paper_author": "Trenfield S.J.",
        "affiliation_name": "UCL School of Pharmacy",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60016379",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial Intelligence in Cancer Research: Trends, Challenges and Future Directions",
        "publication": "Life",
        "citied_by": "70",
        "cover_date": "2022-12-01",
        "Abstract": "The World Health Organization (WHO), in their 2022 report, identified cancer as one of the leading causes of death, accounting for about 16% of deaths worldwide. The Cancer-Moonshot community aims to reduce the cancer death rate by half in the next 25 years and wants to improve the lives of cancer-affected people. Cancer mortality can be reduced if detected early and treated appropriately. Cancers like breast cancer and cervical cancer have high cure probabilities when treated early in accordance with best practices. Integration of artificial intelligence (AI) into cancer research is currently addressing many of the challenges where medical experts fail to bring cancer to control and cure, and the outcomes are quite encouraging. AI offers many tools and platforms to facilitate more understanding and tackling of this life-threatening disease. AI-based systems can help pathologists in diagnosing cancer more accurately and consistently, reducing the case error rates. Predictive-AI models can estimate the likelihood for a person to get cancer by identifying the risk factors. Big data, together with AI, can enable medical experts to develop customized treatments for cancer patients. The side effects from this kind of customized therapy will be less severe in comparison with the generalized therapies. However, many of these AI tools will remain ineffective in fighting against cancer and saving the lives of millions of patients unless they are accessible and understandable to biologists, oncologists, and other medical cancer researchers. This paper presents the trends, challenges, and future directions of AI in cancer research. We hope that this paper will be of help to both medical experts and technical experts in getting a better understanding of the challenges and research opportunities in cancer diagnosis and treatment.",
        "DOI": "10.3390/life12121991",
        "paper_author": "Sebastian A.M.",
        "affiliation_name": "Cochin University of Science and Technology",
        "affiliation_city": "Kochi",
        "affiliation_country": "India",
        "affiliation_id": "60031544",
        "affiliation_state": "KL"
    },
    {
        "paper_title": "Osteoarthritis endotype discovery via clustering of biochemical marker data",
        "publication": "Annals of the Rheumatic Diseases",
        "citied_by": "70",
        "cover_date": "2022-05-01",
        "Abstract": "Objectives Osteoarthritis (OA) patient stratification is an important challenge to design tailored treatments and drive drug development. Biochemical markers reflecting joint tissue turnover were measured in the IMI-APPROACH cohort at baseline and analysed using a machine learning approach in order to study OA-dominant phenotypes driven by the endotype-related clusters and discover the driving features and their disease-context meaning. Method Data quality assessment was performed to design appropriate data preprocessing techniques. The k-means clustering algorithm was used to find dominant subgroups of patients based on the biochemical markers data. Classification models were trained to predict cluster membership, and Explainable AI techniques were used to interpret these to reveal the driving factors behind each cluster and identify phenotypes. Statistical analysis was performed to compare differences between clusters with respect to other markers in the IMI-APPROACH cohort and the longitudinal disease progression. Results Three dominant endotypes were found, associated with three phenotypes: C1) low tissue turnover (low repair and articular cartilage/subchondral bone turnover), C2) structural damage (high bone formation/resorption, cartilage degradation) and C3) systemic inflammation (joint tissue degradation, inflammation, cartilage degradation). The method achieved consistent results in the FNIH/OAI cohort. C1 had the highest proportion of non-progressors. C2 was mostly linked to longitudinal structural progression, and C3 was linked to sustained or progressive pain. Conclusions This work supports the existence of differential phenotypes in OA. The biomarker approach could potentially drive stratification for OA clinical trials and contribute to precision medicine strategies for OA progression in the future. Trial registration number NCT03883568.",
        "DOI": "10.1136/annrheumdis-2021-221763",
        "paper_author": "Angelini F.",
        "affiliation_name": "Newcastle University",
        "affiliation_city": "Newcastle",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60006222",
        "affiliation_state": "Tyne and Wear"
    },
    {
        "paper_title": "Developing, implementing and governing artificial intelligence in medicine: a step-by-step approach to prevent an artificial intelligence winter",
        "publication": "BMJ Health and Care Informatics",
        "citied_by": "70",
        "cover_date": "2022-02-19",
        "Abstract": "Objective Although the role of artificial intelligence (AI) in medicine is increasingly studied, most patients do not benefit because the majority of AI models remain in the testing and prototyping environment. The development and implementation trajectory of clinical AI models are complex and a structured overview is missing. We therefore propose a step-by-step overview to enhance clinicians' understanding and to promote quality of medical AI research. Methods We summarised key elements (such as current guidelines, challenges, regulatory documents and good practices) that are needed to develop and safely implement AI in medicine. Conclusion This overview complements other frameworks in a way that it is accessible to stakeholders without prior AI knowledge and as such provides a step-by-step approach incorporating all the key elements and current guidelines that are essential for implementation, and can thereby help to move AI from bytes to bedside.",
        "DOI": "10.1136/bmjhci-2021-100495",
        "paper_author": "Van De Sande D.",
        "affiliation_name": "Erasmus MC",
        "affiliation_city": "Rotterdam",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60032114",
        "affiliation_state": "Zuid-Holland"
    },
    {
        "paper_title": "Use of Multi-Modal Data and Machine Learning to Improve Cardiovascular Disease Care",
        "publication": "Frontiers in Cardiovascular Medicine",
        "citied_by": "68",
        "cover_date": "2022-04-27",
        "Abstract": "Today's digital health revolution aims to improve the efficiency of healthcare delivery and make care more personalized and timely. Sources of data for digital health tools include multiple modalities such as electronic medical records (EMR), radiology images, and genetic repositories, to name a few. While historically, these data were utilized in silos, new machine learning (ML) and deep learning (DL) technologies enable the integration of these data sources to produce multi-modal insights. Data fusion, which integrates data from multiple modalities using ML and DL techniques, has been of growing interest in its application to medicine. In this paper, we review the state-of-the-art research that focuses on how the latest techniques in data fusion are providing scientific and clinical insights specific to the field of cardiovascular medicine. With these new data fusion capabilities, clinicians and researchers alike will advance the diagnosis and treatment of cardiovascular diseases (CVD) to deliver more timely, accurate, and precise patient care.",
        "DOI": "10.3389/fcvm.2022.840262",
        "paper_author": "Amal S.",
        "affiliation_name": "Stanford University School of Medicine",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60032838",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "A Novel Machine-Learning-Based Hybrid CNN Model for Tumor Identification in Medical Image Processing",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "68",
        "cover_date": "2022-02-01",
        "Abstract": "The popularization of electronic clinical medical records makes it possible to use automated methods to extract high-value information from medical records quickly. As essential medical information, oncology medical events are composed of attributes that describe malignant tumors. In recent years, oncology medicine event extraction has become a research hotspot in academia. Many academic conferences publish it as an evaluation task and provide a series of high-quality annotation data. This article aims at the characteristics of discrete attributes of tumor-related medical events and proposes a medical event. The standard extraction method realizes the combined extraction of the primary tumor site and primary tumor size characteristics, as well as the extraction of tumor metastasis sites. In addition, given the problems of the small number and types of annotation texts for tumor-related medical events, a key-based approach is proposed. A pseudo-data-generation algorithm that randomly replaces information in the whole domain improves the transfer learning ability of the standard extraction method for different types of tumor-related medical event extractions. The proposed method won third place in the clinical medical event extraction and evaluation task of the CCKS2020 electronic medical record. A large number of experiments on the CCKS2020 dataset verify the effectiveness of the proposed method.",
        "DOI": "10.3390/su14031447",
        "paper_author": "Dhiman G.",
        "affiliation_name": "Government Bikram College of Commerce",
        "affiliation_city": "Patiala",
        "affiliation_country": "India",
        "affiliation_id": "60276078",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Multi-modality machine learning predicting Parkinson’s disease",
        "publication": "npj Parkinson's Disease",
        "citied_by": "67",
        "cover_date": "2022-12-01",
        "Abstract": "Personalized medicine promises individualized disease prediction and treatment. The convergence of machine learning (ML) and available multimodal data is key moving forward. We build upon previous work to deliver multimodal predictions of Parkinson’s disease (PD) risk and systematically develop a model using GenoML, an automated ML package, to make improved multi-omic predictions of PD, validated in an external cohort. We investigated top features, constructed hypothesis-free disease-relevant networks, and investigated drug–gene interactions. We performed automated ML on multimodal data from the Parkinson’s progression marker initiative (PPMI). After selecting the best performing algorithm, all PPMI data was used to tune the selected model. The model was validated in the Parkinson’s Disease Biomarker Program (PDBP) dataset. Our initial model showed an area under the curve (AUC) of 89.72% for the diagnosis of PD. The tuned model was then tested for validation on external data (PDBP, AUC 85.03%). Optimizing thresholds for classification increased the diagnosis prediction accuracy and other metrics. Finally, networks were built to identify gene communities specific to PD. Combining data modalities outperforms the single biomarker paradigm. UPSIT and PRS contributed most to the predictive power of the model, but the accuracy of these are supplemented by many smaller effect transcripts and risk SNPs. Our model is best suited to identifying large groups of individuals to monitor within a health registry or biobank to prioritize for further testing. This approach allows complex predictive models to be reproducible and accessible to the community, with the package, code, and results publicly available.",
        "DOI": "10.1038/s41531-022-00288-w",
        "paper_author": "Makarious M.B.",
        "affiliation_name": "National Institute on Aging (NIA)",
        "affiliation_city": "Bethesda",
        "affiliation_country": "United States",
        "affiliation_id": "60017252",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "Cross-ethnicity/race generalization failure of behavioral prediction from resting-state functional connectivity",
        "publication": "Science Advances",
        "citied_by": "67",
        "cover_date": "2022-03-01",
        "Abstract": "Algorithmic biases that favor majority populations pose a key challenge to the application of machine learning for precision medicine. Here, we assessed such bias in prediction models of behavioral phenotypes from brain functional magnetic resonance imaging. We examined the prediction bias using two independent datasets (preadolescent versus adult) of mixed ethnic/racial composition. When predictive models were trained on data dominated by white Americans (WA), out-of-sample prediction errors were generally higher for African Americans (AA) than for WA. This bias toward WA corresponds to more WA-like brain-behavior association patterns learned by the models. When models were trained on AA only, compared to training only on WA or an equal number of AA and WA participants, AA prediction accuracy improved but stayed below that for WA. Overall, the results point to the need for caution and further research regarding the application of current brain-behavior prediction models in minority populations.",
        "DOI": "10.1126/sciadv.abj1812",
        "paper_author": "Li J.",
        "affiliation_name": "Forschungszentrum Jülich GmbH",
        "affiliation_city": "Julich",
        "affiliation_country": "Germany",
        "affiliation_id": "60007774",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Reliable and Resilient AI and IoT-Based Personalised Healthcare Services: A Survey",
        "publication": "IEEE Access",
        "citied_by": "67",
        "cover_date": "2022-01-01",
        "Abstract": "Recent technological (e.g., IoT, 5G), and economic (e.g., UN 2030 Sustainable Development Goals) developments have transformed the healthcare sector towards more personalized and IoT-based healthcare services. These services are realized through control and monitoring applications that are typically developed using artificial intelligence (AI)/machine learning (ML) based algorithms, that play a significant role to highlight the efficiency of traditional healthcare systems. Current personalized healthcare services are dedicated in a specific environment to support technological personalization (e.g., personalized gadgets/devices). However, they are unable to consider different inter-related health conditions, leading to inappropriate diagnosis and affect sustainability and the long-term health/life of patients. Towards this problem, the state-of-the-art Healthcare 5.0 technology has evolved that supersede previous healthcare technologies. The goal of healthcare 5.0 is to achieve a fully autonomous healthcare service, that takes into account the interdependent effect of different health conditions of a patient. This paper conducts a comprehensive survey on personalized healthcare services. In particular, we first present an overview of key requirements of comprehensive personalized healthcare services (CPHS) in modern healthcare Internet of Things (HIoT), including the definition of personalization and an example use case scenario as a representative for modern HIoT. Second, we explored a fundamental three-layer architecture for IoT-based healthcare systems using both AI and non-AI-based approaches, considering key requirements for CPHS followed by their strengths and weaknesses in the frame of personalized healthcare services. Third, we highlighted different security threats against each layer of IoT architecture along with the possible AI and non-AI-based solutions. Finally, we propose a methodology to develop reliable, resilient, and personalized healthcare services that address the identified weaknesses of existing approaches.",
        "DOI": "10.1109/ACCESS.2021.3137364",
        "paper_author": "Taimoor N.",
        "affiliation_name": "Technische Universität Wien",
        "affiliation_city": "Vienna",
        "affiliation_country": "Austria",
        "affiliation_id": "60018163",
        "affiliation_state": "Vienna"
    },
    {
        "paper_title": "Mitigating Bias in Radiology Machine Learning: 1. Data Handling",
        "publication": "Radiology: Artificial Intelligence",
        "citied_by": "66",
        "cover_date": "2022-09-01",
        "Abstract": "Minimizing bias is critical to adoption and implementation of machine learning (ML) in clinical practice. Systematic mathematical biases produce consistent and reproducible differences between the observed and expected performance of ML systems, resulting in suboptimal performance. Such biases can be traced back to various phases of ML development: data handling, model development, and performance evaluation. This report presents 12 suboptimal practices during data handling of an ML study, explains how those practices can lead to biases, and describes what may be done to mitigate them. Authors employ an arbitrary and simplified framework that splits ML data handling into four steps: data collection, data investigation, data splitting, and feature engineering. Examples from the available research literature are provided. A Google Colaboratory Jupyter notebook includes code examples to demonstrate the sub-optimal practices and steps to prevent them.",
        "DOI": "10.1148/ryai.210290",
        "paper_author": "Rouzrokh P.",
        "affiliation_name": "Mayo Clinic",
        "affiliation_city": "Rochester",
        "affiliation_country": "United States",
        "affiliation_id": "60005558",
        "affiliation_state": "MN"
    },
    {
        "paper_title": "Integrated Urinalysis Devices Based on Interface-Engineered Field-Effect Transistor Biosensors Incorporated With Electronic Circuits",
        "publication": "Advanced Materials",
        "citied_by": "66",
        "cover_date": "2022-09-01",
        "Abstract": "Urinalysis is attractive in non-invasive early diagnosis of bladder cancer compared with clinical gold standard cystoscopy. However, the trace bladder tumor biomarkers in urine and the particularly complex urine environment pose significant challenges for urinalysis. Here, a clinically adoptable urinalysis device that integrates molecular-specificity indium gallium zinc oxide field-effect transistor (IGZO FET) biosensor arrays, a device control panel, and an internet terminal for directly analyzing five bladder-tumor-associated proteins in clinical urine samples, is reported for bladder cancer diagnosis and classification. The IGZO FET biosensors with engineered sensing interfaces provide high sensitivity and selectivity for identification of trace proteins in the complex urine environment. Integrating with a machine-learning algorithm, this device can identify bladder cancer with an accuracy of 95.0% in a cohort of 197 patients and 75 non-bladder cancer individuals, distinguishing cancer stages with an overall accuracy of 90.0% and assessing bladder cancer recurrence after surgical treatment. The non-invasive urinalysis device defines a robust technology for remote healthcare and personalized medicine.",
        "DOI": "10.1002/adma.202203224",
        "paper_author": "Yang Y.",
        "affiliation_name": "Renmin Hospital of Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60080982",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Biomaterialomics: Data science-driven pathways to develop fourth-generation biomaterials",
        "publication": "Acta Biomaterialia",
        "citied_by": "65",
        "cover_date": "2022-04-15",
        "Abstract": "Conventional approaches to developing biomaterials and implants require intuitive tailoring of manufacturing protocols and biocompatibility assessment. This leads to longer development cycles, and high costs. To meet existing and unmet clinical needs, it is critical to accelerate the production of implantable biomaterials, implants and biomedical devices. Building on the Materials Genome Initiative, we define the concept ‘biomaterialomics’ as the integration of multi-omics data and high-dimensional analysis with artificial intelligence (AI) tools throughout the entire pipeline of biomaterials development. The Data Science-driven approach is envisioned to bring together on a single platform, the computational tools, databases, experimental methods, machine learning, and advanced manufacturing (e.g., 3D printing) to develop the fourth-generation biomaterials and implants, whose clinical performance will be predicted using ‘digital twins’. While analysing the key elements of the concept of ‘biomaterialomics’, significant emphasis has been put forward to effectively utilize high-throughput biocompatibility data together with multiscale physics-based models, E-platform/online databases of clinical studies, data science approaches, including metadata management, AI/ Machine Learning (ML) algorithms and uncertainty predictions. Such integrated formulation will allow one to adopt cross-disciplinary approaches to establish processing-structure-property (PSP) linkages. A few published studies from the lead author's research group serve as representative examples to illustrate the formulation and relevance of the ‘Biomaterialomics’ approaches for three emerging research themes, i.e. patient-specific implants, additive manufacturing, and bioelectronic medicine. The increased adaptability of AI/ML tools in biomaterials science along with the training of the next generation researchers in data science are strongly recommended. Statement of significance: This leading opinion review paper emphasizes the need to integrate the concepts and algorithms of the data science with biomaterials science. Also, this paper emphasizes the need to establish a mathematically rigorous cross-disciplinary framework that will allow a systematic quantitative exploration and curation of critical biomaterials knowledge needed to drive objectively the innovation efforts within a suitable uncertainty quantification framework, as embodied in ‘biomaterialomics’ concept, which integrates multi-omics data and high-dimensional analysis with artificial intelligence (AI) tools, like machine learning. The formulation of this approach has been demonstrated for patient-specific implants, additive manufacturing, and bioelectronic medicine.",
        "DOI": "10.1016/j.actbio.2022.02.027",
        "paper_author": "Basu B.",
        "affiliation_name": "Indian Institute of Science",
        "affiliation_city": "Bengaluru",
        "affiliation_country": "India",
        "affiliation_id": "60014097",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Knowledge, attitude, and practice of artificial intelligence among doctors and medical students in Pakistan: A cross-sectional online survey",
        "publication": "Annals of Medicine and Surgery",
        "citied_by": "65",
        "cover_date": "2022-04-01",
        "Abstract": "Background: The use of Artificial intelligence (AI) has gained popularity during the last few decades and its use in medicine is increasing globally. Developing countries like Pakistan are lagging in the implementation of AI-based solutions in healthcare. There is a need to incorporate AI in the health system which may help not only in expediting diagnosis and management but also injudicious resource allocation. Objective: To determine the knowledge, attitude, and practice of AI among doctors and medical students in Pakistan. Materials and methods: We conducted a cross-sectional study using an online questionnaire-based survey regarding demographic details, knowledge, perception, and practice of AI. A sample of 470 individuals including doctors and medical students were selected using the convenient sampling technique. The chi-square test was applied for the comparison of variables. Results: Out of 470 individuals, 223(47.45%) were doctors and 247(52.55%) were medical students. Among these, 165(74%) doctors and 170(68.8%) medical students had a basic knowledge of AI but only 61(27.3%) doctors and 48(19.4%) students were aware of its medical applications. Regarding attitude, 237(76.7%) individuals supported AI's inclusion in curriculum, 368(78.3%) and 305(64.9%), 281(59.8%) and 269(57.2%) acknowledged its necessity in radiology, pathology, and COVID-19 pandemic respectively. Conclusion: The majority of doctors and medical students lack knowledge about AI and its applications, but had a positive view of AI in the field of medicine and were willing to adopt it.",
        "DOI": "10.1016/j.amsu.2022.103493",
        "paper_author": "Ahmed Z.",
        "affiliation_name": "Lahore General Hospital",
        "affiliation_city": "Lahore",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60274239",
        "affiliation_state": "Punjab"
    },
    {
        "paper_title": "Using artificial intelligence methods for systematic review in health sciences: A systematic review",
        "publication": "Research Synthesis Methods",
        "citied_by": "65",
        "cover_date": "2022-05-01",
        "Abstract": "The exponential increase in published articles makes a thorough and expedient review of literature increasingly challenging. This review delineated automated tools and platforms that employ artificial intelligence (AI) approaches and evaluated the reported benefits and challenges in using such methods. A search was conducted in 4 databases (Medline, Embase, CDSR, and Epistemonikos) up to April 2021 for systematic reviews and other related reviews implementing AI methods. To be included, the review must use any form of AI method, including machine learning, deep learning, neural network, or any other applications used to enable the full or semi-autonomous performance of one or more stages in the development of evidence synthesis. Twelve reviews were included, using nine different tools to implement 15 different AI methods. Eleven methods were used in the screening stages of the review (73%). The rest were divided: two in data extraction (13%) and two in risk of bias assessment (13%). The ambiguous benefits of the data extractions, combined with the reported advantages from 10 reviews, indicating that AI platforms have taken hold with varying success in evidence synthesis. However, the results are qualified by the reliance on the self-reporting of the review authors. Extensive human validation still appears required at this stage in implementing AI methods, though further evaluation is required to define the overall contribution of such platforms in enhancing efficiency and quality in evidence synthesis.",
        "DOI": "10.1002/jrsm.1553",
        "paper_author": "Blaizot A.",
        "affiliation_name": "University of Utah Health",
        "affiliation_city": "Salt Lake City",
        "affiliation_country": "United States",
        "affiliation_id": "60012445",
        "affiliation_state": "UT"
    },
    {
        "paper_title": "Sepsis biomarkers and diagnostic tools with a focus on machine learning",
        "publication": "eBioMedicine",
        "citied_by": "64",
        "cover_date": "2022-12-01",
        "Abstract": "Over the last years, there have been advances in the use of data-driven techniques to improve the definition, early recognition, subtypes characterisation, prognostication and treatment personalisation of sepsis. Some of those involve the discovery or evaluation of biomarkers or digital signatures of sepsis or sepsis sub-phenotypes. It is hoped that their identification may improve timeliness and accuracy of diagnosis, suggest physiological pathways and therapeutic targets, inform targeted recruitment into clinical trials, and optimise clinical management. Given the complexities of the sepsis response, panels of biomarkers or models combining biomarkers and clinical data are necessary, as well as specific data analysis methods, which broadly fall under the scope of machine learning. This narrative review gives a brief overview of the main machine learning techniques (mainly in the realms of supervised and unsupervised methods) and published applications that have been used to create sepsis diagnostic tools and identify biomarkers.",
        "DOI": "10.1016/j.ebiom.2022.104394",
        "paper_author": "Komorowski M.",
        "affiliation_name": "Imperial College Faculty of Medicine",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020413",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Topological data analysis in biomedicine: A review",
        "publication": "Journal of Biomedical Informatics",
        "citied_by": "64",
        "cover_date": "2022-06-01",
        "Abstract": "Significant technological advances made in recent years have shepherded a dramatic increase in utilization of digital technologies for biomedicine– everything from the widespread use of electronic health records to improved medical imaging capabilities and the rising ubiquity of genomic sequencing contribute to a “digitization” of biomedical research and clinical care. With this shift toward computerized tools comes a dramatic increase in the amount of available data, and current tools for data analysis capable of extracting meaningful knowledge from this wealth of information have yet to catch up. This article seeks to provide an overview of emerging mathematical methods with the potential to improve the abilities of clinicians and researchers to analyze biomedical data, but may be hindered from doing so by a lack of conceptual accessibility and awareness in the life sciences research community. In particular, we focus on topological data analysis (TDA), a set of methods grounded in the mathematical field of algebraic topology that seeks to describe and harness features related to the “shape” of data. We aim to make such techniques more approachable to non-mathematicians by providing a conceptual discussion of their theoretical foundations followed by a survey of their published applications to scientific research. Finally, we discuss the limitations of these methods and suggest potential avenues for future work integrating mathematical tools into clinical care and biomedical informatics.",
        "DOI": "10.1016/j.jbi.2022.104082",
        "paper_author": "Skaf Y.",
        "affiliation_name": "University of Florida",
        "affiliation_city": "Gainesville",
        "affiliation_country": "United States",
        "affiliation_id": "60013959",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "Cloud-Based Lung Tumor Detection and Stage Classification Using Deep Learning Techniques",
        "publication": "BioMed Research International",
        "citied_by": "64",
        "cover_date": "2022-01-01",
        "Abstract": "Artificial intelligence (AI), Internet of Things (IoT), and the cloud computing have recently become widely used in the healthcare sector, which aid in better decision-making for a radiologist. PET imaging or positron emission tomography is one of the most reliable approaches for a radiologist to diagnosing many cancers, including lung tumor. In this work, we proposed stage classification of lung tumor which is a more challenging task in computer-Aided diagnosis. As a result, a modified computer-Aided diagnosis is being considered as a way to reduce the heavy workloads and second opinion to radiologists. In this paper, we present a strategy for classifying and validating different stages of lung tumor progression, as well as a deep neural model and data collection using cloud system for categorizing phases of pulmonary illness. The proposed system presents a Cloud-based Lung Tumor Detector and Stage Classifier (Cloud-LTDSC) as a hybrid technique for PET/CT images. The proposed Cloud-LTDSC initially developed the active contour model as lung tumor segmentation, and multilayer convolutional neural network (M-CNN) for classifying different stages of lung cancer has been modelled and validated with standard benchmark images. The performance of the presented technique is evaluated using a benchmark image LIDC-IDRI dataset of 50 low doses and also utilized the lung CT DICOM images. Compared with existing techniques in the literature, our proposed method achieved good result for the performance metrics accuracy, recall, and precision evaluated. Under numerous aspects, our proposed approach produces superior outcomes on all of the applied dataset images. Furthermore, the experimental result achieves an average lung tumor stage classification accuracy of 97%-99.1% and an average of 98.6% which is significantly higher than the other existing techniques.",
        "DOI": "10.1155/2022/4185835",
        "paper_author": "Kasinathan G.",
        "affiliation_name": "SRM Institute of Science and Technology",
        "affiliation_city": "Kattankulathur",
        "affiliation_country": "India",
        "affiliation_id": "60014340",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Understanding Bacteriophage Tail Fiber Interaction with Host Surface Receptor: The Key “Blueprint” for Reprogramming Phage Host Range",
        "publication": "International Journal of Molecular Sciences",
        "citied_by": "63",
        "cover_date": "2022-10-01",
        "Abstract": "Bacteriophages (phages), as natural antibacterial agents, are being rediscovered because of the growing threat of multi- and pan-drug-resistant bacterial pathogens globally. However, with an estimated 1031 phages on the planet, finding the right phage to recognize a specific bacterial host is like looking for a needle in a trillion haystacks. The host range of a phage is primarily determined by phage tail fibers (or spikes), which initially mediate reversible and specific recognition and adsorption by susceptible bacteria. Recent significant advances at single-molecule and atomic levels have begun to unravel the structural organization of tail fibers and underlying mechanisms of phage–host interactions. Here, we discuss the molecular mechanisms and models of the tail fibers of the well-characterized T4 phage’s interaction with host surface receptors. Structure–function knowledge of tail fibers will pave the way for reprogramming phage host range and will bring future benefits through more-effective phage therapy in medicine. Furthermore, the design strategies of tail fiber engineering are briefly summarized, including machine-learning-assisted engineering inspired by the increasingly enormous amount of phage genetic information.",
        "DOI": "10.3390/ijms232012146",
        "paper_author": "Taslem Mourosi J.",
        "affiliation_name": "The Catholic University of America",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60020444",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Advances in Electrochemical Nano-Biosensors for Biomedical and Environmental Applications: From Current Work to Future Perspectives",
        "publication": "Sensors",
        "citied_by": "63",
        "cover_date": "2022-10-01",
        "Abstract": "Modern life quality is strongly supported by the advances made in biosensors, which has been attributed to their crucial and viable contribution in point-of-care (POC) technology developments. POC devices are exploited for the fast tracing of disease progression, rapid analysis of water, and food quality assessment. Blood glucose meters, home pregnancy strips, and COVID-19 rapid tests all represent common examples of successful biosensors. Biosensors can provide great specificity due to the incorporation of selective bio-recognition elements and portability at significantly reduced costs. Electrochemical biosensor platforms are one of the most advantageous of these platforms because they offer many merits, such as being cheap, selective, specific, rapid, and portable. Furthermore, they can be incorporated into smartphones and various analytical approaches in order to increase their sensitivity and many other properties. As a very broad and interdisciplinary area of research and development, biosensors include all disciplines and backgrounds from materials science, chemistry, physics, medicine, microbiology/biology, and engineering. Accordingly, in this state-of-the-art article, historical background alongside the long journey of biosensing construction and development, starting from the Clark oxygen electrode until reaching highly advanced wearable stretchable biosensing devices, are discussed. Consequently, selected examples among the miscellaneous applications of nanobiosensors (such as microbial detection, cancer diagnosis, toxicity analysis, food quality-control assurance, point of care, and health prognosis) are described. Eventually, future perspectives for intelligent biosensor commercialization and exploitation in real-life that is going to be supported by machine learning and artificial intelligence (AI) are stated.",
        "DOI": "10.3390/s22197539",
        "paper_author": "Hassan R.Y.A.",
        "affiliation_name": "National Research Centre",
        "affiliation_city": "Giza",
        "affiliation_country": "Egypt",
        "affiliation_id": "60014618",
        "affiliation_state": "Giza"
    },
    {
        "paper_title": "Artificial intelligence and machine learning in precision medicine: A paradigm shift in big data analysis",
        "publication": "Progress in Molecular Biology and Translational Science",
        "citied_by": "63",
        "cover_date": "2022-01-01",
        "Abstract": "The integration of artificial intelligence in precision medicine has revolutionized healthcare delivery. Precision medicine identifies the phenotype of particular patients with less-common responses to treatment. Recent studies have demonstrated that translational research exploring the convergence between artificial intelligence and precision medicine will help solve the most difficult challenges facing precision medicine. Here, we discuss different aspects of artificial intelligence in precision medicine that improve healthcare delivery. First, we discuss how artificial intelligence changes the landscape of precision medicine and the evolution of artificial intelligence in precision medicine. Second, we highlight the synergies between artificial intelligence and precision medicine and promises of artificial intelligence and precision medicine in healthcare delivery. Third, we briefly explain the promise of big data analytics and the integration of nanomaterials in precision medicine. Last, we highlight the challenges and opportunities of artificial intelligence in precision medicine.",
        "DOI": "10.1016/bs.pmbts.2022.03.002",
        "paper_author": "Sahu M.",
        "affiliation_name": "Delhi Technological University",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60002874",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Genome-scale metabolic modeling enables in-depth understanding of big data",
        "publication": "Metabolites",
        "citied_by": "63",
        "cover_date": "2022-01-01",
        "Abstract": "Genome-scale metabolic models (GEMs) enable the mathematical simulation of the metabolism of archaea, bacteria, and eukaryotic organisms. GEMs quantitatively define a relationship between genotype and phenotype by contextualizing different types of Big Data (e.g., genomics, metabolomics, and transcriptomics). In this review, we analyze the available Big Data useful for metabolic modeling and compile the available GEM reconstruction tools that integrate Big Data. We also discuss recent applications in industry and research that include predicting phenotypes, elucidating metabolic pathways, producing industry-relevant chemicals, identifying drug targets, and generating knowledge to better understand host-associated diseases. In addition to the up-to-date review of GEMs currently available, we assessed a plethora of tools for developing new GEMs that include macromolecular expression and dynamic resolution. Finally, we provide a perspective in emerging areas, such as annotation, data managing, and machine learning, in which GEMs will play a key role in the further utilization of Big Data.",
        "DOI": "10.3390/metabo12010014",
        "paper_author": "Passi A.",
        "affiliation_name": "University of California, San Diego",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60030612",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Impact of feature harmonization on radiogenomics analysis: Prediction of EGFR and KRAS mutations from non-small cell lung cancer PET/CT images",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "62",
        "cover_date": "2022-03-01",
        "Abstract": "Objective: To investigate the impact of harmonization on the performance of CT, PET, and fused PET/CT radiomic features toward the prediction of mutations status, for epidermal growth factor receptor (EGFR) and Kirsten rat sarcoma viral oncogene (KRAS) genes in non-small cell lung cancer (NSCLC) patients. Methods: Radiomic features were extracted from tumors delineated on CT, PET, and wavelet fused PET/CT images obtained from 136 histologically proven NSCLC patients. Univariate and multivariate predictive models were developed using radiomic features before and after ComBat harmonization to predict EGFR and KRAS mutation statuses. Multivariate models were built using minimum redundancy maximum relevance feature selection and random forest classifier. We utilized 70/30% splitting patient datasets for training/testing, respectively, and repeated the procedure 10 times. The area under the receiver operator characteristic curve (AUC), accuracy, sensitivity, and specificity were used to assess model performance. The performance of the models (univariate and multivariate), before and after ComBat harmonization was compared using statistical analyses. Results: While the performance of most features in univariate modeling was significantly improved for EGFR prediction, most features did not show any significant difference in performance after harmonization in KRAS prediction. Average AUCs of all multivariate predictive models for both EGFR and KRAS were significantly improved (q-value < 0.05) following ComBat harmonization. The mean ranges of AUCs increased following harmonization from 0.87–0.90 to 0.92–0.94 for EGFR, and from 0.85–0.90 to 0.91–0.94 for KRAS. The highest performance was achieved by harmonized F_R0.66_W0.75 model with AUC of 0.94, and 0.93 for EGFR and KRAS, respectively. Conclusion: Our results demonstrated that regarding univariate modelling, while ComBat harmonization had generally a better impact on features for EGFR compared to KRAS status prediction, its effect is feature-dependent. Hence, no systematic effect was observed. Regarding the multivariate models, ComBat harmonization significantly improved the performance of all radiomics models toward more successful prediction of EGFR and KRAS mutation statuses in lung cancer patients. Thus, by eliminating the batch effect in multi-centric radiomic feature sets, harmonization is a promising tool for developing robust and reproducible radiomics using vast and variant datasets.",
        "DOI": "10.1016/j.compbiomed.2022.105230",
        "paper_author": "Shiri I.",
        "affiliation_name": "Hôpitaux Universitaires de Genève",
        "affiliation_city": "Geneva",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60009963",
        "affiliation_state": "GE"
    },
    {
        "paper_title": "Explainable Artificial Intelligence (XAI) in Biomedicine: Making AI Decisions Trustworthy for Physicians and Patients",
        "publication": "BioMedInformatics",
        "citied_by": "61",
        "cover_date": "2022-03-01",
        "Abstract": "The use of artificial intelligence (AI) systems in biomedical and clinical settings can disrupt the traditional doctor–patient relationship, which is based on trust and transparency in medical advice and therapeutic decisions. When the diagnosis or selection of a therapy is no longer made solely by the physician, but to a significant extent by a machine using algorithms, decisions become nontransparent. Skill learning is the most common application of machine learning algorithms in clinical decision making. These are a class of very general algorithms (artificial neural networks, classifiers, etc.), which are tuned based on examples to optimize the classification of new, unseen cases. It is pointless to ask for an explanation for a decision. A detailed understanding of the mathematical details of an AI algorithm may be possible for experts in statistics or computer science. However, when it comes to the fate of human beings, this “developer’s explanation” is not sufficient. The concept of explainable AI (XAI) as a solution to this problem is attracting increasing scientific and regulatory interest. This review focuses on the requirement that XAIs must be able to explain in detail the decisions made by the AI to the experts in the field.",
        "DOI": "10.3390/biomedinformatics2010001",
        "paper_author": "Lötsch J.",
        "affiliation_name": "Goethe-Universität Frankfurt am Main",
        "affiliation_city": "Frankfurt am Main",
        "affiliation_country": "Germany",
        "affiliation_id": "60007762",
        "affiliation_state": "Hessen"
    },
    {
        "paper_title": "Co-evolution of machine learning and digital technologies to improve monitoring of Parkinson’s disease motor symptoms",
        "publication": "npj Digital Medicine",
        "citied_by": "61",
        "cover_date": "2022-12-01",
        "Abstract": "Parkinson’s disease (PD) is a neurodegenerative disorder characterized by motor impairments such as tremor, bradykinesia, dyskinesia, and gait abnormalities. Current protocols assess PD symptoms during clinic visits and can be subjective. Patient diaries can help clinicians evaluate at-home symptoms, but can be incomplete or inaccurate. Therefore, researchers have developed in-home automated methods to monitor PD symptoms to enable data-driven PD diagnosis and management. We queried the US National Library of Medicine PubMed database to analyze the progression of the technologies and computational/machine learning methods used to monitor common motor PD symptoms. A sub-set of roughly 12,000 papers was reviewed that best characterized the machine learning and technology timelines that manifested from reviewing the literature. The technology used to monitor PD motor symptoms has advanced significantly in the past five decades. Early monitoring began with in-lab devices such as needle-based EMG, transitioned to in-lab accelerometers/gyroscopes, then to wearable accelerometers/gyroscopes, and finally to phone and mobile & web application-based in-home monitoring. Significant progress has also been made with respect to the use of machine learning algorithms to classify PD patients. Using data from different devices (e.g., video cameras, phone-based accelerometers), researchers have designed neural network and non-neural network-based machine learning algorithms to categorize PD patients across tremor, gait, bradykinesia, and dyskinesia. The five-decade co-evolution of technology and computational techniques used to monitor PD motor symptoms has driven significant progress that is enabling the shift from in-lab/clinic to in-home monitoring of PD symptoms.",
        "DOI": "10.1038/s41746-022-00568-y",
        "paper_author": "Chandrabhatla A.S.",
        "affiliation_name": "University of Virginia Health System",
        "affiliation_city": "Charlottesville",
        "affiliation_country": "United States",
        "affiliation_id": "60029418",
        "affiliation_state": "VA"
    }
]