[
    {
        "paper_title": "Agricultural Robots: Technology Progress, Challenges and Trends",
        "paper_author": "Zhao C.",
        "publication": "Smart Agriculture",
        "citied_by": "21",
        "cover_date": "2023-12-30",
        "Abstract": "[Significance] Autonomous and intelligent agricultural machinery, characterized by green intelligence, energy efficiency, and reduced emissions, as well as high intelligence and man-machine collaboration, will serve as the driving force behind global agricultural technology advancements and the transformation of production methods in the context of smart agriculture development. Agricultural robots, which utilize intelligent control and information technology, have the unique advantage of replacing manual labor. They occupy the strategic commanding heights and competitive focus of global agricultural equipment and are also one of the key development directions for accelerating the construction of China's agricultural power. World agricultural powers and China have incorporated the research, development, manufacturing, and promotion of agricultural robots into their national strategies, respectively strengthening the agricultural robot policy and planning layout based on their own agricultural development characteristics, thus driving the agricultural robot industry into a stable growth period. [Progress] This paper firstly delves into the concept and defining features of agricultural robots, alongside an exploration of the global agricultural robot development policy and strategic planning blueprint. Furthermore, sheds light on the growth and development of the global agricultural robotics industry; Then proceeds to analyze the industrial backdrop, cutting-edge advancements, developmental challenges, and crucial technology aspects of three representative agricultural robots, including farmland robots, orchard picking robots, and indoor vegetable production robots. Finally, summarizes the disparity between Chinese agricultural robots and their foreign counterparts in terms of advanced technologies. (1) An agricultural robot is a multi-degree-of-freedom autonomous operating equipment that possesses accurate perception, autonomous decision-making, intelligent control, and automatic execution capabilities specifically designed for agricultural environments. When combined with artificial intelligence, big data, cloud computing, and the Internet of Things, agricultural robots form an agricultural robot application system. This system has relatively mature applications in key processes such as field planting, fertilization, pest control, yield estimation, inspection, harvesting, grafting, pruning, inspection, harvesting, transportation, and livestock and poultry breeding feeding, inspection, disinfection, and milking. Globally, agricultural robots, represented by plant protection robots, have entered the industrial application phase and are gradually realizing commercialization with vast market potential. (2) Compared to traditional agricultural machinery and equipment, agricultural robots possess advantages in performing hazardous tasks, executing batch repetitive work, managing complex field operations, and livestock breeding. In contrast to industrial robots, agricultural robots face technical challenges in three aspects. Firstly, the complexity and unstructured nature of the operating environment. Secondly, the flexibility, mobility, and commoditization of the operation object. Thirdly, the high level of technology and investment required. (3) Given the increasing demand for unmanned and less manned operations in farmland production, China's agricultural robot research, development, and application have started late and progressed slowly. The existing agricultural operation equipment still has a significant gap from achieving precision operation, digital perception, intelligent management, and intelligent decision-making. The comprehensive performance of domestic products lags behind foreign advanced counterparts, indicating that there is still a long way to go for industrial development and application. Firstly, the current agricultural robots predominantly utilize single actuators and operate as single machines, with the development of multi-arm cooperative robots just emerging. Most of these robots primarily engage in rigid operations, exhibiting limited flexibility, adaptability, and functionality. Secondly, the perception of multi-source environments in agricultural settings, as well as the autonomous operation of agricultural robot equipment, relies heavily on human input. Thirdly, the progress of new teaching methods and technologies for human-computer natural interaction is rather slow. Lastly, the development of operational infrastructure is insufficient, resulting in a relatively low degree of \"mechanization\". [Conclusions and Prospects] The paper anticipates the opportunities that arise from the rapid growth of the agricultural robotics industry in response to the escalating global shortage of agricultural labor. It outlines the emerging trends in agricultural robot technology, including autonomous navigation, self-learning, real-time monitoring, and operation control. In the future, the path planning and navigation information perception of agricultural robot autonomy are expected to become more refined. Furthermore, improvements in autonomous learning and cross-scenario operation performance will be achieved. The development of real-time operation monitoring of agricultural robots through digital twinning will also progress. Additionally, cloud-based management and control of agricultural robots for comprehensive operations will experience significant growth. Steady advancements will be made in the innovation and integration of agricultural machinery and techniques.",
        "DOI": "10.12133/j.smartag.SA202312030",
        "affiliation_name": "Beijing Academy of Agriculture and Forestry Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60102081",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Explaining the challenges of accountability in machine learning systems beyond technical obstacles",
        "paper_author": "Palvadi S.K.",
        "publication": "Quantum Innovations at the Nexus of Biomedical Intelligence",
        "citied_by": "0",
        "cover_date": "2023-12-29",
        "Abstract": "The ability to make a note regarding machine learning systems decisions for people is becoming increas¬ingly sought after, particularly in situations where decisions have significant repercussions for those affected and where capability in terms of maintaining is required. To increase comprehension based on referred to as \"black box\" mechanism, explaining ability is frequently cited as a technical obstacle in the design of ML systems and decision procedures. The quantities that ML systems aim to optimize must be specified by their users. This leads to the revealing of policy trade-offs that may have previously been hidden or implicit. Important decisions, as well as judgments, help what may need to be explicitly discussed in public debate as ML's use in policy expands.",
        "DOI": "10.4018/979-8-3693-1479-1.ch003",
        "affiliation_name": "K L Deemed to be University",
        "affiliation_city": "Vaddeswaram",
        "affiliation_country": "India",
        "affiliation_id": "60079446",
        "affiliation_state": "AP"
    },
    {
        "paper_title": "Fortifying the digital forge: Unleashing cybersecurity in the interconnected world of digital manufacturing",
        "paper_author": "Dodiya K.R.",
        "publication": "Emerging Technologies in Digital Manufacturing and Smart Factories",
        "citied_by": "3",
        "cover_date": "2023-12-29",
        "Abstract": "In our interconnected world, cybersecurity is paramount due to IoT, cloud computing, and automation's impact on manufacturing. This chapter underscores digital manufacturing's dependence on interconnected systems and cloud infrastructure, acknowledging risks like data breaches, IP theft, and operational disruptions. It advocates a comprehensive cybersecurity approach encompassing technical measures, organizational policies, staff training, and incident response. The chapter delves into threats like malware, phishing, ransomware, and supply chain attacks, emphasizing continuous monitoring, threat intelligence, and vulnerability management. Additionally, it explores emerging trends like AI and machine learning in cybersecurity, legacy system security, and collaborative efforts among industry players, government agencies, and cybersecurity experts to safeguard digital manufacturing. This chapter aids manufacturers, security experts, and researchers in building secure systems in our connected digital landscape.",
        "DOI": "10.4018/979-8-3693-0920-9.ch014",
        "affiliation_name": "Gujarat University",
        "affiliation_city": "Gujarat",
        "affiliation_country": "India",
        "affiliation_id": "126149593",
        "affiliation_state": "GJ"
    },
    {
        "paper_title": "Correction: Exploration on the mechanism of therapeutic and toxic bidirectional effects of Haizao Yuhu decoction based on machine learning and data mining (Medical Data Mining, (2023), 6, 4, 21, 10.53388/MDM202306021)",
        "paper_author": "Chen Y.H.",
        "publication": "Medical Data Mining",
        "citied_by": "0",
        "cover_date": "2023-12-26",
        "Abstract": "Medical Data Mining published an article entitled Exploration on the mechanism of therapeutic and toxic bidirectional effects of Haizao Yuhu decoction based on machine learning and data mining on 05 September 2023. The proof of this article was confirmed by author on 05 September 2023 without any questions. But on 11 September, 2023, the authors contacted the editorial office to state that the following formula is missing at the end of first paragraph in the section “The stability test of the network”, the error was not found and corrected during the article processing (formula presented) The editorial office considers this correction request to be accordance with the policy of Medical Data Mining and agrees to make the correction. So the full content of first paragraph in the section “The stability test of the network” should be as follows: The performance of the multi-layer network depends on its stability, namely invulnerability. When some nodes in the network are destroyed, the network still maintains connectivity. The invulnerability of the network is widely used in complex microbial communities or flora communities. We introduced this invulnerability measurement to the multilayer network, which can reflect the biological significance of the integrity and stability of the multilayer network of the HYD in the treatment of goiter and causing DILI. The detailed principle and calculation formula were recorded in the article of Wu et al. [16]. The specific calculation formula was: (Formula presented).",
        "DOI": "10.53388/MDM202306026",
        "affiliation_name": "Beijing University of Chinese Medicine",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016424",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "GDPR-oriented intelligent checking method of privacy policies compliance",
        "paper_author": "Li X.",
        "publication": "Chinese Journal of Network and Information Security",
        "citied_by": "2",
        "cover_date": "2023-12-25",
        "Abstract": "The implementation of the EU’s General Data Protection Regulation (GDPR) has resulted in the imposition of over 300 fines since its inception in 2018. These fines include significant penalties for prominent companies like Google, which were penalized for their failure to provide transparent and comprehensible privacy policies. The GDPR, known as the strictest data protection laws in history, has made companies worldwide more cautious when offering cross-border services, particularly to the European Union. The regulation's territorial scope stipulates that it applies to any company providing services to EU citizens, irrespective of their location. This implies that companies worldwide, including domestic enterprises, are required to ensure compliance with GDPR in their privacy policies, especially those involved in international operations. To meet this requirement, an intelligent detection method was introduced. Machine learning and automation technologies were utilized to automatically extract privacy policies from online service companies. The policies were converted into a standardized format with a hierarchical structure. Through natural language processing, the privacy policies were classified, allowing for the identification of relevant GDPR concepts. In addition, a constructed GDPR taxonomy was used in the detection mechanism to identify any missing concepts as required by GDPR. This approach facilitated intelligent detection of GDPR-oriented privacy policy compliance, providing support to domestic enterprises while they provided cross-border services to EU users. Analysis of the corpus samples reveals the current situation that mainstream online service companies generally fail to meet GDPR compliance requirements.",
        "DOI": "10.11959/j.issn.2096-109x.2023088",
        "affiliation_name": "Shanghai Jiao Tong University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025084",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Optimal deep machine learning framework for vibration mitigation of seismically-excited uncertain building structures",
        "paper_author": "Rad A.B.",
        "publication": "Structural Engineering and Mechanics",
        "citied_by": "1",
        "cover_date": "2023-12-25",
        "Abstract": "Deep extreme learning machine (DELM) and multi-verse optimization algorithms (MVO) are hybridized for designing an optimal and adaptive control framework for uncertain buildings. In this approach, first, a robust model predictive control (RMPC) scheme is developed to handle the problem uncertainty. The optimality and adaptivity of the proposed controller are provided by the optimal determination of the tunning weights of the linear programming (LP) cost function for clustered external loads using the MVO. The final control policy is achieved by collecting the clustered data and training them by DELM. The efficiency of the introduced control scheme is demonstrated by the numerical simulation of a ten-story benchmark building subjected to earthquake excitations. The results represent the capability of the proposed framework compared to robust MPC (RMPC), conventional MPC (CMPC), and conventional DELM algorithms in structural motion control.",
        "DOI": "10.12989/sem.2023.88.6.535",
        "affiliation_name": "University of Tabriz",
        "affiliation_city": "Tabriz",
        "affiliation_country": "Iran",
        "affiliation_id": "60006622",
        "affiliation_state": "East Azerbaijan"
    },
    {
        "paper_title": "A machine learning-based admissions support system with a case study on D.K.M. College for Women, Vellore",
        "paper_author": "Vasumathy M.",
        "publication": "Design and Implementation of Higher Education Learners' Learning Outcomes (HELLO)",
        "citied_by": "0",
        "cover_date": "2023-12-22",
        "Abstract": "Building efficient higher education systems is tough for India and other developing countries, especially when it comes to female students. Despite the government's efforts, India did not gain anything from its superb and creative educational policy. The Indian government is cognizant of the particular challenges the current global situation poses for the higher education industry. At Vellore's D.K.M. College for Women, the post-graduation admission rate has considerably declined over the last 12 months. The work is largely focused on the identification of concerns, obstacles, and declining factors of post-graduation admittance from the perspectives of students, parents, teaching staffs, and management. The architecture for the course recommender system and the information flow across it are proposed in this chapter. This approach forecasts the ideal subject pairing, or the subjects that pupils will be most interested in. Here, the authors use a learning management system like Moodle to gather information from students about their course preferences.",
        "DOI": "10.4018/978-1-6684-9472-1.ch017",
        "affiliation_name": "Dhanabhagiyam Krishnasamy Mudaliar College for Women",
        "affiliation_city": "Vellore",
        "affiliation_country": "India",
        "affiliation_id": "60113968",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Accelerating and enhancing the generation of socioeconomic data to inform forced displacement policy and response",
        "paper_author": "Brock P.M.",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2023-12-22",
        "Abstract": "There are now an estimated 114 million forcibly displaced people worldwide, some 88% of whom are in low- and middle-income countries. For governments and international organizations to design effective policies and responses, they require comparable and accessible socioeconomic data on those affected by forced displacement, including host communities. Such data is required to understand needs, as well as interactions between complex drivers of displacement and barriers to durable solutions. However, high-quality data of this kind takes time to collect and is costly. Can the ever-increasing volume of open data and evolving innovative techniques accelerate and enhance its generation? Are there applications of alternative data sources, advanced statistics, and machine-learning that could be adapted for forced displacement settings, considering their specific legal and ethical dimensions? As a catalytic bridge between the World Bank and UNHCR, the Joint Data Center on Forced Displacement convened a workshop to answer these questions. This paper summarizes the emergent messages from the workshop and recommendations for future areas of focus and ways forward for the community of practice on socioeconomic data on forced displacement. Three recommended areas of future focus are: enhancing and optimizing household survey sampling approaches; estimating forced displacement socioeconomic indicators from alternative data sources; and amplifying data accessibility and discoverability. Three key features of the recommended approach are: strong complementarity with the existing data-collection-to-use-pipeline; data responsibility built-in and tailored to forced displacement contexts; and iterative assessment of operational relevance to ensure continuous focus on improving outcomes for those affected by forced displacement.",
        "DOI": "10.1017/dap.2023.47",
        "affiliation_name": "The World Bank, USA",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60112834",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Developing a Dynamic Decision-Support Framework for Higher Education Management Systems through Real-time Information Extraction",
        "paper_author": "Pantin R.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "1",
        "cover_date": "2023-12-21",
        "Abstract": "In the changing world of education, it is crucial for institutions to have the ability to make well informed decisions based on data. This paper presents an innovative Decision Support Framework (DDSF), for managing higher education systems. The DDSF utilizes real time information extraction to improve the decision-making process. It combines data analytics and user centric design to provide insights to education administrators. By gathering data from sources like records, financial reports and social media analytics the DDSF uses natural language processing (NLP) and machine learning (ML) algorithms to extract and interpret real time information. This information is then organized in a manner for analysis. The framework is adaptable allowing for the inclusion of emerging data streams ensuring relevance and usefulness. To evaluate the effectiveness of the DDSF we conducted a pilot study at a university. The results indicated improvements in meeting student needs optimizing resource allocation and enhancing operational efficiency. The framework also enables policy development by foreseeing challenges and identifying opportunities, within the education sector. The DDSF brings about a way of managing education by providing a strong platform for institutions to succeed in a competitive and constantly evolving environment. It emphasizes the significance of extracting real time information to guide planning and operational excellence. Future studies will concentrate on expanding the framework, for use, across institutions and incorporating analytics to improve foresight abilities.",
        "DOI": "10.1145/3644713.3644786",
        "affiliation_name": "Tashkent State University of Economics",
        "affiliation_city": "Tashkent",
        "affiliation_country": "Uzbekistan",
        "affiliation_id": "60071662",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Comparative Analysis of Machine Learning Algorithms for Inflation Rate Classification and Economic Trend Forecasting",
        "paper_author": "Khashimova N.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-21",
        "Abstract": "Predictive modeling of inflation rates is critical for economic policy and risk management. This study compares the efficacy of K-Nearest Neighbors (KNN) and logistic regression algorithms in classifying inflation into 'Low,' 'Medium,' and 'High' categories, which are essential for monitoring and managing economic stability. Through meticulous preprocessing, including outlier removal, normalization, and imputation, the dataset was refined for accurate analysis. The study established inflation thresholds using empirical data and economic theory to create structured categories. The EDA revealed the fluctuating nature of inflation and its long-term trends, providing a clear picture of economic conditions. Logistic regression demonstrated a higher accuracy rate and better performance metrics over KNN, suggesting it as a superior model for inflation classification. The findings emphasize the importance of precise model selection in economic forecasting and propose logistic regression as a robust tool for policy-makers and economists in strategic economic planning.",
        "DOI": "10.1145/3644713.3644749",
        "affiliation_name": "Tashkent State University of Economics",
        "affiliation_city": "Tashkent",
        "affiliation_country": "Uzbekistan",
        "affiliation_id": "60071662",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Optimizing geographic locations for electric vehicle battery recycling preprocessing facilities in California",
        "paper_author": "Haynes M.W.",
        "publication": "RSC Sustainability",
        "citied_by": "3",
        "cover_date": "2023-12-20",
        "Abstract": "Spent lithium-ion batteries (LIBs) at end of life pose several safety risks. Specifically, LIBs have the potential to self-ignite during transport, release toxic compounds during incineration, and can leach contaminants into landfills. Spent LIBs, which are classified as hazardous waste, are also subject to numerous policies and require disposal by certified personnel and companies. These requirements result in an increase in transport costs and volume compared to other waste. Efforts to improve LIB recycling focus primarily on reducing costs to make recycling economically profitable. The greatest emphasis is placed on improving recycling technologies; however, transport costs significantly impact the total cost of LIB recycling. Here, we provide a procedure for choosing an unsupervised machine learning clustering heuristic to identify optimal locations for LIB recycling preprocessing facilities in California. The identified decentralized facility locations minimize the transportation distance and the cost of shipping spent electric vehicle batteries between end-use sector facilities and potential second-use locations.",
        "DOI": "10.1039/d3su00319a",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60136858",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "Multimodal analysis of disinformation and misinformation",
        "paper_author": "Wilson A.",
        "publication": "Royal Society Open Science",
        "citied_by": "5",
        "cover_date": "2023-12-20",
        "Abstract": "The use of disinformation and misinformation campaigns in the media has attracted much attention from academics and policy-makers. Multimodal analysis or the analysis of two or more semiotic systems - language, gestures, images, sounds, among others - in their interrelation and interaction is essential to understanding dis-/misinformation efforts because most human communication goes beyond just words. There is a confluence of many disciplines (e.g. computer science, linguistics, political science, communication studies) that are developing methods and analytical models of multimodal communication. This literature review brings research strands from these disciplines together, providing a map of the multi- and interdisciplinary landscape for multimodal analysis of dis-/misinformation. It records the substantial growth starting from the second quarter of 2020 - the start of the COVID-19 epidemic in Western Europe - in the number of studies on multimodal dis-/misinformation coming from the field of computer science. The review examines that category of studies in more detail. Finally, the review identifies gaps in multimodal research on dis-/misinformation and suggests ways to bridge these gaps including future cross-disciplinary research directions. Our review provides scholars from different disciplines working on dis-/misinformation with a much needed bird's-eye view of the rapidly emerging research of multimodal dis-/misinformation.",
        "DOI": "10.1098/rsos.230964",
        "affiliation_name": "Oxford Social Sciences Division",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60175816",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "Revisiting the dynamics of gaseous ammonia and ammonium aerosols during the COVID-19 lockdown in urban Beijing using machine learning models",
        "paper_author": "Lyu Y.",
        "publication": "Science of the Total Environment",
        "citied_by": "3",
        "cover_date": "2023-12-20",
        "Abstract": "The concentration of atmospheric ammonia (NH3) in urban Beijing substantially decreased during the COVID-19 lockdown (24 January to 3 March 2020), likely due to the reduced human activities. However, quantifying the impact of anthropogenic interventions on NH3 dynamics is challenging, as both meteorology and chemistry mask the real changes in observed NH3 concentrations. Here, we applied machine learning techniques based on random forest models to decouple the impacts of meteorology and emission changes on the gaseous NH3 and ammonium aerosol (NH4+) concentrations in Beijing during the lockdown. Our results showed that the meteorological conditions were unfavorable during the lockdown and tended to cause an increase of 8.4 % in the NH3 concentration. In addition, significant reductions in NOx and SO2 emissions could also elevate NH3 concentrations by favoring NH3 gas-phase partitioning. However, the observed NH3 concentration significantly decreased by 35.9 % during the lockdown, indicating a significant reduction in emissions or enhanced chemical sinks. Rapid gas-to-particle conversion was indeed found during the lockdown. Thus, the observed reduced NH3 concentrations could be partially explained by the enhanced transformation into NH4+. Therefore, the sum of NH3 and NH4+ (collectively, NHx) is a more reliable tracer than NH3 or NH4+ alone to estimate the changes in NH3 emissions. Compared to that under the scenario without lockdowns, the NHx concentration decreased by 26.4 %. We considered that this decrease represents the real decrease in NH3 emissions in Beijing due to the lockdown measures, which was less of a decrease than that based on NH3 only (35.9 %). This study highlights the importance of considering chemical sinks in the atmosphere when applying machine learning techniques to link the concentrations of reactive species with their emissions.",
        "DOI": "10.1016/j.scitotenv.2023.166946",
        "affiliation_name": "National Satellite Meteorological Center Beijing",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60073482",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Soil carbon sequestration potential of cultivated lands and its controlling factors in China",
        "paper_author": "Wang S.",
        "publication": "Science of the Total Environment",
        "citied_by": "5",
        "cover_date": "2023-12-20",
        "Abstract": "Understanding soil organic carbon (SOC) stocks and carbon sequestration potential in cultivated lands can have significant benefit for mitigating climate change and emission reduction. However, there is currently a lack of spatially explicit information on this topic in China, and our understanding of the factors that influence both saturated SOC level (SOCS) and soil organic carbon density (SOCD) remains limited. This study predicted SOCS and SOCD of cultivated lands across mainland China based on point SOC measurements, and mapped its spatial distribution using environmental variables as predictors. Based on the differentiation between SOCS and SOCD, the soil organic carbon sequestration potentials (SOCP) of cultivated land were calculated. Boosted regression trees (BRT), random forest (RF), and support vector machine (SVM) were evaluated as prediction models, and the RF model presented the best performance in predicting SOCS and SOCD based on 10-fold cross-validation. A total of 991 topsoil (0–20 cm) SOC measurements and 12 environmental variables explaining topography, climate, organism, soil properties, and human activity were used as predictors in the model. Both SOCS and SOCD suggested higher SOC levels in northeast China and lower levels in central China. The cultivated lands in China had the potential to sequester about 2.13 ± 0.96 kg m−2 (3.25 Pg) SOC in the top 20 cm soil depth. Northeastern China had the largest SOCP followed by Northern China, and Southwestern China had the lowest SOCP. The primary environmental variables that affected the spatial variation of SOCS were mean annual temperature, followed by clay content and normalized difference vegetation index (NDVI). The assessment and mapping of SOCP in China's cultivated lands holds significance importance as it can provide valuable insights to policymakers and researchers about SOCP, and aid in formulating climate change mitigation strategies.",
        "DOI": "10.1016/j.scitotenv.2023.167292",
        "affiliation_name": "Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60031150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Nitrate prediction in groundwater of data scarce regions: The futuristic fresh-water management outlook",
        "paper_author": "Mahlknecht J.",
        "publication": "Science of the Total Environment",
        "citied_by": "16",
        "cover_date": "2023-12-20",
        "Abstract": "Nitrate contamination in groundwater poses a significant threat to water quality and public health, especially in regions with limited data availability. This study addresses this challenge by employing machine learning (ML) techniques to predict nitrate (NO3−-N) concentrations in Mexico's groundwater. Four ML algorithms—Extreme Gradient Boosting (XGB), Boosted Regression Trees (BRT), Random Forest (RF), and Support Vector Machines (SVM)—were executed to model NO3−-N concentrations across the country. Despite data limitations, the ML models achieved robust predictive performances. XGB and BRT algorithms demonstrated superior accuracy (0.80 and 0.78, respectively). Notably, this was achieved using ∼10 times less information than previous large-scale assessments. The novelty lies in the first-ever implementation of the ‘Support Points-based Split Approach’ during data pre-processing. The models considered initially 68 covariates and identified 13–19 significant predictors of NO3−-N concentration spanning from climate, geomorphology, soil, hydrogeology, and human factors. Rainfall, elevation, and slope emerged as key predictors. A validation incorporated nationwide waste disposal sites, yielding an encouraging correlation. Spatial risk mapping unveiled significant pollution hotspots across Mexico. Regions with elevated NO3−-N concentrations (>10 mg/L) were identified, particularly in the north-central and northeast parts of the country, associated with agricultural and industrial activities. Approximately 21 million people, accounting for 10 % of Mexico's population, are potentially exposed to elevated NO3−-N levels in groundwater. Moreover, the NO3−-N hotspots align with reported NO3−-N health implications such as gastric and colorectal cancer. This study not only demonstrates the potential of ML in data-scarce regions but also offers actionable insights for policy and management strategies. Our research underscores the urgency of implementing sustainable agricultural practices and comprehensive domestic waste management measures to mitigate NO3−-N contamination. Moreover, it advocates for the establishment of effective policies based on real-time monitoring and collaboration among stakeholders.",
        "DOI": "10.1016/j.scitotenv.2023.166863",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Davis",
        "affiliation_country": "United States",
        "affiliation_id": "60153736",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Educational Missions and Tactics in the EU Artificial Intelligence Strategy in the Era of Digital Transformation: A Policy Analysis Based on EU Documents Published During 2018-2022",
        "paper_author": "Xiong Y.",
        "publication": "Advances in Transdisciplinary Engineering",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "In the era of digital transformation, AI, cloud computing, big data, blockchain, and other intelligent technologies have increasingly profound impacts on work, study, life, and especially education. The Publishing of The Age of Artificial Intelligence: Towards a European Strategy for Human-Centric Machines marked the official launch of the EU Artificial Intelligence Strategy. By analyzing policy documents published during 2018 and 2022 for the EU Artificial Intelligence Strategy, it is found that the strategy has set three strategic goals, namely achieving an 'Ecosystem of Excellence', building an 'Ecosystem of Trust', and establishing an 'Ecosystem of Digital Education'. To ensure its implementation, the European Commission has published a series of policy documents successively. As the main driver of the AI strategy, education plays an important role in the development of AI, and the EU has adopted various education tactics in the series of documents. Given the particularity of the EU as a regional cooperation organization, this strategy values philosophy, norms, and cooperation. It also provides a good reference for AI development and digital transformation of society in other countries and brings new opportunities for international cooperation in the field of AI.",
        "DOI": "10.3233/ATDE230999",
        "affiliation_name": "Wenzhou University",
        "affiliation_city": "Wenzhou",
        "affiliation_country": "China",
        "affiliation_id": "60020224",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Development of a Machine Learning Framework Based on Occupant-Related Parameters to Predict Residential Electricity Consumption in the Hot and Humid Climate",
        "paper_author": "Qavidel Fard Z.",
        "publication": "Energy and Buildings",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "Occupant-related variables constitute one of the most significant groups of factors influencing residential building energy consumption. However, prediction methods often oversimplify these parameters, leading to substantial discrepancies between predicted and actual consumption. To address this issue, the present study aims to develop a machine learning framework for predicting electricity consumption in residential buildings based on occupant-related factors. The study incorporates twenty-six inputs, including occupant characteristics such as demographics, occupancy, behavior, and behavioral efficiency, two time-related factors, and three extra parameters related to equipment (refrigerator age, hot water source, and type of electricity meter) for training and testing the Random Forest (RF) algorithm in both regression and classification forms. The results indicate that the trained RF regressor exhibits well performance (R2Train = 0.989, R2Test = 0.916, MAETrain = 0.81, MAETest = 2.21, RMSETrain = 1.27, and RMSETest = 3.45). Furthermore, feature importance analysis reveals that the most significant parameter is the time of year, representing weather conditions, followed by the number of occupants, neighborhood, indoor set-point range, mean age of occupants, window opening, and cooling system mode. Even after removing the least impactful factors, the model maintains strong performance with the 16 most important variables (R2Train = 0.986, R2Test = 0.910, MAETrain = 0.83, MAETest = 2.25, RMSETrain = 1.31, and RMSETest = 3.49). Additionally, the RF classifier is designed for problems with 2, 4, 6, and 8 classes based on energy consumption ranges. The results of this model demonstrate that the 2-class model achieves the highest performance (AccuracyTest = 0.963, MAETest = 0.04, and RMSETest = 0.19). However, it lacks detailed categorization of homes based on electricity consumption. On the other hand, the 4-class and 6-class models strike a good balance between prediction performance and the level of detail. In conclusion, the proposed method can accurately predict residential electricity consumption and can serve as a valuable reference for researchers and utility managers when formulating energy reduction policies and comparing the effectiveness of different strategies.",
        "DOI": "10.1016/j.enbuild.2023.113678",
        "affiliation_name": "Shahid Beheshti University",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60032873",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Advancing COP26 climate goals: Leveraging energy innovation, governance readiness, and socio-economic factors for enhanced climate resilience and sustainability",
        "paper_author": "Sarkodie S.A.",
        "publication": "Journal of Cleaner Production",
        "citied_by": "8",
        "cover_date": "2023-12-15",
        "Abstract": "Climate change adaptation and mitigation remain critical to achieving sustainable development while reducing climate vulnerability, particularly among climate-exposed and sensitive regions. Yet, achieving a balance between climate-resilience pathways, high economic productivity, high human development, and energy efficiency appears complex, leading to potential trade-offs. Here, we examine the overarching effect of the diversified energy portfolio, socio-economic drivers, and governance adaptation readiness on Climate change vulnerability across 212 economies. Contrary to the poor conventional panel techniques reported in the existing literature, we employ novel machine learning and dynamic panel estimation techniques that control for chaos, nonlinearity, mutual coupling, and heterogeneity in dynamic systems. The convergent cross-mapping causality technique reveals mutual coupling effects between energy portfolio, governance readiness, socio-economic drivers, and climate change vulnerability. The rapidly increasing population and increasing demand for resources under the business-as-usual society and economic structure that normalizes unsustainable development pathways due to weak governance structures create ineffective climate-resilient policies that lead to unabated emissions with consequences on climate change. The effect of social and governance readiness leads the transformation process to attain sustainable development. Thus, high social and governance readiness spurs climate resilience through climate change adaptation and mitigation to achieve sustainable development. Alternative (renewables) and nuclear energy have displacement effects on fossil fuels, yet, the magnitude of displacement is not large enough to replace future fossil fuel consumption. Conversely, a low-carbon future is still attainable by replacing the fossil energy portfolio with more natural gas and carbon-abatement technologies. Our study demonstrates that energy innovations are useful climate-resilience pathways that lessen climate change vulnerability.",
        "DOI": "10.1016/j.jclepro.2023.139757",
        "affiliation_name": "Nord Universitet",
        "affiliation_city": "Bodo",
        "affiliation_country": "Norway",
        "affiliation_id": "60021876",
        "affiliation_state": "Nordland"
    },
    {
        "paper_title": "A Free and open-source microgrid optimization tool: SAMA the solar alone Multi-Objective Advisor",
        "paper_author": "Ali Sadat S.",
        "publication": "Energy Conversion and Management",
        "citied_by": "9",
        "cover_date": "2023-12-15",
        "Abstract": "Although there are many software tools for simulations of hybrid energy systems, Homer Pro and Homer Grid are the only tools offering optimal sizing of hybrid energy systems. Originally developed as open-source software, they have been closed, which limits user-developers abilities to adapt and improve the software. In addition, all current proprietary offering suffer from the following limitations: i) high costs that limit accessibility to low-resource labs and individuals, ii) incapable of conducting multi-objective optimization, iii) constrained on any new innovations in hybrid energy system design and operation, iv) difficulties for users to specifically define prices and costs in inputs, v) inability to model different electric utility billing structures, vi) complex pricing methodology, and vii) the absence of machine learning-based predictive modeling. To overcome these limitations, this paper introduces and validates SAMA (Solar Alone Multi-objective Advisor), an open-source microgrid optimization software program designed to optimize hybrid energy system sizes economically using metaheuristic algorithms based on specific load profiles and meteorological data. Through rigorous validation exercises, SAMA's outcomes are compared against those generated by the Homer Pro software across distinct climatic conditions and geographical locations (i.e., Sacramento, California in the marine west coast and New Bern in humid continental climate zones of U.S., respectively). The results demonstrate congruence between SAMA and Homer Pro. SAMA can be used for a diverse array of applications from renewable energy systems to off-grid and grid-tied configurations, and from policy formulation to feasibility assessment. Unique features of SAMA include multi-objective optimizer, levelized emission optimization, different pre-defined utility billing structures, and a top-down pricing methodology. These features further enhance SAMA's adaptability, allowing users to tailor the software to their specific needs and system configurations. Finally, the paper anticipates future advancements that could refine component modeling, accelerate optimization processes, and incorporate advanced data analysis techniques such as machine learning to predict energy demand and production patterns.",
        "DOI": "10.1016/j.enconman.2023.117686",
        "affiliation_name": "Ivey Business School",
        "affiliation_city": "London",
        "affiliation_country": "Canada",
        "affiliation_id": "60115928",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Patterns and drivers of carbon stock change in ecological restoration regions: A case study of upper Yangtze River Basin, China",
        "paper_author": "Quan Y.",
        "publication": "Journal of Environmental Management",
        "citied_by": "7",
        "cover_date": "2023-12-15",
        "Abstract": "Balancing ecology and human development has been a long and wide concern. The upper Yangtze River Basin (UYRB) of China has implemented large important ecological restoration projects since the last century. These restoration practices have changed land use patterns within the UYRB, consequently impacting the local carbon cycle. The most noteworthy project is the Grain for Green Program, which returns cropland to natural vegetation (forest and grassland). Yet the effects of restoration on land use change, carbon sequestration, and associated food production remain unclear. This study utilized remote sensing data and conversion coefficients to analyze the ecological-policy-induced land use changes of the UYRB from 2000 to 2020 and their impacts on terrestrial carbon sequestration. Linear regression, machine learning, and structural equation modeling (SEM) were utilized to evaluate the correlations between environmental and socio-economic factors and the distribution of carbon stocks. The results indicated positive effects of ecological activities on the UYRB, despite decreases in cropland. Over the past 20 years, the UYRB had sequestered carbon by a total amount of 1796 ± 926 Mt C. The spatial distribution of sequestered carbon demonstrated a strong correlation with slopes, followed by temperatures. The SEM results indicated that agricultural production and carbon sequestration were enhanced synergically under land use changes. This further demonstrated the effectiveness of these land policies in achieving a balance between crop productivity and ecology protection. We emphasized the importance of vegetation restoration in achieving carbon neutrality and the necessity to continue these projects. We suggested a more reasonable land management for the future UYRB based on the characteristics of each geographical subregion. This work serves as an example of effective land management to other locations worldwide perusing the harmony of ecological restoration and human development.",
        "DOI": "10.1016/j.jenvman.2023.119376",
        "affiliation_name": "Southwest University",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60122052",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Driving style-aware energy management for battery/supercapacitor electric vehicles using deep reinforcement learning",
        "paper_author": "Wu Y.",
        "publication": "Journal of Energy Storage",
        "citied_by": "9",
        "cover_date": "2023-12-15",
        "Abstract": "Driving style can significantly affect the energy consumption, battery lifespan, and driving economy of electric vehicles. In this context, this paper proposes a novel driving style-aware energy management strategy for electric vehicles with battery/supercapacitor hybrid energy storage systems based on deep reinforcement learning. Firstly, a semi-supervised support vector machine-based driving style recognition method is presented to recognize the driving style, where twenty features are extracted from limited labeled velocity/acceleration data and then reduced to six dimensions by locally linear embedding. The six dimension features are used to obtain accurate recognition results. Then a proximal policy optimization-based energy management strategy is proposed with the driving style as an additional input state, to optimize the power allocation and minimize the battery capacity loss cost. Extensive results illustrate the effectiveness of the proposed methods, e.g., the proposed driving style recognition method can recognize the real-time driving style with an accuracy of over 95%. Taking the recognized style as input, the proposed driving style-aware energy management strategy can reduce the battery capacity loss cost by 3.30–4.19% and 1.77–8.15%, compared with no driving style and incorrect driving style input energy management methods, respectively.",
        "DOI": "10.1016/j.est.2023.109199",
        "affiliation_name": "Changsha University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60019338",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "A novel online learning-based linear quadratic regulator for vanadium redox flow battery in DC microgrids",
        "paper_author": "Liu Y.",
        "publication": "Journal of Power Sources",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "This paper proposes a novel learning-based linear quadratic regulator (LQR) to overcome the long-lasting problem of model dependency in the existing vanadium redox flow battery (VRB) control approaches. Compared to the conventional model-dependent control methods, such as PI control and model predictive control (MPC), the proposed method automatically updates the optimal control policy through the online learning mechanism without any knowledge of the VRB system dynamics. The ability of the proposed method to handle uncertainties is verified by simulations under various scenarios.",
        "DOI": "10.1016/j.jpowsour.2023.233672",
        "affiliation_name": "The University of Western Australia",
        "affiliation_city": "Perth",
        "affiliation_country": "Australia",
        "affiliation_id": "60031806",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Closed-Loop Soft Robot Control Frameworks with Coordinated Policies Based on Reinforcement Learning and Proprioceptive Self-Sensing",
        "paper_author": "Ju H.",
        "publication": "Advanced Functional Materials",
        "citied_by": "5",
        "cover_date": "2023-12-15",
        "Abstract": "Recent advances in soft robots have been achieved by using compliant materials and exploiting the advantages of the soft structural designs of living organisms. Living organisms (which have theoretically infinite degrees of freedom) are not only mechanically soft but are also capable of smooth harmonic motions, thanks to global coordination and the individual sensing and control of local tissues. Despite improvements in structural designs, few soft robot control frameworks for global object-oriented behaviors are reported. Such a framework will require the use of multiple segments, with local sensing and independent control using coordinated policies. Here, a class of reinforcement learning based control frameworks for soft robots (with high degrees of freedom) is presented, and their ability to conduct global tasks is demonstrated. Coordinated control policies are formulated to control multiple segments with independently controllable embedded actuators, based on localized proprioceptive self-sensing capabilities. The control frameworks are employed to develop soft physical robots. Demonstrations and experiments include the forward and backward locomotion of multichannel soft robotic flatworms. This approach is applicable to multifunctional, high degrees of freedom soft robots, as demonstrated by experiments with light-sensitive locomotion.",
        "DOI": "10.1002/adfm.202304642",
        "affiliation_name": "Gwangju Institute of Science and Technology",
        "affiliation_city": "Gwangju",
        "affiliation_country": "South Korea",
        "affiliation_id": "60068688",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A hybrid machine learning framework for forecasting house price",
        "paper_author": "Zhan C.",
        "publication": "Expert Systems with Applications",
        "citied_by": "14",
        "cover_date": "2023-12-15",
        "Abstract": "House price prediction is one of the most important factors affecting national real estate policies. However, developing an accurate housing price prediction model is a significant challenge for the real estate market. This study presents a framework of house price prediction models that address this issue by improving forecasting performance, explicitly demonstrating the novelty in the Hybrid Bayesian Optimization (HBO) models combined with Stacking (HBOS), Bagging (HBOB), and Transformer (HBOT) techniques. These hybrid models employ Bayesian Optimization for hyperparameter tuning, leading to superior prediction accuracy and stability. Additionally, the proposed framework can assess a statistical and accurate assessment of the predictive performance of house price forecasting models in different scenarios. Furthermore, we constructed a multi-source dataset containing 1,898,175 transactions of the Hong Kong real estate market covering a period from January 2, 1996, to May 13, 2021. This dataset, another major contribution to the field, enables comprehensive model testing and could be a valuable resource for future research. Then, the proposed hybrid models are compared with 18 benchmark models. Thirteen evaluation metrics are used to evaluate the predictive performance, while the non-parametric testing, including Friedman, Iman–Davenport, and Nemenyi post-hoc tests methods, are adopted to assess the significance of differences in the predictive performance of each model. The experimental results show that the HBOS models are superior to the other benchmark models for application in the house price prediction problem. The HBOS-CatBoost model showed superior performance in terms of RMSE compared to both the HBOB-XGBoost and HBOT-ConvLSTM models, with relative RMSE reductions of 5.11% and 25.56%, respectively. The main contributions of this work are the creation of a rich multi-source dataset, the proposal of novel hybrid models for improved house price prediction, and a comprehensive performance evaluation framework. These findings offer a significant step forward in the housing price prediction field.",
        "DOI": "10.1016/j.eswa.2023.120981",
        "affiliation_name": "Nanfang College of Sun Yet-sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60117185",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Practical machine learning: Forecasting daily financial markets directions",
        "paper_author": "Henrique B.M.",
        "publication": "Expert Systems with Applications",
        "citied_by": "9",
        "cover_date": "2023-12-15",
        "Abstract": "Financial time series prediction has many applications in economics, but producing profitable strategies certainly has a special place among them, a daunting challenge. Statistical and machine learning techniques are intensively researched in the search for a holy grail of stock markets forecasting. However, it is not clear to prospecting researchers how good those popular models are regarding useful predictions on a real scenario. This paper contributes to that discussion, providing decisive evidences contrary to the use of basic out-of-the-box models, specifically Artificial Neural Networks (ANN), Support Vector Machines (SVM), Random Forest (RF) and Naive-Bayes (NB). Results consider optimistic and unreal variables often found in literature, as well as a more close-to-real simulation of the models usage. Specifically, current day closing prices direction forecasting results are contrasted with those on next day forecasts. As expected, when forecasting the current day, accuracy is almost perfect. However, when used to forecast next day closing direction, with a strict data separation policy and without direction or snooping bias, ANN, SVM, RF and NB produce results essentially equal to random guessing. The main achieved result is the demonstration of how a machine learning approach would fare in a support decision system for forecasting short-term future market direction, regardless of the level of market development, considering more than 100 securities in a 10 years period. Consequences for algorithmic trading relate to discouraging usage of the considered models as implemented here. On a more abstract sense, this paper presents more evidence to the Efficient Market Hypothesis (EMH).",
        "DOI": "10.1016/j.eswa.2023.120840",
        "affiliation_name": "Universidade de Brasília",
        "affiliation_city": "Brasilia",
        "affiliation_country": "Brazil",
        "affiliation_id": "60024989",
        "affiliation_state": "DF"
    },
    {
        "paper_title": "Understanding User Equilibrium States of Road Networks using Big Trajectory Data",
        "paper_author": "Chen B.Y.",
        "publication": "International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "User equilibrium (UE) has long been regarded as the cornerstone of transport planning studies. Despite its fundamental importance, our understanding of the actual UE state of road networks has remained surprisingly incomplete. Using big datasets of taxi trajectories, this study investigates the UE states of road networks in Wuhan. Effective indicators, namely relative gaps, are introduced to quantify how actual traffic states deviate from theoretical UE states. Advanced machine learning techniques, including XGBoost and SHAP values, are employed to analyze nonlinear relationships between network disequilibrium states and seven influencing factors extracted from trajectory data. The results reveal significant gaps between actual traffic states and the theoretical UE states at various times of the day during both weekdays and weekends. The XGBoost analysis shows that differences in travel distances, travel speeds, and signalized intersection numbers among alternative routes are the primary causes of road network disequilibrium. The results of this study could have several important methodological and policy implications for using the UE models in transport applications.",
        "DOI": "10.5194/isprs-archives-XLVIII-1-W2-2023-331-2023",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "UNDERSTANDING THE IMPACTS OF CROP DIVERSIFICATION IN THE CONTEXT OF CLIMATE CHANGE: A MACHINE LEARNING APPROACH",
        "paper_author": "Giannarakis G.",
        "publication": "International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "The concept of sustainable intensification in agriculture necessitates the implementation of management practices that prioritize sustainability without compromising productivity. However, the effects of such practices are known to depend on environmental conditions, and are therefore expected to change as a result of a changing climate. We study the impact of crop diversification on productivity in the context of climate change. We leverage heterogeneous Earth Observation data and contribute a data-driven approach based on causal machine learning for understanding how crop diversification impacts may change in the future. We apply this method to the country of Cyprus throughout a 4-year period. We find that, on average, crop diversification significantly benefited the net primary productivity of crops, increasing it by 2.8%. The effect generally synergized well with higher maximum temperatures and lower soil moistures. In a warmer and more drought-prone climate, we conclude that crop diversification exhibits promising adaptation potential and is thus a sensible policy choice with regards to agricultural productivity for present and future.",
        "DOI": "10.5194/isprs-archives-XLVIII-1-W2-2023-1379-2023",
        "affiliation_name": "Cyprus University of Technology",
        "affiliation_city": "Limassol",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60077474",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Classification of Urban Land Use and Land Cover with K-Nearest Neighbour Classifier in the City of Cape Town, South Africa – Cape Flats Case Study",
        "paper_author": "Lefulebe B.E.",
        "publication": "International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "The rapid growth of cities, owing to rural-urban migration and high birth rate has resulted in encroachment of the land use and land cover (LULC) in the Cape Flats, situated north of Cape Town, Western Cape, South Africa. PlanetScope imagery and K-Nearest Neighbour (KNN) classifier are used to map and monitor the following LULC classes within the Cape Flats; waterbodies, trees, built-up, and vegetation, we further do a time series map between 2016 and 2021. The results showed that LULC changes between 2016 to 2021 are as follows: a decrease of 2.1% in vegetation, 0.4% in water bodies, and 11% in trees. Built-up areas, on the other hand, showed a significant increase of 13.6% over five years. The LULC changes in the Cape Flats were mainly triggered by an increase in built-up areas due to household construction to accommodate the increased population resulting from rural-to-urban migration and high birth rate. Classification accuracy from 2016 and 2021 was as follows; overall accuracy of 98.31% and 0.97 kappa coefficient in 2016, while overall accuracy 96.54% and kappa coefficient 0.95 in 2021. A combination of machine learning and high-resolution imagery showcased that high classification results can be achieved in monitoring subtle LULC changes. We recommended that all relevant stakeholders, including government officials and municipalities, formulate and adopt policies to protect against LULC degradation.",
        "DOI": "10.5194/isprs-archives-XLVIII-1-W2-2023-967-2023",
        "affiliation_name": "University of the Free State",
        "affiliation_city": "Bloemfontein",
        "affiliation_country": "South Africa",
        "affiliation_id": "60015706",
        "affiliation_state": "Free State"
    },
    {
        "paper_title": "Can AI deliver advice that is judgement-free for science policy?",
        "paper_author": "Canali S.",
        "publication": "Nature",
        "citied_by": "1",
        "cover_date": "2023-12-14",
        "Abstract": "NA",
        "DOI": "10.1038/d41586-023-03949-9",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "CarbonScaler: Leveraging Cloud Workload Elasticity for Optimizing Carbon-Efficiency",
        "paper_author": "Hanafy W.A.",
        "publication": "Proceedings of the ACM on Measurement and Analysis of Computing Systems",
        "citied_by": "14",
        "cover_date": "2023-12-12",
        "Abstract": "Cloud platforms are increasing their emphasis on sustainability and reducing their operational carbon footprint. A common approach for reducing carbon emissions is to exploit the temporal flexibility inherent to many cloud workloads by executing them in periods with the greenest energy and suspending them at other times. Since such suspend-resume approaches can incur long delays in job completion times, we present a new approach that exploits the elasticity of batch workloads in the cloud to optimize their carbon emissions. Our approach is based on the notion of “carbon scaling,” similar to cloud autoscaling, where a job dynamically varies its server allocation based on fluctuations in the carbon cost of the grid’s energy. We develop a greedy algorithm for minimizing a job’s carbon emissions via carbon scaling that is based on the well-known problem of marginal resource allocation. We implement a CarbonScaler prototype in Kubernetes using its autoscaling capabilities and an analytic tool to guide the carbon-efficient deployment of batch applications in the cloud. We then evaluate CarbonScaler using real-world machine learning training and MPI jobs on a commercial cloud platform and show that it can yield i) 51% carbon savings over carbon-agnostic execution; ii) 37% over a state-of-the-art suspend-resume policy; and iii) 8% over the best static scaling policy.",
        "DOI": "10.1145/3626788",
        "affiliation_name": "University of Massachusetts Amherst",
        "affiliation_city": "Amherst",
        "affiliation_country": "United States",
        "affiliation_id": "60014313",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Employability challenges and opportunities under STEM learning with a special focus on apprenticeship and internship",
        "paper_author": "Nayak P.",
        "publication": "STEM: A Multi-Disciplinary Approach to Integrate Pedagogies, Inculcate Innovations and Connections",
        "citied_by": "0",
        "cover_date": "2023-12-11",
        "Abstract": "Employability is a big issue with most HR Professionals and Managers agreeing that most fresh graduates, especially from traditional courses like B. Com, B. Sc., BBM, BCA, BSW, and BA, are not competent to begin work even after the induction program. The skills and knowledge they possess are mostly not industry-relevant and very few candidates have the attitude necessary to pick up necessary skills and knowledge efficiently. STEM Learning is almost unavoidable for future work. In India the new National Education Policy provides an opportunity for the University, while planning the pedagogy of all their courses, to take inputs from HR Managers, Industry Representatives, Chamber of Commerce, and MSME Department Personnel. Similarly, the UN, ILO, EU, and various Government bodies are also banking on STEM learning to address both economic growth and employability issues, which if left unresolved may lead to social problems shortly. Globally STEM is seen as the most reliable and sustainable solution to overcome the challenges brought forth by emerging technologies like AI, IoT, 3D Printing, Machine Learning, Robotics, and other beneficial but disruptive technologies (International Labour Organization, 2021; Ministry of Education, 2021). Most employed persons use only part of their STEM learning in their day-to-day work. It is also a fact that different professions and different tasks need different knowledge, skills, and experience in STEM applications. Different technology in the same industry at the same levels of work also creates different needs for STEM application for employees. This is where Internships and Apprenticeships can help individuals and specific industries design and deliver their unique STEM requirements among potential employees. While formal education syllabi are designed generically keeping in mind the overall job market requirements, the specifics KSE (Knowledge, Skill & Experience) can be delivered through Internships.",
        "DOI": "NA",
        "affiliation_name": "Visvesvaraya Technological University",
        "affiliation_city": "Belagavi",
        "affiliation_country": "India",
        "affiliation_id": "60002978",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Twitter Sentiment Analysis on Political Tweets",
        "paper_author": "Wyawahare M.",
        "publication": "AIP Conference Proceedings",
        "citied_by": "1",
        "cover_date": "2023-12-11",
        "Abstract": "Twitter is one of the most important social media platforms that is used to keep oneself updated about any political or any news. Twitter generally has a word limit, which also limits the words to be detected in the tweets. Twitter has developed into one of the primary platforms for political discourse and public policy discussions. This paper proposes a Twitter sentiment analyser for political tweets using Machine Learning (ML) and Natural Language Processing (NLP). This paper envisions a model which performs sentiment analysis on tweets discussing a particular political or policy topic from a particular date and performs sentiment analysis on that data. The system is trained with a dataset of 160000 tweets commenting on Indian politics. The system uses NLP for pre-processing and feature extraction. Classification is performed using 3 classifiers namely Random forest, Support Vector Machine (SVM) and Bernoulli Naive Bayes. The highest accuracy obtained was 88.36% using SVM classifier.",
        "DOI": "10.1063/5.0182743",
        "affiliation_name": "Vishwakarma Institute of Technology",
        "affiliation_city": "Pune",
        "affiliation_country": "India",
        "affiliation_id": "60099671",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "Attacks and Defences for ML-enhanced Access Control",
        "paper_author": "Llamas J.M.",
        "publication": "Middleware Demos, Posters and Doctoral Symposium 2023: Proceedings of the 24th International Middleware Conference Demos, Posters and Doctoral Symposium, Part of: Middleware 2023",
        "citied_by": "0",
        "cover_date": "2023-12-11",
        "Abstract": "As technological systems grow in complexity, the task of managing authorisation and access control within distributed systems becomes increasingly daunting. Machine learning (ML) emerges as a solution capable of adapting to this intricate landscape by drawing insights from historical data and swiftly determining who should be granted access to specific resources. While the incorporation of machine learning into authorisation and access control yields numerous benefits, it also introduces concerns surrounding how to safeguard the integrity of these ML models that are deployed and utilised in a distributed setting. These challenges represent the focal point of this doctoral research endeavour. The primary objective of this study is to delve into the dynamics of attacks and defences within an hybrid access control middleware, which combines conventional rule-based policies with ML-based classifiers. Additionally, this research will explore managerial aspects essential for enabling dynamic and adaptive authorisation measures.",
        "DOI": "10.1145/3626564.3629102",
        "affiliation_name": "KU Leuven",
        "affiliation_city": "Leuven",
        "affiliation_country": "Belgium",
        "affiliation_id": "60025063",
        "affiliation_state": "Vlaams-Brabant"
    },
    {
        "paper_title": "Discovering Fatigued Movements for Virtual Character Animation",
        "paper_author": "Cheema N.",
        "publication": "Proceedings - SIGGRAPH Asia 2023 Conference Papers, SA 2023",
        "citied_by": "1",
        "cover_date": "2023-12-10",
        "Abstract": "Virtual character animation and movement synthesis have advanced rapidly during recent years, especially through a combination of extensive motion capture datasets and machine learning. A remaining challenge is interactively simulating characters that fatigue when performing extended motions, which is indispensable for the realism of generated animations. However, capturing such movements is problematic, as performing movements like backflips with fatigued variations up to exhaustion raises capture cost and risk of injury. Surprisingly, little research has been done on faithful fatigue modeling. To address this, we propose a deep reinforcement learning-based approach, which - for the first time in literature - generates control policies for full-body physically simulated agents aware of cumulative fatigue. For this, we first leverage Generative Adversarial Imitation Learning (GAIL) to learn an expert policy for the skill; Second, we learn a fatigue policy by limiting the generated constant torque bounds based on endurance time to non-linear, state- and time-dependent limits in the joint-actuation space using a Three-Compartment Controller (3CC) model. Our results demonstrate that agents can adapt to different fatigue and rest rates interactively, and discover realistic recovery strategies without the need for any captured data of fatigued movement.",
        "DOI": "10.1145/3610548.3618176",
        "affiliation_name": "Aalto University",
        "affiliation_city": "Espoo",
        "affiliation_country": "Finland",
        "affiliation_id": "60103653",
        "affiliation_state": "Uusimaa"
    },
    {
        "paper_title": "Trends in the occurrence and accumulation of microplastics in urban soil of Nanjing and their policy implications",
        "paper_author": "Zhou Y.",
        "publication": "Science of the Total Environment",
        "citied_by": "4",
        "cover_date": "2023-12-10",
        "Abstract": "Urban soil is an important sink of terrestrial microplastics (MPs), and understanding their distribution over time is essential for effective pollution management. Here, based on soil MP data from Nanjing, a typical megacity in eastern China, this study analyzed MP accumulation trends using decision tree and time series network based on soil attributes, POI (point of interest), and human activity factors such as urban industrial structure, transportation, water use. We also evaluated the impact of plastic policy interventions. In the past 15 years, MPs in urban soil in Nanjing have gradually increased, and highly polluted areas have also grown. From 2010 to 2020, the concentration of MPs in urban soil increased from 326.7 items/kg to 480.9 items/kg, with high pollution areas expanding from only 2.0 km2 (0.7 %) to 48.7 km2 (14.9 %). The accumulation of MPs was also influenced by changing factors due to urbanization. In the early 21st century, residential areas had the largest effect, while in the later period, public passenger transport and domestic water consumption were the dominant factors. The scenarios simulation suggests recent plastic intervention policies have helped alleviate this rate of increase, but MP source management (e.g., laundry fibers, tire wear) still needs improvement. By the proposed method, the past trend of microplastics in urban soil and their relationship with soil properties and human activities can be accurately revealed, which will be helpful for the formulation of countermeasures to mitigate regional soil MP pollution.",
        "DOI": "10.1016/j.scitotenv.2023.166144",
        "affiliation_name": "Nanjing University of Information Science &amp; Technology",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60064143",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Neural Network-Based Financial Distress Prediction for Listed Companies in China",
        "paper_author": "Kong L.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "As the global economy gradually enters the post-pandemic era, the prediction of financial distress in listed companies is of significant importance to investors and regulatory authorities. This study employs financial data from Chinese listed companies, integrating macroeconomic factors and industry policy information, and applies neural network and LassoNet regression to construct predictive models. By analyzing data from a-share listed companies from 2000 to 2018, this research considers multi-dimensional factors including financial ratios, corporate governance, macroeconomics, and industry policies, aiming to enhance the accuracy of corporate financial distress prediction. The expected results suggest that the neural network model incorporating macroeconomic factors and industry policies can effectivelyidentify the significant factors influencing financial distress and improve the performance of financial distress prediction.",
        "DOI": "10.1145/3659211.3659245",
        "affiliation_name": "Liaoning Normal University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60017010",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Research on Intelligent Tourism of Ancient Villages under the Perspective of Artificial Intelligence - Take Guilin Yueling Village for example",
        "paper_author": "Li N.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "Combined with the relevant development of artificial intelligence big data, the construction of tourism perception analysis model is discussed, based on the existing government information query platform to establish a big data analysis model, which provides an interface for data aggregation and, data prediction Dynamic streaming data processing in the model, real-time collection and aggregation from the government platform, and combined with machine learning algorithms to propose a recommendation strategy aimed at improving tourism perception, which can help government departments formulate relevant support policies for tourist attractions, and finally, the model performance was evaluated through actual data collection, and the results showed that this model can better analyse and predict the tourism perception of residents.",
        "DOI": "10.1145/3659211.3659321",
        "affiliation_name": "Guilin University of Electronic Technology",
        "affiliation_city": "Guilin",
        "affiliation_country": "China",
        "affiliation_id": "60008919",
        "affiliation_state": "Guangxi"
    },
    {
        "paper_title": "Improve the efficiency of deep reinforcement learning through semantic exploration guided by natural language",
        "paper_author": "Guo Z.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "Reinforcement learning is a powerful technique for learning from trial and error, but it often requires a large number of interactions to achieve good performance. In some domains, such as sparse-reward tasks, an oracle that can provide useful feedback or guidance to the agent during the learning process is really of great importance. However, querying the oracle too frequently may be costly or impractical, and the oracle may not always have a clear answer for every situation. Therefore, we propose a novel method for interacting with the oracle in a selective and efficient way, using a retrieval-based approach. Since the interaction can be modeled as a sequence of templated questions and answers, and that there is a large corpus of previous interactions available. We use a neural network to encode the current state of the agent and the oracle, and retrieve the most relevant question from the corpus to ask the oracle. The agent's policy and value function was updated by the oracle's answer. We evaluate our method on an object manipulation task. Our method can significantly improve the efficiency of RL by reducing the number of interactions needed to reach a certain level of performance, compared to baselines that do not use the oracle or use it in a naive way.",
        "DOI": "10.1145/3638584.3638661",
        "affiliation_name": "Institute of Automation Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60018486",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "A-share Trading Strategy Based on MTL-DDPG",
        "paper_author": "Deng W.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "With the development of artificial intelligence, more investors are applying machine learning and deep learning algorithms to financial time series, aiming to improve traditional quantitative trading strategies. However, most of the current research focus on mature institutional-type markets and strategies proposed by the current research lack dynamic adjustment capability, especially in a complex environment with high volatility and strong noise, are difficult to derive a stable and profitable portfolio. In response to the above problems, we fully combine the advantages of artificial intelligence and traditional financial market theory techniques to construct a quantitative trading strategy model MTL-DDPG (Multi Time-scale LSTM Deep Deterministic Policy Gradient) that can obtain excess returns. By conducting back testing and comparing with other classical quantitative trading strategies, we verify that our proposed quantitative trading strategy, MTL-DDPG, achieves good results in the A-share market by obtaining excess returns, and the selected portfolio outperforms the benchmark both in terms of total return and risk management.",
        "DOI": "10.1145/3638584.3638600",
        "affiliation_name": "Beijing University of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022281",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A New Transfer Learning-Based Traffic Classification Algorithm for a Multi-Domain SDN Network",
        "paper_author": "Hoang N.T.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "1",
        "cover_date": "2023-12-07",
        "Abstract": "To enhance the efficiency and resource utilization of a computer network, it is imperative to classify network traffic and implement distinct priority policies. Network traffic classification plays a pivotal role across various domains, including network administration, cybersecurity, and network resource optimization. As encrypted network data undergoes diverse evolution, as evident in datasets from tech giants like Google, Facebook, and YouTube, traditional traffic classification methods have given way to machine learning-based approaches. Given that computer networks are primarily deployed as distributed multi-domain systems, employing machine learning for traffic classification becomes challenging when a new network domain appears with a limited dataset. One potential remedy is to employ transfer learning, allowing knowledge transfer from a pre-trained model in an established domain to a new one. In this paper, we present two contributions. First, a novel algorithm called Multi-class TrAdaBoost-CNN is introduced to tackle the challenge of cross-domain classification in encrypted network services. This algorithm extends the Multi-class TrAdaBoost approach by incorporating a Convolutional Neural Network (CNN) as a weak learner. Secondly, extensive experiments are conducted on two distinct domains characterized by imbalanced data distributions to assess the efficacy of our proposed method. The experimental results clearly demonstrate that our algorithm outperforms the traditional CNN model, achieving remarkable accuracy improvements of up to 16%, even when dealing with extremely limited data.",
        "DOI": "10.1145/3628797.3628804",
        "affiliation_name": "Hanoi University of Civil Engineering",
        "affiliation_city": "Hanoi",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60071395",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "ChatGPT one year on: who is using it, how and why?",
        "paper_author": "Ghassemi M.",
        "publication": "Nature",
        "citied_by": "12",
        "cover_date": "2023-12-07",
        "Abstract": "In just a year, ChatGPT has permeated scientific research. Seven scientists reveal what they have learnt about how the chatbot should — and shouldn’t — be used. [Figure not available: see fulltext.].",
        "DOI": "10.1038/d41586-023-03798-6",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Modeling Indirect Greenhouse Gas Emissions Sources from Urban Wastewater Treatment Plants: Integrating Machine Learning Models to Compensate for Sparse Parameters with Abundant Observations",
        "paper_author": "Huang Y.",
        "publication": "Environmental Science and Technology",
        "citied_by": "6",
        "cover_date": "2023-12-05",
        "Abstract": "Electricity consumption and sludge yield (SY) are important indirect greenhouse gas (GHG) emission sources in wastewater treatment plants (WWTPs). Predicting these byproducts is crucial for tailoring technology-related policy decisions. However, it challenges balancing mass balance models and mechanistic models that respectively have limited intervariable nexus representation and excessive requirements on operational parameters. Herein, we propose integrating two machine learning models, namely, gradient boosting tree (GBT) and deep learning (DL), to precisely pointwise model electricity consumption intensity (ECI) and SY for WWTPs in China. Results indicate that GBT and DL are capable of mining massive data to compensate for the lack of available parameters, providing a comprehensive modeling focusing on operation conditions and designed parameters, respectively. The proposed model reveals that lower ECI and SY were associated with higher treated wastewater volumes, more lenient effluent standards, and newer equipment. Moreover, ECI and SY showed different patterns when influent biochemical oxygen demand is above or below 100 mg/L in the anaerobic-anoxic-oxic process. Therefore, managing ECI and SY requires quantifying the coupling relationships between biochemical reactions instead of isolating each variable. Furthermore, the proposed models demonstrate potential economic-related inequalities resulting from synergizing water pollution and GHG emissions management.",
        "DOI": "10.1021/acs.est.3c06482",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An intellectual design case of compressor airfoils based on reinforcement learning",
        "paper_author": "Xu X.",
        "publication": "Engineering Computations (Swansea, Wales)",
        "citied_by": "1",
        "cover_date": "2023-12-05",
        "Abstract": "Purpose: In general, the existing compressor design methods require abundant knowledge and inspiration. The purpose of this study is to identify an intellectual design optimization method that enables a machine to learn how to design it. Design/methodology/approach: The airfoil design process was solved using the reinforcement learning (RL) method. An intellectual method based on a modified deep deterministic policy gradient (DDPG) algorithm was implemented. The new method was applied to agents to learn the design policy under dynamic constraints. The agents explored the design space with the help of a surrogate model and airfoil parameterization. Findings: The agents successfully learned to design the airfoils. The loss coefficients of a controlled diffusion airfoil improved by 1.25% and 3.23% in the two- and four-dimensional design spaces, respectively. The agents successfully learned to design under various constraints. Additionally, the modified DDPG method was compared with a genetic algorithm optimizer, verifying that the former was one to two orders of magnitude faster in policy searching. The NACA65 airfoil was redesigned to verify the generalization. Originality/value: It is feasible to consider the compressor design as an RL problem. Trained agents can determine and record the design policy and adapt it to different initiations and dynamic constraints. More intelligence is demonstrated than when traditional optimization methods are used. This methodology represents a new, small step toward the intelligent design of compressors.",
        "DOI": "10.1108/EC-07-2022-0502",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Log2Policy: An Approach to Generate Fine-Grained Access Control Rules for Microservices from Scratch",
        "paper_author": "Xu S.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "3",
        "cover_date": "2023-12-04",
        "Abstract": "Microservice application architecture is one of the most widely used service architectures in the industry. To prevent a compromised microservice from abusing other microservices, authorization policy is applied to regulate the access among them. However, configuring access control policy manually is challenging due to the complexity and dynamic nature of microservice applications. In this paper, we present Log2Policy, a novel approach to generate microservice authorization policy based on access logs. Our approach consists of three fundamental techniques: (1) a log-based topological graph generation mechanism that automatically infers the invocation logic among microservices, (2) a machine learning based attributes mining method that extracts the relevant attributes of requests, and (3) a policy upgrade mechanism based on traffic management that can significantly reduce the upgrade time. We have implemented a prototype of Log2Policy on mainstream microservice infrastructures and have evaluated it with several microservice applications. The results show that Log2Policy can generate fine-grained and effective access control rules and upgrade them with negligible overhead.",
        "DOI": "10.1145/3627106.3627137",
        "affiliation_name": "Institute of Information Engineering",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60273040",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "PSP-Mal: Evading Malware Detection via Prioritized Experience-based Reinforcement Learning with Shapley Prior",
        "paper_author": "Zhan D.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "1",
        "cover_date": "2023-12-04",
        "Abstract": "With the widespread application of machine learning techniques in malware detection, researchers have proposed various adversarial attack methods to generate adversarial examples (AEs) of malware, thereby evading detection. Previous studies have shown that the reinforcement learning (RL) framework can enable black-box attacks by performing a sequence of function-preserving operations, which produces functional evasive malware samples. However, it is difficult to obtain the useful guidance and feedbacks from the environment for agent training in the black-box scenario, which results in the RL framework being unable to learn the effective evasion policy. In this paper, we propose the Shapley prior and establish a prior-guidance-based RL framework, namely PSP-Mal, to generate AEs against Portable Executable (PE) malware detectors. Our framework improves on existing methods in three aspects: 1) We explore feature effects of the black-box model by computing Shapley values and further propose the Shapley prior to represent the expected impact of operations. 2) A novel prioritized experience utilization mechanism is established regarding the Shapley prior guidance in the RL framework. 3) The actions are expanded into item-content pairs and we use the Thompson sampling to choose effective content, which helps to reduce randomness and ensure repeatability. We compare the attack performance of our framework with other methods, and experimental results demonstrate that our algorithm is more effective. The evasion rates of PSP-Mal against the LightGBM models trained on EMBER and SOREL-20M reach 76.88% and 72.03%, respectively.",
        "DOI": "10.1145/3627106.3627178",
        "affiliation_name": "Peoples Liberation Army Engineering University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60226539",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Enhancing family education pattern recognition with a random forest algorithm",
        "paper_author": "Xia J.",
        "publication": "Journal of Intelligent and Fuzzy Systems",
        "citied_by": "0",
        "cover_date": "2023-12-02",
        "Abstract": "It is essential to understand family educational patterns to develop effective educational interventions and policies. Academic success, socioemotional development, and the general well-being of adolescents are all significantly affected by family dynamics and practices. Due to the wide range and variety of familial conditions, it cannot be easy to analyze and recognize these patterns. This paper offers an intelligent strategy for effectively identifying and analyzing family education patterns using the random forest (RF) algorithm. We begin by collecting an extensive data set that includes family factors, educational practices, and student outcomes. The raw data is first preprocessed using min-max normalization. Furthermore, we employ principal component analysis (PCA) to extract the pertinent attributes from the preprocessed data. The best features are chosen using the reptile search optimization (RSO) algorithm to increase the accuracy of the random forest. Comparing the empirical results to state-of-the-art methods demonstrates the suggested RF technique's higher effectiveness in identifying family education patterns. The value of performance metrics such as accuracy (94.7%), precision (95.2%), recall (95.7%), and F1 score (96.1%). This strategy uses the RF to deliver insightful data that may guide targeted interventions, regulations, and individualized procedures to help students and their families succeed in education.",
        "DOI": "10.3233/JIFS-234976",
        "affiliation_name": "Capital Normal University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60020256",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "(R)evolutions of Thought: Artificial Intelligence and Education Futures",
        "paper_author": "Abrams S.S.",
        "publication": "Teachers College Record",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "As part of the 125th issue of Teachers College Record, this commentary provides an overview of technological innovation with a focus on the emergence of machine learning and artificial intelligence (AI). The presence and use of AI is a pressing contemporary topic in education, raising questions about the information and perspective(s) AI might privilege, as well as the evolving ethical concerns related to the blurred and increasingly indistinguishable boundaries of human and nonhuman entities and practices.",
        "DOI": "10.1177/01614681241230173",
        "affiliation_name": "University of South Africa",
        "affiliation_city": "Pretoria",
        "affiliation_country": "South Africa",
        "affiliation_id": "60002397",
        "affiliation_state": "Gauteng"
    },
    {
        "paper_title": "Artificial intelligence: pioneering value-based purchasing in healthcare",
        "paper_author": "Al-Hajjar S.",
        "publication": "International Journal of Pediatrics and Adolescent Medicine",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "NA",
        "DOI": "10.4103/ijpam.ijpam_37_24",
        "affiliation_name": "King Faisal Specialist Hospital &amp; Research Centre",
        "affiliation_city": "Riyadh",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60016332",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Identifying Key Issues in Climate Change Litigation: A Machine Learning Text Analytic Approach",
        "paper_author": "Raghupathi W.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "As climate change, environmental, social, and governance (ESG), along with sustainability, become increasingly crucial for businesses and society, there is a noticeable scarcity of information and transparency regarding corporate practices. Often, government agency enforcement actions lead to litigation and are ultimately resolved by court decisions. Moreover, in instances when there is perceived inadequacy in government enforcement, citizens frequently turn to the courts for preventive judgments against businesses or agencies. In an effort to shed light on the multifaceted aspects of climate change, we adopted a novel, exploratory approach to analyze climate change-related litigation cases. Utilizing a blend of machine learning-based text analytics, we have extracted key insights from individual case narratives. Our analysis encompassed over four hundred cases from the Westlaw database through various keyword searches. The emergent topics from our case dataset revolved around four critical environmental themes: forest, land, water, and air emissions. Our findings provide insight into the nature and dimensions of climate change and also carry significant policy implications, laying the groundwork for future research in this domain.",
        "DOI": "10.3390/su152316530",
        "affiliation_name": "Brooklyn College",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60023814",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Do Public-Led Housing Site Development Projects Affect Local Housing Prices: A Proposal for a Comprehensive Policy Evaluation Methodology",
        "paper_author": "Kim J.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "As the population in urban areas increases, the importance of adequate public-led development policies for sustainable cities with affordable housing is becoming more highlighted. In this regard, this study aims to determine the effectiveness of public-led urban development policies for sustainable growth in urban areas, specifically measuring the effect of housing site development projects on housing prices. The geographical scope of the study is the project sites and their surrounding areas in South Korea, and the temporal background is from 2006 to 2023. The project sites were subdivided into four groups by using the Self-Organization Map (SOM), a machine-learning-based clustering analysis, to collect characteristics of each region. Then, the impact of the policy and the prediction of the real estate market of each cluster were analyzed by applying the DID and LSTM models, which have recently been proven to show a high validity. The results show that each cluster had different characteristics and effects from the development projects, depending not simply on the location, but on several characteristics, including the level of size, infrastructure installation, input cost, etc. Furthermore, it is expected for future studies that more detailed research should be conducted with larger datasets of the regional characteristics.",
        "DOI": "10.3390/su152316495",
        "affiliation_name": "Konkuk University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60000142",
        "affiliation_state": "NA"
    }
]