[
    {
        "paper_title": "Agricultural Robots: Technology Progress, Challenges and Trends",
        "paper_author": "Zhao C.",
        "publication": "Smart Agriculture",
        "citied_by": "21",
        "cover_date": "2023-12-30",
        "Abstract": "[Significance] Autonomous and intelligent agricultural machinery, characterized by green intelligence, energy efficiency, and reduced emissions, as well as high intelligence and man-machine collaboration, will serve as the driving force behind global agricultural technology advancements and the transformation of production methods in the context of smart agriculture development. Agricultural robots, which utilize intelligent control and information technology, have the unique advantage of replacing manual labor. They occupy the strategic commanding heights and competitive focus of global agricultural equipment and are also one of the key development directions for accelerating the construction of China's agricultural power. World agricultural powers and China have incorporated the research, development, manufacturing, and promotion of agricultural robots into their national strategies, respectively strengthening the agricultural robot policy and planning layout based on their own agricultural development characteristics, thus driving the agricultural robot industry into a stable growth period. [Progress] This paper firstly delves into the concept and defining features of agricultural robots, alongside an exploration of the global agricultural robot development policy and strategic planning blueprint. Furthermore, sheds light on the growth and development of the global agricultural robotics industry; Then proceeds to analyze the industrial backdrop, cutting-edge advancements, developmental challenges, and crucial technology aspects of three representative agricultural robots, including farmland robots, orchard picking robots, and indoor vegetable production robots. Finally, summarizes the disparity between Chinese agricultural robots and their foreign counterparts in terms of advanced technologies. (1) An agricultural robot is a multi-degree-of-freedom autonomous operating equipment that possesses accurate perception, autonomous decision-making, intelligent control, and automatic execution capabilities specifically designed for agricultural environments. When combined with artificial intelligence, big data, cloud computing, and the Internet of Things, agricultural robots form an agricultural robot application system. This system has relatively mature applications in key processes such as field planting, fertilization, pest control, yield estimation, inspection, harvesting, grafting, pruning, inspection, harvesting, transportation, and livestock and poultry breeding feeding, inspection, disinfection, and milking. Globally, agricultural robots, represented by plant protection robots, have entered the industrial application phase and are gradually realizing commercialization with vast market potential. (2) Compared to traditional agricultural machinery and equipment, agricultural robots possess advantages in performing hazardous tasks, executing batch repetitive work, managing complex field operations, and livestock breeding. In contrast to industrial robots, agricultural robots face technical challenges in three aspects. Firstly, the complexity and unstructured nature of the operating environment. Secondly, the flexibility, mobility, and commoditization of the operation object. Thirdly, the high level of technology and investment required. (3) Given the increasing demand for unmanned and less manned operations in farmland production, China's agricultural robot research, development, and application have started late and progressed slowly. The existing agricultural operation equipment still has a significant gap from achieving precision operation, digital perception, intelligent management, and intelligent decision-making. The comprehensive performance of domestic products lags behind foreign advanced counterparts, indicating that there is still a long way to go for industrial development and application. Firstly, the current agricultural robots predominantly utilize single actuators and operate as single machines, with the development of multi-arm cooperative robots just emerging. Most of these robots primarily engage in rigid operations, exhibiting limited flexibility, adaptability, and functionality. Secondly, the perception of multi-source environments in agricultural settings, as well as the autonomous operation of agricultural robot equipment, relies heavily on human input. Thirdly, the progress of new teaching methods and technologies for human-computer natural interaction is rather slow. Lastly, the development of operational infrastructure is insufficient, resulting in a relatively low degree of \"mechanization\". [Conclusions and Prospects] The paper anticipates the opportunities that arise from the rapid growth of the agricultural robotics industry in response to the escalating global shortage of agricultural labor. It outlines the emerging trends in agricultural robot technology, including autonomous navigation, self-learning, real-time monitoring, and operation control. In the future, the path planning and navigation information perception of agricultural robot autonomy are expected to become more refined. Furthermore, improvements in autonomous learning and cross-scenario operation performance will be achieved. The development of real-time operation monitoring of agricultural robots through digital twinning will also progress. Additionally, cloud-based management and control of agricultural robots for comprehensive operations will experience significant growth. Steady advancements will be made in the innovation and integration of agricultural machinery and techniques.",
        "DOI": "10.12133/j.smartag.SA202312030",
        "affiliation_name": "Beijing Academy of Agriculture and Forestry Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60102081",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Explaining the challenges of accountability in machine learning systems beyond technical obstacles",
        "paper_author": "Palvadi S.K.",
        "publication": "Quantum Innovations at the Nexus of Biomedical Intelligence",
        "citied_by": "0",
        "cover_date": "2023-12-29",
        "Abstract": "The ability to make a note regarding machine learning systems decisions for people is becoming increas¬ingly sought after, particularly in situations where decisions have significant repercussions for those affected and where capability in terms of maintaining is required. To increase comprehension based on referred to as \"black box\" mechanism, explaining ability is frequently cited as a technical obstacle in the design of ML systems and decision procedures. The quantities that ML systems aim to optimize must be specified by their users. This leads to the revealing of policy trade-offs that may have previously been hidden or implicit. Important decisions, as well as judgments, help what may need to be explicitly discussed in public debate as ML's use in policy expands.",
        "DOI": "10.4018/979-8-3693-1479-1.ch003",
        "affiliation_name": "K L Deemed to be University",
        "affiliation_city": "Vaddeswaram",
        "affiliation_country": "India",
        "affiliation_id": "60079446",
        "affiliation_state": "AP"
    },
    {
        "paper_title": "Fortifying the digital forge: Unleashing cybersecurity in the interconnected world of digital manufacturing",
        "paper_author": "Dodiya K.R.",
        "publication": "Emerging Technologies in Digital Manufacturing and Smart Factories",
        "citied_by": "3",
        "cover_date": "2023-12-29",
        "Abstract": "In our interconnected world, cybersecurity is paramount due to IoT, cloud computing, and automation's impact on manufacturing. This chapter underscores digital manufacturing's dependence on interconnected systems and cloud infrastructure, acknowledging risks like data breaches, IP theft, and operational disruptions. It advocates a comprehensive cybersecurity approach encompassing technical measures, organizational policies, staff training, and incident response. The chapter delves into threats like malware, phishing, ransomware, and supply chain attacks, emphasizing continuous monitoring, threat intelligence, and vulnerability management. Additionally, it explores emerging trends like AI and machine learning in cybersecurity, legacy system security, and collaborative efforts among industry players, government agencies, and cybersecurity experts to safeguard digital manufacturing. This chapter aids manufacturers, security experts, and researchers in building secure systems in our connected digital landscape.",
        "DOI": "10.4018/979-8-3693-0920-9.ch014",
        "affiliation_name": "Gujarat University",
        "affiliation_city": "Gujarat",
        "affiliation_country": "India",
        "affiliation_id": "126149593",
        "affiliation_state": "GJ"
    },
    {
        "paper_title": "Correction: Exploration on the mechanism of therapeutic and toxic bidirectional effects of Haizao Yuhu decoction based on machine learning and data mining (Medical Data Mining, (2023), 6, 4, 21, 10.53388/MDM202306021)",
        "paper_author": "Chen Y.H.",
        "publication": "Medical Data Mining",
        "citied_by": "0",
        "cover_date": "2023-12-26",
        "Abstract": "Medical Data Mining published an article entitled Exploration on the mechanism of therapeutic and toxic bidirectional effects of Haizao Yuhu decoction based on machine learning and data mining on 05 September 2023. The proof of this article was confirmed by author on 05 September 2023 without any questions. But on 11 September, 2023, the authors contacted the editorial office to state that the following formula is missing at the end of first paragraph in the section “The stability test of the network”, the error was not found and corrected during the article processing (formula presented) The editorial office considers this correction request to be accordance with the policy of Medical Data Mining and agrees to make the correction. So the full content of first paragraph in the section “The stability test of the network” should be as follows: The performance of the multi-layer network depends on its stability, namely invulnerability. When some nodes in the network are destroyed, the network still maintains connectivity. The invulnerability of the network is widely used in complex microbial communities or flora communities. We introduced this invulnerability measurement to the multilayer network, which can reflect the biological significance of the integrity and stability of the multilayer network of the HYD in the treatment of goiter and causing DILI. The detailed principle and calculation formula were recorded in the article of Wu et al. [16]. The specific calculation formula was: (Formula presented).",
        "DOI": "10.53388/MDM202306026",
        "affiliation_name": "Beijing University of Chinese Medicine",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016424",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "GDPR-oriented intelligent checking method of privacy policies compliance",
        "paper_author": "Li X.",
        "publication": "Chinese Journal of Network and Information Security",
        "citied_by": "2",
        "cover_date": "2023-12-25",
        "Abstract": "The implementation of the EU’s General Data Protection Regulation (GDPR) has resulted in the imposition of over 300 fines since its inception in 2018. These fines include significant penalties for prominent companies like Google, which were penalized for their failure to provide transparent and comprehensible privacy policies. The GDPR, known as the strictest data protection laws in history, has made companies worldwide more cautious when offering cross-border services, particularly to the European Union. The regulation's territorial scope stipulates that it applies to any company providing services to EU citizens, irrespective of their location. This implies that companies worldwide, including domestic enterprises, are required to ensure compliance with GDPR in their privacy policies, especially those involved in international operations. To meet this requirement, an intelligent detection method was introduced. Machine learning and automation technologies were utilized to automatically extract privacy policies from online service companies. The policies were converted into a standardized format with a hierarchical structure. Through natural language processing, the privacy policies were classified, allowing for the identification of relevant GDPR concepts. In addition, a constructed GDPR taxonomy was used in the detection mechanism to identify any missing concepts as required by GDPR. This approach facilitated intelligent detection of GDPR-oriented privacy policy compliance, providing support to domestic enterprises while they provided cross-border services to EU users. Analysis of the corpus samples reveals the current situation that mainstream online service companies generally fail to meet GDPR compliance requirements.",
        "DOI": "10.11959/j.issn.2096-109x.2023088",
        "affiliation_name": "Shanghai Jiao Tong University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025084",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Optimal deep machine learning framework for vibration mitigation of seismically-excited uncertain building structures",
        "paper_author": "Rad A.B.",
        "publication": "Structural Engineering and Mechanics",
        "citied_by": "1",
        "cover_date": "2023-12-25",
        "Abstract": "Deep extreme learning machine (DELM) and multi-verse optimization algorithms (MVO) are hybridized for designing an optimal and adaptive control framework for uncertain buildings. In this approach, first, a robust model predictive control (RMPC) scheme is developed to handle the problem uncertainty. The optimality and adaptivity of the proposed controller are provided by the optimal determination of the tunning weights of the linear programming (LP) cost function for clustered external loads using the MVO. The final control policy is achieved by collecting the clustered data and training them by DELM. The efficiency of the introduced control scheme is demonstrated by the numerical simulation of a ten-story benchmark building subjected to earthquake excitations. The results represent the capability of the proposed framework compared to robust MPC (RMPC), conventional MPC (CMPC), and conventional DELM algorithms in structural motion control.",
        "DOI": "10.12989/sem.2023.88.6.535",
        "affiliation_name": "University of Tabriz",
        "affiliation_city": "Tabriz",
        "affiliation_country": "Iran",
        "affiliation_id": "60006622",
        "affiliation_state": "East Azerbaijan"
    },
    {
        "paper_title": "A machine learning-based admissions support system with a case study on D.K.M. College for Women, Vellore",
        "paper_author": "Vasumathy M.",
        "publication": "Design and Implementation of Higher Education Learners' Learning Outcomes (HELLO)",
        "citied_by": "0",
        "cover_date": "2023-12-22",
        "Abstract": "Building efficient higher education systems is tough for India and other developing countries, especially when it comes to female students. Despite the government's efforts, India did not gain anything from its superb and creative educational policy. The Indian government is cognizant of the particular challenges the current global situation poses for the higher education industry. At Vellore's D.K.M. College for Women, the post-graduation admission rate has considerably declined over the last 12 months. The work is largely focused on the identification of concerns, obstacles, and declining factors of post-graduation admittance from the perspectives of students, parents, teaching staffs, and management. The architecture for the course recommender system and the information flow across it are proposed in this chapter. This approach forecasts the ideal subject pairing, or the subjects that pupils will be most interested in. Here, the authors use a learning management system like Moodle to gather information from students about their course preferences.",
        "DOI": "10.4018/978-1-6684-9472-1.ch017",
        "affiliation_name": "Dhanabhagiyam Krishnasamy Mudaliar College for Women",
        "affiliation_city": "Vellore",
        "affiliation_country": "India",
        "affiliation_id": "60113968",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Accelerating and enhancing the generation of socioeconomic data to inform forced displacement policy and response",
        "paper_author": "Brock P.M.",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2023-12-22",
        "Abstract": "There are now an estimated 114 million forcibly displaced people worldwide, some 88% of whom are in low- and middle-income countries. For governments and international organizations to design effective policies and responses, they require comparable and accessible socioeconomic data on those affected by forced displacement, including host communities. Such data is required to understand needs, as well as interactions between complex drivers of displacement and barriers to durable solutions. However, high-quality data of this kind takes time to collect and is costly. Can the ever-increasing volume of open data and evolving innovative techniques accelerate and enhance its generation? Are there applications of alternative data sources, advanced statistics, and machine-learning that could be adapted for forced displacement settings, considering their specific legal and ethical dimensions? As a catalytic bridge between the World Bank and UNHCR, the Joint Data Center on Forced Displacement convened a workshop to answer these questions. This paper summarizes the emergent messages from the workshop and recommendations for future areas of focus and ways forward for the community of practice on socioeconomic data on forced displacement. Three recommended areas of future focus are: enhancing and optimizing household survey sampling approaches; estimating forced displacement socioeconomic indicators from alternative data sources; and amplifying data accessibility and discoverability. Three key features of the recommended approach are: strong complementarity with the existing data-collection-to-use-pipeline; data responsibility built-in and tailored to forced displacement contexts; and iterative assessment of operational relevance to ensure continuous focus on improving outcomes for those affected by forced displacement.",
        "DOI": "10.1017/dap.2023.47",
        "affiliation_name": "The World Bank, USA",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60112834",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Developing a Dynamic Decision-Support Framework for Higher Education Management Systems through Real-time Information Extraction",
        "paper_author": "Pantin R.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "1",
        "cover_date": "2023-12-21",
        "Abstract": "In the changing world of education, it is crucial for institutions to have the ability to make well informed decisions based on data. This paper presents an innovative Decision Support Framework (DDSF), for managing higher education systems. The DDSF utilizes real time information extraction to improve the decision-making process. It combines data analytics and user centric design to provide insights to education administrators. By gathering data from sources like records, financial reports and social media analytics the DDSF uses natural language processing (NLP) and machine learning (ML) algorithms to extract and interpret real time information. This information is then organized in a manner for analysis. The framework is adaptable allowing for the inclusion of emerging data streams ensuring relevance and usefulness. To evaluate the effectiveness of the DDSF we conducted a pilot study at a university. The results indicated improvements in meeting student needs optimizing resource allocation and enhancing operational efficiency. The framework also enables policy development by foreseeing challenges and identifying opportunities, within the education sector. The DDSF brings about a way of managing education by providing a strong platform for institutions to succeed in a competitive and constantly evolving environment. It emphasizes the significance of extracting real time information to guide planning and operational excellence. Future studies will concentrate on expanding the framework, for use, across institutions and incorporating analytics to improve foresight abilities.",
        "DOI": "10.1145/3644713.3644786",
        "affiliation_name": "Tashkent State University of Economics",
        "affiliation_city": "Tashkent",
        "affiliation_country": "Uzbekistan",
        "affiliation_id": "60071662",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Comparative Analysis of Machine Learning Algorithms for Inflation Rate Classification and Economic Trend Forecasting",
        "paper_author": "Khashimova N.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-21",
        "Abstract": "Predictive modeling of inflation rates is critical for economic policy and risk management. This study compares the efficacy of K-Nearest Neighbors (KNN) and logistic regression algorithms in classifying inflation into 'Low,' 'Medium,' and 'High' categories, which are essential for monitoring and managing economic stability. Through meticulous preprocessing, including outlier removal, normalization, and imputation, the dataset was refined for accurate analysis. The study established inflation thresholds using empirical data and economic theory to create structured categories. The EDA revealed the fluctuating nature of inflation and its long-term trends, providing a clear picture of economic conditions. Logistic regression demonstrated a higher accuracy rate and better performance metrics over KNN, suggesting it as a superior model for inflation classification. The findings emphasize the importance of precise model selection in economic forecasting and propose logistic regression as a robust tool for policy-makers and economists in strategic economic planning.",
        "DOI": "10.1145/3644713.3644749",
        "affiliation_name": "Tashkent State University of Economics",
        "affiliation_city": "Tashkent",
        "affiliation_country": "Uzbekistan",
        "affiliation_id": "60071662",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Optimizing geographic locations for electric vehicle battery recycling preprocessing facilities in California",
        "paper_author": "Haynes M.W.",
        "publication": "RSC Sustainability",
        "citied_by": "3",
        "cover_date": "2023-12-20",
        "Abstract": "Spent lithium-ion batteries (LIBs) at end of life pose several safety risks. Specifically, LIBs have the potential to self-ignite during transport, release toxic compounds during incineration, and can leach contaminants into landfills. Spent LIBs, which are classified as hazardous waste, are also subject to numerous policies and require disposal by certified personnel and companies. These requirements result in an increase in transport costs and volume compared to other waste. Efforts to improve LIB recycling focus primarily on reducing costs to make recycling economically profitable. The greatest emphasis is placed on improving recycling technologies; however, transport costs significantly impact the total cost of LIB recycling. Here, we provide a procedure for choosing an unsupervised machine learning clustering heuristic to identify optimal locations for LIB recycling preprocessing facilities in California. The identified decentralized facility locations minimize the transportation distance and the cost of shipping spent electric vehicle batteries between end-use sector facilities and potential second-use locations.",
        "DOI": "10.1039/d3su00319a",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60136858",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "Multimodal analysis of disinformation and misinformation",
        "paper_author": "Wilson A.",
        "publication": "Royal Society Open Science",
        "citied_by": "5",
        "cover_date": "2023-12-20",
        "Abstract": "The use of disinformation and misinformation campaigns in the media has attracted much attention from academics and policy-makers. Multimodal analysis or the analysis of two or more semiotic systems - language, gestures, images, sounds, among others - in their interrelation and interaction is essential to understanding dis-/misinformation efforts because most human communication goes beyond just words. There is a confluence of many disciplines (e.g. computer science, linguistics, political science, communication studies) that are developing methods and analytical models of multimodal communication. This literature review brings research strands from these disciplines together, providing a map of the multi- and interdisciplinary landscape for multimodal analysis of dis-/misinformation. It records the substantial growth starting from the second quarter of 2020 - the start of the COVID-19 epidemic in Western Europe - in the number of studies on multimodal dis-/misinformation coming from the field of computer science. The review examines that category of studies in more detail. Finally, the review identifies gaps in multimodal research on dis-/misinformation and suggests ways to bridge these gaps including future cross-disciplinary research directions. Our review provides scholars from different disciplines working on dis-/misinformation with a much needed bird's-eye view of the rapidly emerging research of multimodal dis-/misinformation.",
        "DOI": "10.1098/rsos.230964",
        "affiliation_name": "Oxford Social Sciences Division",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60175816",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "Revisiting the dynamics of gaseous ammonia and ammonium aerosols during the COVID-19 lockdown in urban Beijing using machine learning models",
        "paper_author": "Lyu Y.",
        "publication": "Science of the Total Environment",
        "citied_by": "3",
        "cover_date": "2023-12-20",
        "Abstract": "The concentration of atmospheric ammonia (NH3) in urban Beijing substantially decreased during the COVID-19 lockdown (24 January to 3 March 2020), likely due to the reduced human activities. However, quantifying the impact of anthropogenic interventions on NH3 dynamics is challenging, as both meteorology and chemistry mask the real changes in observed NH3 concentrations. Here, we applied machine learning techniques based on random forest models to decouple the impacts of meteorology and emission changes on the gaseous NH3 and ammonium aerosol (NH4+) concentrations in Beijing during the lockdown. Our results showed that the meteorological conditions were unfavorable during the lockdown and tended to cause an increase of 8.4 % in the NH3 concentration. In addition, significant reductions in NOx and SO2 emissions could also elevate NH3 concentrations by favoring NH3 gas-phase partitioning. However, the observed NH3 concentration significantly decreased by 35.9 % during the lockdown, indicating a significant reduction in emissions or enhanced chemical sinks. Rapid gas-to-particle conversion was indeed found during the lockdown. Thus, the observed reduced NH3 concentrations could be partially explained by the enhanced transformation into NH4+. Therefore, the sum of NH3 and NH4+ (collectively, NHx) is a more reliable tracer than NH3 or NH4+ alone to estimate the changes in NH3 emissions. Compared to that under the scenario without lockdowns, the NHx concentration decreased by 26.4 %. We considered that this decrease represents the real decrease in NH3 emissions in Beijing due to the lockdown measures, which was less of a decrease than that based on NH3 only (35.9 %). This study highlights the importance of considering chemical sinks in the atmosphere when applying machine learning techniques to link the concentrations of reactive species with their emissions.",
        "DOI": "10.1016/j.scitotenv.2023.166946",
        "affiliation_name": "National Satellite Meteorological Center Beijing",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60073482",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Soil carbon sequestration potential of cultivated lands and its controlling factors in China",
        "paper_author": "Wang S.",
        "publication": "Science of the Total Environment",
        "citied_by": "5",
        "cover_date": "2023-12-20",
        "Abstract": "Understanding soil organic carbon (SOC) stocks and carbon sequestration potential in cultivated lands can have significant benefit for mitigating climate change and emission reduction. However, there is currently a lack of spatially explicit information on this topic in China, and our understanding of the factors that influence both saturated SOC level (SOCS) and soil organic carbon density (SOCD) remains limited. This study predicted SOCS and SOCD of cultivated lands across mainland China based on point SOC measurements, and mapped its spatial distribution using environmental variables as predictors. Based on the differentiation between SOCS and SOCD, the soil organic carbon sequestration potentials (SOCP) of cultivated land were calculated. Boosted regression trees (BRT), random forest (RF), and support vector machine (SVM) were evaluated as prediction models, and the RF model presented the best performance in predicting SOCS and SOCD based on 10-fold cross-validation. A total of 991 topsoil (0–20 cm) SOC measurements and 12 environmental variables explaining topography, climate, organism, soil properties, and human activity were used as predictors in the model. Both SOCS and SOCD suggested higher SOC levels in northeast China and lower levels in central China. The cultivated lands in China had the potential to sequester about 2.13 ± 0.96 kg m−2 (3.25 Pg) SOC in the top 20 cm soil depth. Northeastern China had the largest SOCP followed by Northern China, and Southwestern China had the lowest SOCP. The primary environmental variables that affected the spatial variation of SOCS were mean annual temperature, followed by clay content and normalized difference vegetation index (NDVI). The assessment and mapping of SOCP in China's cultivated lands holds significance importance as it can provide valuable insights to policymakers and researchers about SOCP, and aid in formulating climate change mitigation strategies.",
        "DOI": "10.1016/j.scitotenv.2023.167292",
        "affiliation_name": "Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60031150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Nitrate prediction in groundwater of data scarce regions: The futuristic fresh-water management outlook",
        "paper_author": "Mahlknecht J.",
        "publication": "Science of the Total Environment",
        "citied_by": "16",
        "cover_date": "2023-12-20",
        "Abstract": "Nitrate contamination in groundwater poses a significant threat to water quality and public health, especially in regions with limited data availability. This study addresses this challenge by employing machine learning (ML) techniques to predict nitrate (NO3−-N) concentrations in Mexico's groundwater. Four ML algorithms—Extreme Gradient Boosting (XGB), Boosted Regression Trees (BRT), Random Forest (RF), and Support Vector Machines (SVM)—were executed to model NO3−-N concentrations across the country. Despite data limitations, the ML models achieved robust predictive performances. XGB and BRT algorithms demonstrated superior accuracy (0.80 and 0.78, respectively). Notably, this was achieved using ∼10 times less information than previous large-scale assessments. The novelty lies in the first-ever implementation of the ‘Support Points-based Split Approach’ during data pre-processing. The models considered initially 68 covariates and identified 13–19 significant predictors of NO3−-N concentration spanning from climate, geomorphology, soil, hydrogeology, and human factors. Rainfall, elevation, and slope emerged as key predictors. A validation incorporated nationwide waste disposal sites, yielding an encouraging correlation. Spatial risk mapping unveiled significant pollution hotspots across Mexico. Regions with elevated NO3−-N concentrations (>10 mg/L) were identified, particularly in the north-central and northeast parts of the country, associated with agricultural and industrial activities. Approximately 21 million people, accounting for 10 % of Mexico's population, are potentially exposed to elevated NO3−-N levels in groundwater. Moreover, the NO3−-N hotspots align with reported NO3−-N health implications such as gastric and colorectal cancer. This study not only demonstrates the potential of ML in data-scarce regions but also offers actionable insights for policy and management strategies. Our research underscores the urgency of implementing sustainable agricultural practices and comprehensive domestic waste management measures to mitigate NO3−-N contamination. Moreover, it advocates for the establishment of effective policies based on real-time monitoring and collaboration among stakeholders.",
        "DOI": "10.1016/j.scitotenv.2023.166863",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Davis",
        "affiliation_country": "United States",
        "affiliation_id": "60153736",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Educational Missions and Tactics in the EU Artificial Intelligence Strategy in the Era of Digital Transformation: A Policy Analysis Based on EU Documents Published During 2018-2022",
        "paper_author": "Xiong Y.",
        "publication": "Advances in Transdisciplinary Engineering",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "In the era of digital transformation, AI, cloud computing, big data, blockchain, and other intelligent technologies have increasingly profound impacts on work, study, life, and especially education. The Publishing of The Age of Artificial Intelligence: Towards a European Strategy for Human-Centric Machines marked the official launch of the EU Artificial Intelligence Strategy. By analyzing policy documents published during 2018 and 2022 for the EU Artificial Intelligence Strategy, it is found that the strategy has set three strategic goals, namely achieving an 'Ecosystem of Excellence', building an 'Ecosystem of Trust', and establishing an 'Ecosystem of Digital Education'. To ensure its implementation, the European Commission has published a series of policy documents successively. As the main driver of the AI strategy, education plays an important role in the development of AI, and the EU has adopted various education tactics in the series of documents. Given the particularity of the EU as a regional cooperation organization, this strategy values philosophy, norms, and cooperation. It also provides a good reference for AI development and digital transformation of society in other countries and brings new opportunities for international cooperation in the field of AI.",
        "DOI": "10.3233/ATDE230999",
        "affiliation_name": "Wenzhou University",
        "affiliation_city": "Wenzhou",
        "affiliation_country": "China",
        "affiliation_id": "60020224",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Development of a Machine Learning Framework Based on Occupant-Related Parameters to Predict Residential Electricity Consumption in the Hot and Humid Climate",
        "paper_author": "Qavidel Fard Z.",
        "publication": "Energy and Buildings",
        "citied_by": "0",
        "cover_date": "2023-12-15",
        "Abstract": "Occupant-related variables constitute one of the most significant groups of factors influencing residential building energy consumption. However, prediction methods often oversimplify these parameters, leading to substantial discrepancies between predicted and actual consumption. To address this issue, the present study aims to develop a machine learning framework for predicting electricity consumption in residential buildings based on occupant-related factors. The study incorporates twenty-six inputs, including occupant characteristics such as demographics, occupancy, behavior, and behavioral efficiency, two time-related factors, and three extra parameters related to equipment (refrigerator age, hot water source, and type of electricity meter) for training and testing the Random Forest (RF) algorithm in both regression and classification forms. The results indicate that the trained RF regressor exhibits well performance (R2Train = 0.989, R2Test = 0.916, MAETrain = 0.81, MAETest = 2.21, RMSETrain = 1.27, and RMSETest = 3.45). Furthermore, feature importance analysis reveals that the most significant parameter is the time of year, representing weather conditions, followed by the number of occupants, neighborhood, indoor set-point range, mean age of occupants, window opening, and cooling system mode. Even after removing the least impactful factors, the model maintains strong performance with the 16 most important variables (R2Train = 0.986, R2Test = 0.910, MAETrain = 0.83, MAETest = 2.25, RMSETrain = 1.31, and RMSETest = 3.49). Additionally, the RF classifier is designed for problems with 2, 4, 6, and 8 classes based on energy consumption ranges. The results of this model demonstrate that the 2-class model achieves the highest performance (AccuracyTest = 0.963, MAETest = 0.04, and RMSETest = 0.19). However, it lacks detailed categorization of homes based on electricity consumption. On the other hand, the 4-class and 6-class models strike a good balance between prediction performance and the level of detail. In conclusion, the proposed method can accurately predict residential electricity consumption and can serve as a valuable reference for researchers and utility managers when formulating energy reduction policies and comparing the effectiveness of different strategies.",
        "DOI": "10.1016/j.enbuild.2023.113678",
        "affiliation_name": "Shahid Beheshti University",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60032873",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Advancing COP26 climate goals: Leveraging energy innovation, governance readiness, and socio-economic factors for enhanced climate resilience and sustainability",
        "paper_author": "Sarkodie S.A.",
        "publication": "Journal of Cleaner Production",
        "citied_by": "8",
        "cover_date": "2023-12-15",
        "Abstract": "Climate change adaptation and mitigation remain critical to achieving sustainable development while reducing climate vulnerability, particularly among climate-exposed and sensitive regions. Yet, achieving a balance between climate-resilience pathways, high economic productivity, high human development, and energy efficiency appears complex, leading to potential trade-offs. Here, we examine the overarching effect of the diversified energy portfolio, socio-economic drivers, and governance adaptation readiness on Climate change vulnerability across 212 economies. Contrary to the poor conventional panel techniques reported in the existing literature, we employ novel machine learning and dynamic panel estimation techniques that control for chaos, nonlinearity, mutual coupling, and heterogeneity in dynamic systems. The convergent cross-mapping causality technique reveals mutual coupling effects between energy portfolio, governance readiness, socio-economic drivers, and climate change vulnerability. The rapidly increasing population and increasing demand for resources under the business-as-usual society and economic structure that normalizes unsustainable development pathways due to weak governance structures create ineffective climate-resilient policies that lead to unabated emissions with consequences on climate change. The effect of social and governance readiness leads the transformation process to attain sustainable development. Thus, high social and governance readiness spurs climate resilience through climate change adaptation and mitigation to achieve sustainable development. Alternative (renewables) and nuclear energy have displacement effects on fossil fuels, yet, the magnitude of displacement is not large enough to replace future fossil fuel consumption. Conversely, a low-carbon future is still attainable by replacing the fossil energy portfolio with more natural gas and carbon-abatement technologies. Our study demonstrates that energy innovations are useful climate-resilience pathways that lessen climate change vulnerability.",
        "DOI": "10.1016/j.jclepro.2023.139757",
        "affiliation_name": "Nord Universitet",
        "affiliation_city": "Bodo",
        "affiliation_country": "Norway",
        "affiliation_id": "60021876",
        "affiliation_state": "Nordland"
    },
    {
        "paper_title": "A Free and open-source microgrid optimization tool: SAMA the solar alone Multi-Objective Advisor",
        "paper_author": "Ali Sadat S.",
        "publication": "Energy Conversion and Management",
        "citied_by": "9",
        "cover_date": "2023-12-15",
        "Abstract": "Although there are many software tools for simulations of hybrid energy systems, Homer Pro and Homer Grid are the only tools offering optimal sizing of hybrid energy systems. Originally developed as open-source software, they have been closed, which limits user-developers abilities to adapt and improve the software. In addition, all current proprietary offering suffer from the following limitations: i) high costs that limit accessibility to low-resource labs and individuals, ii) incapable of conducting multi-objective optimization, iii) constrained on any new innovations in hybrid energy system design and operation, iv) difficulties for users to specifically define prices and costs in inputs, v) inability to model different electric utility billing structures, vi) complex pricing methodology, and vii) the absence of machine learning-based predictive modeling. To overcome these limitations, this paper introduces and validates SAMA (Solar Alone Multi-objective Advisor), an open-source microgrid optimization software program designed to optimize hybrid energy system sizes economically using metaheuristic algorithms based on specific load profiles and meteorological data. Through rigorous validation exercises, SAMA's outcomes are compared against those generated by the Homer Pro software across distinct climatic conditions and geographical locations (i.e., Sacramento, California in the marine west coast and New Bern in humid continental climate zones of U.S., respectively). The results demonstrate congruence between SAMA and Homer Pro. SAMA can be used for a diverse array of applications from renewable energy systems to off-grid and grid-tied configurations, and from policy formulation to feasibility assessment. Unique features of SAMA include multi-objective optimizer, levelized emission optimization, different pre-defined utility billing structures, and a top-down pricing methodology. These features further enhance SAMA's adaptability, allowing users to tailor the software to their specific needs and system configurations. Finally, the paper anticipates future advancements that could refine component modeling, accelerate optimization processes, and incorporate advanced data analysis techniques such as machine learning to predict energy demand and production patterns.",
        "DOI": "10.1016/j.enconman.2023.117686",
        "affiliation_name": "Ivey Business School",
        "affiliation_city": "London",
        "affiliation_country": "Canada",
        "affiliation_id": "60115928",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Patterns and drivers of carbon stock change in ecological restoration regions: A case study of upper Yangtze River Basin, China",
        "paper_author": "Quan Y.",
        "publication": "Journal of Environmental Management",
        "citied_by": "7",
        "cover_date": "2023-12-15",
        "Abstract": "Balancing ecology and human development has been a long and wide concern. The upper Yangtze River Basin (UYRB) of China has implemented large important ecological restoration projects since the last century. These restoration practices have changed land use patterns within the UYRB, consequently impacting the local carbon cycle. The most noteworthy project is the Grain for Green Program, which returns cropland to natural vegetation (forest and grassland). Yet the effects of restoration on land use change, carbon sequestration, and associated food production remain unclear. This study utilized remote sensing data and conversion coefficients to analyze the ecological-policy-induced land use changes of the UYRB from 2000 to 2020 and their impacts on terrestrial carbon sequestration. Linear regression, machine learning, and structural equation modeling (SEM) were utilized to evaluate the correlations between environmental and socio-economic factors and the distribution of carbon stocks. The results indicated positive effects of ecological activities on the UYRB, despite decreases in cropland. Over the past 20 years, the UYRB had sequestered carbon by a total amount of 1796 ± 926 Mt C. The spatial distribution of sequestered carbon demonstrated a strong correlation with slopes, followed by temperatures. The SEM results indicated that agricultural production and carbon sequestration were enhanced synergically under land use changes. This further demonstrated the effectiveness of these land policies in achieving a balance between crop productivity and ecology protection. We emphasized the importance of vegetation restoration in achieving carbon neutrality and the necessity to continue these projects. We suggested a more reasonable land management for the future UYRB based on the characteristics of each geographical subregion. This work serves as an example of effective land management to other locations worldwide perusing the harmony of ecological restoration and human development.",
        "DOI": "10.1016/j.jenvman.2023.119376",
        "affiliation_name": "Southwest University",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60122052",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Driving style-aware energy management for battery/supercapacitor electric vehicles using deep reinforcement learning",
        "paper_author": "Wu Y.",
        "publication": "Journal of Energy Storage",
        "citied_by": "9",
        "cover_date": "2023-12-15",
        "Abstract": "Driving style can significantly affect the energy consumption, battery lifespan, and driving economy of electric vehicles. In this context, this paper proposes a novel driving style-aware energy management strategy for electric vehicles with battery/supercapacitor hybrid energy storage systems based on deep reinforcement learning. Firstly, a semi-supervised support vector machine-based driving style recognition method is presented to recognize the driving style, where twenty features are extracted from limited labeled velocity/acceleration data and then reduced to six dimensions by locally linear embedding. The six dimension features are used to obtain accurate recognition results. Then a proximal policy optimization-based energy management strategy is proposed with the driving style as an additional input state, to optimize the power allocation and minimize the battery capacity loss cost. Extensive results illustrate the effectiveness of the proposed methods, e.g., the proposed driving style recognition method can recognize the real-time driving style with an accuracy of over 95%. Taking the recognized style as input, the proposed driving style-aware energy management strategy can reduce the battery capacity loss cost by 3.30–4.19% and 1.77–8.15%, compared with no driving style and incorrect driving style input energy management methods, respectively.",
        "DOI": "10.1016/j.est.2023.109199",
        "affiliation_name": "Changsha University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60019338",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "A novel online learning-based linear quadratic regulator for vanadium redox flow battery in DC microgrids",
        "paper_author": "Liu Y.",
        "publication": "Journal of Power Sources",
        "citied_by": "1",
        "cover_date": "2023-12-15",
        "Abstract": "This paper proposes a novel learning-based linear quadratic regulator (LQR) to overcome the long-lasting problem of model dependency in the existing vanadium redox flow battery (VRB) control approaches. Compared to the conventional model-dependent control methods, such as PI control and model predictive control (MPC), the proposed method automatically updates the optimal control policy through the online learning mechanism without any knowledge of the VRB system dynamics. The ability of the proposed method to handle uncertainties is verified by simulations under various scenarios.",
        "DOI": "10.1016/j.jpowsour.2023.233672",
        "affiliation_name": "The University of Western Australia",
        "affiliation_city": "Perth",
        "affiliation_country": "Australia",
        "affiliation_id": "60031806",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Closed-Loop Soft Robot Control Frameworks with Coordinated Policies Based on Reinforcement Learning and Proprioceptive Self-Sensing",
        "paper_author": "Ju H.",
        "publication": "Advanced Functional Materials",
        "citied_by": "5",
        "cover_date": "2023-12-15",
        "Abstract": "Recent advances in soft robots have been achieved by using compliant materials and exploiting the advantages of the soft structural designs of living organisms. Living organisms (which have theoretically infinite degrees of freedom) are not only mechanically soft but are also capable of smooth harmonic motions, thanks to global coordination and the individual sensing and control of local tissues. Despite improvements in structural designs, few soft robot control frameworks for global object-oriented behaviors are reported. Such a framework will require the use of multiple segments, with local sensing and independent control using coordinated policies. Here, a class of reinforcement learning based control frameworks for soft robots (with high degrees of freedom) is presented, and their ability to conduct global tasks is demonstrated. Coordinated control policies are formulated to control multiple segments with independently controllable embedded actuators, based on localized proprioceptive self-sensing capabilities. The control frameworks are employed to develop soft physical robots. Demonstrations and experiments include the forward and backward locomotion of multichannel soft robotic flatworms. This approach is applicable to multifunctional, high degrees of freedom soft robots, as demonstrated by experiments with light-sensitive locomotion.",
        "DOI": "10.1002/adfm.202304642",
        "affiliation_name": "Gwangju Institute of Science and Technology",
        "affiliation_city": "Gwangju",
        "affiliation_country": "South Korea",
        "affiliation_id": "60068688",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A hybrid machine learning framework for forecasting house price",
        "paper_author": "Zhan C.",
        "publication": "Expert Systems with Applications",
        "citied_by": "14",
        "cover_date": "2023-12-15",
        "Abstract": "House price prediction is one of the most important factors affecting national real estate policies. However, developing an accurate housing price prediction model is a significant challenge for the real estate market. This study presents a framework of house price prediction models that address this issue by improving forecasting performance, explicitly demonstrating the novelty in the Hybrid Bayesian Optimization (HBO) models combined with Stacking (HBOS), Bagging (HBOB), and Transformer (HBOT) techniques. These hybrid models employ Bayesian Optimization for hyperparameter tuning, leading to superior prediction accuracy and stability. Additionally, the proposed framework can assess a statistical and accurate assessment of the predictive performance of house price forecasting models in different scenarios. Furthermore, we constructed a multi-source dataset containing 1,898,175 transactions of the Hong Kong real estate market covering a period from January 2, 1996, to May 13, 2021. This dataset, another major contribution to the field, enables comprehensive model testing and could be a valuable resource for future research. Then, the proposed hybrid models are compared with 18 benchmark models. Thirteen evaluation metrics are used to evaluate the predictive performance, while the non-parametric testing, including Friedman, Iman–Davenport, and Nemenyi post-hoc tests methods, are adopted to assess the significance of differences in the predictive performance of each model. The experimental results show that the HBOS models are superior to the other benchmark models for application in the house price prediction problem. The HBOS-CatBoost model showed superior performance in terms of RMSE compared to both the HBOB-XGBoost and HBOT-ConvLSTM models, with relative RMSE reductions of 5.11% and 25.56%, respectively. The main contributions of this work are the creation of a rich multi-source dataset, the proposal of novel hybrid models for improved house price prediction, and a comprehensive performance evaluation framework. These findings offer a significant step forward in the housing price prediction field.",
        "DOI": "10.1016/j.eswa.2023.120981",
        "affiliation_name": "Nanfang College of Sun Yet-sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60117185",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Practical machine learning: Forecasting daily financial markets directions",
        "paper_author": "Henrique B.M.",
        "publication": "Expert Systems with Applications",
        "citied_by": "9",
        "cover_date": "2023-12-15",
        "Abstract": "Financial time series prediction has many applications in economics, but producing profitable strategies certainly has a special place among them, a daunting challenge. Statistical and machine learning techniques are intensively researched in the search for a holy grail of stock markets forecasting. However, it is not clear to prospecting researchers how good those popular models are regarding useful predictions on a real scenario. This paper contributes to that discussion, providing decisive evidences contrary to the use of basic out-of-the-box models, specifically Artificial Neural Networks (ANN), Support Vector Machines (SVM), Random Forest (RF) and Naive-Bayes (NB). Results consider optimistic and unreal variables often found in literature, as well as a more close-to-real simulation of the models usage. Specifically, current day closing prices direction forecasting results are contrasted with those on next day forecasts. As expected, when forecasting the current day, accuracy is almost perfect. However, when used to forecast next day closing direction, with a strict data separation policy and without direction or snooping bias, ANN, SVM, RF and NB produce results essentially equal to random guessing. The main achieved result is the demonstration of how a machine learning approach would fare in a support decision system for forecasting short-term future market direction, regardless of the level of market development, considering more than 100 securities in a 10 years period. Consequences for algorithmic trading relate to discouraging usage of the considered models as implemented here. On a more abstract sense, this paper presents more evidence to the Efficient Market Hypothesis (EMH).",
        "DOI": "10.1016/j.eswa.2023.120840",
        "affiliation_name": "Universidade de Brasília",
        "affiliation_city": "Brasilia",
        "affiliation_country": "Brazil",
        "affiliation_id": "60024989",
        "affiliation_state": "DF"
    },
    {
        "paper_title": "Understanding User Equilibrium States of Road Networks using Big Trajectory Data",
        "paper_author": "Chen B.Y.",
        "publication": "International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "User equilibrium (UE) has long been regarded as the cornerstone of transport planning studies. Despite its fundamental importance, our understanding of the actual UE state of road networks has remained surprisingly incomplete. Using big datasets of taxi trajectories, this study investigates the UE states of road networks in Wuhan. Effective indicators, namely relative gaps, are introduced to quantify how actual traffic states deviate from theoretical UE states. Advanced machine learning techniques, including XGBoost and SHAP values, are employed to analyze nonlinear relationships between network disequilibrium states and seven influencing factors extracted from trajectory data. The results reveal significant gaps between actual traffic states and the theoretical UE states at various times of the day during both weekdays and weekends. The XGBoost analysis shows that differences in travel distances, travel speeds, and signalized intersection numbers among alternative routes are the primary causes of road network disequilibrium. The results of this study could have several important methodological and policy implications for using the UE models in transport applications.",
        "DOI": "10.5194/isprs-archives-XLVIII-1-W2-2023-331-2023",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "UNDERSTANDING THE IMPACTS OF CROP DIVERSIFICATION IN THE CONTEXT OF CLIMATE CHANGE: A MACHINE LEARNING APPROACH",
        "paper_author": "Giannarakis G.",
        "publication": "International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "The concept of sustainable intensification in agriculture necessitates the implementation of management practices that prioritize sustainability without compromising productivity. However, the effects of such practices are known to depend on environmental conditions, and are therefore expected to change as a result of a changing climate. We study the impact of crop diversification on productivity in the context of climate change. We leverage heterogeneous Earth Observation data and contribute a data-driven approach based on causal machine learning for understanding how crop diversification impacts may change in the future. We apply this method to the country of Cyprus throughout a 4-year period. We find that, on average, crop diversification significantly benefited the net primary productivity of crops, increasing it by 2.8%. The effect generally synergized well with higher maximum temperatures and lower soil moistures. In a warmer and more drought-prone climate, we conclude that crop diversification exhibits promising adaptation potential and is thus a sensible policy choice with regards to agricultural productivity for present and future.",
        "DOI": "10.5194/isprs-archives-XLVIII-1-W2-2023-1379-2023",
        "affiliation_name": "Cyprus University of Technology",
        "affiliation_city": "Limassol",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60077474",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Classification of Urban Land Use and Land Cover with K-Nearest Neighbour Classifier in the City of Cape Town, South Africa – Cape Flats Case Study",
        "paper_author": "Lefulebe B.E.",
        "publication": "International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences - ISPRS Archives",
        "citied_by": "0",
        "cover_date": "2023-12-14",
        "Abstract": "The rapid growth of cities, owing to rural-urban migration and high birth rate has resulted in encroachment of the land use and land cover (LULC) in the Cape Flats, situated north of Cape Town, Western Cape, South Africa. PlanetScope imagery and K-Nearest Neighbour (KNN) classifier are used to map and monitor the following LULC classes within the Cape Flats; waterbodies, trees, built-up, and vegetation, we further do a time series map between 2016 and 2021. The results showed that LULC changes between 2016 to 2021 are as follows: a decrease of 2.1% in vegetation, 0.4% in water bodies, and 11% in trees. Built-up areas, on the other hand, showed a significant increase of 13.6% over five years. The LULC changes in the Cape Flats were mainly triggered by an increase in built-up areas due to household construction to accommodate the increased population resulting from rural-to-urban migration and high birth rate. Classification accuracy from 2016 and 2021 was as follows; overall accuracy of 98.31% and 0.97 kappa coefficient in 2016, while overall accuracy 96.54% and kappa coefficient 0.95 in 2021. A combination of machine learning and high-resolution imagery showcased that high classification results can be achieved in monitoring subtle LULC changes. We recommended that all relevant stakeholders, including government officials and municipalities, formulate and adopt policies to protect against LULC degradation.",
        "DOI": "10.5194/isprs-archives-XLVIII-1-W2-2023-967-2023",
        "affiliation_name": "University of the Free State",
        "affiliation_city": "Bloemfontein",
        "affiliation_country": "South Africa",
        "affiliation_id": "60015706",
        "affiliation_state": "Free State"
    },
    {
        "paper_title": "Can AI deliver advice that is judgement-free for science policy?",
        "paper_author": "Canali S.",
        "publication": "Nature",
        "citied_by": "1",
        "cover_date": "2023-12-14",
        "Abstract": "NA",
        "DOI": "10.1038/d41586-023-03949-9",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "CarbonScaler: Leveraging Cloud Workload Elasticity for Optimizing Carbon-Efficiency",
        "paper_author": "Hanafy W.A.",
        "publication": "Proceedings of the ACM on Measurement and Analysis of Computing Systems",
        "citied_by": "14",
        "cover_date": "2023-12-12",
        "Abstract": "Cloud platforms are increasing their emphasis on sustainability and reducing their operational carbon footprint. A common approach for reducing carbon emissions is to exploit the temporal flexibility inherent to many cloud workloads by executing them in periods with the greenest energy and suspending them at other times. Since such suspend-resume approaches can incur long delays in job completion times, we present a new approach that exploits the elasticity of batch workloads in the cloud to optimize their carbon emissions. Our approach is based on the notion of “carbon scaling,” similar to cloud autoscaling, where a job dynamically varies its server allocation based on fluctuations in the carbon cost of the grid’s energy. We develop a greedy algorithm for minimizing a job’s carbon emissions via carbon scaling that is based on the well-known problem of marginal resource allocation. We implement a CarbonScaler prototype in Kubernetes using its autoscaling capabilities and an analytic tool to guide the carbon-efficient deployment of batch applications in the cloud. We then evaluate CarbonScaler using real-world machine learning training and MPI jobs on a commercial cloud platform and show that it can yield i) 51% carbon savings over carbon-agnostic execution; ii) 37% over a state-of-the-art suspend-resume policy; and iii) 8% over the best static scaling policy.",
        "DOI": "10.1145/3626788",
        "affiliation_name": "University of Massachusetts Amherst",
        "affiliation_city": "Amherst",
        "affiliation_country": "United States",
        "affiliation_id": "60014313",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Employability challenges and opportunities under STEM learning with a special focus on apprenticeship and internship",
        "paper_author": "Nayak P.",
        "publication": "STEM: A Multi-Disciplinary Approach to Integrate Pedagogies, Inculcate Innovations and Connections",
        "citied_by": "0",
        "cover_date": "2023-12-11",
        "Abstract": "Employability is a big issue with most HR Professionals and Managers agreeing that most fresh graduates, especially from traditional courses like B. Com, B. Sc., BBM, BCA, BSW, and BA, are not competent to begin work even after the induction program. The skills and knowledge they possess are mostly not industry-relevant and very few candidates have the attitude necessary to pick up necessary skills and knowledge efficiently. STEM Learning is almost unavoidable for future work. In India the new National Education Policy provides an opportunity for the University, while planning the pedagogy of all their courses, to take inputs from HR Managers, Industry Representatives, Chamber of Commerce, and MSME Department Personnel. Similarly, the UN, ILO, EU, and various Government bodies are also banking on STEM learning to address both economic growth and employability issues, which if left unresolved may lead to social problems shortly. Globally STEM is seen as the most reliable and sustainable solution to overcome the challenges brought forth by emerging technologies like AI, IoT, 3D Printing, Machine Learning, Robotics, and other beneficial but disruptive technologies (International Labour Organization, 2021; Ministry of Education, 2021). Most employed persons use only part of their STEM learning in their day-to-day work. It is also a fact that different professions and different tasks need different knowledge, skills, and experience in STEM applications. Different technology in the same industry at the same levels of work also creates different needs for STEM application for employees. This is where Internships and Apprenticeships can help individuals and specific industries design and deliver their unique STEM requirements among potential employees. While formal education syllabi are designed generically keeping in mind the overall job market requirements, the specifics KSE (Knowledge, Skill & Experience) can be delivered through Internships.",
        "DOI": "NA",
        "affiliation_name": "Visvesvaraya Technological University",
        "affiliation_city": "Belagavi",
        "affiliation_country": "India",
        "affiliation_id": "60002978",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "Twitter Sentiment Analysis on Political Tweets",
        "paper_author": "Wyawahare M.",
        "publication": "AIP Conference Proceedings",
        "citied_by": "1",
        "cover_date": "2023-12-11",
        "Abstract": "Twitter is one of the most important social media platforms that is used to keep oneself updated about any political or any news. Twitter generally has a word limit, which also limits the words to be detected in the tweets. Twitter has developed into one of the primary platforms for political discourse and public policy discussions. This paper proposes a Twitter sentiment analyser for political tweets using Machine Learning (ML) and Natural Language Processing (NLP). This paper envisions a model which performs sentiment analysis on tweets discussing a particular political or policy topic from a particular date and performs sentiment analysis on that data. The system is trained with a dataset of 160000 tweets commenting on Indian politics. The system uses NLP for pre-processing and feature extraction. Classification is performed using 3 classifiers namely Random forest, Support Vector Machine (SVM) and Bernoulli Naive Bayes. The highest accuracy obtained was 88.36% using SVM classifier.",
        "DOI": "10.1063/5.0182743",
        "affiliation_name": "Vishwakarma Institute of Technology",
        "affiliation_city": "Pune",
        "affiliation_country": "India",
        "affiliation_id": "60099671",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "Attacks and Defences for ML-enhanced Access Control",
        "paper_author": "Llamas J.M.",
        "publication": "Middleware Demos, Posters and Doctoral Symposium 2023: Proceedings of the 24th International Middleware Conference Demos, Posters and Doctoral Symposium, Part of: Middleware 2023",
        "citied_by": "0",
        "cover_date": "2023-12-11",
        "Abstract": "As technological systems grow in complexity, the task of managing authorisation and access control within distributed systems becomes increasingly daunting. Machine learning (ML) emerges as a solution capable of adapting to this intricate landscape by drawing insights from historical data and swiftly determining who should be granted access to specific resources. While the incorporation of machine learning into authorisation and access control yields numerous benefits, it also introduces concerns surrounding how to safeguard the integrity of these ML models that are deployed and utilised in a distributed setting. These challenges represent the focal point of this doctoral research endeavour. The primary objective of this study is to delve into the dynamics of attacks and defences within an hybrid access control middleware, which combines conventional rule-based policies with ML-based classifiers. Additionally, this research will explore managerial aspects essential for enabling dynamic and adaptive authorisation measures.",
        "DOI": "10.1145/3626564.3629102",
        "affiliation_name": "KU Leuven",
        "affiliation_city": "Leuven",
        "affiliation_country": "Belgium",
        "affiliation_id": "60025063",
        "affiliation_state": "Vlaams-Brabant"
    },
    {
        "paper_title": "Discovering Fatigued Movements for Virtual Character Animation",
        "paper_author": "Cheema N.",
        "publication": "Proceedings - SIGGRAPH Asia 2023 Conference Papers, SA 2023",
        "citied_by": "1",
        "cover_date": "2023-12-10",
        "Abstract": "Virtual character animation and movement synthesis have advanced rapidly during recent years, especially through a combination of extensive motion capture datasets and machine learning. A remaining challenge is interactively simulating characters that fatigue when performing extended motions, which is indispensable for the realism of generated animations. However, capturing such movements is problematic, as performing movements like backflips with fatigued variations up to exhaustion raises capture cost and risk of injury. Surprisingly, little research has been done on faithful fatigue modeling. To address this, we propose a deep reinforcement learning-based approach, which - for the first time in literature - generates control policies for full-body physically simulated agents aware of cumulative fatigue. For this, we first leverage Generative Adversarial Imitation Learning (GAIL) to learn an expert policy for the skill; Second, we learn a fatigue policy by limiting the generated constant torque bounds based on endurance time to non-linear, state- and time-dependent limits in the joint-actuation space using a Three-Compartment Controller (3CC) model. Our results demonstrate that agents can adapt to different fatigue and rest rates interactively, and discover realistic recovery strategies without the need for any captured data of fatigued movement.",
        "DOI": "10.1145/3610548.3618176",
        "affiliation_name": "Aalto University",
        "affiliation_city": "Espoo",
        "affiliation_country": "Finland",
        "affiliation_id": "60103653",
        "affiliation_state": "Uusimaa"
    },
    {
        "paper_title": "Trends in the occurrence and accumulation of microplastics in urban soil of Nanjing and their policy implications",
        "paper_author": "Zhou Y.",
        "publication": "Science of the Total Environment",
        "citied_by": "4",
        "cover_date": "2023-12-10",
        "Abstract": "Urban soil is an important sink of terrestrial microplastics (MPs), and understanding their distribution over time is essential for effective pollution management. Here, based on soil MP data from Nanjing, a typical megacity in eastern China, this study analyzed MP accumulation trends using decision tree and time series network based on soil attributes, POI (point of interest), and human activity factors such as urban industrial structure, transportation, water use. We also evaluated the impact of plastic policy interventions. In the past 15 years, MPs in urban soil in Nanjing have gradually increased, and highly polluted areas have also grown. From 2010 to 2020, the concentration of MPs in urban soil increased from 326.7 items/kg to 480.9 items/kg, with high pollution areas expanding from only 2.0 km2 (0.7 %) to 48.7 km2 (14.9 %). The accumulation of MPs was also influenced by changing factors due to urbanization. In the early 21st century, residential areas had the largest effect, while in the later period, public passenger transport and domestic water consumption were the dominant factors. The scenarios simulation suggests recent plastic intervention policies have helped alleviate this rate of increase, but MP source management (e.g., laundry fibers, tire wear) still needs improvement. By the proposed method, the past trend of microplastics in urban soil and their relationship with soil properties and human activities can be accurately revealed, which will be helpful for the formulation of countermeasures to mitigate regional soil MP pollution.",
        "DOI": "10.1016/j.scitotenv.2023.166144",
        "affiliation_name": "Nanjing University of Information Science &amp; Technology",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60064143",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Neural Network-Based Financial Distress Prediction for Listed Companies in China",
        "paper_author": "Kong L.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "As the global economy gradually enters the post-pandemic era, the prediction of financial distress in listed companies is of significant importance to investors and regulatory authorities. This study employs financial data from Chinese listed companies, integrating macroeconomic factors and industry policy information, and applies neural network and LassoNet regression to construct predictive models. By analyzing data from a-share listed companies from 2000 to 2018, this research considers multi-dimensional factors including financial ratios, corporate governance, macroeconomics, and industry policies, aiming to enhance the accuracy of corporate financial distress prediction. The expected results suggest that the neural network model incorporating macroeconomic factors and industry policies can effectivelyidentify the significant factors influencing financial distress and improve the performance of financial distress prediction.",
        "DOI": "10.1145/3659211.3659245",
        "affiliation_name": "Liaoning Normal University",
        "affiliation_city": "Dalian",
        "affiliation_country": "China",
        "affiliation_id": "60017010",
        "affiliation_state": "Liaoning"
    },
    {
        "paper_title": "Research on Intelligent Tourism of Ancient Villages under the Perspective of Artificial Intelligence - Take Guilin Yueling Village for example",
        "paper_author": "Li N.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "Combined with the relevant development of artificial intelligence big data, the construction of tourism perception analysis model is discussed, based on the existing government information query platform to establish a big data analysis model, which provides an interface for data aggregation and, data prediction Dynamic streaming data processing in the model, real-time collection and aggregation from the government platform, and combined with machine learning algorithms to propose a recommendation strategy aimed at improving tourism perception, which can help government departments formulate relevant support policies for tourist attractions, and finally, the model performance was evaluated through actual data collection, and the results showed that this model can better analyse and predict the tourism perception of residents.",
        "DOI": "10.1145/3659211.3659321",
        "affiliation_name": "Guilin University of Electronic Technology",
        "affiliation_city": "Guilin",
        "affiliation_country": "China",
        "affiliation_id": "60008919",
        "affiliation_state": "Guangxi"
    },
    {
        "paper_title": "Improve the efficiency of deep reinforcement learning through semantic exploration guided by natural language",
        "paper_author": "Guo Z.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "Reinforcement learning is a powerful technique for learning from trial and error, but it often requires a large number of interactions to achieve good performance. In some domains, such as sparse-reward tasks, an oracle that can provide useful feedback or guidance to the agent during the learning process is really of great importance. However, querying the oracle too frequently may be costly or impractical, and the oracle may not always have a clear answer for every situation. Therefore, we propose a novel method for interacting with the oracle in a selective and efficient way, using a retrieval-based approach. Since the interaction can be modeled as a sequence of templated questions and answers, and that there is a large corpus of previous interactions available. We use a neural network to encode the current state of the agent and the oracle, and retrieve the most relevant question from the corpus to ask the oracle. The agent's policy and value function was updated by the oracle's answer. We evaluate our method on an object manipulation task. Our method can significantly improve the efficiency of RL by reducing the number of interactions needed to reach a certain level of performance, compared to baselines that do not use the oracle or use it in a naive way.",
        "DOI": "10.1145/3638584.3638661",
        "affiliation_name": "Institute of Automation Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60018486",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "A-share Trading Strategy Based on MTL-DDPG",
        "paper_author": "Deng W.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2023-12-08",
        "Abstract": "With the development of artificial intelligence, more investors are applying machine learning and deep learning algorithms to financial time series, aiming to improve traditional quantitative trading strategies. However, most of the current research focus on mature institutional-type markets and strategies proposed by the current research lack dynamic adjustment capability, especially in a complex environment with high volatility and strong noise, are difficult to derive a stable and profitable portfolio. In response to the above problems, we fully combine the advantages of artificial intelligence and traditional financial market theory techniques to construct a quantitative trading strategy model MTL-DDPG (Multi Time-scale LSTM Deep Deterministic Policy Gradient) that can obtain excess returns. By conducting back testing and comparing with other classical quantitative trading strategies, we verify that our proposed quantitative trading strategy, MTL-DDPG, achieves good results in the A-share market by obtaining excess returns, and the selected portfolio outperforms the benchmark both in terms of total return and risk management.",
        "DOI": "10.1145/3638584.3638600",
        "affiliation_name": "Beijing University of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022281",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A New Transfer Learning-Based Traffic Classification Algorithm for a Multi-Domain SDN Network",
        "paper_author": "Hoang N.T.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "1",
        "cover_date": "2023-12-07",
        "Abstract": "To enhance the efficiency and resource utilization of a computer network, it is imperative to classify network traffic and implement distinct priority policies. Network traffic classification plays a pivotal role across various domains, including network administration, cybersecurity, and network resource optimization. As encrypted network data undergoes diverse evolution, as evident in datasets from tech giants like Google, Facebook, and YouTube, traditional traffic classification methods have given way to machine learning-based approaches. Given that computer networks are primarily deployed as distributed multi-domain systems, employing machine learning for traffic classification becomes challenging when a new network domain appears with a limited dataset. One potential remedy is to employ transfer learning, allowing knowledge transfer from a pre-trained model in an established domain to a new one. In this paper, we present two contributions. First, a novel algorithm called Multi-class TrAdaBoost-CNN is introduced to tackle the challenge of cross-domain classification in encrypted network services. This algorithm extends the Multi-class TrAdaBoost approach by incorporating a Convolutional Neural Network (CNN) as a weak learner. Secondly, extensive experiments are conducted on two distinct domains characterized by imbalanced data distributions to assess the efficacy of our proposed method. The experimental results clearly demonstrate that our algorithm outperforms the traditional CNN model, achieving remarkable accuracy improvements of up to 16%, even when dealing with extremely limited data.",
        "DOI": "10.1145/3628797.3628804",
        "affiliation_name": "Hanoi University of Civil Engineering",
        "affiliation_city": "Hanoi",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60071395",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "ChatGPT one year on: who is using it, how and why?",
        "paper_author": "Ghassemi M.",
        "publication": "Nature",
        "citied_by": "12",
        "cover_date": "2023-12-07",
        "Abstract": "In just a year, ChatGPT has permeated scientific research. Seven scientists reveal what they have learnt about how the chatbot should — and shouldn’t — be used. [Figure not available: see fulltext.].",
        "DOI": "10.1038/d41586-023-03798-6",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Modeling Indirect Greenhouse Gas Emissions Sources from Urban Wastewater Treatment Plants: Integrating Machine Learning Models to Compensate for Sparse Parameters with Abundant Observations",
        "paper_author": "Huang Y.",
        "publication": "Environmental Science and Technology",
        "citied_by": "6",
        "cover_date": "2023-12-05",
        "Abstract": "Electricity consumption and sludge yield (SY) are important indirect greenhouse gas (GHG) emission sources in wastewater treatment plants (WWTPs). Predicting these byproducts is crucial for tailoring technology-related policy decisions. However, it challenges balancing mass balance models and mechanistic models that respectively have limited intervariable nexus representation and excessive requirements on operational parameters. Herein, we propose integrating two machine learning models, namely, gradient boosting tree (GBT) and deep learning (DL), to precisely pointwise model electricity consumption intensity (ECI) and SY for WWTPs in China. Results indicate that GBT and DL are capable of mining massive data to compensate for the lack of available parameters, providing a comprehensive modeling focusing on operation conditions and designed parameters, respectively. The proposed model reveals that lower ECI and SY were associated with higher treated wastewater volumes, more lenient effluent standards, and newer equipment. Moreover, ECI and SY showed different patterns when influent biochemical oxygen demand is above or below 100 mg/L in the anaerobic-anoxic-oxic process. Therefore, managing ECI and SY requires quantifying the coupling relationships between biochemical reactions instead of isolating each variable. Furthermore, the proposed models demonstrate potential economic-related inequalities resulting from synergizing water pollution and GHG emissions management.",
        "DOI": "10.1021/acs.est.3c06482",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An intellectual design case of compressor airfoils based on reinforcement learning",
        "paper_author": "Xu X.",
        "publication": "Engineering Computations (Swansea, Wales)",
        "citied_by": "1",
        "cover_date": "2023-12-05",
        "Abstract": "Purpose: In general, the existing compressor design methods require abundant knowledge and inspiration. The purpose of this study is to identify an intellectual design optimization method that enables a machine to learn how to design it. Design/methodology/approach: The airfoil design process was solved using the reinforcement learning (RL) method. An intellectual method based on a modified deep deterministic policy gradient (DDPG) algorithm was implemented. The new method was applied to agents to learn the design policy under dynamic constraints. The agents explored the design space with the help of a surrogate model and airfoil parameterization. Findings: The agents successfully learned to design the airfoils. The loss coefficients of a controlled diffusion airfoil improved by 1.25% and 3.23% in the two- and four-dimensional design spaces, respectively. The agents successfully learned to design under various constraints. Additionally, the modified DDPG method was compared with a genetic algorithm optimizer, verifying that the former was one to two orders of magnitude faster in policy searching. The NACA65 airfoil was redesigned to verify the generalization. Originality/value: It is feasible to consider the compressor design as an RL problem. Trained agents can determine and record the design policy and adapt it to different initiations and dynamic constraints. More intelligence is demonstrated than when traditional optimization methods are used. This methodology represents a new, small step toward the intelligent design of compressors.",
        "DOI": "10.1108/EC-07-2022-0502",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Log2Policy: An Approach to Generate Fine-Grained Access Control Rules for Microservices from Scratch",
        "paper_author": "Xu S.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "3",
        "cover_date": "2023-12-04",
        "Abstract": "Microservice application architecture is one of the most widely used service architectures in the industry. To prevent a compromised microservice from abusing other microservices, authorization policy is applied to regulate the access among them. However, configuring access control policy manually is challenging due to the complexity and dynamic nature of microservice applications. In this paper, we present Log2Policy, a novel approach to generate microservice authorization policy based on access logs. Our approach consists of three fundamental techniques: (1) a log-based topological graph generation mechanism that automatically infers the invocation logic among microservices, (2) a machine learning based attributes mining method that extracts the relevant attributes of requests, and (3) a policy upgrade mechanism based on traffic management that can significantly reduce the upgrade time. We have implemented a prototype of Log2Policy on mainstream microservice infrastructures and have evaluated it with several microservice applications. The results show that Log2Policy can generate fine-grained and effective access control rules and upgrade them with negligible overhead.",
        "DOI": "10.1145/3627106.3627137",
        "affiliation_name": "Institute of Information Engineering",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60273040",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "PSP-Mal: Evading Malware Detection via Prioritized Experience-based Reinforcement Learning with Shapley Prior",
        "paper_author": "Zhan D.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "1",
        "cover_date": "2023-12-04",
        "Abstract": "With the widespread application of machine learning techniques in malware detection, researchers have proposed various adversarial attack methods to generate adversarial examples (AEs) of malware, thereby evading detection. Previous studies have shown that the reinforcement learning (RL) framework can enable black-box attacks by performing a sequence of function-preserving operations, which produces functional evasive malware samples. However, it is difficult to obtain the useful guidance and feedbacks from the environment for agent training in the black-box scenario, which results in the RL framework being unable to learn the effective evasion policy. In this paper, we propose the Shapley prior and establish a prior-guidance-based RL framework, namely PSP-Mal, to generate AEs against Portable Executable (PE) malware detectors. Our framework improves on existing methods in three aspects: 1) We explore feature effects of the black-box model by computing Shapley values and further propose the Shapley prior to represent the expected impact of operations. 2) A novel prioritized experience utilization mechanism is established regarding the Shapley prior guidance in the RL framework. 3) The actions are expanded into item-content pairs and we use the Thompson sampling to choose effective content, which helps to reduce randomness and ensure repeatability. We compare the attack performance of our framework with other methods, and experimental results demonstrate that our algorithm is more effective. The evasion rates of PSP-Mal against the LightGBM models trained on EMBER and SOREL-20M reach 76.88% and 72.03%, respectively.",
        "DOI": "10.1145/3627106.3627178",
        "affiliation_name": "Peoples Liberation Army Engineering University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60226539",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Enhancing family education pattern recognition with a random forest algorithm",
        "paper_author": "Xia J.",
        "publication": "Journal of Intelligent and Fuzzy Systems",
        "citied_by": "0",
        "cover_date": "2023-12-02",
        "Abstract": "It is essential to understand family educational patterns to develop effective educational interventions and policies. Academic success, socioemotional development, and the general well-being of adolescents are all significantly affected by family dynamics and practices. Due to the wide range and variety of familial conditions, it cannot be easy to analyze and recognize these patterns. This paper offers an intelligent strategy for effectively identifying and analyzing family education patterns using the random forest (RF) algorithm. We begin by collecting an extensive data set that includes family factors, educational practices, and student outcomes. The raw data is first preprocessed using min-max normalization. Furthermore, we employ principal component analysis (PCA) to extract the pertinent attributes from the preprocessed data. The best features are chosen using the reptile search optimization (RSO) algorithm to increase the accuracy of the random forest. Comparing the empirical results to state-of-the-art methods demonstrates the suggested RF technique's higher effectiveness in identifying family education patterns. The value of performance metrics such as accuracy (94.7%), precision (95.2%), recall (95.7%), and F1 score (96.1%). This strategy uses the RF to deliver insightful data that may guide targeted interventions, regulations, and individualized procedures to help students and their families succeed in education.",
        "DOI": "10.3233/JIFS-234976",
        "affiliation_name": "Capital Normal University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60020256",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "(R)evolutions of Thought: Artificial Intelligence and Education Futures",
        "paper_author": "Abrams S.S.",
        "publication": "Teachers College Record",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "As part of the 125th issue of Teachers College Record, this commentary provides an overview of technological innovation with a focus on the emergence of machine learning and artificial intelligence (AI). The presence and use of AI is a pressing contemporary topic in education, raising questions about the information and perspective(s) AI might privilege, as well as the evolving ethical concerns related to the blurred and increasingly indistinguishable boundaries of human and nonhuman entities and practices.",
        "DOI": "10.1177/01614681241230173",
        "affiliation_name": "University of South Africa",
        "affiliation_city": "Pretoria",
        "affiliation_country": "South Africa",
        "affiliation_id": "60002397",
        "affiliation_state": "Gauteng"
    },
    {
        "paper_title": "Artificial intelligence: pioneering value-based purchasing in healthcare",
        "paper_author": "Al-Hajjar S.",
        "publication": "International Journal of Pediatrics and Adolescent Medicine",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "NA",
        "DOI": "10.4103/ijpam.ijpam_37_24",
        "affiliation_name": "King Faisal Specialist Hospital &amp; Research Centre",
        "affiliation_city": "Riyadh",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60016332",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Identifying Key Issues in Climate Change Litigation: A Machine Learning Text Analytic Approach",
        "paper_author": "Raghupathi W.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "As climate change, environmental, social, and governance (ESG), along with sustainability, become increasingly crucial for businesses and society, there is a noticeable scarcity of information and transparency regarding corporate practices. Often, government agency enforcement actions lead to litigation and are ultimately resolved by court decisions. Moreover, in instances when there is perceived inadequacy in government enforcement, citizens frequently turn to the courts for preventive judgments against businesses or agencies. In an effort to shed light on the multifaceted aspects of climate change, we adopted a novel, exploratory approach to analyze climate change-related litigation cases. Utilizing a blend of machine learning-based text analytics, we have extracted key insights from individual case narratives. Our analysis encompassed over four hundred cases from the Westlaw database through various keyword searches. The emergent topics from our case dataset revolved around four critical environmental themes: forest, land, water, and air emissions. Our findings provide insight into the nature and dimensions of climate change and also carry significant policy implications, laying the groundwork for future research in this domain.",
        "DOI": "10.3390/su152316530",
        "affiliation_name": "Brooklyn College",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60023814",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Do Public-Led Housing Site Development Projects Affect Local Housing Prices: A Proposal for a Comprehensive Policy Evaluation Methodology",
        "paper_author": "Kim J.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "As the population in urban areas increases, the importance of adequate public-led development policies for sustainable cities with affordable housing is becoming more highlighted. In this regard, this study aims to determine the effectiveness of public-led urban development policies for sustainable growth in urban areas, specifically measuring the effect of housing site development projects on housing prices. The geographical scope of the study is the project sites and their surrounding areas in South Korea, and the temporal background is from 2006 to 2023. The project sites were subdivided into four groups by using the Self-Organization Map (SOM), a machine-learning-based clustering analysis, to collect characteristics of each region. Then, the impact of the policy and the prediction of the real estate market of each cluster were analyzed by applying the DID and LSTM models, which have recently been proven to show a high validity. The results show that each cluster had different characteristics and effects from the development projects, depending not simply on the location, but on several characteristics, including the level of size, infrastructure installation, input cost, etc. Furthermore, it is expected for future studies that more detailed research should be conducted with larger datasets of the regional characteristics.",
        "DOI": "10.3390/su152316495",
        "affiliation_name": "Konkuk University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60000142",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An Analytical Study Predicting Future Conditions and Application Strategies of Concrete Bridge Pavement Based on Pavement Management System Database",
        "paper_author": "Lee J.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "South Korea is implementing various policies to address the aging of infrastructures and improve road infrastructure management. Moreover, numerous research projects aiming at the development of necessary technologies for the proper implementation of these policies are underway. This study specifically aims to overcome existing problems in bridge pavement maintenance, such as the inaccuracy of future condition predictions and the selection of incorrect evaluation indicators. Our goal is to provide a new approach for the improved management of the bridge pavement management system (BPMS). To address the issues of accuracy in future condition prediction and evaluation indicator selection within the existing maintenance system, we utilized particle filtering, a Kalman filter method among machine learning techniques. This method allows for the prediction of future conditions, based on the nonlinearly collected bridge pavement conditions within BPMS. Furthermore, we proposed a systematic bridge pavement management strategy. This strategy utilizes traffic volume (ESALs; equivalent single axle loadings), a factor that can influence the future condition of bridge pavement, in correlation with the future condition predicted through particle filtering within BPMS.",
        "DOI": "10.3390/su152416680",
        "affiliation_name": "Korea Institute of Civil Engineering and Building Technology (KICT)",
        "affiliation_city": "Goyang",
        "affiliation_country": "South Korea",
        "affiliation_id": "60121523",
        "affiliation_state": "Gyeonggi-do"
    },
    {
        "paper_title": "Advanced Digital Tools for Data-Informed and Performance-Driven Design: A Review of Building Energy Consumption Forecasting Models Based on Machine Learning",
        "paper_author": "Di Stefano A.G.",
        "publication": "Applied Sciences (Switzerland)",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "Cities and buildings represent the core of human life, the nexus of economic activity, culture, and growth. Although cities cover less than 10% of the global land area, they are notorious for their substantial energy consumption and consequential carbon dioxide (CO2) emissions. These emissions significantly contribute to reducing the carbon budget available to mitigate the adverse impacts of climate change. In this context, the designers’ role is crucial to the technical and social response to climate change, and providing a new generation of tools and instruments is paramount to guide their decisions towards sustainable buildings and cities. In this regard, data-informed digital tools are a viable solution. These tools efficiently utilise available resources to estimate the energy consumption in buildings, thereby facilitating the formulation of effective urban policies and design optimisation. Furthermore, these data-driven digital tools enhance the application of algorithms across the building industry, empowering designers to make informed decisions, particularly in the early stages of design. This paper presents a comprehensive literature review on artificial intelligence-based tools that support performance-driven design. An exhaustive keyword-driven exploration across diverse bibliographic databases yielded a consolidated dataset used for automated analysis for discerning the prevalent themes, correlations, and structural nuances within the body of literature. The primary findings indicate an increasing emphasis on master plans and neighbourhood-scale simulations. However, it is observed that there is a lack of a streamlined framework integrating these data-driven tools into the design process.",
        "DOI": "10.3390/app132412981",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Multidimensional Data Analysis for Enhancing In-Depth Knowledge on the Characteristics of Science and Technology Parks",
        "paper_author": "Francés O.",
        "publication": "Applied Sciences (Switzerland)",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "Featured Application: This work expands the understanding of science and technology parks (STPs) and can also guide STP decision makers by incorporating data science and artificial intelligence tools, as well as guiding policy makers on how to promote innovation. The role played by science and technology parks (STPs) in technology transfer, industrial innovation, and economic growth is examined in this paper. The accurate monitoring of their evolution and impact is hindered by the lack of uniformity in STP models or goals, and the scarcity of high-quality datasets. This work uses existing terminologies, definitions, and core features of STPs to conduct a multidimensional data analysis that explores and evaluates the 21 core features which describe the key internal factors of an STP. The core features are gathered from a reliable and updatable dataset of Spanish STPs. The methodological framework can be replicated for other STP contexts and is based on descriptive techniques and machine-learning tools. The results of the study provide an overview of the general situation of STPs in Spain, validate the existence and characteristics of three types of STPs, and identify the typical features of STPs. Moreover, the prototype STP can be used as a benchmark so that other STPs can identify the features that need to be improved. Finally, this work makes it possible to carry out classifications of STPs, in addition to prediction and decision making for innovation ecosystems.",
        "DOI": "10.3390/app132312595",
        "affiliation_name": "Universitat d'Alacant",
        "affiliation_city": "Alicante",
        "affiliation_country": "Spain",
        "affiliation_id": "60010844",
        "affiliation_state": "Alicante"
    },
    {
        "paper_title": "The Impact of an Increase in Bank Competition on Export Product Quality: Evidence from China",
        "paper_author": "Tu C.",
        "publication": "Annals of Financial Economics",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Few studies specifically testified to how increased bank competition affects export product quality. This paper fills this gap in this area by examining whether and how increased bank competition affects export product quality. The core results of our findings are as follows. First, the statistical analysis results show that a series of bank reforms have enhanced competition in the banking industry in China. Second, the theoretical model shows that bank reform positively influences export product quality. Subsequently, employing a panel sample of 77,817 firms that exported 4,787 products (HS-6) to 230 destinations from 2000 to 2006, we adopt a difference-in-differences approach to test the association between a rise in bank competition and the quality of exported products. The baseline results which are robust in different model settings support that an increase in bank competition increases export product quality. The further empirical test shows that increased bank competition upgrades export product quality through the following channels: bank competition increase leads to enterprises' financial stability enhancement which, in turn, leads to R&D investment upgrading which then leads to export product quality enhancement. Finally, the heterogeneity checks documented that the positive effect of bank competition upgrading on export product quality is pronounced for non-SOEs, and for firms in both the growth and mature stages. Moreover, an increase in bank competition makes financial resources more accessible in areas with weak financial infrastructure. Our findings shed light on the policy implications for emerging economies. Our study expands the theoretical framework of bank competition research on export product quality and inspires the development of strategies for exporting enterprises.",
        "DOI": "10.1142/S2010495223500124",
        "affiliation_name": "Zhejiang Sci-Tech University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60103821",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Logic Separation: Discrete Modelling of Pattern Recognition",
        "paper_author": "Aslanyan L.",
        "publication": "Pattern Recognition and Image Analysis",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Abstract: Herein, a historical analytical survey of work of “Discrete Modelling of Pattern Recognition” (DM-Lab) research group in Armenia is presented. The group is since 1973, supervised by worldwide recognized scientist Yurii Ivanovich Zhuravlev and lead by his former student Levon Aslanyan. The general start of attention to computational mathematics and computational systems in Armenia is concerned with the times of cybernetics as a research direction, and the names of great scientists and policy makers, such as Andranik Iosifyan and Sergei Mergelyan. In early 1950’s a large number of HighTech and defense related organizations were established in area, and their theoretical, scientific cluster was formed around the Yerevan Research Institute of Mathematical Machines, and Computer Center of Academy of Sciences and Yerevan State University. This was the time for intensive stuff and student exchanges inside the larger country USSR. Rimma Podlovchenko, Rafik Tonoyan, Igor’ Zaslavski, Yuri Shoukourian started teaching at Yerevan State University in 70’s, a number of students were delegated to the recognized cybernetical centers, in Moscow, Kiev, Novosibirsk. And one of the results of these developments was appearance of DM-Lab in Armenia, composed by alumnus of Novosibirsk and Moscow State Universities, led by Levon Aslanyan, and supervised globally by RF Academician Yuri Ivanovich Zhuravlev. Further research and education activities lead to defenses of candidate and doctoral dissertations, in Armenia, and at the council of Computer Center of Academy of Sciences of Russian Federation. The initial stuff of DM-Lab group included Gevorg Tonoyan, Levon Asatryan, Vilik Karakhanyan. Local members of the group were Hasmik Sahakyan, Vladimir Sahakyan, Irina Arsenyan, Levon Kazaryan and large number of young PhD students. Research directions at the DM-Lab were and are related to the pattern recognition theory – to mathematical models of forming and analyzing learning sets, studying their properties such as the class compactness hypothesis, in terms of isoperimetry; to forming the logic of interrelations of classes, in terms of logic separation; setting up new approaches in data mining area, etc. All these studies involve intensive research over the years, addressing topics related to the geometry of n-dimensional unite cube and lattices in general, Boolean function minimization, discrete optimization problems, and algorithmic studies coming from data science and artificial intelligence. International relations and activities of the group includes: long term representation of Armenia in the ISO technical groups, representation of Armenia in ICT research programmes of European Council, membership at the ITHEA virtual research institute with its conferences and publishing house. 10’s of research projects were implemented during these years. Projects were funded by UNDP, NATO Research, INTAS, EC Esprit, IST and Horizone, RFBR, and other international and local sources. 16 candidate and 2 doctoral theses were defended by the group members.",
        "DOI": "10.1134/S1054661823040077",
        "affiliation_name": "National Academy of Sciences of the Republic of Armenia",
        "affiliation_city": "Yerevan",
        "affiliation_country": "Armenia",
        "affiliation_id": "60070846",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "What Legal Frameworks Should Govern Use of Genetic Test Results by Private Health Insurers in New Zealand?",
        "paper_author": "Janes H.",
        "publication": "Journal of law and medicine",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "The rising cost of private health insurance and constraints within public health systems are global concerns. Genetic testing presents a transformative opportunity for health care to enhance health outcomes and optimise resource allocation through personalised medicine, early diagnosis, targeted treatments, managed care, and improved drug development. However, ethical and policy issues arise, including privacy, discrimination and equitable access to testing. Balancing these against potential health benefits poses a complex challenge. While some advocate for restricting health insurers from using genetic data, others argue that well-regulated private insurance can ensure affordability, improved health outcomes, and innovative care adoption. This article explores examples of improved health outcomes through genetic testing, identifies areas of risk related to insurers' use of genetic data, evaluates the adequacy of New Zealand's legal framework, and emphasises the need for ethical and equitable policy solutions. The broader issues of data governance, biases in algorithms, and implications of artificial intelligence and machine learning warrant separate exploration.",
        "DOI": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Recommendation Systems for e-Shopping: Review of Techniques for Retail and Sustainable Marketing",
        "paper_author": "Stalidis G.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "6",
        "cover_date": "2023-12-01",
        "Abstract": "In recent years, the interest in recommendation systems (RSs) has dramatically increased, as they have become main components of all online stores. The aims of an RS can be multifaceted, related not only to the increase in sales or the convenience of the customer, but may include the promotion of alternative environmentally friendly products or to strengthen policies and campaigns. In addition to accurate suggestions, important aspects of contemporary RSs are therefore to align with the particular marketing goals of the e-shop and with the stances of the targeted audience, ensuring user acceptance, satisfaction, high impact, and achieving sustained usage by customers. The current review focuses on RS related to retail shopping, highlighting recent research efforts towards enhanced e-shops and more efficient sustainable digital marketing and personalized promotion. The reported research was categorized by main approach, key methods, and specialized e-commerce problems addressed, while technological aspects were linked with marketing aspects. The increasing number of papers in the field showed that it has become particularly popular, following the explosive growth in e-commerce and mobile shopping. The problems addressed have expanded beyond the performance of the core algorithms to the business aspects of recommendation, considering user acceptance and impact maximization techniques. Technologies have also shifted from the improvement of classic filtering techniques to complex deep learning architectures, in order to deal with issues such as contextualization, sequence-based methods, and automatic feature extraction from unstructured data. The upcoming goals seem to be even more intelligent recommendations that more precisely adapt not only to users’ explicit needs and hidden desires but also to their personality and sensitivity for more sustainable choices.",
        "DOI": "10.3390/su152316151",
        "affiliation_name": "International Hellenic University",
        "affiliation_city": "Thessaloniki",
        "affiliation_country": "Greece",
        "affiliation_id": "60158100",
        "affiliation_state": "Central Macedonia"
    },
    {
        "paper_title": "Construction and Application of Carbon Emission Prediction Model for China蒺s Textile and Garment Industry Based on Improved WOA-LSTM",
        "paper_author": "Shao C.",
        "publication": "Journal of Beijing Institute of Fashion Technology (Natural Science Edition)",
        "citied_by": "7",
        "cover_date": "2023-12-01",
        "Abstract": "Carbon emissions prediction in the textile and garment industry makes the industry爷s carbon reduction policies more practical. In order to predict the industry's carbon emissions more accurately, this paper proposed a prediction model based on Long鄄Short Term Memory neural network (LSTM), which was optimized by an improved Whale Optimization Algorithm (WOA). The machine learning method was introduced to provide a basis for explo鄄ring the industry's carbon reduction path. Firstly, the LSTM model used WOA to optimize the key parameters, and chaotic mapping initialization population and adaptive weights were taken to improve the algorithm. At the same time, an improved WOA-LSTM model was constructed. Secondly, the carbon emissions of the textile and garment industry were calculated from 1990 to 2020, and the STIRPAT model was used to screen the influencing factors of carbon emissions in the industry. Comparative analysis was used to confirm the model's performance, and several scenarios were used to predict the industry's carbon emissions trend. Experiments show that the prediction accuracy is significantly improved, and the MAE, RMSE, and MAPE values for the model test set are 4. 868, 4. 984, and 0. 024, respectively. Meanwhile, the industry will primarily rely on technological innovation to achieve carbon neu鄄trality. This study offers new perspectives to research on carbon emissions prediction in industrial sectors.",
        "DOI": "10.16454/j.cnki.issn.1001-0564.2023.04.010",
        "affiliation_name": "Beijing Institute of Fashion Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60017925",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Safe reinforcement learning and its applications in robotics: A survey",
        "paper_author": "Zhang C.X.",
        "publication": "Kongzhi Lilun Yu Yingyong/Control Theory and Applications",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Reinforcement learning is a kind of machine learning method that realizes sequential optimization decisions by interacting with the environment. It has been applied in games, recommendation systems and natural language processing. However, it is still a challenge to ensure the safety of reinforcement learning algorithms when applied to robotics in the real world. In recent years, the safe reinforcement learning methods for robotics systems have become a hot research direction, gaining extensive attention in robotics and reinforcement learning communities. This paper surveys important achievements and development tendency of safe reinforcement learning based on the existing work and focuses on their applicability in robotics. This paper first introduces the general problem description of safe reinforcement learning. Then we focus on the latest significant progress in this field from the perspective of method and performance, including constraint policy optimization, control barrier function, safety filter and adversarial training methods, and their applications in autonomous driving vehicles, unmanned aerial vehicles and other robotic systems. Finally, the future research direction of this field is prospected and discussed.",
        "DOI": "10.7641/CTA.2023.30247",
        "affiliation_name": "National University of Defense Technology China",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60024350",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "Who's Watching TV?",
        "paper_author": "Clark J.",
        "publication": "Information Systems Research",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "This work addresses the problem of \"user disambiguation\"-estimating the likelihood of each member of a small group using a shared account or device. The main focus is on television set-top box (STB) viewership data in multiperson households, in which it is impossible to tell with certainty which household members watch what. The first main contribution is formulating user disambiguation as a predictive problem. The second contribution is a solution for estimating the likelihood that each individual in a multiperson household watches each TV segment. Kernel theories from the marketing, economics, and sociology literature inform the design of our method. This method learns priors for viewership in single-person households and then adapts them to the specifics of each multiperson household's viewership history. Finally, we formalize two ad hoc heuristics that are currently used in industry (and research) for estimating audience composition of STB data and conduct a comparative analysis using simulated data, real large-scale viewership data, and a fully labeled panel-based data source. We find that our method has superior performance and practical value. The proposed solution has implications for advertisers, researchers who seek better understanding of TV viewership, and anyone using data generated by shared devices or accounts. A major TV provider has deployed this new method for use in its TV ad-targeting system. No personally identifiable information was gathered or used in conducting this study. To the extent any data were analyzed, it was anonymous and/or aggregated data, consistent with the carrier's privacy policy.",
        "DOI": "10.1287/isre.2023.1204",
        "affiliation_name": "Leonard N. Stern School of Business",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60108316",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Blame avoidance and credit-claiming dynamics in government policy communications: evidence from leadership tweets in four OECD countries during the 2020-2022 COVID-19 pandemic",
        "paper_author": "Leong C.",
        "publication": "Policy and Society",
        "citied_by": "6",
        "cover_date": "2023-12-01",
        "Abstract": "Government information activities are often thought to be motivated by a classic calculus of blame minimization and credit maximization. However, the precise interactions of “blame” and “credit” communication activities in government are not well understood, and questions abound about how they are deployed in practice. This paper uses Natural Language Processing (NLP) machine-learning sentiment analysis of a unique dataset composed of several thousand tweets of high-level political leaders in four OECD countries-namely the Prime Ministers of the United Kingdom, Ireland, Australia, and Canada-during 2020-2022 to examine the relationships existing between “blame” and “credit” communication strategies and their relation to the changing severity of the COVID-19 pandemic, both in an objective and subjective sense. In general, the study suggests that during this high-impact, long-lasting, and waxing and waning crisis, political leaders acted in accordance with theoretical expectations when it came to communicating credit seeking messages during the periods when the COVID situation was thought to be improving, but they did not exclusively rely upon communicating blame or scapegoating when the situation was considered to be deteriorating. The consequences of this finding for blame and credit-based theories of government communication are then discussed.",
        "DOI": "10.1093/polsoc/puad029",
        "affiliation_name": "Lee Kuan Yew School of Public Policy",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60109868",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Navigating the Ethical and Privacy Concerns of Big Data and Machine Learning in Decision Making",
        "paper_author": "Taherdoost H.",
        "publication": "Intelligent and Converged Networks",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "In recent years, the fields of big data and machine learning have gained significant attention for their potential to revolutionize decision-making processes. The vast amounts of data generated by various sources can provide valuable insights to inform decisions across a range of domains, from business and finance to healthcare and social policy. Machine learning algorithms enable computers to learn from data and improve their performance over time, thereby enhancing their ability to make predictions and identify patterns. This article provides a comprehensive overview of how big data and machine learning can improve decision-making processes between 2017-2022. It covers key concepts and techniques involved in these tools, including data collection, data preprocessing, feature selection, model training, and evaluation. The article also discusses the potential benefits and limitations of these tools and explores the ethical and privacy concerns associated with their use. In particular, it highlights the need for transparency and fairness in decision-making algorithms and the importance of protecting individuals' privacy rights. The review concludes by highlighting future research opportunities and challenges in this rapidly evolving field, including the need for more robust and interpretable models, as well as the integration of human decision making with machine learning algorithms. Ultimately, this review aims to provide insights for researchers and practitioners seeking to leverage big data and machine learning to improve decision-making processes in various domains.",
        "DOI": "10.23919/ICN.2023.0023",
        "affiliation_name": "University Canada West",
        "affiliation_city": "Vancouver",
        "affiliation_country": "Canada",
        "affiliation_id": "60268296",
        "affiliation_state": "BC"
    },
    {
        "paper_title": "Digitization in teacher education—quality enhancement, status quo, and professionalization approaches",
        "paper_author": "Rubach C.",
        "publication": "Unterrichtswissenschaft",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "This special issue brings together a diverse range of research that reflects the multifaceted landscape within the realm of digitization in teacher education. The contributions in this special issue range from underscoring how machine learning is not just an analytical tool but a beacon for identifying systemic challenges, i.e., dropouts and its impacts, and informing policy decisions within teacher education. They extend to contributions that bring to light the critical evaluation tools now at our disposal, which diagnose pressing issues in teacher education—such as the stagnation in digital competencies among (pre-service) teachers and their underestimation of digital media’s potential. The findings of the present contributions also highlight a crucial point: the need to reshape curricula to embed digital competencies as fundamental pillars of teacher education. Moreover, they reveal the effectiveness of innovative strategies such as reverse mentoring, collaborative peer learning, and leveraging educator role models as catalysts for change. Together, this special issue acts as a compass, directing the course of teacher education to a tech-savvy and responsive future.",
        "DOI": "10.1007/s42010-024-00193-6",
        "affiliation_name": "Eberhard Karls Universität Tübingen",
        "affiliation_city": "Tubingen",
        "affiliation_country": "Germany",
        "affiliation_id": "60017246",
        "affiliation_state": "Baden-Wurttemberg"
    },
    {
        "paper_title": "A Review of Deep Learning Strategies for Enhancing Cybersecurity in Networks",
        "paper_author": "Bhuvaneshwari A.J.",
        "publication": "Journal of Scientific and Industrial Research",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "Rapid technological improvements have brought significant hazards to sensitive data and information. Cyberspace has connected various data structures, ranging from private communications/transactions to government activities. Cyberattacks are growing more complex which emphasizes the need to improve cybersecurity. Cyber security is more crucial as everything becomes more digital and as the number of connected devices keeps increasing. Cyber security techniques are used to keep networks, applications, and devices safe from intruders. Cloud and IoT technologies have expanded the complexity of computing, communication, and networking infrastructures, making cybercrime prevention more difficult. It takes a long time to develop threat recognition algorithms by the existing methods. Innovative strategies, like employing deep learning tools for cybersecurity, are anticipated to provide a solution to the issue. Deep learning approaches have many benefits which include the ability to solve complex problems quickly, high levels of automation, the best use of informal information, the capacity to generate excellent results at a lower cost, and the ability to recognize complex interactions. A diverse range of applications can be employed in deep learning models to make decisions based on predictions in the daily routine. The significant benefits of deep learning-enabled cyber security have improved security and reduced risks. The intensity of this systematic study provides consolidated knowledge about recent trends and serves as a foundation for future research in Deep learning-enabled Cybersecurity. This paper highlights the potential challenges and current cybersecurity issues with cutting-edge Deep Learning technologies.",
        "DOI": "10.56042/jsir.v82i12.1702",
        "affiliation_name": "SSN College of Engineering, Kalavakkam",
        "affiliation_city": "Kanchipuram",
        "affiliation_country": "India",
        "affiliation_id": "60079728",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Intelligent Intrusion Detection System Snort and SVM",
        "paper_author": "El Aeraj O.",
        "publication": "Revue d'Intelligence Artificielle",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "Despite significant advances in IT security, current solutions fail to guarantee protection against malicious threats, often consisting of subtle and potentially damaging variants. To counter these risks, it remains essential to adopt robust security policies and devices such as firewalls and intrusion detection systems. However, these systems have their drawbacks, not least the propensity to generate false positives, leading to erroneous alerts and compromising the overall effectiveness of the security system. Faced with these challenges, an innovative approach was adopted, making use of machine learning, in particular support vector machines (SVM) written in Python programming language, in conjunction with the Snort IDS. This approach exploits the Snort IDS traffic training dataset, identifying attacks such as denial of service using alarm-generating rules. The data is then converted to a usable format and used as input for the machine learning model. This model separates the data into training and test sets in order to evaluate performance, using metrics such as F1 score, precision and recall. The results of this study demonstrate exceptional performance, with a precision rate of 99%, a true positive rate of 162, a false positive rate of 1, a true negative rate of 160 and a false negative rate of zero. These results highlight the robustness of the proposed approach, positioning it favorably in relation compared to other intrusion detection techniques.",
        "DOI": "10.18280/ria.370627",
        "affiliation_name": "Hassan II University of Casablanca",
        "affiliation_city": "Casablanca",
        "affiliation_country": "Morocco",
        "affiliation_id": "60025457",
        "affiliation_state": "Casablanca-Settat"
    },
    {
        "paper_title": "Assessing the Potential of AI–ML in Urban Climate Change Adaptation and Sustainable Development",
        "paper_author": "Srivastava A.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "19",
        "cover_date": "2023-12-01",
        "Abstract": "This study addresses a notable gap in the climate change literature by examining the potential of artificial intelligence and machine learning (AI–ML) in urban climate change adaptation and sustainable development across major global continents. While much attention has been given to mitigation strategies, this study uniquely delves into the AI–ML’s underexplored role in catalyzing climate change adaptation in contemporary and future urban centers. The research thoroughly explores diverse case studies from Africa, Asia, Australasia, Europe, North America, and South America, utilizing a methodological framework involving six-step and five-step models for systematic literature reviews. The findings underscore AI–ML achievements, illuminate challenges, and emphasize the need for context-specific and collaborative approaches. The findings imply that a one-size-fits-all approach is insufficient. Instead, successful adaptation strategies must be intricately linked to the particular characteristics, vulnerabilities, and intricacies of each region. Furthermore, the research underscores the importance of international collaboration, knowledge sharing, and technology transfer to expedite the integration of AI–ML into climate adaptation strategies globally. The study envisions a promising trajectory for AI–ML in the climate adaptation domain, emphasizing the necessity for ongoing research, innovation, and practical AI–ML applications. As climate change remains a defining challenge, this research predicts an increasingly pivotal role for AI–ML in constructing climate-resilient urban centers and promoting sustainable development. Continuous efforts to advance AI–ML technologies, establish robust policy frameworks, and ensure universal access are crucial for harnessing AI–ML’s transformative capabilities to combat climate change consequences.",
        "DOI": "10.3390/su152316461",
        "affiliation_name": "Indian Institute of Technology Kharagpur",
        "affiliation_city": "Kharagpur",
        "affiliation_country": "India",
        "affiliation_id": "60004750",
        "affiliation_state": "WB"
    },
    {
        "paper_title": "Toxic phytoplankton in eutrophic regional seas: An overview",
        "paper_author": "Karydis M.",
        "publication": "Global Nest Journal",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Toxic algal blooms have become a major environmental problem over the last few decades because of their impact on fisheries, leisure activities, national income and human health. It is known that Harmful Algal Blooms (HABs) can occur naturally but the frequency of occurrence as well as their geographical distribution are alarming. HABs, beyond the scientific interest, have been an issue of concern for policy makers due to the high cost for implementing management practices. Unlike other marine environmental problems, the causes of HAB formation are not known so far with certainty and a high degree of uncertainty remains, regarding possible triggering mechanisms. Various factors, apart from nutrient concentrations, seem to be connected with this phenomenon: abundance, presence and absence of phytoplankton species, presence of grazers, weather conditions, seawater temperature and water mass circulation patterns, have already been reported in the scientific literature as potential factors. However, there are strong indications that eutrophic conditions play a paramount role in HABs formation. Machine learning methods, applied over the last few years to predict HAB’s occurrences, have also confirmed the role of nutrients. In the present work, toxic algal blooms in regional seas characterized by eutrophic conditions that is the Mediterranean Sea, the Black Sea, the Baltic Sea, the North Sea, Wider Caribbean Region and the South China Sea are reviewed. Relevant issues including the drivers of eutrophication triggering HAB’s events as well as effects on ecosystem services and socio-economic consequences are also considered.",
        "DOI": "10.30955/gnj.005388",
        "affiliation_name": "University of the Aegean",
        "affiliation_city": "Mytilene",
        "affiliation_country": "Greece",
        "affiliation_id": "60017404",
        "affiliation_state": "North Aegean"
    },
    {
        "paper_title": "Transfer-Ensemble Learning: A Novel Approach for Mapping Urban Land Use/Cover of the Indian Metropolitans",
        "paper_author": "Barman P.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "Land use and land cover (LULC) classification plays a significant role in the analysis of climate change, evidence-based policies, and urban and regional planning. For example, updated and detailed information on land use in urban areas is highly needed to monitor and evaluate urban development plans. Machine learning (ML) algorithms, and particularly ensemble ML models support transferability and efficiency in mapping land uses. Generalization, model consistency, and efficiency are essential requirements for implementing such algorithms. The transfer-ensemble learning approach is increasingly used due to its efficiency. However, it is rarely investigated for mapping complex urban LULC in Global South cities, such as India. The main objective of this study is to assess the performance of machine and ensemble-transfer learning algorithms to map the LULC of two metropolitan cities of India using Landsat 5 TM, 2011, and DMSP-OLS nightlight, 2013. This study used classical ML algorithms, such as Support Vector Machine-Radial Basis Function (SVM-RBF), SVM-Linear, and Random Forest (RF). A total of 480 samples were collected to classify six LULC types. The samples were split into training and validation sets with a 65:35 ratio for the training, parameter tuning, and validation of the ML algorithms. The result shows that RF has the highest accuracy (94.43%) of individual models, as compared to SVM-RBF (85.07%) and SVM-Linear (91.99%). Overall, the ensemble model-4 produces the highest accuracy (94.84%) compared to other ensemble models for the Kolkata metropolitan area. In transfer learning, the pre-trained ensemble model-4 achieved the highest accuracy (80.75%) compared to other pre-trained ensemble models for Delhi. This study provides innovative guidelines for selecting a robust ML algorithm to map urban LULC at the metropolitan scale to support urban sustainability.",
        "DOI": "10.3390/su152416593",
        "affiliation_name": "Central University of Punjab",
        "affiliation_city": "Bathinda",
        "affiliation_country": "India",
        "affiliation_id": "60106790",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "A Supply Chain-Oriented Model to Predict Crude Oil Import Prices in South Korea Based on the Hybrid Approach",
        "paper_author": "Jo J.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Although numerous studies have explored key variables for forecasting crude oil prices, the role of supply chain factors has often been overlooked. In the face of global risks such as COVID-19, the Russia–Ukraine war, and the U.S.–China trade dispute, supply chain management (SCM) has evolved beyond an individual company’s concern. This research investigates the impact of a supply chain-oriented variable on the forecasting of crude oil import prices in South Korea. Our findings reveal that models incorporating the Global Supply Chain Pressure Index (GSCPI) outperform those without it, emphasizing the importance of monitoring supply chain-related variables for stabilizing domestic prices for policy makers. Additionally, we propose a novel hybrid factor-based approach that integrates time series and machine learning models to enhance the prediction performance of oil prices. This endeavor is poised to serve as a foundational step toward developing methodologically sound forecasting models for oil prices, offering valuable insights for policymakers.",
        "DOI": "10.3390/su152416725",
        "affiliation_name": "Korea Maritime Institute",
        "affiliation_city": "Busan",
        "affiliation_country": "South Korea",
        "affiliation_id": "60094613",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Hybrid Model of Variational Mode Decomposition and Long Short-Term Memory for Next-Hour Wind Speed Forecasting in a Hot Desert Climate",
        "paper_author": "Alkhayat G.",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Advancements in technology, policies, and cost reductions have led to rapid growth in wind power (WP) production. One of the major challenges in wind energy production is the instability of WP generation due to weather changes. Efficient power grid management requires accurate power output forecasting. New wind energy forecasting methods based on deep learning (DL) are delivering competitive performance versus traditional methods, like numerical weather prediction (NWP), statistical models and machine learning (ML) models. This is truer for short-term prediction. Since there is a relationship between methods, climates and forecasting complexity, forecasting methods do not always perform the same depending on the climate and terrain of the data source. This paper presents a novel model that combines the variational mode decomposition (VMD) method with a long short-term memory (LSTM) model for next-hour wind speed (WS) prediction in a hot desert climate, such as the climate in Saudi Arabia. The proposed model performance is compared to two other hybrid models, six DL models and four ML models using different feature sets. Also, the proposed model is tested on data from different climates, Caracas and Toronto. The proposed model showed a forecast skill (FS) between 61% and 74% based on mean absolute error (MAE), 64% and 72% based on root mean square error (RMSE), and 59% and 68% based on mean absolute percentage error (MAPE) for locations in Saudi Arabia.",
        "DOI": "10.3390/su152416759",
        "affiliation_name": "Islamic University of Madinah",
        "affiliation_city": "Medina",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60105081",
        "affiliation_state": "Al Madinah al Munawwarah"
    },
    {
        "paper_title": "A landmark environmental law looks ahead",
        "paper_author": "Wible B.",
        "publication": "Science",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "NA",
        "DOI": "10.1126/science.adn3245",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Data-driven service model to profile healthcare needs and optimise the operation of community-based care: a multi-source data analysis using predictive artificial intelligence",
        "paper_author": "Leung E.",
        "publication": "Hong Kong Medical Journal",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "NA",
        "DOI": "10.12809/hkmj235154",
        "affiliation_name": "Chinese University of Hong Kong, Faculty of Medicine",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60086464",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Suicide Risk Assessment and Prevention Tools in the UK: Current Landscape and Future Directions",
        "paper_author": "Arowosegbe A.",
        "publication": "Psychiatry International",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Suicide is a major global public health problem, with profound implications for individuals, families, and communities. In the United Kingdom (UK), despite efforts to detect and manage suicidal ideas, suicide rates persist, especially among middle-aged men and women, particularly those aged 45 to 54 years. Recent global challenges, such as the COVID-19 pandemic, climate change, conflict, and the environmental crisis, have raised concerns about an increase in suicide rates, particularly among young people. As a result, a population-wide preventive approach based on evidence is imperative to mitigate the projected increase in suicides. To evaluate the effectiveness of suicide prevention strategies, there is a need for an objective and universally accepted risk assessment approach that does not currently exist. This review examines the current landscape of suicide prevention in the United Kingdom and evaluates the strengths and limitations of existing suicide risk assessments tools. The current suicide prevention tools used, including machine learning and mobile applications are discussed. Also, the epidemiological trends in the various regions of the UK, risk factors including age, sex, and socio-economic status are assessed to provide context. Through this discourse, we hope to provide valuable insight for clinicians, researchers, and policy makers about the current landscape of suicide, especially within the United Kingdom, while presenting recommendations regarding areas that require further research and improvement. Accordingly, suicide prevention is and will continue to be a major focus of both the national health service and research in the UK in the strive to reduce the rate of suicide across all regions. Indeed, headways have been made in the use of technology in preventing suicide both locally and globally. However, research should in the future investigate the value of personalized interventions tailored to the various risk factors of suicide and based on appropriate screening and assessment tools.",
        "DOI": "10.3390/psychiatryint4040032",
        "affiliation_name": "UCL Division of Medicine",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60182839",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Macroeconomic Predictions Using Payments Data and Machine Learning",
        "paper_author": "Chapman J.T.E.",
        "publication": "Forecasting",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "This paper assesses the usefulness of comprehensive payments data for macroeconomic predictions in Canada. Specifically, we evaluate which type of payments data are useful, when they are useful, why they are useful, and whether machine learning (ML) models enhance their predictive value. We find payments data with a factor model can help improve accuracy up to 25% in predicting GDP, retail, and wholesale sales; and nonlinear ML models can further improve the accuracy up to 20%. Furthermore, we find the retail payments data are more useful than the data from the wholesale system; and they add more value during crisis and at the nowcasting horizon due to the timeliness. The contribution of the payments data and ML models is small and linear during low and normal economic growth periods. However, their contribution is large, asymmetrical, and nonlinear during crises such as COVID-19. Moreover, we propose a cross-validation approach to mitigate overfitting and use tools to overcome interpretability in the ML models to improve their effectiveness for policy use.",
        "DOI": "10.3390/forecast5040036",
        "affiliation_name": "Banque du Canada",
        "affiliation_city": "Ottawa",
        "affiliation_country": "Canada",
        "affiliation_id": "60027607",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Edge-Driven Multi-Agent Reinforcement Learning: A Novel Approach to Ultrasound Breast Tumor Segmentation",
        "paper_author": "Karunanayake N.",
        "publication": "Diagnostics",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "A segmentation model of the ultrasound (US) images of breast tumors based on virtual agents trained using reinforcement learning (RL) is proposed. The agents, living in the edge map, are able to avoid false boundaries, connect broken parts, and finally, accurately delineate the contour of the tumor. The agents move similarly to robots navigating in the unknown environment with the goal of maximizing the rewards. The individual agent does not know the goal of the entire population. However, since the robots communicate, the model is able to understand the global information and fit the irregular boundaries of complicated objects. Combining the RL with a neural network makes it possible to automatically learn and select the local features. In particular, the agents handle the edge leaks and artifacts typical for the US images. The proposed model outperforms 13 state-of-the-art algorithms, including selected deep learning models and their modifications.",
        "DOI": "10.3390/diagnostics13243611",
        "affiliation_name": "King Mongkut's Institute of Technology Ladkrabang",
        "affiliation_city": "Bangkok",
        "affiliation_country": "Thailand",
        "affiliation_id": "60021543",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Inclusive and Safe Mobility Needs of Senior Citizens: Implications for Age-Friendly Cities and Communities",
        "paper_author": "Bokolo A.J.",
        "publication": "Urban Science",
        "citied_by": "8",
        "cover_date": "2023-12-01",
        "Abstract": "Municipalities are concerned with addressing social issues such as mobility inclusion and safety by increasing access to transport facilities and services for all groups in society to create equitable and equal access for all citizens. Moreover, the public transportation systems provided in cities have to be inclusive and safe, driven by emerging technologies such as Artificial Intelligence (AI)-based services that provide personalized recommendation to improve mobility inclusion and safety for all citizens in society, especially vulnerable road users such as senior citizens or older people. But at the moment, there are few studies that have investigated how municipalities can provide inclusive and safe public transportation in general and for senior citizens, particularly those aged 65 and above. Therefore, this study aimed to examine how to provide inclusive and safe mobility for senior citizens to improve out-of-home mobility services for senior citizens towards age-friendly cities and communities. Accordingly, a systematic literature review grounded on secondary data was adopted to investigate inclusive and safe mobility needs for senior citizens. The data were collected from previous research and existing documents, and a descriptive data analysis was carried out to provide insights on urban transportation policies related to senior citizens. Furthermore, case studies were adopted to present polices and strategies employed in Norway, Canada, the United States of America, the United Kingdom, Sweden, and Northern Ireland to identify measures employed to address the public transportation needs of an aging society, focusing on the provision of inclusive and safe mobility to senior citizens. Further findings from this study included the possible use of emerging technologies such as AI-based machine learning for inclusive and safe mobility.",
        "DOI": "10.3390/urbansci7040103",
        "affiliation_name": "HØgskolen i Østfold",
        "affiliation_city": "Halden",
        "affiliation_country": "Norway",
        "affiliation_id": "60101843",
        "affiliation_state": "Viken"
    },
    {
        "paper_title": "Early Detection of Dicamba and 2,4-D Herbicide Drifting Injuries on Soybean with a New Spatial–Spectral Algorithm Based on LeafSpec, an Accurate Touch-Based Hyperspectral Leaf Scanner",
        "paper_author": "Niu Z.",
        "publication": "Remote Sensing",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "In soybeans, off-target damage from the use of dicamba and 2,4-D herbicides for broadleaf weed control can significantly impact sensitive vegetation and crops. The early detection and assessment of such damage are critical for plant diagnostic labs and regulatory agencies to inform regulated usage policies. However, the existing technologies that calculate the average spectrum often struggle to detect and differentiate the damage caused by these herbicides, as they share a similar mode-of-action. In this study, a high-precision spatial and spectral imaging solution was tested for the early detection of dicamba and 2,4-D-induced damage in soybeans. A 2021 study was conducted using LeafSpec, a touch-based hyperspectral leaf scanner, to detect damage on soybean leaves. VIS-NIR (visible–near infrared) hyperspectral images were captured from 180 soybean plants exposed to nine different herbicide treatments at different intervals after spraying. Leaf damage was distinguished as early as 2 h after treatment (HAT) using pairwise partial least squares discriminant analysis (PLS-DA) models based on spectral data. Leaf color distribution, texture, and morphological features were analyzed to separate herbicide dosages. By fully exploiting the spatial and spectral information from high-resolution hyperspectral images, classification accuracy was improved from 57.4% to over 80% for all evaluation dates. This work demonstrates the potential and advantages of using spectral and spatial features of LeafSpec hyperspectral images for the early and accurate detection of herbicide damage in soybean plants.",
        "DOI": "10.3390/rs15245771",
        "affiliation_name": "College of Agriculture",
        "affiliation_city": "West Lafayette",
        "affiliation_country": "United States",
        "affiliation_id": "60148375",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Sizing with Technical Indicators of Microgrids with Battery Energy Storage Systems: A Systematic Review",
        "paper_author": "Vasconcelos A.",
        "publication": "Energies",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Worldwide, governmental organizations are restructuring energy policies, making them cleaner, encouraging transformation and energy transition by integrating renewable sources, engaging in environmental preservation, and, notably, meeting the growing demand for sustainable energy models, such as solar and wind energy. In the electricity sector, reducing carbon emissions is crucial to facilitating the integration of microgrids (MGs) with renewable sources and Battery Energy Storage Systems (BESSs). This work constitutes a systematic review that thoroughly analyzes the sizing of MGs with BESSs. The unpredictability and variability of renewable sources justify the complexity of this analysis and the loads connected to the system. Additionally, the sizing of a BESS depends primarily on the application, battery technology, and the system’s energy demand. This review mapped and identified existing computational and optimization methodologies for structured sizing in technical indicators of an MG with a BESS based on articles published between 2017 and 2021. A protocol was defined in which articles were filtered in multiple stages, undergoing strategic refinements to arrive at the final articles to address the Research Questions (RQs). The final number of articles was 44, and within these, technical indicators related to the RQs were addressed, covering the most relevant works and comparing them technically, including how each explains the objective and result of their work. The rejected articles did not meet the criteria established by the defined protocol, such as exclusion criteria, quality criteria, and RQs. In conclusion, studies employing the integration of machine learning coupled with optimization techniques exhibit a significant contribution to results, as historical data can aid machine learning for data prediction.",
        "DOI": "10.3390/en16248095",
        "affiliation_name": "Universidade de Pernambuco",
        "affiliation_city": "Recife",
        "affiliation_country": "Brazil",
        "affiliation_id": "60021980",
        "affiliation_state": "PE"
    },
    {
        "paper_title": "Mapping Deprived Urban Areas Using Open Geospatial Data and Machine Learning in Africa",
        "paper_author": "Owusu M.",
        "publication": "Urban Science",
        "citied_by": "6",
        "cover_date": "2023-12-01",
        "Abstract": "Reliable data on slums or deprived living conditions remain scarce in many low- and middle-income countries (LMICs). Global high-resolution maps of deprived areas are fundamental for both research- and evidence-based policies. Existing mapping methods are generally one-off studies that use proprietary commercial data or other physical or socio-economic data that are limited geographically. Open geospatial data are increasingly available for large areas; however, their unstructured nature has hindered their use in extracting useful insights to inform decision making. In this study, we demonstrate an approach to map deprived areas within and across cities using open-source geospatial data. The study tests this methodology in three African cities—Accra (Ghana), Lagos (Nigeria), and Nairobi (Kenya) using a three arc second spatial resolution. Using three machine learning classifiers, (i) models were trained and tested on individual cities to assess the scalability for large area application, (ii) city-to-city comparisons were made to assess how the models performed in new locations, and (iii) a generalized model to assess our ability to map across cities with training samples from each city was designed. Our best models achieved over 80% accuracy in all cities. The study demonstrates an inexpensive, scalable, and transferable approach to map deprived areas that outperforms existing large area methods.",
        "DOI": "10.3390/urbansci7040116",
        "affiliation_name": "Faculty of Geo-Information Science and Earth Observation – ITC",
        "affiliation_city": "Enschede",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60017915",
        "affiliation_state": "Overijssel"
    },
    {
        "paper_title": "Bicycle Data-Driven Application Framework: A Dutch Case Study on Machine Learning-Based Bicycle Delay Estimation at Signalized Intersections Using Nationwide Sparse GPS Data",
        "paper_author": "Yuan Y.",
        "publication": "Sensors",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Data-driven approaches are helpful for quantitative justification and performance evaluation. The Netherlands has made notable strides in establishing a national protocol for bicycle traffic counting and collecting GPS cycling data through initiatives such as the Talking Bikes program. This article addresses the need for a generic framework to harness cycling data and extract relevant insights. Specifically, it focuses on the application of estimating average bicycle delays at signalized intersections, as this is an essential variable in assessing the performance of the transportation system. This study evaluates machine learning (ML)-based approaches using GPS cycling data. The dataset provides comprehensive yet incomplete information regarding one million bicycle rides annually across The Netherlands. These ML models, including random forest, k-nearest neighbor, support vector regression, extreme gradient boosting, and neural networks, are developed to estimate bicycle delays. The study demonstrates the feasibility of estimating bicycle delays using sparse GPS cycling data combined with publicly accessible information, such as weather information and intersection complexity, leveraging the burden of understanding local traffic conditions. It emphasizes the potential of data-driven approaches to inform traffic management, bicycle policy, and infrastructure development.",
        "DOI": "10.3390/s23249664",
        "affiliation_name": "Faculteit Civiele Techniek en Geowetenschappen, TU Delft",
        "affiliation_city": "Delft",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60118019",
        "affiliation_state": "Zuid-Holland"
    },
    {
        "paper_title": "Joint Task Offloading and Resource Allocation for Intelligent Reflecting Surface-Aided Integrated Sensing and Communication Systems Using Deep Reinforcement Learning Algorithm",
        "paper_author": "Yang L.",
        "publication": "Sensors",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "This paper investigates an intelligent reflecting surface (IRS)-aided integrated sensing and communication (ISAC) framework to cope with the problem of spectrum scarcity and poor wireless environment. The main goal of the proposed framework in this work is to optimize the overall performance of the system, including sensing, communication, and computational offloading. We aim to achieve the trade-off between system performance and overhead by optimizing spectrum and computing resource allocation. On the one hand, the joint design of transmit beamforming and phase shift matrices can enhance the radar sensing quality and increase the communication data rate. On the other hand, task offloading and computation resource allocation optimize energy consumption and delay. Due to the coupled and high dimension optimization variables, the optimization problem is non-convex and NP-hard. Meanwhile, given the dynamic wireless channel condition, we formulate the optimization design as a Markov decision process. To tackle this complex optimization problem, we proposed two innovative deep reinforcement learning (DRL)-based schemes. Specifically, a deep deterministic policy gradient (DDPG) method is proposed to address the continuous high-dimensional action space, and the prioritized experience replay is adopted to speed up the convergence process. Then, a twin delayed DDPG algorithm is designed based on this DRL framework. Numerical results confirm the effectiveness of proposed schemes compared with the benchmark methods.",
        "DOI": "10.3390/s23249896",
        "affiliation_name": "Dublin City University",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60025059",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "Proximal Policy Optimization-Based Reinforcement Learning and Hybrid Approaches to Explore the Cross Array Task Optimal Solution",
        "paper_author": "Corecco S.",
        "publication": "Machine Learning and Knowledge Extraction",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "In an era characterised by rapid technological advancement, the application of algorithmic approaches to address complex problems has become crucial across various disciplines. Within the realm of education, there is growing recognition of the pivotal role played by computational thinking (CT). This skill set has emerged as indispensable in our ever-evolving digital landscape, accompanied by an equal need for effective methods to assess and measure these skills. This research places its focus on the Cross Array Task (CAT), an educational activity designed within the Swiss educational system to assess students’ algorithmic skills. Its primary objective is to evaluate pupils’ ability to deconstruct complex problems into manageable steps and systematically formulate sequential strategies. The CAT has proven its effectiveness as an educational tool in tracking and monitoring the development of CT skills throughout compulsory education. Additionally, this task presents an enthralling avenue for algorithmic research, owing to its inherent complexity and the necessity to scrutinise the intricate interplay between different strategies and the structural aspects of this activity. This task, deeply rooted in logical reasoning and intricate problem solving, often poses a substantial challenge for human solvers striving for optimal solutions. Consequently, the exploration of computational power to unearth optimal solutions or uncover less intuitive strategies presents a captivating and promising endeavour. This paper explores two distinct algorithmic approaches to the CAT problem. The first approach combines clustering, random search, and move selection to find optimal solutions. The second approach employs reinforcement learning techniques focusing on the Proximal Policy Optimization (PPO) model. The findings of this research hold the potential to deepen our understanding of how machines can effectively tackle complex challenges like the CAT problem but also have broad implications, particularly in educational contexts, where these approaches can be seamlessly integrated into existing tools as a tutoring mechanism, offering assistance to students encountering difficulties. This can ultimately enhance students’ CT and problem-solving abilities, leading to an enriched educational experience.",
        "DOI": "10.3390/make5040082",
        "affiliation_name": "IDSIA Dalle Molle Institute for Artificial Intelligence",
        "affiliation_city": "Viganello",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60014996",
        "affiliation_state": "TI"
    },
    {
        "paper_title": "The application of machine learning approaches to determine the predictors of anemia among under five children in Ethiopia",
        "paper_author": "Kebede Kassaw A.",
        "publication": "Scientific Reports",
        "citied_by": "11",
        "cover_date": "2023-12-01",
        "Abstract": "Health professionals need a strong prediction system to reach appropriate disease diagnosis, particularly for under-five child with health problems like anemia. Diagnosis and treatment delay can potentially lead to devastating disease complications resulting in childhood mortality. However, the application of machine learning techniques using a large data set provides scientifically sounded information to solve such palpable critical health and health-related problems. Therefore, this study aimed to determine the predictors of anemia among under-5 year’s age children in Ethiopia using a machine learning approach. A cross-sectional study design was done using the Ethiopian Demographic and Health Survey 2016 data set. A two-stage stratified cluster sampling technique was employed to select the samples. The data analysis was conducted using Statistical Package for Social Sciences/SPSS version 25 and R-software. Data were derived from Ethiopian Demographic and Health Survey. Boruta algorism was applied to select the features and determine the predictors of anemia among under-5 years-old children in Ethiopia. The machine learning algorism showed that number of children, distance to health facilities, health insurance coverage, youngest child’s stool disposal, residence, mothers’ wealth index, type of cooking fuel, number of family members, mothers’ educational status and receiving rotavirus vaccine were the top ten important predictors for anemia among under-five children. Machine-learning algorithm was applied to determine the predictors of anemia among under- 5 year’s age children in Ethiopia. We have identified the determinant factors by conducting a feature importance analysis with the Boruta algorithm. The most significant predictors were number of children, distance to health facility, health insurance coverage, youngest child’s stool disposal, residence, mothers’ wealth index, and type of cooking fuel. Machine learning model plays a paramount role for policy and intervention strategies related to anemia prevention and control among under-five children.",
        "DOI": "10.1038/s41598-023-50128-x",
        "affiliation_name": "Woldia University",
        "affiliation_city": "Woldia",
        "affiliation_country": "Ethiopia",
        "affiliation_id": "60138825",
        "affiliation_state": "Amhara"
    },
    {
        "paper_title": "Crop Yield Assessment Using Field-Based Data and Crop Models at the Village Level: A Case Study on a Homogeneous Rice Area in Telangana, India",
        "paper_author": "Mandapati R.",
        "publication": "AgriEngineering",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "Crop yield estimation has gained importance due to its vital significance for policymakers and decision-makers in enacting schemes, ensuring food security, and assessing crop insurance losses due to biotic and abiotic stress. This research focused on rice yield estimation at the field level in the Karimnagar district of Telangana during 2021 and 2022 by employing the leaf area index (LAI) as the primary criterion for integrating remote sensing technology and crop simulation models. Using Sentinel-2 satellite data, the rice crop was mapped with the help of ground data and machine learning algorithms, attaining an accuracy of 93.04%. Crop management data for the DSSAT tool were collected during the field visits; the model results revealed a 0.80 correlation between observed and predicted yields. Due to its strong correlation with LAI (0.82), the normalized difference vegetation index (NDVI) was selected as the critical element for integration with the model. A spatial LAI map was generated using the linear equation developed between the NDVI and LAI. The relationship between LAI and yield was used to create a spatial yield map. The study’s findings show that assimilating remote sensing data with crop models enhances the precision of rice yield prediction for insurance companies and policy- and decision-makers.",
        "DOI": "10.3390/agriengineering5040117",
        "affiliation_name": "Centurion University of Technology and Management",
        "affiliation_city": "Paralakhemundi",
        "affiliation_country": "India",
        "affiliation_id": "60075923",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "Comprehensive Growth Index (CGI): A Comprehensive Indicator from UAV-Observed Data for Winter Wheat Growth Status Monitoring",
        "paper_author": "Tang Y.",
        "publication": "Agronomy",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Crop growth monitoring plays an important role in estimating the scale of food production and providing a decision-making basis for agricultural policies. Moreover, it can allow understanding of the growth status of crops, seedling conditions, and changes in a timely manner, overcoming the disadvantages of traditional monitoring methods such as low efficiency and inaccuracy. In order to realize rapid and non-destructive monitoring of winter wheat growth status, this study introduced an equal weight method and coefficient of variation method to construct new comprehensive growth indicators based on drone images and measured data obtained from field experiments. The accuracy of the indicators in evaluating the growth of winter wheat can be judged by the construction, and the effects of different machine learning methods on the construction of indicators can be compared. Correlation analysis and variable screening were carried out on the constructed comprehensive growth indicators and the characteristic parameters extracted by the drone, and the comprehensive growth index estimation model was constructed using the selected parameter combination. Among them, when estimating the comprehensive growth index (CGIavg), the optimal model at the jointing stage is the support vector regression (SVR) model: R2 is 0.77, RMSE is 0.095; at the booting stage, the optimal model is the Gaussian process regression (GPR) model: R2 is 0.71, RMSE is 0.098; at the flowering stage, the optimal model is the SVR model: R2 is 0.78, RMSE is 0.087. When estimating the comprehensive growth index based on the coefficient of variation method (CGIcv), the optimal model at the jointing stage is the multi-scale retinex (MSR) model: R2 is 0.73, RMSE is 0.084; at the booting stage, the optimal model is the GPR model: R2 is 0.74, RMSE is 0.092; at the flowering stage, the optimal model is the SVR model, R2 is 0.78: RMSE is 0.085. The conclusion shows that the method of constructing the comprehensive growth index is superior to the function of a single parameter to some extent, providing a new way for wheat growth monitoring and process management.",
        "DOI": "10.3390/agronomy13122883",
        "affiliation_name": "Yangzhou University",
        "affiliation_city": "Yangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60007381",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "MaxEnt model strategies to studying current and future potential land suitability dynamics of wheat, soybean and rice cultivation under climatic change scenarios in East Asia",
        "paper_author": "Ali S.",
        "publication": "PLoS ONE",
        "citied_by": "9",
        "cover_date": "2023-12-01",
        "Abstract": "Climate change and variability are projected to alter the geographic suitability of lands for crops cultivation. Accurately predicting changes in the potential current and future land suitability distribution dynamics of wheat (Triticum aestivum), soybean (Glycine max) and rice (Oryza sativa) crops due to climate change scenarios is critical to adapting and mitigating the impacts of bioclimatic changes, and plays a significant role in securing food security in East Asia region. This study compiled large datasets of wheat, soybean and rice occurrence locations from GBIF and 19 bioclimatic variables obtained from the WorldClim database that affect crops growth. We recognized potential future suitable distribution regions for crops under the one socioeconomic pathway, (SSP585) for 2021–2040 and 2041–2060, using the MaxEnt model. The accuracy of the MaxEnt was highly significant with mean AUC values ranging from 0.833 to 0.882 for all models evaluated. The jackknife test revealed that for wheat, Bio4 and Bio12 contributed 17.6% and 12.6%, for soybean Bio10 and Bio12 contributed 15.6% and 49.5%, while for rice Bio12 and Bio14 contributed 12.9% and 36.0% to the MaxEnt model. In addition, cultivation aptitude for wheat, soybean, and rice increased in southeast China, North Korea, South Korea, and Japan, while decreasing in Mongolia and northwest China. Climate change is expected to increase the high land suitability for wheat, soybean, and rice in East Asia. Simulation results indicate an average decrease of unsuitable areas of -98.5%, -41.2% and -36.3% for wheat, soybean and rice from 2060 than that of current land suitability. In contrast, the high land suitable for wheat, soybean and rice cultivation is projected to increase by 75.1%, 68.5% and 81.9% from 2060 as compared with current. The findings of this study are of utmost importance in the East Asia region as they present an opportunity for policy makers to develop appropriate adaptation and mitigation strategies required to sustain crops distribution under future climates. Although the risks of wheat, soybean and rice cultivation may be significantly higher in the future because of high temperatures, heat waves, and droughts caused by climate change.",
        "DOI": "10.1371/journal.pone.0296182",
        "affiliation_name": "Hazara University Pakistan",
        "affiliation_city": "Mansehra",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60070606",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Prediction model of dental caries in 12-year-old children in Sichuan Province based on machine learning",
        "paper_author": "Yan X.",
        "publication": "Hua Xi Kou Qiang Yi Xue Za Zhi / West China Journal of Stomatology",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Objective The machine learning algorithm was used to construct a prediction model of children’s dental caries to determine the risk factors of dental caries in children and put forward targeted measures and policy suggestions to improve children’s oral health. Methods Stratified cluster random sampling was adopted in this study. In accordance with different policies and measures in Sichuan Province, 12-year-old students from 3−4 middle schools in eight cities of Sichuan Province were randomly selected for questionnaire survey, oral examination, and physical examination. Multivariate logistic regression analysis of risk factors for dental caries in 12-year-old children was conducted. The dataset was randomly divided into training set and validation set at a ratio of 7∶3. Four machine learning algorithms, including random forest, decision tree, extreme gradient boosting (XGBoost), and Logistic regression, were constructed using R version 4.1.1, and the prediction effects of the four prediction models were evaluated using the area under receiver operating characteristic curve (AUC). Re⁃ sults A total of 4 439 children aged 12 years were included in this study. The incidence of permanent teeth caries was 50.93%. The results of multivariate logistic regression analysis showed that body mass index, highest educational background of the father, highest educational background of the mother, whether to brush teeth, how many times a day, use of toothpaste when brushing teeth, duration of brushing teeth, mouthwash after meals, eating before going to bed after brushing teeth, sweet drinks, snacks, going to dental clinic to examine teeth, and age of brushing teeth were the factors influencing children’s dental caries (P<0.05). The AUC values predicted by random forest, decision tree, Logistic regression, and XGBoost were 0.840, 0.755, 0.799, and 0.794, respectively. In the random forest model, the variable with the highest contribution was eating before bed after brushing. Conclusion A prediction model of dental caries in children was established on the basis of random forest, showing good prediction effect. Taking preventive measures for the main factors affecting the occurrence of dental caries in children is beneficial.",
        "DOI": "10.7518/hxkq.2023.2023124",
        "affiliation_name": "Chengdu Medical College",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60084546",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "A Multi-Agent Reinforcement Learning Method for Omnidirectional Walking of Bipedal Robots",
        "paper_author": "Mou H.",
        "publication": "Biomimetics",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Achieving omnidirectional walking for bipedal robots is considered one of the most challenging tasks in robotics technology. Reinforcement learning (RL) methods have proved effective in bipedal walking tasks. However, most existing methods use state machines to switch between multiple policies and achieve omnidirectional gait, which results in shaking during the policy switching process for bipedal robots. To achieve a seamless transition between omnidirectional gait and transient motion for full-size bipedal robots, we propose a novel multi-agent RL method. Firstly, a multi-agent RL algorithm based on the actor–critic framework is designed, and policy entropy is introduced to improve exploration efficiency. By learning agents with parallel initial state distributions, we minimize reliance on gait planner effectiveness in the Robot Operating System (ROS). Additionally, we design a novel heterogeneous policy experience replay mechanism based on Euclidean distance. Secondly, considering the periodicity of bipedal robot walking, we develop a new periodic gait function. Including periodic objectives in the policy can accelerate the convergence speed of training periodic gait functions. Finally, to enhance the robustness of the policy, we construct a novel curriculum learning method by discretizing Gaussian distribution and incorporate it into the robot’s training task. Our method is validated in a simulation environment, and the results show that our method can achieve multiple gaits through a policy network and achieve smooth transitions between different gaits.",
        "DOI": "10.3390/biomimetics8080616",
        "affiliation_name": "Universität Hamburg",
        "affiliation_city": "Hamburg",
        "affiliation_country": "Germany",
        "affiliation_id": "60028229",
        "affiliation_state": "Hamburg"
    },
    {
        "paper_title": "Towards improved screening of toxins for Parkinson’s risk",
        "paper_author": "Shan L.",
        "publication": "npj Parkinson's Disease",
        "citied_by": "11",
        "cover_date": "2023-12-01",
        "Abstract": "Parkinson’s disease (PD) is a chronic, progressive and disabling neurodegenerative disorder. The prevalence of PD has risen considerably over the past decades. A growing body of evidence suggest that exposure to environmental toxins, including pesticides, solvents and heavy metals (collectively called toxins), is at least in part responsible for this rapid growth. It is worrying that the current screening procedures being applied internationally to test for possible neurotoxicity of specific compounds offer inadequate insights into the risk of developing PD in humans. Improved screening procedures are therefore urgently needed. Our review first substantiates current evidence on the relation between exposure to environmental toxins and the risk of developing PD. We subsequently propose to replace the current standard toxin screening by a well-controlled multi-tier toxin screening involving the following steps: in silico studies (tier 1) followed by in vitro tests (tier 2), aiming to prioritize agents with human relevant routes of exposure. More in depth studies can be undertaken in tier 3, with whole-organism (in)vertebrate models. Tier 4 has a dedicated focus on cell loss in the substantia nigra and on the presumed mechanisms of neurotoxicity in rodent models, which are required to confirm or refute the possible neurotoxicity of any individual compound. This improved screening procedure should not only evaluate new pesticides that seek access to the market, but also critically assess all pesticides that are being used today, acknowledging that none of these has ever been proven to be safe from a perspective of PD. Importantly, the improved screening procedures should not just assess the neurotoxic risk of isolated compounds, but should also specifically look at the cumulative risk conveyed by exposure to commonly used combinations of pesticides (cocktails). The worldwide implementation of such an improved screening procedure, would be an essential step for policy makers and governments to recognize PD-related environmental risk factors.",
        "DOI": "10.1038/s41531-023-00615-9",
        "affiliation_name": "Donders Institute for Brain, Cognition and Behaviour",
        "affiliation_city": "Nijmegen",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60102054",
        "affiliation_state": "Gelderland"
    },
    {
        "paper_title": "Toward a Balanced Approach: Bridging the Military, Policy, and Technical Communities",
        "paper_author": "Seraphin A.",
        "publication": "Ethics and International Affairs",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "The development of new technologies that enable autonomous weapon systems poses a challenge to policymakers and technologists trying to balance military requirements with international obligations and ethical norms. Some have called for new international agreements to restrict or ban lethal autonomous weapon systems. Given the tactical and strategic value of the technologies and the proliferation of threats, the military continues to explore the development of new autonomous technologies to execute national security missions. The rapid global diffusion and dualuse nature of autonomous systems necessitate a proactive approach and a shared understanding of the technical realities, threats, military relevance, and strategic implications of these technologies from these communities. Ultimately, developing AI-enabled defense systems that adhere to global norms and relevant treaty obligations, leverage emerging technologies, and provide operational advantages is possible. The development of a workable and realistic regulatory framework governing the use of lethal autonomous weapons and the artificial intelligence that underpins autonomy will be best supported through a coordinated effort of the regulatory community, technologists, and military to create requirements that reflect the global proliferation and rapidly evolving threat of autonomous weapon systems. This essay seeks to demonstrate that: (1) the lack of coherent dialogue between the technical and policy communities can create security, ethical, and legal dilemmas; and (2) bridging the military, technical, and policy communities can lead to technology with constraints that balance the needs of military, technical, and policy communities. It uses case studies to show why mechanisms are needed to enable early and continuous engagement across the technical, policymaking, and operational communities. The essay then uses twelve interviews with AI and autonomy experts, which provide insight into what the technical and policymaking communities consider fundamental to the progression of responsible autonomous development. It also recommends practical steps for connecting the relevant stakeholders. The goal is to provide the Department of Defense with concrete steps for building organizational structures or processes that create incentives for engagement across communities.",
        "DOI": "10.1017/S0892679423000321",
        "affiliation_name": "Emerging Technologies Institute",
        "affiliation_city": null,
        "affiliation_country": "United States",
        "affiliation_id": "130584936",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "Revolutionizing Biological Science: The Synergy of Genomics in Health, Bioinformatics, Agriculture, and Artificial Intelligence",
        "paper_author": "Biswas A.",
        "publication": "OMICS A Journal of Integrative Biology",
        "citied_by": "10",
        "cover_date": "2023-12-01",
        "Abstract": "With climate emergency, COVID-19, and the rise of planetary health scholarship, the binary of human and ecosystem health has been deeply challenged. The interdependence of human and nonhuman animal health is increasingly acknowledged and paving the way for new frontiers in integrative biology. The convergence of genomics in health, bioinformatics, agriculture, and artificial intelligence (AI) has ushered in a new era of possibilities and applications. However, the sheer volume of genomic/multiomics big data generated also presents formidable sociotechnical challenges in extracting meaningful biological, planetary health and ecological insights. Over the past few years, AI-guided bioinformatics has emerged as a powerful tool for managing, analyzing, and interpreting complex biological datasets. The advances in AI, particularly in machine learning and deep learning, have been transforming the fields of genomics, planetary health, and agriculture. This article aims to unpack and explore the formidable range of possibilities and challenges that result from such transdisciplinary integration, and emphasizes its radically transformative potential for human and ecosystem health. The integration of these disciplines is also driving significant advancements in precision medicine and personalized health care. This presents an unprecedented opportunity to deepen our understanding of complex biological systems and advance the well-being of all life in planetary ecosystems. Notwithstanding in mind its sociotechnical, ethical, and critical policy challenges, the integration of genomics, multiomics, planetary health, and agriculture with AI-guided bioinformatics opens up vast opportunities for transnational collaborative efforts, data sharing, analysis, valorization, and interdisciplinary innovations in life sciences and integrative biology.",
        "DOI": "10.1089/omi.2023.0197",
        "affiliation_name": "Amity University Jharkhand",
        "affiliation_city": "Ranchi",
        "affiliation_country": "India",
        "affiliation_id": "60273561",
        "affiliation_state": "JH"
    },
    {
        "paper_title": "From policy to practice: Lessons learned from an open science funding initiative",
        "paper_author": "Dumanis S.B.",
        "publication": "PLoS Computational Biology",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "NA",
        "DOI": "10.1371/journal.pcbi.1011626",
        "affiliation_name": "University of California, Berkeley",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60025038",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Towards understanding policy design through text-as-data approaches: The policy design annotations (POLIANNA) dataset",
        "paper_author": "Sewerin S.",
        "publication": "Scientific Data",
        "citied_by": "5",
        "cover_date": "2023-12-01",
        "Abstract": "Despite the importance of ambitious policy action for addressing climate change, large and systematic assessments of public policies and their design are lacking as analysing text manually is labour-intensive and costly. POLIANNA is a dataset of policy texts from the European Union (EU) that are annotated based on theoretical concepts of policy design, which can be used to develop supervised machine learning approaches for scaling policy analysis. The dataset consists of 20,577 annotated spans, drawn from 18 EU climate change mitigation and renewable energy policies. We developed a novel coding scheme translating existing taxonomies of policy design elements to a method for annotating text spans that consist of one or several words. Here, we provide the coding scheme, a description of the annotated corpus, and an analysis of inter-annotator agreement, and discuss potential applications. As understanding policy texts is still difficult for current text-processing algorithms, we envision this database to be used for building tools that help with manual coding of policy texts by automatically proposing paragraphs containing relevant information.",
        "DOI": "10.1038/s41597-023-02801-z",
        "affiliation_name": "Lee Kuan Yew School of Public Policy",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60109868",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A New Method for Estimating Groundwater Changes Based on Optimized Deep Learning Models—A Case Study of Baiquan Spring Domain in China",
        "paper_author": "Zhang J.",
        "publication": "Water (Switzerland)",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Estimating groundwater level (GWL) changes is crucial for the sustainable management of water resources in the face of urbanization and population growth. Existing prediction methods for GWL variations have limitations due to their inability to account for the diverse and irregular patterns of change. This paper introduces an innovative approach to GWL prediction that leverages multisource data and offers a comprehensive analysis of influencing factors. Our methodology goes beyond conventional approaches by incorporating historical GWL data, examining the impacts of precipitation and extraction, as well as considering policy-driven influences, especially in nations like China. The main contribution of this study is the development of a novel hierarchical framework (HGP) for GWL prediction, which progressively integrates correlations among different hierarchical information sources. In our experimental analysis, we make a significant discovery: extraction has a more substantial impact on GWL changes compared to precipitation. Building on this insight, our HGP model demonstrates superior predictive performance when evaluated on real-world datasets. The results show that HGP can increase NSE and R2 scores by 2.8% during the test period compared to the current more accurate deep learning method: ANFIS. This innovative model not only enhances GWL prediction accuracy but also provides valuable insight for effective water resource management. By incorporating multisource data and a novel hierarchical framework, our approach advances the state of the art in GWL prediction, contributing to more sustainable and informed decision making in the context of groundwater resource management.",
        "DOI": "10.3390/w15234129",
        "affiliation_name": "China University of Mining &amp; Technology, Beijing",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60108755",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Policy Gradient Algorithm to Alleviate the Multi-Agent Value Overestimation Problem in Complex Environments",
        "paper_author": "Yang Y.",
        "publication": "Sensors",
        "citied_by": "0",
        "cover_date": "2023-12-01",
        "Abstract": "Multi-agent reinforcement learning excels at addressing group intelligent decision-making problems involving sequential decision-making. In particular, in complex, high-dimensional state and action spaces, it imposes higher demands on the reliability, stability, and adaptability of decision algorithms. The reinforcement learning algorithm based on the multi-agent deep strategy gradient incorporates a function approximation method using discriminant networks. However, this can lead to estimation errors when agents evaluate action values, thereby reducing model reliability and stability and resulting in challenging convergence. With the increasing complexity of the environment, there is a decline in the quality of experience collected by the experience playback pool, resulting in low efficiency of the sampling stage and difficulties in algorithm convergence. To address these challenges, we propose an innovative approach called the empirical clustering layer-based multi-agent dual dueling policy gradient (ECL-MAD3PG) algorithm. Experimental results demonstrate that our ECL-MAD3PG algorithm outperforms other methods in various complex environments, demonstrating a remarkable 9.1% improvement in mission completion compared to MADDPG within the context of complex UAV cooperative combat scenarios.",
        "DOI": "10.3390/s23239520",
        "affiliation_name": "University of Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027363",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Machine Learning Approach for Investment Analysis in Renewable Energy Sources: A Case Study in Photovoltaic Farms",
        "paper_author": "Ioannou K.",
        "publication": "Energies",
        "citied_by": "1",
        "cover_date": "2023-12-01",
        "Abstract": "Farmland offers excellent conditions for developing solar energy while farmers seem to appreciate its notable revenues. The increasing adoption of photovoltaics (PVs) on farmland raises various concerns with the most important being the loss of productive farmland and the increased farmland prices, which may prevent young farmers from entering the farming occupation. The latter can threaten the future of agriculture in countries that are already facing the problem of rural population ageing. The aim of this paper is to examine the effect of crop type on farmers’ willingness to install photovoltaics on their farmland. To that end, this study applies four machine learning (ML) algorithms (categorical regression, decision trees and random forests, support vector machines) on a dataset obtained from a questionnaire survey on farmers in a Greek agricultural area. The results from the application of the algorithms allowed us to quantify and relate farmers’ willingness to invest in PVs with three major crop types (cotton, wheat, sunflower) which play a very important role in food security. Results also provide support for making policy interventions by defining the rate of productive farmland for photovoltaics and also for designing policies to support farmers to start and maintain farming operations.",
        "DOI": "10.3390/en16237735",
        "affiliation_name": "Forest Research Institute",
        "affiliation_city": "Thessaloniki",
        "affiliation_country": "Greece",
        "affiliation_id": "60042637",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The allometric relationship between carbon emission and economic development in Yangtze River Delta: fusion of multi-source remote sensing nighttime light data",
        "paper_author": "Xu J.",
        "publication": "Environmental science and pollution research international",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "Exploring the allometric relationship between carbon emission and economic development can provide guidance for policy-makers who hope to accelerate carbon emission reduction and achieve high-quality development. First, based on the established DMSP/OLS and NPP/VIIRS nighttime light datasets, this study simulated the carbon emissions of the Yangtze River Delta from 2000 to 2020. Second, our research analyzed the spatiotemporal evolution characteristics of carbon emissions. Third, adopting allometric growth model, we explored the allometric relationship between economic development and carbon emissions in Yangtze River Delta. The main conclusions are as follows. First, four prediction models, namely, linear fitting, support vector machine, random forest, and CNN-BiLSTM deep learning, were compared to simulate the accuracy of carbon emissions. Consequently, the CNN-BiLSTM deep learning estimation model presented the best accuracy. Second, both the carbon emissions in YRD as a whole showed an increasing trend, with the largest growth rate appearing in Shanghai and the smallest growth rate occurring in Lishui. Moreover, the high-carbon emission areas were mainly distributed in the core city cluster, which are enclosed by Shanghai, Nanjing, and Hangzhou. Finally, the allometric relationship between economic development and carbon emissions was dominated by one-level negative during the sample period, and the relative growth rate of carbon emissions is lower than that of the economic development, which made the YRD at a basic coordinate stage of weak expansion of economy.",
        "DOI": "10.1007/s11356-023-30692-5",
        "affiliation_name": "Chuzhou University",
        "affiliation_city": "Chuzhou",
        "affiliation_country": "China",
        "affiliation_id": "60103963",
        "affiliation_state": "Anhui"
    },
    {
        "paper_title": "Security-aware 5G RAN slice mapping with tiered isolation in physical-layer secured metro-aggregation elastic optical networks using heuristic-assisted DRL",
        "paper_author": "Wang Y.",
        "publication": "Journal of Optical Communications and Networking",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "The optical transport network (OTN) encryption technology is attractive to solve the physical-layer security in services for the light-path provision process. This paper mainly explores the security-aware 5G radio access network (RAN) slice mapping problem with the tiered isolation (TI) policy, which decides the solution for aggregating service into the physical-layer secured metro-aggregation elastic optical networks (MA-EONs). We first introduce the physical-layer secured OTNs and illustrate their differences from the traditional optical networks. Then, we formulate the 5G RAN slice mapping problem in physical-layer secured MA-EONs as an exact integer linear programming (ILP) model to minimize the average cost (AC), which consists of the number of utilized processing pools (PPs)/general-purpose processors (GPPs)/virtual machines (VMs), and maximum frequency slot index (MFSI) on the light-paths, meanwhile satisfying the given slices latency, isolation, and security requirements. After that, to overcome the non-scalability problem of the ILP model, a heuristic-assisted deep reinforcement learning (HA-DRL) algorithm is proposed to obtain a near-optimal solution for large-scale network scenarios, where the classical shortest path algorithm is employed in the DRL to shrink the size of the exploration space and accelerate the convergence process. Finally, we evaluate the proposed ILP model and HA-DRL algorithm through extensive simulations. Simulation results indicate that our proposed HA-DRL method can find approximate solutions to the ILP model in the small-scale network scenario. Furthermore, the HA-DRL method can also achieve higher resource efficiency compared with benchmark heuristic first-fit algorithms in the large-scale network scenario. In comparison to the first-fit algorithm benchmark, the proposed HA-DRL can achieve up to 9.4% AC reduction in large-scale network scenarios.",
        "DOI": "10.1364/JOCN.499551",
        "affiliation_name": "Purple Mountain Laboratory",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60278946",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Groundwater Vulnerability in a Megacity Under Climate and Economic Changes: A Coupled Sociohydrological Analysis",
        "paper_author": "Li B.",
        "publication": "Water Resources Research",
        "citied_by": "2",
        "cover_date": "2023-12-01",
        "Abstract": "Groundwater depletion has become increasingly challenging, and many cities worldwide have adopted drastic policies to relieve water stress due to socioeconomic growth. Located on the declining aquifer of the North China Plain, Beijing, for example, has developed plans to limit the size of the city’s population. However, the effect of population displacement under uncertain macroeconomic and climate change remains ambiguous. We adopt a sociohydrological model, with explicit consideration of the dynamics of human-water interactions, to explore the groundwater vulnerability of Beijing. We investigate how human response might shape the development trajectories of the groundwater-population-economy system under different macroscale economic and climate scenarios. Furthermore, we use a machine learning algorithm to identify the decisive factors to be considered for reducing groundwater vulnerability. Our results show that while rapid external economic development or larger annual average precipitation would enable recovery of the groundwater table in the short term, they may slacken human water shortage awareness and result in more acute groundwater depletion in the long run. Strengthening policymaker perceptions of groundwater depletion would prompt timely response policies for controlling population size. Improving the quantity and quality of labor force input to economic development would avoid downturns in the economy due to labor shortages. The outcomes of this study suggest that these strategies would effectively reduce groundwater vulnerability in the long run without causing severe socioeconomic recession. These findings highlight the importance of endogenizing human behavioral dynamics in sustainable urban water management.",
        "DOI": "10.1029/2022WR033943",
        "affiliation_name": "The Grainger College of Engineering",
        "affiliation_city": "Urbana",
        "affiliation_country": "United States",
        "affiliation_id": "60158506",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "Machine learning analysis of government's public risk communication during COVID-19 lockdown in Wuhan, China",
        "paper_author": "Guo C.",
        "publication": "International Journal of Disaster Risk Reduction",
        "citied_by": "3",
        "cover_date": "2023-12-01",
        "Abstract": "The COVID-19 pandemic has caused millions of deaths worldwide since 2020, and has led to sizable health and economic costs. Although COVID-19 cases were first detected in Wuhan, over time the death rate attributable to COVID-19 was one of the lowest globally. Understanding the Chinese government's focuses and strategies can offer insights into early pandemic control in the future. This study aimed to explore the strategies and practices of government risk communication adopted during the COVID-19 lockdown in Wuhan, China; and provide implications for effective health risk communication at the early stage of epidemic response. The 90 government press conference records during the Wuhan lockdown (from January 22, 2020 to May 1, 2020) were divided into three batches and preprocessed. Topic modeling, i.e., the Latent Dirichlet Allocation, was used to computationally extract the topics in each batch. We identified important topics early in the lockdown period, such as “medical team's work”, “assuring supplies for society”, “patients' detection and isolation”; in the middle batch such as “patient treatment and hospitalization”, “enterprises' resumption of work and production”, “epidemic prevention and control”; and later in the lockdown including “policies supporting enterprises”, “ensuring employment”, as well as “blood donation”. We found that communicators from various government sectors provided consistent, concise information during the pandemic. Sectors involved included health, transportation, employment, agriculture, banking, industrial recovery, and resource deployment. Our results suggest that pandemic control requires not only effective public health policies but also collaboration and collective action across diverse societal systems.",
        "DOI": "10.1016/j.ijdrr.2023.104119",
        "affiliation_name": "Guangzhou University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60025345",
        "affiliation_state": "Guangdong"
    }
]