[
    {
        "paper_title": "Advancements in Microwave Absorption Motivated by Interdisciplinary Research",
        "publication": "Advanced Materials",
        "citied_by": "116",
        "cover_date": "2024-01-25",
        "Abstract": "Microwave absorption materials (MAMs) are originally developed for military purposes, but have since evolved into versatile materials with promising applications in modern technologies, including household use. Despite significant progress in bench-side research over the past decade, MAMs remain limited in their scope and have yet to be widely adopted. This review explores the history of MAMs from first-generation coatings to second-generation functional absorbers, identifies bottlenecks hindering their maturation. It also presents potential solutions such as exploring broader spatial scales, advanced characterization, introducing liquid media, utilizing novel toolbox (machine learning, ML), and proximity of lab to end-user. Additionally, it meticulously presents compelling applications of MAMs in medicine, mechanics, energy, optics, and sensing, which go beyond absorption efficiency, along with their current development status and prospects. This interdisciplinary research direction differs from previous research which primarily focused on meeting traditional requirements (i.e., thin, lightweight, wide, and strong), and can be defined as the next generation of smart absorbers. Ultimately, the effective utilization of ubiquitous electromagnetic (EM) waves, aided by third-generation MAMs, should be better aligned with future expectations.",
        "DOI": "10.1002/adma.202304182",
        "paper_author": "Zhao Z.",
        "affiliation_name": "Northwestern Polytechnical University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60003977",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Materials-Driven Soft Wearable Bioelectronics for Connected Healthcare",
        "publication": "Chemical Reviews",
        "citied_by": "106",
        "cover_date": "2024-01-24",
        "Abstract": "In the era of Internet-of-things, many things can stay connected; however, biological systems, including those necessary for human health, remain unable to stay connected to the global Internet due to the lack of soft conformal biosensors. The fundamental challenge lies in the fact that electronics and biology are distinct and incompatible, as they are based on different materials via different functioning principles. In particular, the human body is soft and curvilinear, yet electronics are typically rigid and planar. Recent advances in materials and materials design have generated tremendous opportunities to design soft wearable bioelectronics, which may bridge the gap, enabling the ultimate dream of connected healthcare for anyone, anytime, and anywhere. We begin with a review of the historical development of healthcare, indicating the significant trend of connected healthcare. This is followed by the focal point of discussion about new materials and materials design, particularly low-dimensional nanomaterials. We summarize material types and their attributes for designing soft bioelectronic sensors; we also cover their synthesis and fabrication methods, including top-down, bottom-up, and their combined approaches. Next, we discuss the wearable energy challenges and progress made to date. In addition to front-end wearable devices, we also describe back-end machine learning algorithms, artificial intelligence, telecommunication, and software. Afterward, we describe the integration of soft wearable bioelectronic systems which have been applied in various testbeds in real-world settings, including laboratories that are preclinical and clinical environments. Finally, we narrate the remaining challenges and opportunities in conjunction with our perspectives.",
        "DOI": "10.1021/acs.chemrev.3c00502",
        "paper_author": "Gong S.",
        "affiliation_name": "Monash University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60019578",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Solar power generation forecasting using ensemble approach based on deep learning and statistical methods",
        "publication": "Applied Computing and Informatics",
        "citied_by": "87",
        "cover_date": "2024-06-17",
        "Abstract": "Solar power forecasting will have a significant impact on the future of large-scale renewable energy plants. Predicting photovoltaic power generation depends heavily on climate conditions, which fluctuate over time. In this research, we propose a hybrid model that combines machine-learning methods with Theta statistical method for more accurate prediction of future solar power generation from renewable energy plants. The machine learning models include long short-term memory (LSTM), gate recurrent unit (GRU), AutoEncoder LSTM (Auto-LSTM) and a newly proposed Auto-GRU. To enhance the accuracy of the proposed Machine learning and Statistical Hybrid Model (MLSHM), we employ two diversity techniques, i.e. structural diversity and data diversity. To combine the prediction of the ensemble members in the proposed MLSHM, we exploit four combining methods: simple averaging approach, weighted averaging using linear approach and using non-linear approach, and combination through variance using inverse approach. The proposed MLSHM scheme was validated on two real-time series datasets, that sre Shagaya in Kuwait and Cocoa in the USA. The experiments show that the proposed MLSHM, using all the combination methods, achieved higher accuracy compared to the prediction of the traditional individual models. Results demonstrate that a hybrid model combining machine-learning methods with statistical method outperformed a hybrid model that only combines machine-learning models without statistical method.",
        "DOI": "10.1016/j.aci.2019.11.002",
        "paper_author": "AlKandari M.",
        "affiliation_name": "Kuwait University",
        "affiliation_city": "Kuwait City",
        "affiliation_country": "Kuwait",
        "affiliation_id": "60038812",
        "affiliation_state": "Safat"
    },
    {
        "paper_title": "Hardware implementation of memristor-based artificial neural networks",
        "publication": "Nature Communications",
        "citied_by": "84",
        "cover_date": "2024-12-01",
        "Abstract": "Artificial Intelligence (AI) is currently experiencing a bloom driven by deep learning (DL) techniques, which rely on networks of connected simple computing units operating in parallel. The low communication bandwidth between memory and processing units in conventional von Neumann machines does not support the requirements of emerging applications that rely extensively on large sets of data. More recent computing paradigms, such as high parallelization and near-memory computing, help alleviate the data communication bottleneck to some extent, but paradigm- shifting concepts are required. Memristors, a novel beyond-complementary metal-oxide-semiconductor (CMOS) technology, are a promising choice for memory devices due to their unique intrinsic device-level properties, enabling both storing and computing with a small, massively-parallel footprint at low power. Theoretically, this directly translates to a major boost in energy efficiency and computational throughput, but various practical challenges remain. In this work we review the latest efforts for achieving hardware-based memristive artificial neural networks (ANNs), describing with detail the working principia of each block and the different design alternatives with their own advantages and disadvantages, as well as the tools required for accurate estimation of performance metrics. Ultimately, we aim to provide a comprehensive protocol of the materials and methods involved in memristive neural networks to those aiming to start working in this field and the experts looking for a holistic approach.",
        "DOI": "10.1038/s41467-024-45670-9",
        "paper_author": "Aguirre F.",
        "affiliation_name": "King Abdullah University of Science and Technology",
        "affiliation_city": "Thuwal",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60092945",
        "affiliation_state": "Makkah"
    },
    {
        "paper_title": "A critical review on inconsistency mechanism, evaluation methods and improvement measures for lithium-ion battery energy storage systems",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "82",
        "cover_date": "2024-01-01",
        "Abstract": "With the rapid development of electric vehicles and smart grids, the demand for battery energy storage systems is growing rapidly. The large-scale battery system leads to prominent inconsistency issues. This work systematically reviewed the causes, hazards, evaluation methods and improvement measures of lithium-ion battery inconsistency. From material to manufacture and usage, the process and conditions of each link affect battery consistency. The hazards of battery pack inconsistency include increasing system failure rate, reducing service performance and accelerating life decay. Inconsistency evaluation methods are summarized as statistics-based, machine learning-based and information fusion-based methods. Moreover, the improvement measures of battery inconsistency are reviewed from the aspects of the production process, sorting technology, topology optimization, equalization control and thermal management. In addition, the future works on challenges and prospects of battery inconsistency research are revealed, in hope of inspiring the efficient operation and maintenance of large-scale battery energy storage systems.",
        "DOI": "10.1016/j.rser.2023.113978",
        "paper_author": "Tian J.",
        "affiliation_name": "Anhui University",
        "affiliation_city": "Hefei",
        "affiliation_country": "China",
        "affiliation_id": "60001455",
        "affiliation_state": "Anhui"
    },
    {
        "paper_title": "Intelligent Machinery Fault Diagnosis With Event-Based Camera",
        "publication": "IEEE Transactions on Industrial Informatics",
        "citied_by": "78",
        "cover_date": "2024-01-01",
        "Abstract": "Event-based cameras are the emerging bioinspired technology in vision sensing. Different from the traditional standard cameras, the event-based cameras asynchronously record the brightness change per pixel, and have the great merits of high temporal resolution, low energy consumption, high dynamic range, etc. While the event-based cameras have been initially exploited in several common vision-based tasks in the recent years, the investigation on machine condition monitoring problem is quite limited. This article offers the first attempt in the current literature on exploring the contactless event vision data for machine fault diagnosis. A vibration event representation is proposed to transform the event records into typical data samples, and a deep convolutional neural network model is used for processing the event information. To enhance the model robustness against environmental noisy vision events, an event data augmentation method is proposed to introduce variations of the event patterns. A deep representation clustering method is further proposed to improve the pattern recognition performance with respect to different machine health conditions. Experiments on the event vision-based rotating machine fault diagnosis problem are carried out. It is extensively validated that high fault diagnosis accuracies can be obtained using the vision data from the event-based cameras, which are competitive with the popular accelerometer data. Considering the properties of flexibility, portability, and data recognizability, the event-based cameras thus provide a promising new tool for contactless machine health condition monitoring and fault diagnosis.",
        "DOI": "10.1109/TII.2023.3262854",
        "paper_author": "Li X.",
        "affiliation_name": "Xi'an Jiaotong University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60018308",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Data-driven interpretable ensemble learning methods for the prediction of wind turbine power incorporating SHAP analysis",
        "publication": "Expert Systems with Applications",
        "citied_by": "76",
        "cover_date": "2024-03-01",
        "Abstract": "Wind energy increasingly attracts investment from many countries as a clean and renewable energy source. Since wind energy investment cost is high, the efficiency of a potential wind power plant should be determined using wind power prediction models and wind speed data before installation. Accurate wind power estimation is crucial to set up comprehensive strategies for wind power generation. This study estimated the power produced in a wind turbine using six different regression algorithms based on machine learning using temperature, humidity, pressure, air density, and wind speed data. The proposed estimation model was evaluated on the data received between 2011 and 2020 at station 17,112 in Çanakkale, Turkey. XGBoost, Random Forest, LightGBM, CatBoost, AdaBoost, and M5-Prime algorithms were used to create predictive models. Furthermore, model explanations were presented using the SHAP methodology. Among the regression algorithms evaluated according to the R2 performance metric, the best performance was obtained from the XGBoost algorithm. Regarding computational speed, the LightGBM model emerged as the most efficient model. The wind speed was shown to be the input feature with the SHAP algorithm's most significant impact on the model predictions.",
        "DOI": "10.1016/j.eswa.2023.121464",
        "paper_author": "Cakiroglu C.",
        "affiliation_name": "Turkish-German University",
        "affiliation_city": "Istanbul",
        "affiliation_country": "Turkey",
        "affiliation_id": "60106510",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Reinforcement Learning Approach for Flexible Job Shop Scheduling Problem With Crane Transportation and Setup Times",
        "publication": "IEEE Transactions on Neural Networks and Learning Systems",
        "citied_by": "73",
        "cover_date": "2024-04-01",
        "Abstract": "Flexible job shop scheduling problem (FJSP) has attracted research interests as it can significantly improve the energy, cost, and time efficiency of production. As one type of reinforcement learning, deep Q-network (DQN) has been applied to solve numerous realistic optimization problems. In this study, a DQN model is proposed to solve a multiobjective FJSP with crane transportation and setup times (FJSP-CS). Two objectives, i.e., makespan and total energy consumption, are optimized simultaneously based on weighting approach. To better reflect the problem realities, eight different crane transportation stages and three typical machine states including processing, setup, and standby are investigated. Considering the complexity of FJSP-CS, an identification rule is designed to organize the crane transportation in solution decoding. As for the DQN model, 12 state features and seven actions are designed to describe the features in the scheduling process. A novel structure is applied in the DQN topology, saving the calculation resources and improving the performance. In DQN training, double deep Q-network technique and soft target weight update strategy are used. In addition, three reported improvement strategies are adopted to enhance the solution qualities by adjusting scheduling assignments. Extensive computational tests and comparisons demonstrate the effectiveness and advantages of the proposed method in solving FJSP-CS, where the DQN can choose appropriate dispatching rules at various scheduling situations.",
        "DOI": "10.1109/TNNLS.2022.3208942",
        "paper_author": "Du Y.",
        "affiliation_name": "Shandong Normal University",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60002210",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "MOFs-Bbased Materials for Solid-State Hydrogen Storage: Strategies and Perspectives",
        "publication": "Chemical Engineering Journal",
        "citied_by": "71",
        "cover_date": "2024-04-01",
        "Abstract": "Exceptionally porous crystals with ultrahigh adsorption capacities, metal–organic frameworks (MOFs), have received recognition as leading candidates for the promotion of solid-state hydrogen storage. MOFs are compelling adsorbents given their impressive uptake under stringent cryogenic and high-pressure conditions for physisorption. The use of high-throughput screening to rapidly identify potential candidates, the understanding of structure–property correlations through molecular simulations, and the use of machine learning to predict material properties offer a more efficient approach to meeting these stringent operational constraints. Furthermore, the open metal sites and customizable pore structures act make MOFs as catalysts or nanoconfinement matrices, facilitating enhancements in the thermodynamics and kinetics of reactive chemical hydrides. Strategically harnessing the tunability of MOFs could unlock vast, untapped potential for enabling high-density, reversible hydrogen storage under real-world conditions, aligned with sustainability needs. This review establishes MOFs as an innovative platform in solid-state hydrogen storage by intertwining material discovery with engineering principles. The comprehensive analysis and consolidation of the research provides new perspectives to broaden the scope of the investigation and drive the widespread deployment and development of hydrogen energy.",
        "DOI": "10.1016/j.cej.2024.149665",
        "paper_author": "Li Y.",
        "affiliation_name": "Wuhan University of Science and Technology",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60014643",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Optimized integration of solar energy and liquefied natural gas regasification for sustainable urban development: Dynamic modeling, data-driven optimization, and case study",
        "publication": "Journal of Cleaner Production",
        "citied_by": "67",
        "cover_date": "2024-04-01",
        "Abstract": "As sustainable urban communities continue to seek alternative energy sources, this study explores the inclusion of renewable resources in the energy mix. With a focus on liquefied natural gas (LNG) regasification, parabolic trough solar collectors, dual-loop power cycles, proton exchange membrane electrolysis, and hydrogen liquefaction cycle, this research conducts a comprehensive examination of an integrated system. The primary objective is to provide a diverse range of valuable outputs, including electricity, liquefied hydrogen, desalinated water, and cooling for coastal areas. Through careful analysis of regional geographic features, San Francisco emerges as a suitable location due to its favorable solar radiation intensity and existing LNG transportation infrastructure. The findings reveal that the integrated system has the potential to deliver approximately 5750.4 MWh of cooling, 14988.85 MWh of electricity, and 1,491,084 m3 of fresh water, thereby significantly contributing to the city's utility demands. In terms of data-driven optimization, artificial neural networks serve as intermediary mechanisms to establish correlations between the developed code and the optimization algorithm. The results demonstrate that the optimized system exhibits notable improvements in production capacity. Moreover, significant reductions in the levelized cost of electricity (0.19 Cent/kWh), fresh water (1.22 Cent/m3), and hydrogen (0.08 $/kg) are observed. Although the optimized case entails a 16.11% higher cost rate compared to the base system, it is projected to generate a 25.59% higher profit over its operational lifespan. Additionally, the payback period of the optimized system is shortened by 6.31%, making it an attractive long-term investment for sustainable urban development.",
        "DOI": "10.1016/j.jclepro.2024.141405",
        "paper_author": "Yang C.",
        "affiliation_name": "Hubei University of Automotive Technology",
        "affiliation_city": "Shiyan",
        "affiliation_country": "China",
        "affiliation_id": "60083908",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Calculation of carbon emissions in wastewater treatment and its neutralization measures: A review",
        "publication": "Science of the Total Environment",
        "citied_by": "67",
        "cover_date": "2024-02-20",
        "Abstract": "As the pursuit of “carbon neutrality” gains momentum, the emphasis on low-carbon solutions, emphasizing energy conservation and resource reuse, has introduced fresh challenges to conventional wastewater treatment approaches. Precisely evaluating carbon emissions in urban water supply and drainage systems, wastewater treatment plants, and establishing carbon-neutral operating models has become a pivotal concern in the future of wastewater treatment. Regrettably, limited research has been devoted to carbon accounting and the development of carbon-neutral strategies for wastewater treatment. In this review, to facilitate comprehensive carbon accounting, we initially recognizes direct and indirect carbon emission sources in the wastewater treatment process. We then provide an overview of several major carbon accounting methods and propose a carbon accounting framework. Furthermore, we advocate for a systemic perspective, highlighting that achieving carbon neutrality in wastewater treatment extends beyond the boundaries of wastewater treatment plants. We assess current technical measures both within and outside the plants that contribute to achieving carbon-neutral operations. Encouraging the application of intelligent algorithms for the multifaceted monitoring and control of wastewater treatment processes is paramount. Supporting resource and energy recycling is also essential, as is recognizing the benefits of synergistic wastewater treatment technologies. We advocate a systematic, multi-level planning approach that takes into account a wide range of factors. Our goal is to offer valuable insights and support for the practical implementation of water environment management within the framework of carbon neutrality, and to advance sustainable socio-economic development and contribute to a more environmentally responsible future.",
        "DOI": "10.1016/j.scitotenv.2023.169356",
        "paper_author": "Liu Z.",
        "affiliation_name": "Shaoxing University",
        "affiliation_city": "Shaoxing",
        "affiliation_country": "China",
        "affiliation_id": "60024781",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Physics-informed neural network for lithium-ion battery degradation stable modeling and prognosis",
        "publication": "Nature Communications",
        "citied_by": "61",
        "cover_date": "2024-12-01",
        "Abstract": "Accurate state-of-health (SOH) estimation is critical for reliable and safe operation of lithium-ion batteries. However, reliable and stable battery SOH estimation remains challenging due to diverse battery types and operating conditions. In this paper, we propose a physics-informed neural network (PINN) for accurate and stable estimation of battery SOH. Specifically, we model the attributes that affect the battery degradation from the perspective of empirical degradation and state space equations, and utilize neural networks to capture battery degradation dynamics. A general feature extraction method is designed to extract statistical features from a short period of data before the battery is fully charged, enabling our method applicable to different battery types and charge/discharge protocols. Additionally, we generate a comprehensive dataset consisting of 55 lithium-nickel-cobalt-manganese-oxide (NCM) batteries. Combined with three other datasets from different manufacturers, we use a total of 387 batteries with 310,705 samples to validate our method. The mean absolute percentage error (MAPE) is 0.87%. Our proposed PINN has demonstrated remarkable performance in regular experiments, small sample experiments, and transfer experiments when compared to alternative neural networks. This study highlights the promise of physics-informed machine learning for battery degradation modeling and SOH estimation.",
        "DOI": "10.1038/s41467-024-48779-z",
        "paper_author": "Wang F.",
        "affiliation_name": "Xi'an Jiaotong University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60018308",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Application of nanogenerators in acoustics based on artificial intelligence and machine learning",
        "publication": "APL Materials",
        "citied_by": "56",
        "cover_date": "2024-02-01",
        "Abstract": "As artificial intelligence (AI) advances, it is critical to give conventional electronics the capacity to “think,” “analyze,” and “advise.” The need for intelligent, self-powered devices has increased due to recent significant developments in the computer field, namely, in the fields of AI and machine learning (ML). The use of nanogenerators in the area of acoustics is examined in this Review, with an emphasis on how they might be integrated with ML and AI. Innovative energy-harvesting devices called nanogenerators are able to produce electrical power from outside sources, such as vibrations in the air or mechanical movements. The study examines a number of acoustic applications for nanogenerators, such as energy harvesting, sound detection, noise monitoring, and acoustic sensing. Furthermore, the research highlights how AI and ML techniques enhance the performance of nanogenerators and enable more efficient acoustic applications through data analysis and model training. At the end of this Review, the future development prospects of nanogenerators based on AI and ML were discussed.",
        "DOI": "10.1063/5.0195399",
        "paper_author": "Yu X.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Efficient machine-learning algorithm applied to predict the transient shock reaction of the elastic structure partially rested on the viscoelastic substrate",
        "publication": "Mechanics of Advanced Materials and Structures",
        "citied_by": "56",
        "cover_date": "2024-01-01",
        "Abstract": "Due to numerous applications of piezoelectric materials in the modern technologies, this study assesses the thermomechanical shock behavior of the functionally graded graphene platelets reinforced nanocomposite (FG-GPLRN) annular plate surrounded by two piezoelectric layers and partially rested on the viscoelastic substrate for different cases of boundary conditions by metaheuristic optimized machine-learning methods, for the first time. Thermal and mechanical shocks are simultaneously applied on the upper surface of the mentioned structure. Governing equations of the system are formulated in the background of three-dimensional (3D) elasticity theory. Energy balance of the system is considered based on the Lord-Shulman theorem. Differential quadrature method (DQM) is selected as the main solver to determine the spatial response of the system from the state-space form of the governing differential equations. Additionally, Laplace transform is collaborated with modified Dubner and Abate’s approach to predict the temporal response of the system. Accuracy of the applied methods is carefully examined and verified through comparative study performed between the current results and those determined in the published high-quality studies. Valuable outcomes of the current approach would be directly employed in designing process of similar structures interacting with probable thermomechanical shocks.",
        "DOI": "10.1080/15376494.2023.2183289",
        "paper_author": "Wu J.",
        "affiliation_name": "Chongqing Creation Vocational College",
        "affiliation_city": "Yongchuan",
        "affiliation_country": "China",
        "affiliation_id": "126249574",
        "affiliation_state": "Chongqing"
    },
    {
        "paper_title": "Process monitoring and machine learning for defect detection in laser-based metal additive manufacturing",
        "publication": "Journal of Intelligent Manufacturing",
        "citied_by": "55",
        "cover_date": "2024-04-01",
        "Abstract": "Over the past several decades, metal Additive Manufacturing (AM) has transitioned from a rapid prototyping method to a viable manufacturing tool. AM technologies can produce parts on-demand, repair damaged components, and provide an increased freedom of design not previously attainable by traditional manufacturing techniques. The increasing maturation of metal AM is attracting high-value industries to directly produce components for use in aerospace, automotive, biomedical, and energy fields. Two leading processes for metal part production are Powder Bed Fusion with laser beam (PBF-LB/M) and Directed Energy Deposition with laser beam (DED-LB/M). Despite the many advances made with these technologies, the highly dynamic nature of the process frequently results in the formation of defects. These technologies are also notoriously difficult to control, and the existing machines do not offer closed loop control. In the present work, the application of various Machine Learning (ML) approaches and in-situ monitoring technologies for the purpose of defect detection are reviewed. The potential of these methods for enabling process control implementation is discussed. We provide a critical review of trends in the usage of data structures and ML algorithms and compare the capabilities of different sensing technologies and their application to monitoring tasks in laser metal AM. The future direction of this field is then discussed, and recommendations for further research are provided. Graphical abstract: (Figure presented.)",
        "DOI": "10.1007/s10845-023-02119-y",
        "paper_author": "Herzog T.",
        "affiliation_name": "RMIT University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60011362",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Battery safety: Machine learning-based prognostics",
        "publication": "Progress in Energy and Combustion Science",
        "citied_by": "54",
        "cover_date": "2024-05-01",
        "Abstract": "Lithium-ion batteries play a pivotal role in a wide range of applications, from electronic devices to large-scale electrified transportation systems and grid-scale energy storage. Nevertheless, they are vulnerable to both progressive aging and unexpected failures, which can result in catastrophic events such as explosions or fires. Given their expanding global presence, the safety of these batteries and potential hazards from serious malfunctions are now major public concerns. Over the past decade, scholars and industry experts are intensively exploring methods to monitor battery safety, spanning from materials to cell, pack and system levels and across various spectral, spatial, and temporal scopes. In this Review, we start by summarizing the mechanisms and nature of battery failures. Following this, we explore the intricacies in predicting battery system evolution and delve into the specialized knowledge essential for data-driven, machine learning models. We offer an exhaustive review spotlighting the latest strides in battery fault diagnosis and failure prognosis via an array of machine learning approaches. Our discussion encompasses: (1) supervised and reinforcement learning integrated with battery models, apt for predicting faults/failures and probing into failure causes and safety protocols at the cell level; (2) unsupervised, semi-supervised, and self-supervised learning, advantageous for harnessing vast data sets from battery modules/packs; (3) few-shot learning tailored for gleaning insights from scarce examples, alongside physics-informed machine learning to bolster model generalization and optimize training in data-scarce settings. We conclude by casting light on the prospective horizons of comprehensive, real-world battery prognostics and management.",
        "DOI": "10.1016/j.pecs.2023.101142",
        "paper_author": "Zhao J.",
        "affiliation_name": "University of California, Davis",
        "affiliation_city": "Davis",
        "affiliation_country": "United States",
        "affiliation_id": "60014439",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Performance optimization of energy-efficient solar absorbers for thermal energy harvesting in modern industrial environments using a solar deep learning model",
        "publication": "Heliyon",
        "citied_by": "52",
        "cover_date": "2024-02-29",
        "Abstract": "Thermal energy harvesting has seen a rise in popularity in recent years due to its potential to generate renewable energy from the sun. One of the key components of this process is the solar absorber, which is responsible for converting solar radiation into thermal energy. In this paper, a smart performance optimization of energy efficient solar absorber for thermal energy harvesting is proposed for modern industrial environments using solar deep learning model. In this model, data is collected from multiple sensors over time that measure various environmental factors such as temperature, humidity, wind speed, atmospheric pressure, and solar radiation. This data is then used to train a machine learning algorithm to make predictions on how much thermal energy can be harvested from a particular panel or system. In a computational range, the proposed solar deep learning model (SDLM) reached 83.22 % of testing and 91.72 % of training results of false positive absorption rate, 69.88 % of testing and 81.48 % of training results of false absorption discovery rate, 81.40 % of testing and 72.08 % of training results of false absorption omission rate, 75.04 % of testing and 73.19 % of training results of absorbance prevalence threshold, and 90.81 % of testing and 78.09 % of training results of critical success index. The model also incorporates components such as insulation and orientation to further improve its accuracy in predicting the amount of thermal energy that can be harvested. Solar absorbers are used in industrial environments to absorb the sun's radiation and turn it into thermal energy. This thermal energy can then be used to power things such as heating and cooling systems, air compressors, and even some types of manufacturing operations. By using a solar deep learning model, businesses can accurately predict how much thermal energy can be harvested from a particular solar absorber before making an investment in a system.",
        "DOI": "10.1016/j.heliyon.2024.e26371",
        "paper_author": "Armghan A.",
        "affiliation_name": "Jouf University",
        "affiliation_city": "Sakakah",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60104126",
        "affiliation_state": "Al Jawf"
    },
    {
        "paper_title": "Framework for Sustainable Energy Management using Smart Grid Panels Integrated with Machine Learning and IOT based Approach.",
        "publication": "International Journal of Intelligent Systems and Applications in Engineering",
        "citied_by": "52",
        "cover_date": "2024-01-01",
        "Abstract": "Maintaining a consistent supply of power is essential for the well-being of the economy, the public, and one's own health. The generation of energy, as well as its distribution, monitoring, and management, are all undergoing fundamental changes as a result of the implementation of a smart grid (SG), which is authorised to include communication technology and sensors into power systems. There are a lot of problems that need to be fixed before the interoperability of the smart grid can be determined. The integration of renewable energy sources and smart grid technology market size and energy management is a sustainable solution to the problem of energy demand management. The importance work quickly toward the development of an efficient Energy Management Model (EMM) that integrates smart grids and renewable energy sources. When it comes to the modelling of complex and non-linear data, machine learning (ML), Internet of Things (IoT) approaches often perform better than statistical models. So, utilizing a machine learning approach for the EMM is a good option since it simplifies the EMM by generating a single trained model to anticipate its performance characteristics across all conditions. This may be accomplished via the use of an EMM created using an ML method. It was recommended that a certain flexibility sample be used as a control mechanism for incursion into the smart grid. The outcomes of the experiment indicate that the demand-side management (DSM) device is more resistant to infiltration and is enough to lower the energy usage of the smart grid.",
        "DOI": "NA",
        "paper_author": "Bani Ahmad A.Y.A.",
        "affiliation_name": "Middle East University Jordan",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60109124",
        "affiliation_state": "Amman"
    },
    {
        "paper_title": "Novel Coil Transducer Induced Thermoacoustic Detection of Rail Internal Defects Towards Intelligent Processing",
        "publication": "IEEE Transactions on Industrial Electronics",
        "citied_by": "52",
        "cover_date": "2024-02-01",
        "Abstract": "A novel resonant tri-coil transducer is proposed to induce thermoacoustic (TA) signals for detecting rail internal defects. It consists of a ferrite plate-backed tri-coil and its associated circuits, a shielding layer, and a three-dimensional printed enclosure for supporting and securing. General TA detection theory is illustrated to understand how to detect rail internal defects. For achieving electromagnetic (EM) field shaping and focusing, the physical structure of the proposed transducer is optimized. It reduces backward EM fields and interference. Then, an equivalent circuit model between the proposed transducer and the rail is constructed to analyze optimal power transfer efficiency as a function of distance and frequency. To validate the design concept, the proposed transducer is fabricated for inducing TA signals, and experiments are performed. Several engineered rail specimens (UIC-60E) with different types of defects are prepared. The induced TA waves are found to be compressional. With selected features, a support vector machine algorithm-based multinomial classifier model is trained and employed for intelligent processing. Then, the proposed transducer is integrated into the self-designed automatic rail monitoring system. Experimental results show that the self-designed system can achieve an accuracy rate of 96.4%, successfully identifying defects in defect classification. The proposed transducer has low cost in fabrication and maintenance, focused magnetic fields with a large lift-off distance and enhanced acoustic wave intensity. Compared to earlier version of the system, the spacing between the transmitter and the rail has been further increased.",
        "DOI": "10.1109/TIE.2023.3250766",
        "paper_author": "Wang W.",
        "affiliation_name": "School of Electrical and Electronic Engineering",
        "affiliation_city": "Singapore City",
        "affiliation_country": "Singapore",
        "affiliation_id": "60118454",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Single-atom materials: The application in energy conversion",
        "publication": "Interdisciplinary Materials",
        "citied_by": "51",
        "cover_date": "2024-01-01",
        "Abstract": "Single-atom materials (SAMs) have become one of the most important power sources to push the field of energy conversion forward. Among the main types of energy, including thermal energy, electrical energy, solar energy, and biomass energy, SAMs have realized ultra-high efficiency and show an appealing future in practical application. More than high activity, the uniform active sites also provide a convincible model for chemists to design and comprehend the mechanism behind the phenomenon. Therefore, we presented an insightful review of the application of the single-atom material in the field of energy conversion. The challenges (e.g., accurate synthesis and practical application) and future directions (e.g., machine learning and efficient design) of the applications of SAMs in energy conversion are included, aiming to provide guidance for the research in the next step.",
        "DOI": "10.1002/idm2.12141",
        "paper_author": "Zhu C.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "OpenMM 8: Molecular Dynamics Simulation with Machine Learning Potentials",
        "publication": "Journal of Physical Chemistry B",
        "citied_by": "51",
        "cover_date": "2024-01-11",
        "Abstract": "Machine learning plays an important and growing role in molecular simulation. The newest version of the OpenMM molecular dynamics toolkit introduces new features to support the use of machine learning potentials. Arbitrary PyTorch models can be added to a simulation and used to compute forces and energy. A higher-level interface allows users to easily model their molecules of interest with general purpose, pretrained potential functions. A collection of optimized CUDA kernels and custom PyTorch operations greatly improves the speed of simulations. We demonstrate these features in simulations of cyclin-dependent kinase 8 (CDK8) and the green fluorescent protein chromophore in water. Taken together, these features make it practical to use machine learning to improve the accuracy of simulations with only a modest increase in cost.",
        "DOI": "10.1021/acs.jpcb.3c06662",
        "paper_author": "Eastman P.",
        "affiliation_name": "Stanford University",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60012708",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Learning-based model predictive energy management for fuel cell hybrid electric bus with health-aware control",
        "publication": "Applied Energy",
        "citied_by": "51",
        "cover_date": "2024-02-01",
        "Abstract": "Advanced energy management strategy (EMS) can ensure healthy, stable, and efficient operation of the on-board energy systems. Model Predictive Control (MPC) and Deep Reinforcement Learning (DRL) are two powerful control methods that have been extensively researched in the field of vehicle energy management. However, there are some problems with both approaches. On the one hand, MPC is difficult to cope with the complex systems and the excessive computational load caused by the non-linear solving over long prediction horizon, on the other hand, DRL lacks adaptability to different driving conditions and is poorly interpretable. Therefore, this paper innovatively proposes a learning-based model predictive (L-MPC) EMS for fuel cell hybrid electric bus (FCHEB) with health-aware control. This method effectively merges the advantages of control theory and machine learning. Specifically, firstly, the precise aging models for vehicular energy systems are established and incorporated into the optimization framework along with hydrogen consumption related metrics. Secondly, the principles of the learning-based MPC algorithm are thoroughly elucidated. In addition, to ensure driving details under future conditions, a speed predictor based on a double-layer Bi-directional Long Short-Term Memory (BiLSTM) is proposed at the strategy supervision layer. Finally, the superiority of the proposed strategy in prolonging the lifespan of the energy systems and reducing overall vehicle operating cost is verified by comprehensive comparisons with state-of-the-art MPC and DRL methods under real-world collected driving condition.",
        "DOI": "10.1016/j.apenergy.2023.122228",
        "paper_author": "Jia C.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Reinforcement Learning Methods for Computation Offloading: A Systematic Review",
        "publication": "ACM Computing Surveys",
        "citied_by": "51",
        "cover_date": "2024-01-31",
        "Abstract": "Today, cloud computation offloading may not be an appropriate solution for delay-sensitive applications due to the long distance between end-devices and remote datacenters. In addition, offloading to a remote cloud can consume bandwidth and dramatically increase costs. However, end-devices such as sensors, cameras, and smartphones have limited computing and storage capacity. Processing tasks on such battery-powered and energy-constrained devices becomes even more complex. To address these challenges, a new paradigm called Edge Computing (EC) emerged nearly a decade ago to bring computing resources closer to end-devices. Here, edge servers located between the end-device and the remote cloud perform user tasks. Recently, several new computing paradigms such as Mobile Edge Computing (MEC) and Fog Computing (FC) have emerged to complement Cloud Computing (CC) and EC. Although these paradigms are heterogeneous, they can further reduce energy consumption and task response time, especially for delay-sensitive applications. Computation offloading is a multi-objective, NP-hard optimization problem. A significant part of previous research in this field is devoted to Machine Learning (ML) methods. One of the essential types of ML is Reinforcement Learning (RL), in which an agent learns how to make the best decision using the experiences gained from the environment. This article provides a systematic review of the widely used RL approaches in computation offloading. It covers research in complementary paradigms such as mobile cloud computing, edge computing, fog computing, and the Internet of Things. We explain the reasons for using various RL methods in computation offloading from a technical point of view. This analysis includes both binary offloading and partial offloading techniques. For each method, the essential elements of RL and the characteristics of the environment are discussed regarding the most important criteria. Research challenges and Future trends are also mentioned.",
        "DOI": "10.1145/3603703",
        "paper_author": "Zabihi Z.",
        "affiliation_name": "Islamic Azad University, Qazvin Branch",
        "affiliation_city": "Qazvin",
        "affiliation_country": "Iran",
        "affiliation_id": "60013126",
        "affiliation_state": "Qazvin Province"
    },
    {
        "paper_title": "Progress toward the computational discovery of new metal–organic framework adsorbents for energy applications",
        "publication": "Nature Energy",
        "citied_by": "49",
        "cover_date": "2024-02-01",
        "Abstract": "Metal–organic frameworks (MOFs) are a class of nanoporous material precisely synthesized from molecular building blocks. MOFs could have a critical role in many energy technologies, including carbon capture, separations and storage of energy carriers. Molecular simulations can improve our molecular-level understanding of adsorption in MOFs, and it is now possible to use realistic models for these complicated materials and predict their adsorption properties in quantitative agreement with experiments. Here we review the predictive design and discovery of MOF adsorbents for the separation and storage of energy-relevant molecules, with a view to understanding whether we can reliably discover novel MOFs computationally prior to laboratory synthesis and characterization. We highlight in silico approaches that have discovered new adsorbents that were subsequently confirmed by experiments, and we discuss the roles of high-throughput computational screening and machine learning. We conclude that these tools are already accelerating the discovery of new applications for existing MOFs, and there are now several examples of new MOFs discovered by computational modelling.",
        "DOI": "10.1038/s41560-023-01417-2",
        "paper_author": "Moghadam P.Z.",
        "affiliation_name": "University College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60022148",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Efficient design of energy microgrid management system: A promoted Remora optimization algorithm-based approach",
        "publication": "Heliyon",
        "citied_by": "49",
        "cover_date": "2024-01-15",
        "Abstract": "Microgrids are a promising solution for decentralized energy generation and distribution, offering reliability, efficiency, and resilience. These small-scale power systems can operate independently or connect to the main grid, providing greater reliability and resilience. However, integrating renewable energy into microgrids presents challenges due to their unpredictable nature and fluctuating load of electricity. Energy management strategies play a crucial role in optimizing the operation of microgrids, aiming to balance electricity supply and demand, maximize renewable energy utilization, and minimize operational costs. Various approaches have been proposed for energy management in microgrids, including optimization algorithms, machine learning techniques, and intelligent control systems. This study proposes an optimized and efficient strategy for microgrids operating in both independent and grid-connected modes, focusing on microgrids that utilize a combination of solar and green energy sources. The proposed approach, based on the Promoted Remora Optimization (PRO) algorithm, aims to meet load power requirements at the lowest possible cost while ensuring constant DC bus voltage and safeguarding batteries against overcharging and depletion. The CRO method effectively optimized the charging process, maintaining a consistent level of charge and achieving a final SoC of 33.37 %–33.60 %. It also demonstrated high system efficiency, with an average of 87.99 %, and a range of 87.80 %–88.03 %. The optimizer efficiency ranged from 83.12 % to 86.52 %, with an average of 86.46 %. The CRO method also achieved reasonable operating costs, with a cost per power of $0.1687/kW to $0.1699/kW and a daily cost of $1,379,595 to $1,479,998. Overall, the CRO method showed promise in optimizing the charging process in terms of efficiency and cost-effectiveness. Comparative analysis with existing literature is conducted to evaluate the effectiveness of the proposed approach, demonstrating its superior results compared to other energy management strategies for microgrids. This study contributes to the field of microgrid energy management by providing a novel approach based on the PRO algorithm and demonstrating its effectiveness through comparative analysis.",
        "DOI": "10.1016/j.heliyon.2023.e23394",
        "paper_author": "Zhang H.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356",
        "affiliation_state": "Hunan"
    }
]