[
    {
        "paper_title": "The impact of e-learning and social parameters on students' academic performance",
        "paper_author": "Petrusevich D.A.",
        "publication": "Science for Education Today",
        "citied_by": "5",
        "cover_date": "2020-12-31",
        "Abstract": "Introduction. The article examines the problem of assessing students' academic performance in the current situation. The purpose of the paper is to evaluate the influence of e-learning and some social and behavioral parameters on students' academic performance. Materials and Methods. The author employed the machine learning procedures in order to identify and assess the current problems of the educational system, students' behavior, and universities' policy. Methods of mathematical analysis and statistics as well as ensemble methods (gradient boosting and the random forest algorithms) were used in order to achieve high accuracy of the research. Results. The author conducted the analysis of the following datasets devoted to academic performance at higher and secondary educational institutions in a number of countries: Students' Performance in Portugal, E-learning Student Reactions and Students' Academic Performance. The purposes of the current study were to identify statistical correlations between social parameters of students and the level of their academic performance and to understand how academic performance is determined by the implementation of online learning and blended learning. The research findings suggest that mathematical statistics and data analysis methods allow to identify correlations between students' performance data and reveal hidden relationships which can be important for university staff. Conclusions. In conclusion, the author summarizes the results of evaluating the impact of the introduction of e-learning elements and some social parameters on students' academic performance.",
        "DOI": "10.15293/2658-6762.2006.08",
        "affiliation_name": "MIREA - Russian Technological University (RTU MIREA)",
        "affiliation_city": "Moscow",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60096204",
        "affiliation_state": "Moscow Oblast"
    },
    {
        "paper_title": "Learning method for autonomous air combat based on experience transfer",
        "paper_author": "Zhou K.",
        "publication": "Hangkong Xuebao/Acta Aeronautica et Astronautica Sinica",
        "citied_by": "2",
        "cover_date": "2020-12-25",
        "Abstract": "Most of the existing machine learning methods are in interactive learning mode, whose training process relies heavily on the interactive data with the environment. Air combat is a training mission with sparse rewards, with the system usually exploring for a long period of time to find actions that can obtain rewards during the beginning stage of learning. Retraining for every new mission wastes the computing resources. Therefore, a learning method based on experience transfer is designed in this paper, enabling the trained agent to share knowledge with the new agent and thereby improving its learning efficiency in the new task. First of all, a learning model based on experience transfer is constructed by referring to the phenomenon that mankind can learn rapidly through experiences. Secondly, considering both the knowledge sharing and characteristics of the new task, the connotation of experience is defined, and a cognitive mode of \"knowledge + task → experience\" is established. Thirdly, a reference learning method is designed, combining external experience with the task to further transform it into knowledge of the new agent. Finally, using experience applicability as the screening index, we analyze the influence of experience applicability on the reference learning efficiency, determining the screening boundary of implementing the reference learning. The new agent can therefore obtain preliminary knowledge about the new mission by reference learning and find action policies that can obtain reward so as to improve the learning speed in the new learning mission.",
        "DOI": "10.7527/S1000-6893.2020.24285",
        "affiliation_name": "Air Force Engineering University China",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60069720",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Proceedings of 2020 7th International Conference on Networking, Systems and Security, NSysS 2020",
        "paper_author": "NA",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2020-12-22",
        "Abstract": "The proceedings contain 15 papers. The topics discussed include: can COVID-19 change the Big5 personality traits of healthcare workers?; attacks on health workers during COVID-19 pandemic - data exploration and news article detection using NLP and GRU model; application of machine learning based hospital up-gradation policy for Bangladesh; a benchmark study on machine learning methods using several feature extraction techniques for news genre detection from Bangla news articles & titles; machine learning based malware detection on encrypted traffic: a comprehensive performance study; efficient feature selection for detecting botnets based on network traffic and behavior analysis; and solving the maze of diagnosing Parkinson’s disease based on portable EEG sensing to be adaptable to go in-the-wild.",
        "DOI": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Application of Machine Learning Based Hospital Up-gradation Policy for Bangladesh",
        "paper_author": "Shuvo S.S.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "4",
        "cover_date": "2020-12-22",
        "Abstract": "Hospital beds are an essential part of delivering medical services to the patients. Due to the hospital bed demand's stochastic nature, it is hard to predict future needs and devise an appropriate augmentation scheme. In this work, we consider Bangladesh as a test case where hospital beds are inadequate, and a sudden surge in demand can cause a massive loss of lives and wealth. We propose a deep reinforcement learning (RL) based policy for hospital capacity up-gradation schedule. The deep RL agent monitors population growth and current bed capacity and recommends the optimal number of beds for future inclusion. We utilize the state-of-the-art machine learning (ML) algorithm, Advantage Actor-Critic (A2C), to minimize the cumulative cost. This policy outperforms the straight forward strategies: Fixed upgrade and complain based upgrade.",
        "DOI": "10.1145/3428363.3428364",
        "affiliation_name": "Gono Bishwabidyalay",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60109914",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Social media security threats investigation and mitigation methods: A preliminary review",
        "paper_author": "Singh M.",
        "publication": "Journal of Physics: Conference Series",
        "citied_by": "4",
        "cover_date": "2020-12-22",
        "Abstract": "Recent advancement of data collection and coupled statistics, big data became a significant issue in various research areas like: Machine learning, data mining, social networks, artificial intelligence, etc. Social networking is used as a platform for various applications like: government, business, educational, political, dating and matrimonial, etc. Like each and every platform, social networking too has its own set of pros and cons. We examine the types of posting on social media websites and influence of posting data and privacy concerns of Facebook and twitter users. This study indicates the different concerns of users regarding posting information and its influences of user voiced privacy concerns. It is beneficial in fields like: education, advertisements, online shopping but people get addicted to social networking, its time consuming in various issues and can be misused for cybercrimes. We've discussed the e-government objectives of using social media. Social networking is also vulnerable at different stages and attacked in several ways that includes evil twin attack, virus attack, phishing attack, account hijacking, data breach attack, fraud and scams. Site monitoring, developing security policies, educating users and training programs, updating software, archiving, media contents are several mitigation techniques are used to reduce the effects of cyber-attacks.",
        "DOI": "10.1088/1742-6596/1706/1/012142",
        "affiliation_name": "Chandigarh Group of Colleges Jhanjeri",
        "affiliation_city": "Mohali",
        "affiliation_country": "India",
        "affiliation_id": "60280932",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Gender and ethnic differences in publication of BMJ letters to the editor: An observational study using machine learning",
        "paper_author": "Zeina M.",
        "publication": "BMJ Open",
        "citied_by": "10",
        "cover_date": "2020-12-21",
        "Abstract": "Objectives To analyse the relationship between first author's gender and ethnicity (estimated from first name and surname), and chance of publication of rapid responses in the British Medical Journal (BMJ). To analyse whether other features of the rapid response account for any gender or ethnic differences, including the presence of multiple authors, declaration of conflicts of interests, the presence of Twitter handle, word count, reading ease, spelling and grammatical mistakes, and the presence of references. Design A retrospective observational study. Setting Website of the BMJ (BMJ.com). Participants Publicly available rapid responses submitted to BMJ.com between 1998 and 2018. Main outcome measures Publication of a rapid response as a letter to the editor in the BMJ. Results We analysed 113 265 rapid responses, of which 8415 were published as letters to the editor (7.4%). Statistically significant univariate correlations were found between odds of publication and first author estimated gender and ethnicity, multiple authors, declaration of conflicts of interest, the presence of Twitter handle, word count, reading ease, spelling and grammatical mistakes, and the presence of references. Multivariate analysis showed that first author estimated gender and ethnicity predicted publication after taking into account the other factors. Compared to white authors, black authors were 26% less likely to be published (OR: 0.74, CI: 0.57-0.96), Asian and Pacific Islander authors were 46% less likely to be published (OR: 0.54, CI: 0.49-0.59) and Hispanic authors were 49% less likely to be published (OR: 0.51, CI: 0.41-0.64). Female authors were 10% less likely to be published (OR: 0.90, CI: 0.85-0.96) than male authors. Conclusion Ethnic and gender differences in rapid response publication remained after accounting for a broad range of features, themselves all predictive of publication. This suggests that the reasons for the differences of these groups lies elsewhere.",
        "DOI": "10.1136/bmjopen-2020-037269",
        "affiliation_name": "Barts Health NHS Trust",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60159931",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Log-based malicious activity detection using machine and deep learning",
        "paper_author": "Tarnowska K.A.",
        "publication": "Malware Analysis Using Artificial Intelligence and Deep Learning",
        "citied_by": "0",
        "cover_date": "2020-12-20",
        "Abstract": "This chapter describes the application of intelligent computational techniques to the problem of malicious activity detection. It is proposed to embed machine and deep learning models for malicious activity detection into the framework of a log-based decision support system (DSS) for information security administrators. It is expected that such a solution will enable organizational-wide protection of informational assets, by providing accurate and comprehensive real-time insights into violations of information security policies. In this work, we present experiments and results on database systems' log analysis using traditional machine learning (ML) methods and deep learning (DL) on the synthetic log dataset simulating user activity in a hypothetical company.",
        "DOI": "10.1007/978-3-030-62582-5_23",
        "affiliation_name": "University of California, Berkeley",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60025038",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Multi-Agent Reinforcement Learning using the Deep Distributed Distributional Deterministic Policy Gradients Algorithm",
        "paper_author": "Farag W.",
        "publication": "2020 International Conference on Innovation and Intelligence for Informatics, Computing and Technologies, 3ICT 2020",
        "citied_by": "9",
        "cover_date": "2020-12-20",
        "Abstract": "In this paper, the Deep Distributed Distributional Deterministic Policy Gradients (D4PG) reinforcement learning algorithm is adopted to train a multi-agent action in a cooperative game environment. The algorithm is experimented on training the agents to play a game of tennis against each other. The architectures of the actor and cretic networks are meticulously designed and the D4PG hyperparameters are carefully tuned. The trained agents are successfully tested in the Unity Machine Learning Agents environment. The testing shows the powerful performance of the D4PG algorithm in training multi-agents in complex environments.",
        "DOI": "10.1109/3ICT51146.2020.9311945",
        "affiliation_name": "American University of the Middle East",
        "affiliation_city": "Al Ahmadi",
        "affiliation_country": "Kuwait",
        "affiliation_id": "60105846",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Assessment of machine learning, time series, response surface methodology and empirical models in prediction of global solar radiation",
        "paper_author": "Gürel A.E.",
        "publication": "Journal of Cleaner Production",
        "citied_by": "117",
        "cover_date": "2020-12-20",
        "Abstract": "Solar radiation (SR) knowledge plays a vital role in the design, modelling, and operation of solar energy conversion systems and future energy investment policies of the governments. However, these data are not measured for all regions due to the non-availability of SR measurement equipment at the weather stations. Therefore, SR has to be accurately predicted using various prediction models. In this research, four models from different classes are being used to predict monthly average daily global SR data. The models used in this study are based on a machine-learning algorithm (feed-forward neural network), empirical models (3 Angstrom-type models), time series (Holt-Winters), and mathematical model (RSM). As the prediction locations, four provinces (Ankara, Karaman, Kilis, and Şırnak) in Turkey are selected. The dataset including pressure, relative humidity, wind speed, ambient temperature, and sunshine duration is supplied from the Turkish State Meteorological Service and it covers the years 2008–2018. In the study, monthly average daily global SR data for the year 2018 is being predicted, and the performance success of the models is discussed in terms of the following benchmarks R2, MBE, RMSE, MAPE, and t-stat. In the results, R2 value for all models is varying between 0.952 and 0.993 and MAPE and RMSE value for all models is smaller than 10% and 2 MJ/m2-day, respectively. Evaluation in terms of t-stat value, no models exceed the t-critic limit. Considering all the models together, ANN has presented the best results with an average R2, MBE, RMSE, MAPE, and t-stat of 0.9911, 0.1323 MJ/m2-day, 0.78 MJ/m2-day, 4.9263%, and 0.582, respectively. Then Holt-Winters, RSM, and empirical models closely followed it, respectively.",
        "DOI": "10.1016/j.jclepro.2020.122353",
        "affiliation_name": "Düzce Üniversitesi",
        "affiliation_city": "Duzce",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60024371",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Machine Vision-Based Deep Learning Inference Approach of Biker Safety Hat Detection System",
        "paper_author": "MacAlisang J.",
        "publication": "7th IEEE International Conference on Engineering Technologies and Applied Sciences, ICETAS 2020",
        "citied_by": "0",
        "cover_date": "2020-12-18",
        "Abstract": "In the Philippines road accidents were prevalent among motorcycle riders. The motorcyclist was required to wear their helmet when on the road. Some motorcyclists didn't follow the rules on wearing a helmet as safety precautions on the road. To address this, policymakers are focusing on enforcing safe and law-abiding behavior in traffic. There is, however, a lack of comprehensive data on the safety-critical behavioral metric of the use of motorcycle helmets, especially in developing countries where the main mode of transport is the motorcycle. Targeted enforcement and safety campaigns that are critical for accident reduction are prohibited by this shortage of knowledge. Hence, The researchers developed an algorithm for detecting the helmet that was worn by the motorcyclist, by using a deep learning approach the object detection was done successfully. Based on the annotated images, frames of video, and live feed data that was collected, To detect active bikes, the researchers taught the algorithm to use their helmets. An overview of the algorithm's success on an annotated research data set and a study of available data on the use of human-registered helmets indicate that our approach is extremely reliable.",
        "DOI": "10.1109/ICETAS51660.2020.9484194",
        "affiliation_name": "Don Mariano Marcos Memorial State University",
        "affiliation_city": "Bacnotan",
        "affiliation_country": "Philippines",
        "affiliation_id": "60279751",
        "affiliation_state": "La Union"
    },
    {
        "paper_title": "An evaluation of neural machine translation and pre-trained word embeddings in multilingual neural sentiment analysis",
        "paper_author": "Manias G.",
        "publication": "Proceedings of 2020 IEEE International Conference on Progress in Informatics and Computing, PIC 2020",
        "citied_by": "8",
        "cover_date": "2020-12-18",
        "Abstract": "One of the main elements in several application domains, such as policy making, addresses the scope of public opinion analysis. The latter is recently realized through sentiment analysis and Natural Language Processing, for identifying and extracting subjective information from raw texts. An additional challenge refers to the exploitation and correlation of data from different languages, in order to analyse sentiments by considering all available information in a holistic way. This paper investigates the impact of Neural Machine Translation in sentiment analysis, based on the translation of text for which neural sentiment analysis in English has been already applied and is applied again on the translated German and Greek texts. The latter is performed through the same Neural Network models that were used in the original language, in order to analyse the differences between the performed neural sentiment analysis on the source and the target languages. The outcomes of the proposed approach have a twofold interpretation. While, it is concluded that modern Neural Machine Translation tools are mature enough to provide high accuracy translations and have minor impact on multilingual sentiment analysis, on the other hand it is shown that additional research should be performed on the multilingualism that pre-trained Word Embeddings can provide.",
        "DOI": "10.1109/PIC50277.2020.9350849",
        "affiliation_name": "University of Piraeus",
        "affiliation_city": "Piraeus",
        "affiliation_country": "Greece",
        "affiliation_id": "60010667",
        "affiliation_state": "Attica"
    },
    {
        "paper_title": "Verhealth Vetting medical voice applications through policy enforcement",
        "paper_author": "Shezan F.H.",
        "publication": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies",
        "citied_by": "18",
        "cover_date": "2020-12-17",
        "Abstract": "Healthcare applications on Voice Personal Assistant System (e.g., Amazon Alexa), have shown a great promise to deliver personalized health services via a conversational interface. However, concerns are also raised about privacy, safety, and service quality. In this paper, we propose VerHealth, to systematically assess health-related applications on Alexa for how well they comply with existing privacy and safety policies. VerHealth contains a static module and a dynamic module based on machine learning that can trigger and detect violation behaviors hidden deep in the interaction threads. We use VerHealth to analyze 813 health-related applications on Alexa by sending over 855,000 probing questions and analyzing 863,000 responses. We also consult with three medical school students (domain experts) to confirm and assess the potential violations. We show that violations are quite common, e.g., 86.36% of them miss disclaimers when providing medical information; 30.23% of them store user physical or mental health data without approval. Domain experts believe that the applications' medical suggestions are often factually-correct but are of poor relevance, and applications should have asked more questions before providing suggestions for over half of the cases. Finally, we use our results to discuss possible directions for improvements.",
        "DOI": "10.1145/3432233",
        "affiliation_name": "Virginia Polytechnic Institute and State University",
        "affiliation_city": "Blacksburg",
        "affiliation_country": "United States",
        "affiliation_id": "60027090",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "Machine-learned models for the performance of six different solar PV technologies under the tropical environment",
        "paper_author": "Yassin H.",
        "publication": "2020 IEEE Asia-Pacific Conference on Computer Science and Data Engineering, CSDE 2020",
        "citied_by": "4",
        "cover_date": "2020-12-16",
        "Abstract": "Due to the recent environmental concerns and long-term challenges in energy security, the Global energy scenarios are shifting more towards sustainable and renewable energy resources. Brunei has planned to increase the use of cleaner energy technologies by contributing 10 percent or 954 GWh of renewable energy in its power generation mix by 2035. Out of the available renewable options, solar is the most promising one for Brunei, for example, the daily average solar installation is around 5kWh per day [1]. Though solar energy is an abundant resource, for optimally designing and successfully managing solar power projects, its availability in different time scales are to be analyzed and understood in a local context. In this paper, we present models for estimating the output of six different solar PV technologies using machine learning methods Performance data from the solar PV systems installed at the Tenaga Suria PV plant in Brunei are used to develop the models. Influence of relevant environmental parameters, such as irradiance, relative humidity, ambient temperature and wind speed on the power output has been analyzed for optimal feature selection. Performance models based on Support Vector Machine (SVM) and K-Nearest Neighbour (KNN) were developed and tested for predicting the PV system performance. Both the models could estimate the system performance with reasonably high level of accuracy.",
        "DOI": "10.1109/CSDE50874.2020.9411543",
        "affiliation_name": "Universitetet i Agder",
        "affiliation_city": "Kristiansand",
        "affiliation_country": "Norway",
        "affiliation_id": "60080184",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Portfolio Optimization with 2D Relative-Attentional Gated Transformer",
        "paper_author": "Kim T.W.",
        "publication": "2020 IEEE Asia-Pacific Conference on Computer Science and Data Engineering, CSDE 2020",
        "citied_by": "7",
        "cover_date": "2020-12-16",
        "Abstract": "Portfolio optimization is one of the most attentive fields that have been researched with machine learning approaches. Many researchers attempted to solve this problem using deep reinforcement learning due to its efficient inherence that can handle the property of financial markets. However, most of them can hardly be applicable to real-world trading since they ignore or extremely simplify the realistic constraints such as transaction costs or slippage. These constraints have a significantly negative impact on portfolio profitability. In this paper a conservative level of transaction fees and slippage are considered for the realistic experiment. To enhance the performance under those constraints, we propose a novel Deterministic Policy Gradient with 2D Relative-attentional Gated Transformer (DPGRGT) model. Applying learnable relative positional embeddings for the time and assets axes, the model better understands the peculiar structure of the financial data in the portfolio optimization domain. Also, gating layers and layer reordering are employed for stable convergence of Transformers in reinforcement learning. In our experiment using U.S. stock market data of 20 years, our model outperformed baseline models and demonstrated its effectiveness.",
        "DOI": "10.1109/CSDE50874.2020.9411635",
        "affiliation_name": "School of Computer Science",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60099659",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "The value–complexity trade-off for reinforcement learning based brain–computer interfaces",
        "paper_author": "Levi-Aharoni H.",
        "publication": "Journal of Neural Engineering",
        "citied_by": "1",
        "cover_date": "2020-12-16",
        "Abstract": "Objective. One of the recent developments in the field of brain–computer interfaces (BCI) is the reinforcement learning (RL) based BCI paradigm, which uses neural error responses as the reward feedback on the agent’s action. While having several advantages over motor imagery based BCI, the reliability of RL-BCI is critically dependent on the decoding accuracy of noisy neural error signals. A principled method is needed to optimally handle this inherent noise under general conditions. Approach. By determining a trade-off between the expected value and the informational cost of policies, the info-RL (IRL) algorithm provides optimal low-complexity policies, which are robust under noisy reward conditions and achieve the maximal obtainable value. In this work we utilize the IRL algorithm to characterize the maximal obtainable value under different noise levels, which in turn is used to extract the optimal robust policy for each noise level. Main results. Our simulation results of a setting with Gaussian noise show that the complexity level of the optimal policy is dependent on the reward magnitude but not on the reward variance, whereas the variance determines whether a lower complexity solution is favorable or not. We show how this analysis can be utilized to select optimal robust policies for an RL-BCI and demonstrate its use on EEG data. Significance. We propose here a principled method to determine the optimal policy complexity of an RL problem with a noisy reward, which we argue is particularly useful for RL-based BCI paradigms. This framework may be used to minimize initial training time and allow for a more dynamic and robust shared control between the agent and the operator under different conditions.",
        "DOI": "10.1088/1741-2552/abc8d8",
        "affiliation_name": "Hebrew University of Jerusalem",
        "affiliation_city": "Jerusalem",
        "affiliation_country": "Israel",
        "affiliation_id": "60007903",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Research on COVID-19 Global Forecast based on SIR Model-ML regression",
        "paper_author": "Wei H.",
        "publication": "Journal of Physics: Conference Series",
        "citied_by": "0",
        "cover_date": "2020-12-16",
        "Abstract": "Under the background of the global COVID-19 pandemic, the global COVID-19 epidemic spread was modeled and analyzed, and its future trend was predicted. The dataset covers 163 countries and almost 2 full months from 2020, which is enough data to get some clues about the pandemic. The epidemic situation was predicted by the fusion of SIR model and ML regression, and the results showed that the model analysis was basically consistent with the real performance of the epidemic development. Finally, the development stage and trend of the epidemic situation are evaluated to provide a basis for the government to formulate relevant epidemic prevention policies.",
        "DOI": "10.1088/1742-6596/1693/1/012065",
        "affiliation_name": "Beijing Institute of Graphic Communication",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60073441",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Spatially explicit calculation and simulation of estimating housing land consolidation potential in rural areas",
        "paper_author": "Zou L.",
        "publication": "Nongye Gongcheng Xuebao/Transactions of the Chinese Society of Agricultural Engineering",
        "citied_by": "8",
        "cover_date": "2020-12-15",
        "Abstract": "Modeling of farmers' willingness to consolidation of abandoned homesteads plays an essential role in the prediction of regional land consolidation potential. Previous prediction models on land consolidation potential still have some limitations in the simulation of farmers' consolidation willingness and the spatial explicit prediction. The complex system modeling and machine learning provide effective tools for the behaviors simulation of land-use stakeholders. Land consolidation potential depends mainly on the farmers' willingness to consolidation, as well as the policies and land use planning. It is difficult to obtain enough negative training samples from the non-reclaimed area where farmers are opposed to the consolidation. There is a balance on the training samples, meaning that most training samples are positive. One-class classification approach has provided a good solution for the classification of imbalanced samples, due to only positive samples is selected to complete the training of classifiers. Hence, one-class classification can be used to solve the negative samples in the modeling of farmers' willingness to land consolidation. Therefore, an one class support vector machine (OCSVM) was selected to simulate the decision-making behaviors of the farmers. The OCSVM has been widely used as a type of one-class classification in image recognition and abnormal detection. A geographic information system (GIS) was used to build the model, in order to predict the land consolidation potential in a spatially explicit way. Furthermore, high-resolution remote sensing images were used to identify the abandoned homesteads in the study region. Pingtang was selected as the study area to evaluate the accuracy of model, where a mountainous and poverty town located in western Guangdong province, China. 4 449 positive samples were obtained, where the farmers would like to confer from the historical land consolidation project data in the study area. Another 141 negative samples were randomly selected from the non-reclaimed areas to evaluate the accuracy of model. Thus, a total of 4 590 unlabeled samples were obtained to train the model. The experimental results showed that the overall accuracy of model reached 96.36%, the prediction accuracy of positive sample was 96.88%, and the accuracy of negative samples was 80.14%, indicating that the performance of model was reliable for the potential prediction of land consolidation. The model was used to predict the land consolidation potential in the whole study area. The total area of abandoned homesteads identified by high-resolution remote sensing images was about 103.96 hm2, whereas, the predicted potential obtained by the model was about 94.74 hm2. However, there were many small spots in the study area that were too fragmented to be reclaimed. According to the land consolidation of Pingtang, the abandoned homesteads that can be reclaimed was only 36.02 hm2, accounting for 34.65% of the total areas. Consequently, terrain factors were also essential to affect the consolidation potential in mountainous and hilly areas. The model can be expected to better support the decision-making of land use planning, regional land remediation planning, and site selection in land remediation project.",
        "DOI": "10.11975/j.issn.1002-6819.2020.24.029",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Impact of Urban Expansion and in Situ Greenery on Community-Wide Carbon Emissions: Method Development and Insights from 11 US Cities",
        "paper_author": "Milnar M.",
        "publication": "Environmental Science and Technology",
        "citied_by": "23",
        "cover_date": "2020-12-15",
        "Abstract": "Biogenic CO2 emissions in cities are shaped by urban land cover change which can release carbon stocks, and, carbon sequestration by in situ vegetation. To date, these two processes have not been studied together and compared with transboundary fossil fuel-based CO2 emissions of urban energy use. We leverage remote sensing and machine learning to quantify biogenic CO2 emissions between 2006 and 2012, across 11 U.S cities, including central and suburban cities, in different climate zones. Results indicate that in situ carbon sequestration by greenery varied moderately across cities (-2.1 to -0.87 Mg CO2 ha-1 yr-1), while emissions from the carbon stock change due to land conversion varied much more (-3.4 to 9.8 Mg CO2 ha-1 yr-1), indicating that the latter dominates biogenic CO2 emissions. Net biogenic CO2 emissions were negative (carbon sink) in four cities, while large net positive emissions were present in rapidly growing suburbs. As a ratio of community-wide energy use for travel and buildings, biogenic CO2 emissions were a small proportion in the core cities Denver (0.17%) and Minneapolis (0.33%) and as high as 38.2% in growing exurban communities. These results show that land cover change and greenery will be important policy levers in zero-carbon city planning.",
        "DOI": "10.1021/acs.est.0c02723",
        "affiliation_name": "School of Engineering and Applied Science",
        "affiliation_city": "Princeton",
        "affiliation_country": "United States",
        "affiliation_id": "60141284",
        "affiliation_state": "NJ"
    },
    {
        "paper_title": "Satellite-based assessment of the long-term efficacy of PM<inf>2.5</inf> pollution control policies across the Taiwan Strait",
        "paper_author": "Wang L.",
        "publication": "Remote Sensing of Environment",
        "citied_by": "24",
        "cover_date": "2020-12-15",
        "Abstract": "Evaluating the efficacy of air pollution control policies is an essential part of the decision-making process to develop new policies and improve existing measures. Since 2005, Fujian Province of Mainland China and Taiwan across the Taiwan Strait have both implemented aggressive air pollution control policies designed based on different principles, but a comprehensive evaluation of these control policies on PM2.5pollution levels is still lacking. In the current study, we assessed the effects of these policies in the Taiwan Strait Region from 2005 to 2018 using full-coverage, high-resolution PM2.5generated by a satellite-driven machine learning model. A ten-fold cross-validation for our prediction model showed an R2value of 0.89, demonstrating that these predictions can be used for policy evaluation. During the 14-year period, PM2.5levels in all areas of Fujian and Taiwan underwent a significant decrease. Separate regression models for policy evaluation in Taiwan and Fujian showed that all considered policies have mitigated PM2.5pollution to various degrees. The Clean Air Action Plans (CAAP) is the most effective control policy in Taiwan, while the Action Plan of Air Pollution Prevention and Control (APPC-AP) and Three-year Action Plan for Blue Skies (3YAP-BS) as well as their provincial implementation plans are the most successful in Fujian. The effectiveness of control policies, however, varies by land-use types especially for Taiwan.",
        "DOI": "10.1016/j.rse.2020.112067",
        "affiliation_name": "University of Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027363",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Regional Electricity Sales Forecasting Research Based on Big Data Application Service Platform",
        "paper_author": "Qi C.",
        "publication": "2020 IEEE 3rd International Conference on Electronics and Communication Engineering, ICECE 2020",
        "citied_by": "4",
        "cover_date": "2020-12-14",
        "Abstract": "Regional monthly electricity sales forecast is an important basis for regional power grid planning and construction, evaluation of regional economic development and operation, and protection of residents' lives. It is also an important work of regional power regulation and management, decision-making of power generation and purchase, improvement of power supply equipment utilization rate and deepening of power system reform. Based on the current situation of power supply enterprise information development, distribution network business status and characteristics, this paper analyzes the factors affecting electricity sales. According to the characteristics of annual changes in electricity sales and data quality factors, the recurrent neural network model is selected based on the big data application service platform. The long short term memory neural network model performs multi-step multivariate prediction on time series, and uses the attention mechanism to combine two independent models for prediction. Experiments conducted on the historical electricity sales data set of a power supply company show that compared with traditional machine learning methods, this method has advantages in accuracy and efficiency.",
        "DOI": "10.1109/ICECE51594.2020.9352886",
        "affiliation_name": "State Grid Corporation of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60004246",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Forecasting of Electricity Generation for Hydro Power Plants",
        "paper_author": "Javed U.",
        "publication": "HONET 2020 - IEEE 17th International Conference on Smart Communities: Improving Quality of Life using ICT, IoT and AI",
        "citied_by": "3",
        "cover_date": "2020-12-14",
        "Abstract": "In today's world of modern technology and rapid increasing demand of electronics, electricity has become an essential and a vital part of our daily life. The under-developed or developing countries face several different challenges in order to manage demand and supply of electricity. The gap between demand and supply of electricity has a very strong effect on the economic growth. The forecasting of energy will play an important role for the policy makers to timely identify the sudden change in demand of electricity under given conditions. To this end, we developed a model for forecasting of electricity generation from hydro-power plants. Besides the parameters from hydropower plant, the forecasting model incorporates the temperature and rainfall in the catchment area of the dam. In this research work we analyzed the data for the energy generation trends on live data of Tarbela Dam, which consist of daily electricity generation for the last five years augmented with the temperature and rainfall data of the dam catchment area. Moreover, we have applied different supervised machine learning and time-series based models to forecast the energy production. The proposed solution is based on future forecasting of energy generation for hydro power plant, which can assist the policy makers in better decision making. The proposed research work will help in minimizing the increasing gap between energy demand and production considering weather conditions of the area. It can also help the power plant management to detect any anomaly or a failure in the electricity production of electricity by studying the deviation from the predicted trend. Our proposed method can forecast the production of electricity generation with Mean Absolute Error of 2.47 only.",
        "DOI": "10.1109/HONET50430.2020.9322841",
        "affiliation_name": "National University of Sciences and Technology",
        "affiliation_city": "Islamabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60059937",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "2020 7th International Conference on Internet of Things: Systems, Management and Security, IOTSMS 2020",
        "paper_author": "NA",
        "publication": "2020 7th International Conference on Internet of Things: Systems, Management and Security, IOTSMS 2020",
        "citied_by": "0",
        "cover_date": "2020-12-14",
        "Abstract": "The proceedings contain 42 papers. The topics discussed include: adopting machine learning to support the detection of malicious domain names; securing industrial control systems using physical device fingerprinting; a novel gateway selection protocol for three-layers integrated wireless networks; reliable abnormal event detection from IoT surveillance systems; a data generator for cloud-edge vehicle communication in multi domain cellular networks; a novel approach based on blockchain to enhance security with dynamic policy updating; scalable IoT architecture for balancing performance and security in mobile crowdsensing systems; investigating the potential of MFCC features in classifying respiratory diseases; and WSNB: wearable sensors with neural networks located in a base station for IoT environment.",
        "DOI": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "2020 59th IEEE Conference on Decision and Control, CDC 2020",
        "paper_author": "NA",
        "publication": "Proceedings of the IEEE Conference on Decision and Control",
        "citied_by": "0",
        "cover_date": "2020-12-14",
        "Abstract": "The proceedings contain 768 papers. The topics discussed include: a minimum energy filter for localization of an unmanned aerial vehicle; chance constrained covariance control for linear stochastic systems with output feedback; distributed composite adaptive synchronization of multiple uncertain Euler-Lagrange systems using cooperative initial excitation; online learning for job scheduling on heterogeneous machines; policy optimization for linear-quadratic zero-sum mean-field type games; on integral input-to-output stability properties; flexible regularization approaches for fairness in deep learning; information disclosure and network formation in news subscription services; performance analysis of stochastic model predictive control with direct and indirect feedback; distributed kalman filter for 3-D moving object tracking over sensor networks; and event-triggered control in presence of measurement noise: a space-regularization approach.",
        "DOI": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Learning Feedforward Control of a Hydraulic Clutch Actuation Path Based on Policy Gradients",
        "paper_author": "Mesmer F.",
        "publication": "Proceedings of the IEEE Conference on Decision and Control",
        "citied_by": "0",
        "cover_date": "2020-12-14",
        "Abstract": "The hydraulic clutch actuation path used in heavy duty transmissions often shows a lot of variability due to manufacturing tolerances and ageing effects. Reason for this are in particular varying friction coefficients in the spools and external factors such as compliance with the specified service intervals or the choice of hydraulic fluid. As a direct consequence, the shift quality typically varies from one transmission to the next. To resolve this problem, this paper presents a machine learning algorithm for the feedforward control of the hydraulic clutch actuation path, a model-based and a data-based feedforward approach. The two approaches are evaluated and compared with each other in simulations with a high-fidelity model. As it turns out, the model-based version is to be preferred and therefore used in a real world evaluation on an embedded controller and a 16 tons wheel loader.",
        "DOI": "10.1109/CDC42340.2020.9303981",
        "affiliation_name": "ZF Friedrichshafen AG",
        "affiliation_city": "Friedrichshafen",
        "affiliation_country": "Germany",
        "affiliation_id": "60072206",
        "affiliation_state": "Baden-Wurttemberg"
    },
    {
        "paper_title": "Adaptive Control for Linearizable Systems Using On-Policy Reinforcement Learning",
        "paper_author": "Westenbroek T.",
        "publication": "Proceedings of the IEEE Conference on Decision and Control",
        "citied_by": "6",
        "cover_date": "2020-12-14",
        "Abstract": "This paper proposes a framework for adaptively learning a feedback linearization-based tracking controller for an unknown system using discrete-time model-free policy-gradient parameter update rules. The primary advantage of the scheme over standard model-reference adaptive control techniques is that it does not require the learned inverse model to be invertible at all instances of time. This enables the use of general function approximators to approximate the linearizing controller for the system without having to worry about singularities. The overall learning system is stochastic, due to the random nature of the policy gradient updates, thus we combine analysis techniques commonly employed in the machine learning literature alongside stability arguments from adaptive control to demonstrate that with high probability the tracking and parameter errors concentrate near zero, under a standard persistency of excitation condition. A simulated example of a double pendulum demonstrates the utility of the proposed theory.",
        "DOI": "10.1109/CDC42340.2020.9304242",
        "affiliation_name": "University of California, Berkeley",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60025038",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "An Attention Based Deep Reinforcement Learning Method for Virtual Network Function Placement",
        "paper_author": "Li S.",
        "publication": "2020 IEEE 6th International Conference on Computer and Communications, ICCC 2020",
        "citied_by": "4",
        "cover_date": "2020-12-11",
        "Abstract": "Network Function Virtualization (NFV) decouples network functions from the dedicated hardware and produces Virtual Network Functions (VNFs) in software. The VNFs are placed on hardware and are linked together to build a service chain. The design of an efficient VNF placement algorithm is crucial. The rapid development of machine learning, especially Deep Reinforcement Learning (Deep RL), allows us to address this problem. In this paper, we present an attention based sequence to sequence Deep RL method for VNF placement. Our approach is a policy based method optimized by REINFORCE with baseline. Our model receives physical hosts and service chain as input and produces the output sequence step by step with attention encoder and decoder. We demonstrate that our method outperforms the existing learning method and greedy heuristic.",
        "DOI": "10.1109/ICCC51575.2020.9345041",
        "affiliation_name": "Beijing University of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022281",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An Improved Q-Learning for System Power Optimization with Temperature, Performance and Energy Constraint Modeling",
        "paper_author": "Li L.",
        "publication": "2020 IEEE Conference on Telecommunications, Optics and Computer Science, TOCS 2020",
        "citied_by": "0",
        "cover_date": "2020-12-11",
        "Abstract": "Power management of embedded systems based on machine learning have drawn more and more attention. High-level software power management and optimization have gradually become important technologies for controlling the computer system power dissipation. In paper, we have employed an improved power optimization management technique which employ Q-learning algorithm based on temperature, performance and energy. The improved Q-learning has been employed to control the uncertain states of the running system and can effectively make decisions to select a rational policy with multiple parameter constraints. As running hardware and application data can be effectively collected and modeled, the power management framework can easily explore an ideal policy by value function of Q-learning algorithm.",
        "DOI": "10.1109/TOCS50858.2020.9339699",
        "affiliation_name": "National Computer Network Emergency Response Technical Team",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "112126690",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Machine Learning-Aided Global Diagnostic and Comparative Tool to Assess Effect of Quarantine Control in COVID-19 Spread",
        "paper_author": "Dandekar R.",
        "publication": "Patterns",
        "citied_by": "35",
        "cover_date": "2020-12-11",
        "Abstract": "We have developed a globally applicable diagnostic COVID-19 model by augmenting the classical SIR epidemiological model with a neural network module. Our model does not rely upon previous epidemics like SARS/MERS and all parameters are optimized via machine learning algorithms used on publicly available COVID-19 data. The model decomposes the contributions to the infection time series to analyze and compare the role of quarantine control policies used in highly affected regions of Europe, North America, South America, and Asia in controlling the spread of the virus. For all continents considered, our results show a generally strong correlation between strengthening of the quarantine controls as learnt by the model and actions taken by the regions' respective governments. In addition, we have hosted our quarantine diagnosis results for the top 70 affected countries worldwide, on a public platform. As we enter the fifth month in the fight against COVID-19, it is evident that the government response to the COVID-19 pandemic has been spatially and temporally diverse. As such, the role played by the varying quarantine measures in different countries in shaping the infection growth curve is still not clear. To address this need, we have developed a novel model which lies at the intersection of the fields of epidemiology and machine learning and allows us to analyze and compare the role of quarantine control policies globally, across the continents of Europe, North America, South America and Asia (results hosted at https://covid19ml.org/). Such a robust, publicly available tool can be of significant value for studies looking at the correlation between the quarantine strength evolution in a particular region with a wide range of metrics spanning from mortality rate to socio-economic landscape impact of COVID-19 in that region. There is an urgent need to quantify the role played by quarantine policies implemented in various regions globally to curtail the spread of COVID-19. A model lying at the intersection of machine learning and epidemiology is shown to be powerful in diagnosing the quarantine policy evolution, which mimics well the real-time, on-ground situation seen in that region. The model, applied to 70 countries globally, is hosted publicly, making it a robust, useful tool in the fight against COVID-19.",
        "DOI": "10.1016/j.patter.2020.100145",
        "affiliation_name": "MIT School of Engineering",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60140949",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Predicting Skill Shortages in Labor Markets: A Machine Learning Approach",
        "paper_author": "Dawson N.",
        "publication": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020",
        "citied_by": "5",
        "cover_date": "2020-12-10",
        "Abstract": "Skill shortages are a drain on society. They hamper economic opportunities for individuals, slow growth for firms, and impede labor productivity in aggregate. Therefore, the ability to understand and predict skill shortages in advance is critical for policy-makers and educators to help alleviate their adverse effects. This research implements a high-performing Machine Learning approach to predict occupational skill shortages. In addition, we demonstrate methods to analyze the underlying skill demands of occupations in shortage and the most important features for predicting skill shortages. For this work, we compile a unique dataset of both Labor Demand and Labor Supply occupational data in Australia from 2012 to 2018. This includes data from 7.7 million job advertisements (ads) and 20 official labor force measures. We use these data as explanatory variables and leverage the XGBoost classifier to predict yearly skills shortage classifications for 132 standardized occupations. The models we construct achieve macro-F1 average performance scores of up to 83 per cent. Our results show that job ads data and employment statistics were the highest performing feature sets for predicting year-to-year skills shortage changes for occupations. We also find that features such as 'Hours Worked', years of 'Education', years of 'Experience', and median 'Salary' are highly important features for predicting occupational skill shortages. This research provides a robust data-driven approach for predicting and analyzing skill shortages, which can assist policy-makers, educators, and businesses to prepare for the future of work.",
        "DOI": "10.1109/BigData50022.2020.9377773",
        "affiliation_name": "University of Technology Sydney",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60023932",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Sketch and Scale Geo-distributed tSNE and UMAP",
        "paper_author": "Wei V.",
        "publication": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020",
        "citied_by": "4",
        "cover_date": "2020-12-10",
        "Abstract": "Running machine learning analytics over geographically distributed datasets is a rapidly arising problem in the world of data management policies ensuring privacy and data security. Visualizing high dimensional data using tools such as t-distributed Stochastic Neighbor Embedding (tSNE) and Uniform Manifold Approximation and Projection (UMAP) became a common practice for data scientists. Both tools scale poorly in time and memory. While recent optimizations showed successful handling of 10,000 data points, scaling beyond million points is still challenging. We introduce a novel framework: Sketch and Scale (SnS). It leverages a Count Sketch data structure to compress the data on the edge nodes, aggregates the reduced size sketches on the master node, and runs vanilla tSNE or UMAP on the summary, representing the densest areas, extracted from the aggregated sketch.We show this technique to be fully parallel, scale linearly in time, logarithmically in memory and communication, making it possible to analyze datasets with many millions, potentially billions of data points, spread across several data centers around the globe. We demonstrate the power of our method on two mid-size datasets: cancer data with 52 million 35-band pixels from multiplex images of tumor biopsies; and astrophysics data of 100 million stars with multi-color photometry from the Sloan Digital Sky Survey (SDSS).",
        "DOI": "10.1109/BigData50022.2020.9377843",
        "affiliation_name": "Johns Hopkins University",
        "affiliation_city": "Baltimore",
        "affiliation_country": "United States",
        "affiliation_id": "60005248",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "Privacy Preserving Proxy for Machine Learning as a Service",
        "paper_author": "Kasichainula K.",
        "publication": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020",
        "citied_by": "3",
        "cover_date": "2020-12-10",
        "Abstract": "In this paper, we propose a new framework called Privacy Preserving Proxy (PPP) to protect the online models. PPP is designed like a gateway to work on behalf of the users when requesting service, potentially masking the true origin of the online model from client. Instead of connecting directly to the machine learning-as-a-service(MLaaS) the clients submit the request to the PPP, which evaluates the request and executes some functions to maximize the safety of the models. PPP can potentially host a wide range of functions or triggers to control the complexity of the request or provide additional benefits such as privacy and security. We propose two different methods including Random Model Assignment and Intelligent Rounding Policy which can function inside PPP to protect the privacy of online models. To test the PPP we test TL-GAN based face reconstruction attack as a sophisticated approach which can reveal inefficiency of rounding policy as countermeasure. Our experiments show that, PPP can potentially nullify such complicated attacks in the future.",
        "DOI": "10.1109/BigData50022.2020.9378377",
        "affiliation_name": "University of Houston",
        "affiliation_city": "Houston",
        "affiliation_country": "United States",
        "affiliation_id": "60005837",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "A Deep Recurrent Neural Network to Support Guidelines and Decision Making of Social Distancing",
        "paper_author": "Aledhari M.",
        "publication": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020",
        "citied_by": "2",
        "cover_date": "2020-12-10",
        "Abstract": "The recent Covid-19 pandemic instigated many changes in our way of life within the United States, and slowly but surely we are working towards mitigating the virus. Due to Covid-19, there are higher demands for models to accurately forecast the number of Covid-19 cases that factor mandated guidelines such as social-distancing. Many scholarly and corporate research entities are investigating ways to achieve this goal preemptively; Unfortunately, current models are not yet able to accurately model future Covid-19 cases that factor in various guidelines; What is lacking with these models is an understanding of crucial factors affecting spread, accuracy, availability of reported cases on a small scale, and quantifiable metrics for how social distancing and quarantine efforts mitigate the spread. Therefore, the goal of this study is to produce a mathematical model to directly aid policy decisions by comparing predicted models of various decisions and social distancing protocols. This model can be applied on top of existing models to factor in more imminent data and produce predictive curves, indicating troughs and peaks of new daily Covid-19 cases with comparatively high accuracy, which can aid in analysis. These predictive curves can, therefore, be generated using data corresponding to projected responses to proposed guidelines and compared to each other to choose the optimal solution for 'flattening the curve' of the Covid19 infection rate. We use an LSTM-RNN model with ANN Regression in an attempt to predict future Covid-19 cases. Our model achieved comparable results, but further improvements could be implemented for more optimal results.",
        "DOI": "10.1109/BigData50022.2020.9377800",
        "affiliation_name": "Kennesaw State University",
        "affiliation_city": "Kennesaw",
        "affiliation_country": "United States",
        "affiliation_id": "60019740",
        "affiliation_state": "GA"
    },
    {
        "paper_title": "A Novel Lasso Regression Model for Sector Rotation Trading Strategies with Economy-Policy Cycles",
        "paper_author": "Wang X.",
        "publication": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020",
        "citied_by": "1",
        "cover_date": "2020-12-10",
        "Abstract": "A variety of machine learning methods such as decision trees, support vector machines, neural networks, and natural language processing are demonstrating their utilities in the Financial Investing field. In this article, we use a novel and innovative Lasso Regression model called Post-Lasso to construct a profitable sector rotation trading strategy for the Chinese stock market. On the basis of the machine learning model, we further identify and analyze the Economy-Policy cycles, which represent a broader environment of the economy. Through combining two megatrends - macroeconomy and artificial intelligence, we develop an interpretable, reliable, and trustworthy trading system which applies well to more practical situations.",
        "DOI": "10.1109/BigData50022.2020.9377759",
        "affiliation_name": "China Asset Management Co. Ltd.",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "114022347",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Towards Green Query Processing - Auditing Power before Deploying",
        "paper_author": "Dembele S.P.",
        "publication": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020",
        "citied_by": "11",
        "cover_date": "2020-12-10",
        "Abstract": "Nowadays, energy reduction has become a critical and urgent issue for the database community. A lot of initiatives have been launched on energy-efficiency for intensive-workload computation covering individual hardware components, system software, to applications. This computation is mainly ensured by query optimizers. Their current versions minimize inputs-outputs operations and try to exploit RAM as much as possible, by ignoring energy. A couple of studies proposed the integration of energy into query optimizers that can be classified into hardware and software solutions. Several researchers have the idea that the operating systems and firmware manage energy and put software solutions in the second plan. This does not distinguish between tasks of operating systems and DBMSs. In this paper, we claim that building from scratch a green query processors and revisiting existing ones pass through 4-steps procedure: (1) establishment of a deep audit that allows understanding the query processor functioning, (2) identification of relevant energy-sensitive parameters belonging to hardware and software components, (3) elaboration of mathematical cost models estimating consumed energy when executing a query on a target DBMS and (4) setting of values of the energy-sensitive parameters using a nonlinear regression technique. To show the effectiveness of this procedure, we apply it on two open-source DBMSs with different functioning policies: PostgreSQL and MonetDB and compared them using the dataset and the workload of the TPC-H benchmark.",
        "DOI": "10.1109/BigData50022.2020.9377819",
        "affiliation_name": "ISAE-ENSMA",
        "affiliation_city": "Chasseneuil du Poitou",
        "affiliation_country": "France",
        "affiliation_id": "60009701",
        "affiliation_state": "Nouvelle-Aquitaine"
    },
    {
        "paper_title": "Machine Learning and OLAP on Big COVID-19 Data",
        "paper_author": "Leung C.K.",
        "publication": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020",
        "citied_by": "61",
        "cover_date": "2020-12-10",
        "Abstract": "In the current technological era, huge amounts of big data are generated and collected from a wide variety of rich data sources. These big data can be of different levels of veracity in the sense that some of them are precise while some others are imprecise and uncertain. Embedded in these big data are useful information and valuable knowledge to be discovered. An example of these big data is healthcare and epidemiological data such as data related to patients who suffered from epidemic diseases like the coronavirus disease 2019 (COVID-19). Knowledge discovered from these epidemiological data - via data science techniques such as machine learning, data mining, and online analytical processing (OLAP) - helps researchers, epidemiologists and policy makers to get a better understanding of the disease, which may inspire them to come up ways to detect, control and combat the disease. In this paper, we present a machine learning and big data analytic tool for processing and analyzing COVID-19 epidemiological data. Specifically, the tool makes good use of taxonomy and OLAP to generalize some specific attributes into some generalized attributes for effective big data analytics. Instead of ignoring unknown or unstated values of some attributes, the tool provides users with flexibility of including or excluding these values, depending on their preference and applications. Moreover, the tool discovers frequent patterns and their related patterns, which help reveal some useful knowledge such as absolute and relative frequency of the patterns. Furthermore, the tool learns from the patterns discovered from historical data and predicts useful information such as clinical outcomes for future data. As such, the tool helps users to get a better understanding of information about the confirmed cases of COVID-19. Although this tool is designed for machine learning and analytics of big epidemiological data, it would be applicable to machine learning and analytics of big data in many other real-life applications and services.",
        "DOI": "10.1109/BigData50022.2020.9378407",
        "affiliation_name": "Università della Calabria",
        "affiliation_city": "Rende",
        "affiliation_country": "Italy",
        "affiliation_id": "60020261",
        "affiliation_state": "CS"
    },
    {
        "paper_title": "A network science-based approach for an optimal microservice governance",
        "paper_author": "Siriwardhana G.S.",
        "publication": "ICAC 2020 - 2nd International Conference on Advancements in Computing, Proceedings",
        "citied_by": "2",
        "cover_date": "2020-12-10",
        "Abstract": "In today's world of software application development, Kubernetes has emerged as one of the most effective microservice deployment technologies presently available due to its exceptional ability to deploy and orchestrate containerized microservices. However, a common issue faced in such orchestration technologies is the employment of vast arrays of disjoint monitoring solutions that fail to portray a holistic perspective on the state of microservice deployments, which consequently inhibit the creation of more optimized deployment policies. In response to this issue, this publication proposes the use of a network science-based approach to facilitate the creation of a microservice governance model that incorporates the use of dependency analysis, load prediction, centrality analysis, and resilience evaluation to effectively construct a more holistic perspective on a given microservice deployment. Furthermore, through analysis of the factors mentioned above, the research conducted, then proceeds to create an optimized deployment strategy for the deployment with the aid of a developed optimization algorithm. Analysis of results revealed the developed governance model aided through the utilization of the developed optimization algorithm proposed in this publication, proved to be quite effective in the generation of optimized microservice deployment policies.",
        "DOI": "10.1109/ICAC51239.2020.9357232",
        "affiliation_name": "Sri Lanka Institute of Information Technology",
        "affiliation_city": "Colombo",
        "affiliation_country": "Sri Lanka",
        "affiliation_id": "60104431",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "COVID-19 Chest X-Ray Classification Using Convolutional Neural Network Architectures",
        "paper_author": "Nurtiyasari D.",
        "publication": "2020 3rd International Seminar on Research of Information Technology and Intelligent Systems, ISRITI 2020",
        "citied_by": "8",
        "cover_date": "2020-12-10",
        "Abstract": "World Health Organizations declared that Coronavirus Disease 2019 (COVID-19) outbreak pandemic in March 2020. Countries around the world are stepping up effort to halt the spread of this pandemic. Some countries are scrambling to tackle this virus by applying lockdown policy. As of 10 August 2020, there have been confirmed 19.718.030 total cases and 728.013 total deaths of COVID-19 [2]. COVID-19 detection is vital to decide the subsequent step in handling the patients. One strategy that may be applied for COVID-19 detection is classification approach primarily based totally on chest x-ray of the patients. Convolutional neural network has been successfully applied in practical applications. It is a type of machine learning which the model is designed to learn classification tasks directly from an image. It recognizes patterns directly from image pixel. These patterns are used to classify images and to eliminate the need of manual feature extraction. The classification provides outcomes with recall, precision, and accuracy had been respectively 94.99%, 95%, and 95.47% for model 1 and 97.73%, 95%, and 96.59% for model 2.",
        "DOI": "10.1109/ISRITI51436.2020.9315499",
        "affiliation_name": "Universitas Gadjah Mada",
        "affiliation_city": "Yogyakarta",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60069380",
        "affiliation_state": "Yogyakarta"
    },
    {
        "paper_title": "An Advanced Policy Gradient Based Vector Control of PMSM for EV Application",
        "paper_author": "Bhattacharjee S.",
        "publication": "2020 10th International Electric Drives Production Conference, EDPC 2020 - Proceedings",
        "citied_by": "15",
        "cover_date": "2020-12-08",
        "Abstract": "Traditional proportional-integral (PI) based control has proven to be an influential control technique due to its advantage of easy implementation and robust performance for EV application. However, these controls are sensitive to plant parameters since the motor parameters change over time resulting in reduced performance and efficiency. This paper proposes a new vector control in permanent magnet synchronous motor (PMSM) with deep reinforcement learning (DRL) based controller in EV application. An advanced policy gradient algorithm is used to develop the DRL-based vector controller to overcome non-linearity in machine parameters and mitigate the decoupling inaccuracy issues in conventional control schemes. This contribution further evaluates the adaptive and dynamic performance against the conventional PI-based control and the research outlook is presented in the subsequent sections of this paper.",
        "DOI": "10.1109/EDPC51184.2020.9388187",
        "affiliation_name": "Magna Donnelly",
        "affiliation_city": "Holland",
        "affiliation_country": "United States",
        "affiliation_id": "60028473",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Expanding dimensions: A new source in the bibliometrician's toolbox",
        "paper_author": "Wastl J.",
        "publication": "Handbook Bibliometrics",
        "citied_by": "2",
        "cover_date": "2020-12-07",
        "Abstract": "Developed by Digital Science in collaboration with over 100 leading research organisations around the world, Dimensions is a unique platform combining data about publications, data sets, grants, patents, clinical trials, and policy documents. This database spans the broader global scientific landscape to enable individual researchers as well as research funders, research organizations, and publishers to discover, analyse, and understand multiple aspects of the research life cycle. This chapter introduces the development and deployment of the Dimensions platform and describes the breadth of available functionality with focus on bibliometric applications and question sets that can be applied to the academic and broader outcomes of research, and gather insights to inform future strategy.",
        "DOI": "10.1515/9783110646610-039",
        "affiliation_name": "Digital Science",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "117499655",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Functional Analysis of the 2020 U.S. Elections on Twitter and Facebook using Machine Learning",
        "paper_author": "Alashri S.",
        "publication": "Proceedings of the 2020 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining, ASONAM 2020",
        "citied_by": "1",
        "cover_date": "2020-12-07",
        "Abstract": "Social Networking Sites (SNS), such as Facebook and Twitter, are important tools for political campaigns. A line of related work analyzed political campaigns online. The initial efforts in analyzing campaign discourse functions relied on human analysis, which is time consuming and does not scale well with big data. To address these gaps, we propose a model to detect the type of campaign topics: Policy vs. Character, and how the public (commentators) responded to these messages. The proposed model yielded an accuracy of 78% (F-measure) in detecting post type. Moreover, experimental results show the analysis of commentators linguistic and psychological characteristics.",
        "DOI": "10.1109/ASONAM49781.2020.9381302",
        "affiliation_name": "King Abdulaziz City for Science and Technology",
        "affiliation_city": "Riyadh",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60033126",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Anticipating future learning affects current control decisions: A comparison between passive and active adaptive management in an epidemiological setting",
        "paper_author": "Atkins B.D.",
        "publication": "Journal of Theoretical Biology",
        "citied_by": "7",
        "cover_date": "2020-12-07",
        "Abstract": "Infectious disease epidemics present a difficult task for policymakers, requiring the implementation of control strategies under significant time constraints and uncertainty. Mathematical models can be used to predict the outcome of control interventions, providing useful information to policymakers in the event of such an epidemic. However, these models suffer in the early stages of an outbreak from a lack of accurate, relevant information regarding the dynamics and spread of the disease and the efficacy of control. As such, recommendations provided by these models are often incorporated in an ad hoc fashion, as and when more reliable information becomes available. In this work, we show that such trial-and-error-type approaches to management, which do not formally take into account the resolution of uncertainty and how control actions affect this, can lead to sub-optimal management outcomes. We compare three approaches to managing a theoretical epidemic: a non-adaptive management (AM) approach that does not use real-time outbreak information to adapt control, a passive AM approach that incorporates real-time information if and when it becomes available, and an active AM approach that explicitly incorporates the future resolution of uncertainty through gathering real-time information into its initial recommendations. The structured framework of active AM encourages the specification of quantifiable objectives, models of system behaviour and possible control and monitoring actions, followed by an iterative learning and control phase that is able to employ complex control optimisations and resolve system uncertainty. The result is a management framework that is able to provide dynamic, long-term projections to help policymakers meet the objectives of management. We investigate in detail the effect of different methods of incorporating up-to-date outbreak information. We find that, even in a highly simplified system, the method of incorporating new data can lead to different results that may influence initial policy decisions, with an active AM approach to management providing better information that can lead to more desirable outcomes from an epidemic.",
        "DOI": "10.1016/j.jtbi.2020.110380",
        "affiliation_name": "Lancaster Medical School",
        "affiliation_city": "Lancaster",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60117765",
        "affiliation_state": "Lancashire"
    },
    {
        "paper_title": "Screening of Murabaha business process through Quran and hadith: a text mining analysis",
        "paper_author": "Tlemsani I.",
        "publication": "Journal of Islamic Accounting and Business Research",
        "citied_by": "13",
        "cover_date": "2020-12-06",
        "Abstract": "Purpose: This paper revolves around the usage of data analytics in the Qur’an and Hadith through a new text mining technique to answer the main research question of whether the activities and the data flows of the Murabaha financing contract is compatible with Sharia law. The purpose of this paper is to provide a thorough and comprehensive database that will be used to examine existing practices in Islamic banks’ and improve compliancy with Islamic financial law (Sharia). Design/methodology/approach: To design a Sharia-compliant Murabaha business process originated on text mining, the authors start by identifying the factors deemed necessary in their text mining techniques of both texts; using a four-step strategy to analyze those text mining analytics; then, they list the three basic approaches in text mining used for new knowledge discovery in databases: the co-occurrence approach based on the recursive co-occurrence algorithm; the machine learning or statistical-based; and the knowledge-based. They identify any variation and association between the Murabaha business processes produced using text mining against the one developed through data collection. Findings: The main finding attained in this paper is to confirm the compatibility of all activities and the data flows in the Murabaha financing contract produced using data analytics of the Quran and Hadith texts against the Murabaha business process that was developed based on data collection. Another key finding is revealing some shortcomings regarding Islamic banks business process compliance with Sharia law. Practical implications: Given Murabaha as the most popular mode of Islamic financing with more than 75% in total transactions, this research has managed to touch-base on an area that is interesting to the vast majority of those dealing with Islamic finance instruments. By reaching findings that could improve the existing Islamic Murabaha business process and concluding on Sharia compliance of the existing Murabaha business process, this research is quite relevant and could be used in practice as well as in influencing public policy. In fact, Islamic Sharia law experts, Islamic finance professionals and Islamic banks may find the results of this study very useful in improving at least one aspect of the Islamic finance transactions. Originality/value: By using a novel, fresh text mining methods built on recursive occurrence of synonym words from the Qur’an and Hadith to enrich Islamic finance, this research study can claim to have been the first of its kind in using machine learning to mine the Quran, Hadith and in extracting valuable knowledge to support and consolidate the Islamic financial business processes and make them more compliant with the i.",
        "DOI": "10.1108/JIABR-05-2020-0159",
        "affiliation_name": "IE Business School",
        "affiliation_city": "Madrid",
        "affiliation_country": "Spain",
        "affiliation_id": "60108973",
        "affiliation_state": "Madrid"
    },
    {
        "paper_title": "Bank loan prediction system using machine learning",
        "paper_author": "Gupta A.",
        "publication": "Proceedings of the 2020 9th International Conference on System Modeling and Advancement in Research Trends, SMART 2020",
        "citied_by": "35",
        "cover_date": "2020-12-04",
        "Abstract": "With the advancement in technology, there are so many enhancements in the banking sector also. The number of applications is increasing every day for loan approval. There are some bank policies that they have to consider while selecting an applicant for loan approval. Based on some parameters, the bank has to decide which one is best for approval. It is tough and risky to check out manually every person and then recommended for loan approval. In this work, we use a machine learning technique that will predict the person who is reliable for a loan, based on the previous record of the person whom the loan amount is accredited before. This work's primary objective is to predict whether the loan approval to a specific individual is safe or not.",
        "DOI": "10.1109/SMART50582.2020.9336801",
        "affiliation_name": "Teerthanker Mahaveer University, Moradabad",
        "affiliation_city": "Moradabad",
        "affiliation_country": "India",
        "affiliation_id": "60113718",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "Making Cyberspace towards Sustainability A Scientometric Review for a Cyberspace that Enables Green and Digital Transformation",
        "paper_author": "Wang Z.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "6",
        "cover_date": "2020-12-04",
        "Abstract": "Green and Digital Transformation, using digital technologies for green and inclusive development, has become the main agenda for both policy-makers and researchers. European Union (EU), for instance, has targeted the twin transition towards a green and digital economy by proposing a European Green Deal, guiding its investment and planning on the industrial applications using digital technologies such as artificial intelligence, big data, cloud and Internet of Things. While some work has been conducted to examine the digital transformation of different industries, no systematic review has been conducted to analyze the research fronts on the topic of green and digital transformation. With the purpose to layout an overall roadmap for industries and research, a scientometric study was conducted to map out the evolution, main journals, authors and keywords, thereby providing policy and research suggestions for science and technology innovations. This scientometric report on green and digital transformation, with its core value in summarizing scientific literature data using data science and machine learning techniques, provides timely accessible visualization for policy-makers, innovators and researchers evidence-based insights to make better decisions. Future research can build upon the preliminary findings here for the methodological, information and research need for tracking the development of green and digital transformation, so as to produce better strategic foresight.",
        "DOI": "10.1145/3444370.3444603",
        "affiliation_name": "Nanfang College of Sun Yet-sen University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60117185",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Healthcare Management System with Sales Analytics using Autoregressive Integrated Moving Average and Google Vision",
        "paper_author": "Madrid M.C.R.",
        "publication": "2020 IEEE 12th International Conference on Humanoid, Nanotechnology, Information Technology, Communication and Control, Environment, and Management, HNICEM 2020",
        "citied_by": "4",
        "cover_date": "2020-12-03",
        "Abstract": "Digitalization of different industries led to new systems that provide accurate information that results in efficient and effective services. This information is vital for decision-making and on the larger scale, policymaking especially in the health sector. In the Philippines, some healthcare establishments have not adjusted to this digital change. This study aims to develop an enhanced model of healthcare management system that can perform digitization of data, predictive health analytics and sales trend analysis. The researchers identified these three features as the focus of the system because it improves data quality, accessibility, reliability, and autonomy. The system is based on prescriptive analytics - a type of analytics that uses machine learning to process historical and predictive data. The artificially intelligent management system caters to the needs of the healthcare sector in this digital age to improve its services to the people.",
        "DOI": "10.1109/HNICEM51456.2020.9400035",
        "affiliation_name": "FEU Institute of Technology",
        "affiliation_city": "Manila",
        "affiliation_country": "Philippines",
        "affiliation_id": "60110905",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Development of Waste Management System using the Concept of 'Basura Advantage Points' through Artificial Neural Network",
        "paper_author": "Castro R.C.C.",
        "publication": "2020 IEEE 12th International Conference on Humanoid, Nanotechnology, Information Technology, Communication and Control, Environment, and Management, HNICEM 2020",
        "citied_by": "9",
        "cover_date": "2020-12-03",
        "Abstract": "One of the most pressing problems of the world is the growing solid waste pollution. With current demands for sustainable development, the researchers developed a waste segregator machine that satisfies efficient segregation and introduces the concept of reward system to motivate people to throw their waste into the machine. In this paper, the researchers created an automatic segregating machine that uses Artificial Neural Network (ANN) as an algorithm for machine learning and embedded with the concept of 'Basura Advantage Points'. The ANN acts as the brain of the machine for sorting out the plastic bottles as one category and other waste materials for the other category. The 'Basura Advantage Points' is a novel concept wherein whenever people throw a garbage into the segregating machine, they can earn points which can then be used to redeem awards set by policy makers. Survey results show that the machine is appealing to the public. Based on the sample wastes, the accuracy of the machine is around 80 percent. From positive feedbacks to successful evaluation, the study highlighted a good model to decrease improper waste disposal and encourage people to participate in proper waste segregation.",
        "DOI": "10.1109/HNICEM51456.2020.9400123",
        "affiliation_name": "Bulacan State University",
        "affiliation_city": "Malolos",
        "affiliation_country": "Philippines",
        "affiliation_id": "60108105",
        "affiliation_state": "Bulacan"
    },
    {
        "paper_title": "Motorcycle Rider Helmet Detection for Riding Safety and Compliance Using Convolutional Neural Networks",
        "paper_author": "Giron N.N.F.",
        "publication": "2020 IEEE 12th International Conference on Humanoid, Nanotechnology, Information Technology, Communication and Control, Environment, and Management, HNICEM 2020",
        "citied_by": "8",
        "cover_date": "2020-12-03",
        "Abstract": "Traffic violation apprehension is one of the traffic problems here in the Philippines. One example is the No Helmet No Ride Law that is implemented but many motorists still choose to ignore. To alleviate the problem the government has offered many solutions, one of which is the No Contact Traffic Apprehension Policy that uses CCTV Monitoring. To further enhance this solution the government has partnered with the De La Salle University to use artificial intelligence in the system. Computer Vision tasks like image classification and object detection can help automate the traffic apprehension system. Image classification and object detection are technologies which are used in computer vision in defining an image or coordinates of an object in an image. In this work, a novel approach to classifying motorcycle riders between wearing a helmet or not will be developed. It will be demonstrated using deep machine learning, specifically convolutional neural network and by utilizing different pre-trained models to a gathered dataset.",
        "DOI": "10.1109/HNICEM51456.2020.9400149",
        "affiliation_name": "Bulacan State University",
        "affiliation_city": "Malolos",
        "affiliation_country": "Philippines",
        "affiliation_id": "60108105",
        "affiliation_state": "Bulacan"
    },
    {
        "paper_title": "Classification between Pedestrians and Motorcycles using FasterRCNN Inception and SSD MobileNetv2",
        "paper_author": "Giron N.N.F.",
        "publication": "2020 IEEE 12th International Conference on Humanoid, Nanotechnology, Information Technology, Communication and Control, Environment, and Management, HNICEM 2020",
        "citied_by": "8",
        "cover_date": "2020-12-03",
        "Abstract": "Philippines is on the list of the top ten fastest growing economy in the world. One of its developments is in its traffic law enforcement. Today, the government is continuously finding ways on how to alleviate the problem on its roads with the use of technology. The Metro Manila Development Authority (MMDA) has offered a solution which is the No Contact Traffic Apprehension Policy, that utilizes Closed-Circuit Television (CCTV) Monitoring to apprehend vehicles violating traffic laws, rules and regulations by capturing videos and images. To further enhance this, the government has partnered with the De La Salle University to use artificial intelligence in the system with the project 'CATCH-ALL'. With the use of CCTVs and artificial intelligence system, it can help the system detect traffic violations using an automated process. But some tasks are not that easy to execute by the computer like differentiating a pedestrian and a motorcycle. In this study, a novel approach to classifying a pedestrian and a motorcycle with the use of object detection will be developed. It will be demonstrated using deep machine learning, specifically convolutional neural network and by utilizing different pre-trained models to a gathered dataset.",
        "DOI": "10.1109/HNICEM51456.2020.9400113",
        "affiliation_name": "Bulacan State University",
        "affiliation_city": "Malolos",
        "affiliation_country": "Philippines",
        "affiliation_id": "60108105",
        "affiliation_state": "Bulacan"
    },
    {
        "paper_title": "A Machine-Learning Based Approach for Zoning Urban Area in Consolidation Schemes Context",
        "paper_author": "Ouadi J.E.",
        "publication": "2020 13th International Colloquium of Logistics and Supply Chain Management, LOGISTIQUA 2020",
        "citied_by": "11",
        "cover_date": "2020-12-02",
        "Abstract": "Private freight transportation has many advantages, including speed, comfort and affordability. However, it is not often efficient to shorten longer commute times, as it is unable to keep-up with logistics demand during peak hours. Integrative policies, in flow terms, could fill this gap when supported through freight consolidation. Yet, a key issue that emerges in the implementation of consolidation-based transportation systems is that of logistics demand for reducing uncertainties about whether it will be met. The main target of this article is to include demand volatility to carry out a longterm urban land splitting that serve in building consolidation network. To that end, we propose a hybrid machine-learning framework combining several algorithms that are thought robust according to the literature and the achieved accuracy benchmarks. Based upon simulated system, some analytical outlooks are provided below.",
        "DOI": "10.1109/LOGISTIQUA49782.2020.9353901",
        "affiliation_name": "Université de Bordeaux",
        "affiliation_city": "Bordeaux",
        "affiliation_country": "France",
        "affiliation_id": "60102125",
        "affiliation_state": "Nouvelle-Aquitaine"
    },
    {
        "paper_title": "Prediction of Absenteeism at Work using Data Mining Techniques",
        "paper_author": "Skorikov M.",
        "publication": "Proceedings of ICITR 2020 - 5th International Conference on Information Technology Research: Towards the New Digital Enlightenment",
        "citied_by": "7",
        "cover_date": "2020-12-02",
        "Abstract": "High absenteeism among employees can be detrimental to an organization as it can result in productivity and economic loss. This paper looks into a case of absenteeism in a courier company in Brazil. Machine learning techniques have been employed to understand and predict absenteeism. Understanding this would provide human resource managers an excellent decision aid to create policies that can aim to reduce absenteeism. Data has been preprocessed, and several machine learning classification algorithms (such as zeroR, tree-based J48, naive Bayes, and KNN) have been applied. The paper reports models that can predict absenteeism with an accuracy of over 92%. Furthermore, from an initial of 20 attributes, disciplinary failure turns out to be a very prominent feature in predicting absenteeism.",
        "DOI": "10.1109/ICITR51448.2020.9310913",
        "affiliation_name": "North South University",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60028220",
        "affiliation_state": "NA"
    }
]