[
    {
        "paper_title": "ChatGPT Utility in Healthcare Education, Research, and Practice: Systematic Review on the Promising Perspectives and Valid Concerns",
        "publication": "Healthcare (Switzerland)",
        "citied_by": "1282",
        "cover_date": "2023-03-01",
        "Abstract": "ChatGPT is an artificial intelligence (AI)-based conversational large language model (LLM). The potential applications of LLMs in health care education, research, and practice could be promising if the associated valid concerns are proactively examined and addressed. The current systematic review aimed to investigate the utility of ChatGPT in health care education, research, and practice and to highlight its potential limitations. Using the PRIMSA guidelines, a systematic search was conducted to retrieve English records in PubMed/MEDLINE and Google Scholar (published research or preprints) that examined ChatGPT in the context of health care education, research, or practice. A total of 60 records were eligible for inclusion. Benefits of ChatGPT were cited in 51/60 (85.0%) records and included: (1) improved scientific writing and enhancing research equity and versatility; (2) utility in health care research (efficient analysis of datasets, code generation, literature reviews, saving time to focus on experimental design, and drug discovery and development); (3) benefits in health care practice (streamlining the workflow, cost saving, documentation, personalized medicine, and improved health literacy); and (4) benefits in health care education including improved personalized learning and the focus on critical thinking and problem-based learning. Concerns regarding ChatGPT use were stated in 58/60 (96.7%) records including ethical, copyright, transparency, and legal issues, the risk of bias, plagiarism, lack of originality, inaccurate content with risk of hallucination, limited knowledge, incorrect citations, cybersecurity issues, and risk of infodemics. The promising applications of ChatGPT can induce paradigm shifts in health care education, research, and practice. However, the embrace of this AI chatbot should be conducted with extreme caution considering its potential limitations. As it currently stands, ChatGPT does not qualify to be listed as an author in scientific articles unless the ICMJE/COPE guidelines are revised or amended. An initiative involving all stakeholders in health care education, research, and practice is urgently needed. This will help to set a code of ethics to guide the responsible use of ChatGPT among other LLMs in health care and academia.",
        "DOI": "10.3390/healthcare11060887",
        "paper_author": "Sallam M.",
        "affiliation_name": "School of Medicine",
        "affiliation_city": "Amman",
        "affiliation_country": "Jordan",
        "affiliation_id": "60199635",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial Intelligence and Machine Learning in Clinical Medicine, 2023.",
        "publication": "New England Journal of Medicine",
        "citied_by": "479",
        "cover_date": "2023-01-01",
        "Abstract": "AI and Machine Learning in Clinical Medicine, 2023 This first article in a series describes the history of artificial intelligence in medicine; the use of AI in image analysis, identification of disease outbreaks, and diagnosis; and the use of chatbots.",
        "DOI": "10.1056/NEJMra2302038",
        "paper_author": "Haug C.J.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Can artificial intelligence help for scientific writing?",
        "publication": "Critical Care",
        "citied_by": "420",
        "cover_date": "2023-12-01",
        "Abstract": "This paper discusses the use of Artificial Intelligence Chatbot in scientific writing. ChatGPT is a type of chatbot, developed by OpenAI, that uses the Generative Pre-trained Transformer (GPT) language model to understand and respond to natural language inputs. AI chatbot and ChatGPT in particular appear to be useful tools in scientific writing, assisting researchers and scientists in organizing material, generating an initial draft and/or in proofreading. There is no publication in the field of critical care medicine prepared using this approach; however, this will be a possibility in the next future. ChatGPT work should not be used as a replacement for human judgment and the output should always be reviewed by experts before being used in any critical decision-making or application. Moreover, several ethical issues arise about using these tools, such as the risk of plagiarism and inaccuracies, as well as a potential imbalance in its accessibility between high- and low-income countries, if the software becomes paying. For this reason, a consensus on how to regulate the use of chatbots in scientific writing will soon be required.",
        "DOI": "10.1186/s13054-023-04380-2",
        "paper_author": "Salvagno M.",
        "affiliation_name": "Hôpital Erasme",
        "affiliation_city": "Brussels",
        "affiliation_country": "Belgium",
        "affiliation_id": "60068575",
        "affiliation_state": "BRU"
    },
    {
        "paper_title": "Assessing the performance of ChatGPT in answer- ing questions regarding cirrhosis and hepatocellu- lar carcinoma",
        "publication": "Clinical and Molecular Hepatology",
        "citied_by": "299",
        "cover_date": "2023-07-01",
        "Abstract": "Background/Aims: Patients with cirrhosis and hepatocellular carcinoma (HCC) require extensive and personalized care to improve outcomes. ChatGPT (Generative Pre-trained Transformer), a large language model, holds the potential to provide professional yet patient-friendly support. We aimed to examine the accuracy and reproducibility of ChatGPT in answering questionsregarding knowledge, management, and emotionalsupport for cirrhosis and HCC. Methods: ChatGPT’s responses to 164 questions were independently graded by two transplant hepatologists and resolved by a third reviewer. The performance of ChatGPT was also assessed using two published questionnaires and 26 questions formulated from the quality measures of cirrhosis management. Finally, its emotional support capacity was tested. Results: We showed that ChatGPT regurgitated extensive knowledge of cirrhosis (79.1% correct) and HCC (74.0% correct), but only small proportions (47.3% in cirrhosis, 41.1% in HCC) were labeled as comprehensive. The performance was better in basic knowledge, lifestyle, and treatment than in the domains of diagnosis and preventive medicine. For the quality measures, the model answered 76.9% of questions correctly but failed to specify decision-making cut-offs and treatment durations. ChatGPT lacked knowledge of regional guidelines variations, such as HCC screening criteria. However, it provided practical and multifaceted advice to patients and caregivers regarding the next steps and adjusting to a new diagnosis. Conclusions: We analyzed the areas of robustness and limitations of ChatGPT’s responses on the management of cirrhosis and HCC and relevant emotional support. ChatGPT may have a role as an adjunct informational tool for patients and physiciansto improve outcomes. (Clin Mol Hepatol 2023;29:721-732)",
        "DOI": "10.3350/cmh.2023.0089",
        "paper_author": "Yeo Y.H.",
        "affiliation_name": "Cedars-Sinai Medical Center",
        "affiliation_city": "Los Angeles",
        "affiliation_country": "United States",
        "affiliation_id": "60016173",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "From human writing to artificial intelligence generated text: examining the prospects and potential threats of ChatGPT in academic writing",
        "publication": "Biology of Sport",
        "citied_by": "280",
        "cover_date": "2023-01-01",
        "Abstract": "Natural language processing (NLP) has been studied in computing for decades. Recent technological advancements have led to the development of sophisticated artificial intelligence (AI) models, such as Chat Generative Pre-trained Transformer (ChatGPT). These models can perform a range of language tasks and generate human-like responses, which offers exciting prospects for academic efficiency. This manuscript aims at (i) exploring the potential benefits and threats of ChatGPT and other NLP technologies in academic writing and research publications; (ii) highlights the ethical considerations involved in using these tools, and (iii) consider the impact they may have on the authenticity and credibility of academic work. This study involved a literature review of relevant scholarly articles published in peer-reviewed journals indexed in Scopus as quartile 1. The search used keywords such as “ChatGPT,” “AI-generated text,” “academic writing,” and “natural language processing.” The analysis was carried out using a quasi-qualitative approach, which involved reading and critically evaluating the sources and identifying relevant data to support the research questions. The study found that ChatGPT and other NLP technologies have the potential to enhance academic writing and research efficiency. However, their use also raises concerns about the impact on the authenticity and credibility of academic work. The study highlights the need for comprehensive discussions on the potential use, threats, and limitations of these tools, emphasizing the importance of ethical and academic principles, with human intelligence and critical thinking at the forefront of the research process. This study highlights the need for comprehensive debates and ethical considerations involved in their use. The study also recommends that academics exercise caution when using these tools and ensure transparency in their use, emphasizing the importance of human intelligence and critical thinking in academic work.",
        "DOI": "10.5114/BIOLSPORT.2023.125623",
        "paper_author": "Dergaa I.",
        "affiliation_name": "Primary Health Care Corporation",
        "affiliation_city": "Doha",
        "affiliation_country": "Qatar",
        "affiliation_id": "60264454",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial Intelligence in Pharmaceutical Technology and Drug Delivery Design",
        "publication": "Pharmaceutics",
        "citied_by": "278",
        "cover_date": "2023-07-01",
        "Abstract": "Artificial intelligence (AI) has emerged as a powerful tool that harnesses anthropomorphic knowledge and provides expedited solutions to complex challenges. Remarkable advancements in AI technology and machine learning present a transformative opportunity in the drug discovery, formulation, and testing of pharmaceutical dosage forms. By utilizing AI algorithms that analyze extensive biological data, including genomics and proteomics, researchers can identify disease-associated targets and predict their interactions with potential drug candidates. This enables a more efficient and targeted approach to drug discovery, thereby increasing the likelihood of successful drug approvals. Furthermore, AI can contribute to reducing development costs by optimizing research and development processes. Machine learning algorithms assist in experimental design and can predict the pharmacokinetics and toxicity of drug candidates. This capability enables the prioritization and optimization of lead compounds, reducing the need for extensive and costly animal testing. Personalized medicine approaches can be facilitated through AI algorithms that analyze real-world patient data, leading to more effective treatment outcomes and improved patient adherence. This comprehensive review explores the wide-ranging applications of AI in drug discovery, drug delivery dosage form designs, process optimization, testing, and pharmacokinetics/pharmacodynamics (PK/PD) studies. This review provides an overview of various AI-based approaches utilized in pharmaceutical technology, highlighting their benefits and drawbacks. Nevertheless, the continued investment in and exploration of AI in the pharmaceutical industry offer exciting prospects for enhancing drug development processes and patient care.",
        "DOI": "10.3390/pharmaceutics15071916",
        "paper_author": "Vora L.K.",
        "affiliation_name": "Queen's University Belfast",
        "affiliation_city": "Belfast",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60029738",
        "affiliation_state": "Northern Ireland"
    },
    {
        "paper_title": "The next generation of evidence-based medicine",
        "publication": "Nature Medicine",
        "citied_by": "261",
        "cover_date": "2023-01-01",
        "Abstract": "Recently, advances in wearable technologies, data science and machine learning have begun to transform evidence-based medicine, offering a tantalizing glimpse into a future of next-generation ‘deep’ medicine. Despite stunning advances in basic science and technology, clinical translations in major areas of medicine are lagging. While the COVID-19 pandemic exposed inherent systemic limitations of the clinical trial landscape, it also spurred some positive changes, including new trial designs and a shift toward a more patient-centric and intuitive evidence-generation system. In this Perspective, I share my heuristic vision of the future of clinical trials and evidence-based medicine.",
        "DOI": "10.1038/s41591-022-02160-z",
        "paper_author": "Subbiah V.",
        "affiliation_name": "The University of Texas MD Anderson Cancer Center",
        "affiliation_city": "Houston",
        "affiliation_country": "United States",
        "affiliation_id": "60015023",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Origin of Antibiotics and Antibiotic Resistance, and Their Impacts on Drug Development: A Narrative Review",
        "publication": "Pharmaceuticals",
        "citied_by": "239",
        "cover_date": "2023-11-01",
        "Abstract": "Antibiotics have revolutionized medicine, saving countless lives since their discovery in the early 20th century. However, the origin of antibiotics is now overshadowed by the alarming rise in antibiotic resistance. This global crisis stems from the relentless adaptability of microorganisms, driven by misuse and overuse of antibiotics. This article explores the origin of antibiotics and the subsequent emergence of antibiotic resistance. It delves into the mechanisms employed by bacteria to develop resistance, highlighting the dire consequences of drug resistance, including compromised patient care, increased mortality rates, and escalating healthcare costs. The article elucidates the latest strategies against drug-resistant microorganisms, encompassing innovative approaches such as phage therapy, CRISPR-Cas9 technology, and the exploration of natural compounds. Moreover, it examines the profound impact of antibiotic resistance on drug development, rendering the pursuit of new antibiotics economically challenging. The limitations and challenges in developing novel antibiotics are discussed, along with hurdles in the regulatory process that hinder progress in this critical field. Proposals for modifying the regulatory process to facilitate antibiotic development are presented. The withdrawal of major pharmaceutical firms from antibiotic research is examined, along with potential strategies to re-engage their interest. The article also outlines initiatives to overcome economic challenges and incentivize antibiotic development, emphasizing international collaborations and partnerships. Finally, the article sheds light on government-led initiatives against antibiotic resistance, with a specific focus on the Middle East. It discusses the proactive measures taken by governments in the region, such as Saudi Arabia and the United Arab Emirates, to combat this global threat. In the face of antibiotic resistance, a multifaceted approach is imperative. This article provides valuable insights into the complex landscape of antibiotic development, regulatory challenges, and collaborative efforts required to ensure a future where antibiotics remain effective tools in safeguarding public health.",
        "DOI": "10.3390/ph16111615",
        "paper_author": "Muteeb G.",
        "affiliation_name": "King Faisal University",
        "affiliation_city": "Al-Ahsa",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60030736",
        "affiliation_state": "Ash Sharqiyah"
    },
    {
        "paper_title": "Nonhuman \"authors\" and Implications for the Integrity of Scientific Publication and Medical Knowledge",
        "publication": "JAMA",
        "citied_by": "231",
        "cover_date": "2023-02-28",
        "Abstract": "NA",
        "DOI": "10.1001/jama.2023.1344",
        "paper_author": "Flanagin A.",
        "affiliation_name": "Journal of American Medical Association",
        "affiliation_city": "Chicago",
        "affiliation_country": "United States",
        "affiliation_id": "60000200",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "Redefining Radiology: A Review of Artificial Intelligence Integration in Medical Imaging",
        "publication": "Diagnostics",
        "citied_by": "169",
        "cover_date": "2023-09-01",
        "Abstract": "This comprehensive review unfolds a detailed narrative of Artificial Intelligence (AI) making its foray into radiology, a move that is catalysing transformational shifts in the healthcare landscape. It traces the evolution of radiology, from the initial discovery of X-rays to the application of machine learning and deep learning in modern medical image analysis. The primary focus of this review is to shed light on AI applications in radiology, elucidating their seminal roles in image segmentation, computer-aided diagnosis, predictive analytics, and workflow optimisation. A spotlight is cast on the profound impact of AI on diagnostic processes, personalised medicine, and clinical workflows, with empirical evidence derived from a series of case studies across multiple medical disciplines. However, the integration of AI in radiology is not devoid of challenges. The review ventures into the labyrinth of obstacles that are inherent to AI-driven radiology—data quality, the ’black box’ enigma, infrastructural and technical complexities, as well as ethical implications. Peering into the future, the review contends that the road ahead for AI in radiology is paved with promising opportunities. It advocates for continuous research, embracing avant-garde imaging technologies, and fostering robust collaborations between radiologists and AI developers. The conclusion underlines the role of AI as a catalyst for change in radiology, a stance that is firmly rooted in sustained innovation, dynamic partnerships, and a steadfast commitment to ethical responsibility.",
        "DOI": "10.3390/diagnostics13172760",
        "paper_author": "Najjar R.",
        "affiliation_name": "Canberra Health Services",
        "affiliation_city": "Canberra",
        "affiliation_country": "Australia",
        "affiliation_id": "129611811",
        "affiliation_state": "ACT"
    },
    {
        "paper_title": "A Review of the Role of Artificial Intelligence in Healthcare",
        "publication": "Journal of Personalized Medicine",
        "citied_by": "167",
        "cover_date": "2023-06-01",
        "Abstract": "Artificial intelligence (AI) applications have transformed healthcare. This study is based on a general literature review uncovering the role of AI in healthcare and focuses on the following key aspects: (i) medical imaging and diagnostics, (ii) virtual patient care, (iii) medical research and drug discovery, (iv) patient engagement and compliance, (v) rehabilitation, and (vi) other administrative applications. The impact of AI is observed in detecting clinical conditions in medical imaging and diagnostic services, controlling the outbreak of coronavirus disease 2019 (COVID-19) with early diagnosis, providing virtual patient care using AI-powered tools, managing electronic health records, augmenting patient engagement and compliance with the treatment plan, reducing the administrative workload of healthcare professionals (HCPs), discovering new drugs and vaccines, spotting medical prescription errors, extensive data storage and analysis, and technology-assisted rehabilitation. Nevertheless, this science pitch meets several technical, ethical, and social challenges, including privacy, safety, the right to decide and try, costs, information and consent, access, and efficacy, while integrating AI into healthcare. The governance of AI applications is crucial for patient safety and accountability and for raising HCPs’ belief in enhancing acceptance and boosting significant health consequences. Effective governance is a prerequisite to precisely address regulatory, ethical, and trust issues while advancing the acceptance and implementation of AI. Since COVID-19 hit the global health system, the concept of AI has created a revolution in healthcare, and such an uprising could be another step forward to meet future healthcare needs.",
        "DOI": "10.3390/jpm13060951",
        "paper_author": "Al Kuwaiti A.",
        "affiliation_name": "Imam Abdulrahman Bin Faisal University",
        "affiliation_city": "Dammam",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60104334",
        "affiliation_state": "Ash Sharqiyah"
    },
    {
        "paper_title": "The Future of AI in Medicine: A Perspective from a Chatbot",
        "publication": "Annals of Biomedical Engineering",
        "citied_by": "156",
        "cover_date": "2023-02-01",
        "Abstract": "NA",
        "DOI": "10.1007/s10439-022-03121-w",
        "paper_author": "King M.R.",
        "affiliation_name": "Vanderbilt University School of Engineering",
        "affiliation_city": "Nashville",
        "affiliation_country": "United States",
        "affiliation_id": "60010060",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Algorithmic fairness in artificial intelligence for medicine and healthcare",
        "publication": "Nature Biomedical Engineering",
        "citied_by": "138",
        "cover_date": "2023-06-01",
        "Abstract": "In healthcare, the development and deployment of insufficiently fair systems of artificial intelligence (AI) can undermine the delivery of equitable care. Assessments of AI models stratified across subpopulations have revealed inequalities in how patients are diagnosed, treated and billed. In this Perspective, we outline fairness in machine learning through the lens of healthcare, and discuss how algorithmic biases (in data acquisition, genetic variation and intra-observer labelling variability, in particular) arise in clinical workflows and the resulting healthcare disparities. We also review emerging technology for mitigating biases via disentanglement, federated learning and model explainability, and their role in the development of AI-based software as a medical device.",
        "DOI": "10.1038/s41551-023-01056-8",
        "paper_author": "Chen R.J.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Artificial Intelligence in Medicine",
        "publication": "New England Journal of Medicine",
        "citied_by": "132",
        "cover_date": "2023-01-01",
        "Abstract": "Artificial Intelligence in Medicine The editors announce both a series of articles focusing on AI and machine learning in health care and the 2024 launch of a new journal, NEJM AI, a forum for evidence, resource sharing, and discussion of the possibilities and limitations of medical AI.",
        "DOI": "10.1056/NEJMe2206291",
        "paper_author": "Beam A.L.",
        "affiliation_name": "Harvard T.H. Chan School of Public Health",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60032499",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Medical Image Segmentation via Cascaded Attention Decoding",
        "publication": "Proceedings - 2023 IEEE Winter Conference on Applications of Computer Vision, WACV 2023",
        "citied_by": "126",
        "cover_date": "2023-01-01",
        "Abstract": "Transformers have shown great promise in medical image segmentation due to their ability to capture long-range dependencies through self-attention. However, they lack the ability to learn the local (contextual) relations among pixels. Previous works try to overcome this problem by embedding convolutional layers either in the encoder or decoder modules of transformers thus ending up sometimes with inconsistent features. To address this issue, we propose a novel attention-based decoder, namely CASCaded Attention DEcoder (CASCADE), which leverages the multi-scale features of hierarchical vision transformers. CASCADE consists of i) an attention gate which fuses features with skip connections and ii) a convolutional attention module that enhances the long-range and local context by suppressing background information. We use a multi-stage feature and loss aggregation framework due to their faster convergence and better performance. Our experiments demonstrate that transformers with CASCADE significantly outperform state-of-the-art CNN- and transformer-based approaches, obtaining up to 5.07% and 6.16% improvements in DICE and mIoU scores, respectively. CASCADE opens new ways of designing better attention-based decoders.",
        "DOI": "10.1109/WACV56688.2023.00616",
        "paper_author": "Rahman M.M.",
        "affiliation_name": "The University of Texas at Austin",
        "affiliation_city": "Austin",
        "affiliation_country": "United States",
        "affiliation_id": "60013372",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Histopathological image classification using dilated residual grooming kernel model",
        "publication": "International Journal of Biomedical Engineering and Technology",
        "citied_by": "119",
        "cover_date": "2023-01-01",
        "Abstract": "Breast cancer is being diagnosed earlier and more accurately through deep learning and machine learning models. This study contributes to medical science and technology using a novel deep learning-based model for detecting tiny cancer cells and accurately diagnosing cancer cells. The proposed approach uses strain normalisation to resolve colour divergence concerns in the breast cancer histopathological image classification (BreakHis) and breast cancer histopathological annotation and diagnosis (BreCaHAD) image datasets. Followed by 19 various parameters such as scaling, rotation, flip, resize, and gamma value are used to tackle the overfitting problem. The proposed dilated residual grooming kernel (DRGK) model is a 19-layer model and contains a proposed multi-scale dilated convolution (MSDC) unit to extract the features efficiently by detection of tiny objects and thin boundaries without adding complexity. Along with MSDC unit and convolution, pooling, down sampling, the proposed DRGK model accurately detects the cancer cells with accuracy of 98.5%.",
        "DOI": "10.1504/IJBET.2023.129819",
        "paper_author": "Kashyap R.",
        "affiliation_name": "Amity University Chhattisgarh",
        "affiliation_city": "Raipur",
        "affiliation_country": "India",
        "affiliation_id": "60109376",
        "affiliation_state": "CG"
    },
    {
        "paper_title": "Natural Language Processing in Electronic Health Records in relation to healthcare decision-making: A systematic review",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "119",
        "cover_date": "2023-03-01",
        "Abstract": "Background: Natural Language Processing (NLP) is widely used to extract clinical insights from Electronic Health Records (EHRs). However, the lack of annotated data, automated tools, and other challenges hinder the full utilisation of NLP for EHRs. Various Machine Learning (ML), Deep Learning (DL) and NLP techniques are studied and compared to understand the limitations and opportunities in this space comprehensively. Methodology: After screening 261 articles from 11 databases, we included 127 papers for full-text review covering seven categories of articles: (1) medical note classification, (2) clinical entity recognition, (3) text summarisation, (4) deep learning (DL) and transfer learning architecture, (5) information extraction, (6) Medical language translation and (7) other NLP applications. This study follows the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. Result and Discussion: EHR was the most commonly used data type among the selected articles, and the datasets were primarily unstructured. Various ML and DL methods were used, with prediction or classification being the most common application of ML or DL. The most common use cases were: the International Classification of Diseases, Ninth Revision (ICD-9) classification, clinical note analysis, and named entity recognition (NER) for clinical descriptions and research on psychiatric disorders. Conclusion: We find that the adopted ML models were not adequately assessed. In addition, the data imbalance problem is quite important, yet we must find techniques to address this underlining problem. Future studies should address key limitations in studies, primarily identifying Lupus Nephritis, Suicide Attempts, perinatal self-harmed and ICD-9 classification.",
        "DOI": "10.1016/j.compbiomed.2023.106649",
        "paper_author": "Hossain E.",
        "affiliation_name": "North South University",
        "affiliation_city": "Dhaka",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60028220",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Implications of large language models such as ChatGPT for dental medicine",
        "publication": "Journal of Esthetic and Restorative Dentistry",
        "citied_by": "117",
        "cover_date": "2023-10-01",
        "Abstract": "Objective: This article provides an overview of the implications of ChatGPT and other large language models (LLMs) for dental medicine. Overview: ChatGPT, a LLM trained on massive amounts of textual data, is adept at fulfilling various language-related tasks. Despite its impressive capabilities, ChatGPT has serious limitations, such as occasionally giving incorrect answers, producing nonsensical content, and presenting misinformation as fact. Dental practitioners, assistants, and hygienists are not likely to be significantly impacted by LLMs. However, LLMs could affect the work of administrative personnel and the provision of dental telemedicine. LLMs offer potential for clinical decision support, text summarization, efficient writing, and multilingual communication. As more people seek health information from LLMs, it is crucial to safeguard against inaccurate, outdated, and biased responses to health-related queries. LLMs pose challenges for patient data confidentiality and cybersecurity that must be tackled. In dental education, LLMs present fewer challenges than in other academic fields. LLMs can enhance academic writing fluency, but acceptable usage boundaries in science need to be established. Conclusions: While LLMs such as ChatGPT may have various useful applications in dental medicine, they come with risks of malicious use and serious limitations, including the potential for misinformation. Clinical Significance: Along with the potential benefits of using LLMs as an additional tool in dental medicine, it is crucial to carefully consider the limitations and potential risks inherent in such artificial intelligence technologies.",
        "DOI": "10.1111/jerd.13046",
        "paper_author": "Eggmann F.",
        "affiliation_name": "University of Pennsylvania School of Dental Medicine",
        "affiliation_city": "Philadelphia",
        "affiliation_country": "United States",
        "affiliation_id": "60096942",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Opportunities and risks of ChatGPT in medicine, science, and academic publishing: a modern Promethean dilemma",
        "publication": "Croatian Medical Journal",
        "citied_by": "117",
        "cover_date": "2023-02-01",
        "Abstract": "NA",
        "DOI": "10.3325/cmj.2023.64.1",
        "paper_author": "Homolak J.",
        "affiliation_name": "University of Zagreb School of Medicine",
        "affiliation_city": "Zagreb",
        "affiliation_country": "Croatia",
        "affiliation_id": "60006461",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Recent advances in targeting the “undruggable” proteins: from drug discovery to clinical trials",
        "publication": "Signal Transduction and Targeted Therapy",
        "citied_by": "116",
        "cover_date": "2023-12-01",
        "Abstract": "Undruggable proteins are a class of proteins that are often characterized by large, complex structures or functions that are difficult to interfere with using conventional drug design strategies. Targeting such undruggable targets has been considered also a great opportunity for treatment of human diseases and has attracted substantial efforts in the field of medicine. Therefore, in this review, we focus on the recent development of drug discovery targeting “undruggable” proteins and their application in clinic. To make this review well organized, we discuss the design strategies targeting the undruggable proteins, including covalent regulation, allosteric inhibition, protein–protein/DNA interaction inhibition, targeted proteins regulation, nucleic acid-based approach, immunotherapy and others.",
        "DOI": "10.1038/s41392-023-01589-z",
        "paper_author": "Xie X.",
        "affiliation_name": "Chengdu University of Traditional Chinese Medicine",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60000196",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Artificial Intelligence and Machine Learning Technology Driven Modern Drug Discovery and Development",
        "publication": "International Journal of Molecular Sciences",
        "citied_by": "111",
        "cover_date": "2023-02-01",
        "Abstract": "The discovery and advances of medicines may be considered as the ultimate relevant translational science effort that adds to human invulnerability and happiness. But advancing a fresh medication is a quite convoluted, costly, and protracted operation, normally costing USD ~2.6 billion and consuming a mean time span of 12 years. Methods to cut back expenditure and hasten new drug discovery have prompted an arduous and compelling brainstorming exercise in the pharmaceutical industry. The engagement of Artificial Intelligence (AI), including the deep-learning (DL) component in particular, has been facilitated by the employment of classified big data, in concert with strikingly reinforced computing prowess and cloud storage, across all fields. AI has energized computer-facilitated drug discovery. An unrestricted espousing of machine learning (ML), especially DL, in many scientific specialties, and the technological refinements in computing hardware and software, in concert with various aspects of the problem, sustain this progress. ML algorithms have been extensively engaged for computer-facilitated drug discovery. DL methods, such as artificial neural networks (ANNs) comprising multiple buried processing layers, have of late seen a resurgence due to their capability to power automatic attribute elicitations from the input data, coupled with their ability to obtain nonlinear input-output pertinencies. Such features of DL methods augment classical ML techniques which bank on human-contrived molecular descriptors. A major part of the early reluctance concerning utility of AI in pharmaceutical discovery has begun to melt, thereby advancing medicinal chemistry. AI, along with modern experimental technical knowledge, is anticipated to invigorate the quest for new and improved pharmaceuticals in an expeditious, economical, and increasingly compelling manner. DL-facilitated methods have just initiated kickstarting for some integral issues in drug discovery. Many technological advances, such as “message-passing paradigms”, “spatial-symmetry-preserving networks”, “hybrid de novo design”, and other ingenious ML exemplars, will definitely come to be pervasively widespread and help dissect many of the biggest, and most intriguing inquiries. Open data allocation and model augmentation will exert a decisive hold during the progress of drug discovery employing AI. This review will address the impending utilizations of AI to refine and bolster the drug discovery operation.",
        "DOI": "10.3390/ijms24032026",
        "paper_author": "Sarkar C.",
        "affiliation_name": "North Eastern Indira Gandhi Regional Institute of Health and Medical Sciences",
        "affiliation_city": "Shillong",
        "affiliation_country": "India",
        "affiliation_id": "60018291",
        "affiliation_state": "ML"
    },
    {
        "paper_title": "Applications of multi-omics analysis in human diseases",
        "publication": "MedComm",
        "citied_by": "103",
        "cover_date": "2023-08-01",
        "Abstract": "Multi-omics usually refers to the crossover application of multiple high-throughput screening technologies represented by genomics, transcriptomics, single-cell transcriptomics, proteomics and metabolomics, spatial transcriptomics, and so on, which play a great role in promoting the study of human diseases. Most of the current reviews focus on describing the development of multi-omics technologies, data integration, and application to a particular disease; however, few of them provide a comprehensive and systematic introduction of multi-omics. This review outlines the existing technical categories of multi-omics, cautions for experimental design, focuses on the integrated analysis methods of multi-omics, especially the approach of machine learning and deep learning in multi-omics data integration and the corresponding tools, and the application of multi-omics in medical researches (e.g., cancer, neurodegenerative diseases, aging, and drug target discovery) as well as the corresponding open-source analysis tools and databases, and finally, discusses the challenges and future directions of multi-omics integration and application in precision medicine. With the development of high-throughput technologies and data integration algorithms, as important directions of multi-omics for future disease research, single-cell multi-omics and spatial multi-omics also provided a detailed introduction. This review will provide important guidance for researchers, especially who are just entering into multi-omics medical research.",
        "DOI": "10.1002/mco2.315",
        "paper_author": "Chen C.",
        "affiliation_name": "Ministry of Health of People's Republic of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60073471",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Machine learning and artificial intelligence in disease prediction: Applications, challenges, limitations, case studies, and future directions",
        "publication": "Contemporary Applications of Data Fusion for Advanced Healthcare Informatics",
        "citied_by": "102",
        "cover_date": "2023-08-01",
        "Abstract": "Artificial intelligence (AI) based disease identification has thepotential to transform medicine by utilizing machine learning algorithms and techniques to analyze large volumes of medical data and identify patterns and features that may be difficult for human experts to detect. However, there are still challenges and limitations to overcome, such as the need for high-quality medical data and concerns around privacy and bias. This chapter explores the growing intersection of machine learning (ML) and AI techniques with disease prediction. The chapter begins by providing an overview of ML and AI methodologies commonly employed in disease prediction, including supervised and unsupervised learning algorithms, deep learning techniques, and ensemble methods. Lastly, the chapter outlines future directions and research opportunities in the field.",
        "DOI": "10.4018/978-1-6684-8913-0.ch013",
        "paper_author": "Ramudu K.",
        "affiliation_name": "Kakatiya Institute of Technology &amp; Science",
        "affiliation_city": "Hanamkonda",
        "affiliation_country": "India",
        "affiliation_id": "60114435",
        "affiliation_state": "TS"
    },
    {
        "paper_title": "Artificial Intelligence in Healthcare: Review, Ethics, Trust Challenges &amp; Future Research Directions",
        "publication": "Engineering Applications of Artificial Intelligence",
        "citied_by": "101",
        "cover_date": "2023-04-01",
        "Abstract": "The use of artificial intelligence (AI) in medicine is beginning to alter current procedures in prevention, diagnosis, treatment, amelioration, cure of disease and other physical and mental impairments. In addition to raising concerns about public trust and ethics, advancements in this new emerging technology have also led to a lot of debate around its integration into healthcare. The objective of this work is to introduce researchers to AI and its medical applications, along with their potential pitfalls, in a comprehensive manner. This paper provides a review of current studies that have investigated how to apply AI methodologies to create a smart predictive maintenance model for the industries of the future. We begin with a brief introduction to AI and a decade's worth of its advancements across a variety of industries, including smart grids, train transportation, etc., and most recently, healthcare. In this paper, we explore the various applications of AI across various medical specialties, including radiology, dermatology, haematology, ophthalmology, etc. along with the comparative study by employing several key criteria. Finally, it highlights the challenges for large-scale integration of AI in medical systems along with a summary of the ethical, legal, trust, and future implications of AI in healthcare.",
        "DOI": "10.1016/j.engappai.2023.105894",
        "paper_author": "Kumar P.",
        "affiliation_name": "National Institute of Technology Hamirpur",
        "affiliation_city": "Hamirpur",
        "affiliation_country": "India",
        "affiliation_id": "60016077",
        "affiliation_state": "HP"
    },
    {
        "paper_title": "A classification and regression tree algorithm for heart disease modeling and prediction",
        "publication": "Healthcare Analytics",
        "citied_by": "98",
        "cover_date": "2023-11-01",
        "Abstract": "Heart disease remains the leading cause of death, such that nearly one-third of all deaths worldwide are estimated to be caused by heart-related conditions. Advancing applications of classification-based machine learning to medicine facilitates earlier detection. In this study, the Classification and Regression Tree (CART) algorithm, a supervised machine learning method, has been employed to predict heart disease and extract decision rules in clarifying relationships between input and output variables. In addition, the study's findings rank the features influencing heart disease based on importance. When considering all performance parameters, the 87% accuracy of the prediction validates the model's reliability. On the other hand, extracted decision rules reported in the study can simplify the use of clinical purposes without needing additional knowledge. Overall, the proposed algorithm can support not only healthcare professionals but patients who are subjected to cost and time constraints in the diagnosis and treatment processes of heart disease.",
        "DOI": "10.1016/j.health.2022.100130",
        "paper_author": "Ozcan M.",
        "affiliation_name": "Izmir Bakircay University",
        "affiliation_city": "Izmir",
        "affiliation_country": "Turkey",
        "affiliation_id": "60198721",
        "affiliation_state": "Izmir"
    },
    {
        "paper_title": "What Is Machine Learning, Artificial Neural Networks and Deep Learning?—Examples of Practical Applications in Medicine",
        "publication": "Diagnostics",
        "citied_by": "97",
        "cover_date": "2023-08-01",
        "Abstract": "Machine learning (ML), artificial neural networks (ANNs), and deep learning (DL) are all topics that fall under the heading of artificial intelligence (AI) and have gained popularity in recent years. ML involves the application of algorithms to automate decision-making processes using models that have not been manually programmed but have been trained on data. ANNs that are a part of ML aim to simulate the structure and function of the human brain. DL, on the other hand, uses multiple layers of interconnected neurons. This enables the processing and analysis of large and complex databases. In medicine, these techniques are being introduced to improve the speed and efficiency of disease diagnosis and treatment. Each of the AI techniques presented in the paper is supported with an example of a possible medical application. Given the rapid development of technology, the use of AI in medicine shows promising results in the context of patient care. It is particularly important to keep a close eye on this issue and conduct further research in order to fully explore the potential of ML, ANNs, and DL, and bring further applications into clinical use in the future.",
        "DOI": "10.3390/diagnostics13152582",
        "paper_author": "Kufel J.",
        "affiliation_name": "Slaski Uniwersytet Medyczny w Katowicach",
        "affiliation_city": "Katowice",
        "affiliation_country": "Poland",
        "affiliation_id": "60027573",
        "affiliation_state": "SL"
    },
    {
        "paper_title": "Wearable artificial intelligence biosensor networks",
        "publication": "Biosensors and Bioelectronics",
        "citied_by": "94",
        "cover_date": "2023-01-01",
        "Abstract": "The demand for high-quality healthcare and well-being services is remarkably increasing due to the ageing global population and modern lifestyles. Recently, the integration of wearables and artificial intelligence (AI) has attracted extensive academic and technological attention for its powerful high-dimensional data processing of wearable biosensing networks. This work reviews the recent developments in AI-assisted wearable biosensing devices in disease diagnostics and fatigue monitoring demonstrating the trend towards personalised medicine with highly efficient, cost-effective, and accurate point-of-care diagnosis by finding hidden patterns in biosensing data and detecting abnormalities. The reliability of adaptive learning and synthetic data and data privacy still need further investigation to realise personalised medicine in the next decade. Due to the worldwide popularity of smartphones, they have been utilised for sensor readout, wireless data transfer, data processing and storage, result display, and cloud server communication leading to the development of smartphone-based biosensing systems. The recent advances have demonstrated a promising future for the healthcare system because of the increasing data processing power, transfer efficiency and storage capacity and diversifying functionalities.",
        "DOI": "10.1016/j.bios.2022.114825",
        "paper_author": "Zhang Y.",
        "affiliation_name": "Imperial College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60015150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "ChatGPT and large language model (LLM) chatbots: The current state of acceptability and a proposal for guidelines on utilization in academic medicine",
        "publication": "Journal of Pediatric Urology",
        "citied_by": "92",
        "cover_date": "2023-10-01",
        "Abstract": "Introduction: There is currently no clear consensus on the standards for using large language models such as ChatGPT in academic medicine. Hence, we performed a scoping review of available literature to understand the current state of LLM use in medicine and to provide a guideline for future utilization in academia. Materials and methods: A scoping review of the literature was performed through a Medline search on February 16, 2023 using a combination of keywords including artificial intelligence, machine learning, natural language processing, generative pre-trained transformer, ChatGPT, and large language model. There were no restrictions to language or date of publication. Records not pertaining to LLMs were excluded. Records pertaining to LLM ChatBots and ChatGPT were identified and evaluated separately. Among the records pertaining to LLM ChatBots and ChatGPT, those that suggest recommendations for ChatGPT use in academia were utilized to create guideline statements for ChatGPT and LLM use in academic medicine. Results: A total of 87 records were identified. 30 records were not pertaining to large language models and were excluded. 54 records underwent a full-text review for evaluation. There were 33 records related to LLM ChatBots or ChatGPT. Discussion: From assessing these texts, five guideline statements for LLM use was developed: (1) ChatGPT/LLM cannot be cited as an author in scientific manuscripts; (2) If use of ChatGPT/LLM are considered for use in academic work, author(s) should have at least a basic understanding of what ChatGPT/LLM is; (3) Do not use ChatGPT/LLM to produce entirety of text in manuscripts; humans must be held accountable for use of ChatGPT/LLM and contents created by ChatGPT/LLM should be meticulously verified by humans; (4) ChatGPT/LLMs may be used for editing and refining of text; (5) Any use of ChatGPT/LLM should be transparent and should be clearly outlined in scientific manuscripts and acknowledged. Conclusion: Future authors should remain mindful of the potential impact their academic work may have on healthcare and continue to uphold the highest ethical standards and integrity when utilizing ChatGPT/LLM.",
        "DOI": "10.1016/j.jpurol.2023.05.018",
        "paper_author": "Kim J.K.",
        "affiliation_name": "The Hospital for Sick Children",
        "affiliation_city": "Toronto",
        "affiliation_country": "Canada",
        "affiliation_id": "60030319",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Colonic drug delivery: Formulating the next generation of colon-targeted therapeutics",
        "publication": "Journal of Controlled Release",
        "citied_by": "89",
        "cover_date": "2023-01-01",
        "Abstract": "Colonic drug delivery can facilitate access to unique therapeutic targets and has the potential to enhance drug bioavailability whilst reducing off-target effects. Delivering drugs to the colon requires considered formulation development, as both oral and rectal dosage forms can encounter challenges if the colon's distinct physiological environment is not appreciated. As the therapeutic opportunities surrounding colonic drug delivery multiply, the success of novel pharmaceuticals lies in their design. This review provides a modern insight into the key parameters determining the effective design and development of colon-targeted medicines. Influential physiological features governing the release, dissolution, stability, and absorption of drugs in the colon are first discussed, followed by an overview of the most reliable colon-targeted formulation strategies. Finally, the most appropriate in vitro, in vivo, and in silico preclinical investigations are presented, with the goal of inspiring strategic development of new colon-targeted therapeutics.",
        "DOI": "10.1016/j.jconrel.2022.12.029",
        "paper_author": "McCoubrey L.E.",
        "affiliation_name": "UCL School of Pharmacy",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60016379",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "AI and IoT-based technologies for precision medicine",
        "publication": "AI and IoT-Based Technologies for Precision Medicine",
        "citied_by": "88",
        "cover_date": "2023-10-18",
        "Abstract": "In the dynamic landscape of post covid-19 healthcare, the demand for smart healthcare solutions and precision medicine systems has become paramount. Addressing these pressing challenges, AI and IoT-Based Technologies for Precision Medicine emerges as a comprehensive book, equipping doctors, scholars, researchers, engineers, and students with the knowledge and tools to leverage AI solutions and IoT-based technologies in healthcare services. From predictive disease analysis to informed decision-making, the book presents advanced methodologies and models that elevate the precision medicine ecosystem. Within the pages of this book, readers will be given the opportunity to gain a profound understanding of the prospects and challenges arising from AI-powered applications and IoT-equipped techniques in smart healthcare. Bridging the gap between theory and practice, the book explores fundamental concepts, real-time supporting systems, and human-like robotics, propelling the high-tech medical industry toward transformative advancements. By addressing machine learning, deep learning, computer vision in medicine, AI-integrated applications, IoT-based technologies, healthcare data analytics, and biotechnology application, the book empowers healthcare professionals to pioneer innovative solutions and drive efficiency, accuracy, and security in medical practices. AI and IoT-Based Technologies for Precision Medicine serve as an authoritative guide, fostering collaboration and knowledge sharing among healthcare scholars and professionals. Embrace this indispensable resource to harness the full potential of AI and IoT, revolutionizing medical practices, bolstering healthcare services, and propelling the smart healthcare revolution forward. With this book in hand, readers can navigate the ever-changing landscape of high-tech medicine, making informed strides toward a cutting-edge and precise medical ecosystem.",
        "DOI": "10.4018/979-8-3693-0876-9",
        "paper_author": "Khang A.",
        "affiliation_name": "Global Research Institute of Technology and Engineering",
        "affiliation_city": "Raleigh",
        "affiliation_country": "United States",
        "affiliation_id": "60281158",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Artificial intelligence in clinical medicine: catalyzing a sustainable global healthcare paradigm",
        "publication": "Frontiers in Artificial Intelligence",
        "citied_by": "86",
        "cover_date": "2023-01-01",
        "Abstract": "As the demand for quality healthcare increases, healthcare systems worldwide are grappling with time constraints and excessive workloads, which can compromise the quality of patient care. Artificial intelligence (AI) has emerged as a powerful tool in clinical medicine, revolutionizing various aspects of patient care and medical research. The integration of AI in clinical medicine has not only improved diagnostic accuracy and treatment outcomes, but also contributed to more efficient healthcare delivery, reduced costs, and facilitated better patient experiences. This review article provides an extensive overview of AI applications in history taking, clinical examination, imaging, therapeutics, prognosis and research. Furthermore, it highlights the critical role AI has played in transforming healthcare in developing nations.",
        "DOI": "10.3389/frai.2023.1227091",
        "paper_author": "Krishnan G.",
        "affiliation_name": "Kasturba Medical College, Manipal",
        "affiliation_city": "Manipal",
        "affiliation_country": "India",
        "affiliation_id": "60015855",
        "affiliation_state": "KA"
    },
    {
        "paper_title": "To metabolomics and beyond: a technological portfolio to investigate cancer metabolism",
        "publication": "Signal Transduction and Targeted Therapy",
        "citied_by": "86",
        "cover_date": "2023-12-01",
        "Abstract": "Tumour cells have exquisite flexibility in reprogramming their metabolism in order to support tumour initiation, progression, metastasis and resistance to therapies. These reprogrammed activities include a complete rewiring of the bioenergetic, biosynthetic and redox status to sustain the increased energetic demand of the cells. Over the last decades, the cancer metabolism field has seen an explosion of new biochemical technologies giving more tools than ever before to navigate this complexity. Within a cell or a tissue, the metabolites constitute the direct signature of the molecular phenotype and thus their profiling has concrete clinical applications in oncology. Metabolomics and fluxomics, are key technological approaches that mainly revolutionized the field enabling researchers to have both a qualitative and mechanistic model of the biochemical activities in cancer. Furthermore, the upgrade from bulk to single-cell analysis technologies provided unprecedented opportunity to investigate cancer biology at cellular resolution allowing an in depth quantitative analysis of complex and heterogenous diseases. More recently, the advent of functional genomic screening allowed the identification of molecular pathways, cellular processes, biomarkers and novel therapeutic targets that in concert with other technologies allow patient stratification and identification of new treatment regimens. This review is intended to be a guide for researchers to cancer metabolism, highlighting current and emerging technologies, emphasizing advantages, disadvantages and applications with the potential of leading the development of innovative anti-cancer therapies.",
        "DOI": "10.1038/s41392-023-01380-0",
        "paper_author": "Danzi F.",
        "affiliation_name": "Università degli Studi di Verona",
        "affiliation_city": "Verona",
        "affiliation_country": "Italy",
        "affiliation_id": "60032256",
        "affiliation_state": "VR"
    },
    {
        "paper_title": "Artificial Intelligence Applied to clinical trials: opportunities and challenges",
        "publication": "Health and Technology",
        "citied_by": "86",
        "cover_date": "2023-03-01",
        "Abstract": "Background: Clinical Trials (CTs) remain the foundation of safe and effective drug development. Given the evolving data-driven and personalized medicine approach in healthcare, it is imperative for companies and regulators to utilize tailored Artificial Intelligence (AI) solutions that enable expeditious and streamlined clinical research. In this paper, we identified opportunities, challenges, and potential implications of AI in CTs. Methods: Following an extensive search in relevant databases and websites, we gathered publications tackling the use of AI and Machine Learning (ML) in CTs from the past 5 years in the US and Europe, including Regulatory Authorities’ documents. Results: Documented applications of AI commonly concern the oncology field and are mostly being applied in the area of recruitment. Main opportunities discussed aim to create efficiencies across CT activities, including the ability to reduce sample sizes, improve enrollment and conduct faster, more optimized adaptive CTs. While AI is an area of enthusiastic development, the identified challenges are ethical in nature and relate to data availability, standards, and most importantly, lack of regulatory guidance hindering the acceptance of AI tools in drug development. However, future implications are significant and are anticipated to improve the probability of success, reduce trial burden and overall, speed up research and regulatory approval. Conclusion: The use of AI in CTs is in its relative infancy; however, it is a fast-evolving field. As regulators provide more guidance on the acceptability of AI in specific areas, we anticipate the scope of use to broaden and the volume of implementation to increase rapidly.",
        "DOI": "10.1007/s12553-023-00738-2",
        "paper_author": "Askin S.",
        "affiliation_name": "Massachusetts College of Pharmacy and Health Sciences",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60015345",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Advances in PET imaging of cancer",
        "publication": "Nature Reviews Cancer",
        "citied_by": "85",
        "cover_date": "2023-07-01",
        "Abstract": "Molecular imaging has experienced enormous advancements in the areas of imaging technology, imaging probe and contrast development, and data quality, as well as machine learning-based data analysis. Positron emission tomography (PET) and its combination with computed tomography (CT) or magnetic resonance imaging (MRI) as a multimodality PET–CT or PET–MRI system offer a wealth of molecular, functional and morphological data with a single patient scan. Despite the recent technical advances and the availability of dozens of disease-specific contrast and imaging probes, only a few parameters, such as tumour size or the mean tracer uptake, are used for the evaluation of images in clinical practice. Multiparametric in vivo imaging data not only are highly quantitative but also can provide invaluable information about pathophysiology, receptor expression, metabolism, or morphological and functional features of tumours, such as pH, oxygenation or tissue density, as well as pharmacodynamic properties of drugs, to measure drug response with a contrast agent. It can further quantitatively map and spatially resolve the intertumoural and intratumoural heterogeneity, providing insights into tumour vulnerabilities for target-specific therapeutic interventions. Failure to exploit and integrate the full potential of such powerful imaging data may lead to a lost opportunity in which patients do not receive the best possible care. With the desire to implement personalized medicine in the cancer clinic, the full comprehensive diagnostic power of multiplexed imaging should be utilized.",
        "DOI": "10.1038/s41568-023-00576-4",
        "paper_author": "Schwenck J.",
        "affiliation_name": "Eberhard Karls Universität Tübingen",
        "affiliation_city": "Tubingen",
        "affiliation_country": "Germany",
        "affiliation_id": "60017246",
        "affiliation_state": "Baden-Wurttemberg"
    },
    {
        "paper_title": "Generalisable long COVID subtypes: Findings from the NIH N3C and RECOVER programmes",
        "publication": "eBioMedicine",
        "citied_by": "84",
        "cover_date": "2023-01-01",
        "Abstract": "Background: Stratification of patients with post-acute sequelae of SARS-CoV-2 infection (PASC, or long COVID) would allow precision clinical management strategies. However, long COVID is incompletely understood and characterised by a wide range of manifestations that are difficult to analyse computationally. Additionally, the generalisability of machine learning classification of COVID-19 clinical outcomes has rarely been tested. Methods: We present a method for computationally modelling PASC phenotype data based on electronic healthcare records (EHRs) and for assessing pairwise phenotypic similarity between patients using semantic similarity. Our approach defines a nonlinear similarity function that maps from a feature space of phenotypic abnormalities to a matrix of pairwise patient similarity that can be clustered using unsupervised machine learning. Findings: We found six clusters of PASC patients, each with distinct profiles of phenotypic abnormalities, including clusters with distinct pulmonary, neuropsychiatric, and cardiovascular abnormalities, and a cluster associated with broad, severe manifestations and increased mortality. There was significant association of cluster membership with a range of pre-existing conditions and measures of severity during acute COVID-19. We assigned new patients from other healthcare centres to clusters by maximum semantic similarity to the original patients, and showed that the clusters were generalisable across different hospital systems. The increased mortality rate originally identified in one cluster was consistently observed in patients assigned to that cluster in other hospital systems. Interpretation: Semantic phenotypic clustering provides a foundation for assigning patients to stratified subgroups for natural history or therapy studies on PASC. Funding: NIH (TR002306/OT2HL161847-01/OD011883/HG010860), U.S.D.O.E. (DE-AC02-05CH11231), Donald A. Roux Family Fund at Jackson Laboratory, Marsico Family at CU Anschutz.",
        "DOI": "10.1016/j.ebiom.2022.104413",
        "paper_author": "Reese J.T.",
        "affiliation_name": "Lawrence Berkeley National Laboratory",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60007174",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Quantum Computing for Healthcare: A Review",
        "publication": "Future Internet",
        "citied_by": "81",
        "cover_date": "2023-03-01",
        "Abstract": "In recent years, the interdisciplinary field of quantum computing has rapidly developed and garnered substantial interest from both academia and industry due to its ability to process information in fundamentally different ways, leading to hitherto unattainable computational capabilities. However, despite its potential, the full extent of quantum computing’s impact on healthcare remains largely unexplored. This survey paper presents the first systematic analysis of the various capabilities of quantum computing in enhancing healthcare systems, with a focus on its potential to revolutionize compute-intensive healthcare tasks such as drug discovery, personalized medicine, DNA sequencing, medical imaging, and operational optimization. Through a comprehensive analysis of existing literature, we have developed taxonomies across different dimensions, including background and enabling technologies, applications, requirements, architectures, security, open issues, and future research directions, providing a panoramic view of the quantum computing paradigm for healthcare. Our survey aims to aid both new and experienced researchers in quantum computing and healthcare by helping them understand the current research landscape, identifying potential opportunities and challenges, and making informed decisions when designing new architectures and applications for quantum computing in healthcare.",
        "DOI": "10.3390/fi15030094",
        "paper_author": "Ur Rasool R.",
        "affiliation_name": "Victoria University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60006234",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "3D printing: Innovative solutions for patients and pharmaceutical industry",
        "publication": "International Journal of Pharmaceutics",
        "citied_by": "81",
        "cover_date": "2023-01-25",
        "Abstract": "Three-dimensional (3D) printing is an emerging technology with great potential in pharmaceutical applications, providing innovative solutions for both patients and pharmaceutical industry. This technology offers precise construction of the structure of dosage forms and can benefit drug product design by providing versatile release modes to meet clinical needs and facilitating patient-centric treatment, such as personalized dosing, accommodate treatment of specific disease states or patient populations. Utilization of 3D printing also facilitates digital drug product development and manufacturing. Development of 3D printing at early clinical stages and commercial scale pharmaceutical manufacturing has substantially advanced in recent years. In this review, we discuss how 3D printing accelerates early-stage drug development, including pre-clinical research and early phase human studies, and facilitates late-stage product manufacturing as well as how the technology can benefit patients. The advantages, current status, and challenges of employing 3D printing in large scale manufacturing and personalized dosing are introduced respectively. The considerations and efforts of regulatory agencies to address 3D printing technology are also discussed.",
        "DOI": "10.1016/j.ijpharm.2022.122480",
        "paper_author": "Tracy T.",
        "affiliation_name": "LLC",
        "affiliation_city": "Huntsville",
        "affiliation_country": "United States",
        "affiliation_id": "124640970",
        "affiliation_state": "AL"
    },
    {
        "paper_title": "Artificial intelligence-powered electronic skin",
        "publication": "Nature Machine Intelligence",
        "citied_by": "79",
        "cover_date": "2023-12-01",
        "Abstract": "Skin-interfaced electronics is gradually changing medical practices by enabling continuous and non-invasive tracking of physiological and biochemical information. With the rise of big data and digital medicine, next-generation electronic skin (e-skin) will be able to use artificial intelligence (AI) to optimize its design as well as uncover user-personalized health profiles. Recent multimodal e-skin platforms have already used machine learning algorithms for autonomous data analytics. Unfortunately, there is a lack of appropriate AI protocols and guidelines for e-skin devices, resulting in overly complex models and non-reproducible conclusions for simple applications. This Review aims to present AI technologies in e-skin hardware and assess their potential for new inspired integrated platform solutions. We outline recent breakthroughs in AI strategies and their applications in engineering e-skins as well as understanding health information collected by e-skins, highlighting the transformative deployment of AI in robotics, prosthetics, virtual reality and personalized healthcare. We also discuss the challenges and prospects of AI-powered e-skins as well as predictions for the future trajectory of smart e-skins.",
        "DOI": "10.1038/s42256-023-00760-z",
        "paper_author": "Xu C.",
        "affiliation_name": "California Institute of Technology Division of Engineering and Applied Science",
        "affiliation_city": "Pasadena",
        "affiliation_country": "United States",
        "affiliation_id": "60143898",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Liquid biopsy-based protein biomarkers for risk prediction, early diagnosis, and prognostication of cholangiocarcinoma",
        "publication": "Journal of Hepatology",
        "citied_by": "78",
        "cover_date": "2023-07-01",
        "Abstract": "Background & Aims: Cholangiocarcinoma (CCA), heterogeneous biliary tumours with dismal prognosis, lacks accurate early diagnostic methods especially important for individuals at high-risk (i.e. those with primary sclerosing cholangitis [PSC]). Here, we searched for protein biomarkers in serum extracellular vesicles (EVs). Methods: EVs from patients with isolated PSC (n = 45), concomitant PSC-CCA (n = 44), PSC who developed CCA during follow-up (PSC to CCA; n = 25), CCAs from non-PSC aetiology (n = 56), and hepatocellular carcinoma (n = 34) and healthy individuals (n = 56) were characterised by mass spectrometry. Diagnostic biomarkers for PSC-CCA, non-PSC CCA, or CCAs regardless of aetiology (Pan-CCAs) were defined and validated by ELISA. Their expression was evaluated in CCA tumours at a single-cell level. Prognostic EV biomarkers for CCA were investigated. Results: High-throughput proteomics of EVs identified diagnostic biomarkers for PSC-CCA, non-PSC CCA, or Pan-CCA, and for the differential diagnosis of intrahepatic CCA and hepatocellular carcinoma, which were cross-validated by ELISA using total serum. Machine learning-based algorithms disclosed CRP/FIBRINOGEN/FRIL for the diagnosis of PSC-CCA (local disease [LD]) vs. isolated PSC (AUC = 0.947; odds ratio [OR] =36.9) and, combined with carbohydrate antigen 19-9, overpowers carbohydrate antigen 19-9 alone. CRP/PIGR/VWF allowed the diagnosis of LD non-PSC CCAs vs. healthy individuals (AUC = 0.992; OR = 387.5). It is noteworthy that CRP/FRIL accurately diagnosed LD Pan-CCA (AUC = 0.941; OR = 89.4). Levels of CRP/FIBRINOGEN/FRIL/PIGR showed predictive capacity for CCA development in PSC before clinical evidence of malignancy. Multi-organ transcriptomic analysis revealed that serum EV biomarkers were mostly expressed in hepatobiliary tissues, and single-cell RNA sequencing and immunofluorescence analysis of CCA tumours showed their presence mainly in malignant cholangiocytes. Multivariable analysis unveiled EV prognostic biomarkers, with COMP/GNAI2/CFAI and ACTN1/MYCT1/PF4V associated negatively and positively with patients’ survival, respectively. Conclusions: Serum EVs contain protein biomarkers for the prediction, early diagnosis, and prognostication of CCA that are detectable using total serum, representing a tumour cell-derived liquid biopsy tool for personalised medicine. Impact and implications: The accuracy of current imaging tests and circulating tumour biomarkers for cholangiocarcinoma (CCA) diagnosis is far from satisfactory. Most CCAs are considered sporadic, although up to 20% of patients with primary sclerosing cholangitis (PSC) develop CCA during their lifetime, constituting a major cause of PSC-related death. This international study has proposed protein-based and aetiology-related logistic models with predictive, diagnostic, or prognostic capacities by combining two to four circulating protein biomarkers, moving a step forward into personalised medicine. These novel liquid biopsy tools may allow the (i) easy and non-invasive diagnosis of sporadic CCAs, (ii) identification of patients with PSC with higher risk for CCA development, (iii) establishment of cost-effective surveillance programmes for the early detection of CCA in high-risk populations (e.g. PSC), and (iv) prognostic stratification of patients with CCA, which, altogether, may increase the number of cases eligible for potentially curative options or to receive more successful treatments, decreasing CCA-related mortality.",
        "DOI": "10.1016/j.jhep.2023.02.027",
        "paper_author": "Lapitz A.",
        "affiliation_name": "Biodonostia Health Research Institute",
        "affiliation_city": "Donostia-San Sebastian",
        "affiliation_country": "Spain",
        "affiliation_id": "60122497",
        "affiliation_state": "Guipuzcoa"
    },
    {
        "paper_title": "Explainable Artificial Intelligence (XAI): Concepts and Challenges in Healthcare",
        "publication": "AI (Switzerland)",
        "citied_by": "76",
        "cover_date": "2023-09-01",
        "Abstract": "Artificial Intelligence (AI) describes computer systems able to perform tasks that normally require human intelligence, such as visual perception, speech recognition, decision-making, and language translation. Examples of AI techniques are machine learning, neural networks, and deep learning. AI can be applied in many different areas, such as econometrics, biometry, e-commerce, and the automotive industry. In recent years, AI has found its way into healthcare as well, helping doctors make better decisions (“clinical decision support”), localizing tumors in magnetic resonance images, reading and analyzing reports written by radiologists and pathologists, and much more. However, AI has one big risk: it can be perceived as a “black box”, limiting trust in its reliability, which is a very big issue in an area in which a decision can mean life or death. As a result, the term Explainable Artificial Intelligence (XAI) has been gaining momentum. XAI tries to ensure that AI algorithms (and the resulting decisions) can be understood by humans. In this narrative review, we will have a look at some central concepts in XAI, describe several challenges around XAI in healthcare, and discuss whether it can really help healthcare to advance, for example, by increasing understanding and trust. Finally, alternatives to increase trust in AI are discussed, as well as future research possibilities in the area of XAI.",
        "DOI": "10.3390/ai4030034",
        "paper_author": "Hulsen T.",
        "affiliation_name": "Philips Research",
        "affiliation_city": "Eindhoven",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60016561",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence-driven radiomics study in cancer: the role of feature engineering and modeling",
        "publication": "Military Medical Research",
        "citied_by": "74",
        "cover_date": "2023-12-01",
        "Abstract": "Modern medicine is reliant on various medical imaging technologies for non-invasively observing patients’ anatomy. However, the interpretation of medical images can be highly subjective and dependent on the expertise of clinicians. Moreover, some potentially useful quantitative information in medical images, especially that which is not visible to the naked eye, is often ignored during clinical practice. In contrast, radiomics performs high-throughput feature extraction from medical images, which enables quantitative analysis of medical images and prediction of various clinical endpoints. Studies have reported that radiomics exhibits promising performance in diagnosis and predicting treatment responses and prognosis, demonstrating its potential to be a non-invasive auxiliary tool for personalized medicine. However, radiomics remains in a developmental phase as numerous technical challenges have yet to be solved, especially in feature engineering and statistical modeling. In this review, we introduce the current utility of radiomics by summarizing research on its application in the diagnosis, prognosis, and prediction of treatment responses in patients with cancer. We focus on machine learning approaches, for feature extraction and selection during feature engineering and for imbalanced datasets and multi-modality fusion during statistical modeling. Furthermore, we introduce the stability, reproducibility, and interpretability of features, and the generalizability and interpretability of models. Finally, we offer possible solutions to current challenges in radiomics research.",
        "DOI": "10.1186/s40779-023-00458-8",
        "paper_author": "Zhang Y.P.",
        "affiliation_name": "Nantong University",
        "affiliation_city": "Nantong",
        "affiliation_country": "China",
        "affiliation_id": "60021783",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Artificial Intelligence in Pharmaceutical and Healthcare Research",
        "publication": "Big Data and Cognitive Computing",
        "citied_by": "74",
        "cover_date": "2023-03-01",
        "Abstract": "Artificial intelligence (AI) is a branch of computer science that allows machines to work efficiently, can analyze complex data. The research focused on AI has increased tremendously, and its role in healthcare service and research is emerging at a greater pace. This review elaborates on the opportunities and challenges of AI in healthcare and pharmaceutical research. The literature was collected from domains such as PubMed, Science Direct and Google scholar using specific keywords and phrases such as ‘Artificial intelligence’, ‘Pharmaceutical research’, ‘drug discovery’, ‘clinical trial’, ‘disease diagnosis’, etc. to select the research and review articles published within the last five years. The application of AI in disease diagnosis, digital therapy, personalized treatment, drug discovery and forecasting epidemics or pandemics was extensively reviewed in this article. Deep learning and neural networks are the most used AI technologies; Bayesian nonparametric models are the potential technologies for clinical trial design; natural language processing and wearable devices are used in patient identification and clinical trial monitoring. Deep learning and neural networks were applied in predicting the outbreak of seasonal influenza, Zika, Ebola, Tuberculosis and COVID-19. With the advancement of AI technologies, the scientific community may witness rapid and cost-effective healthcare and pharmaceutical research as well as provide improved service to the general public.",
        "DOI": "10.3390/bdcc7010010",
        "paper_author": "Bhattamisra S.K.",
        "affiliation_name": "GITAM University",
        "affiliation_city": "Visakhapatnam",
        "affiliation_country": "India",
        "affiliation_id": "60026146",
        "affiliation_state": "AP"
    },
    {
        "paper_title": "Association of Machine Learning-Based Assessment of Tumor-Infiltrating Lymphocytes on Standard Histologic Images with Outcomes of Immunotherapy in Patients with NSCLC",
        "publication": "JAMA Oncology",
        "citied_by": "71",
        "cover_date": "2023-01-19",
        "Abstract": "Importance: Currently, predictive biomarkers for response to immune checkpoint inhibitor (ICI) therapy in lung cancer are limited. Identifying such biomarkers would be useful to refine patient selection and guide precision therapy. Objective: To develop a machine-learning (ML)-based tumor-infiltrating lymphocytes (TILs) scoring approach, and to evaluate TIL association with clinical outcomes in patients with advanced non-small cell lung cancer (NSCLC). Design, Setting, and Participants: This multicenter retrospective discovery-validation cohort study included 685 ICI-treated patients with NSCLC with median follow-up of 38.1 and 43.3 months for the discovery (n = 446) and validation (n = 239) cohorts, respectively. Patients were treated between February 2014 and September 2021. We developed an ML automated method to count tumor, stroma, and TIL cells in whole-slide hematoxylin-eosin-stained images of NSCLC tumors. Tumor mutational burden (TMB) and programmed death ligand-1 (PD-L1) expression were assessed separately, and clinical response to ICI therapy was determined by medical record review. Data analysis was performed from June 2021 to April 2022. Exposures: All patients received anti-PD-(L)1 monotherapy. Main Outcomes and Measures: Objective response rate (ORR), progression-free survival (PFS), and overall survival (OS) were determined by blinded medical record review. The area under curve (AUC) of TIL levels, TMB, and PD-L1 in predicting ICI response were calculated using ORR. Results: Overall, there were 248 (56%) women in the discovery cohort and 97 (41%) in the validation cohort. In a multivariable analysis, high TIL level (≥250 cells/mm2) was independently associated with ICI response in both the discovery (PFS: HR, 0.71; P =.006; OS: HR, 0.74; P =.03) and validation (PFS: HR = 0.80; P =.01; OS: HR = 0.75; P =.001) cohorts. Survival benefit was seen in both first- and subsequent-line ICI treatments in patients with NSCLC. In the discovery cohort, the combined models of TILs/PD-L1 or TMB/PD-L1 had additional specificity in differentiating ICI responders compared with PD-L1 alone. In the PD-L1 negative (<1%) subgroup, TIL levels had superior classification accuracy for ICI response (AUC = 0.77) compared with TMB (AUC = 0.65). Conclusions and Relevance: In these cohorts, TIL levels were robustly and independently associated with response to ICI treatment. Patient TIL assessment is relatively easily incorporated into the workflow of pathology laboratories at minimal additional cost, and may enhance precision therapy..",
        "DOI": "10.1001/jamaoncol.2022.4933",
        "paper_author": "Rakaee M.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Artificial intelligence and machine learning disciplines with the potential to improve the nanotoxicology and nanomedicine fields: a comprehensive review",
        "publication": "Archives of Toxicology",
        "citied_by": "70",
        "cover_date": "2023-04-01",
        "Abstract": "The use of nanomaterials in medicine depends largely on nanotoxicological evaluation in order to ensure safe application on living organisms. Artificial intelligence (AI) and machine learning (MI) can be used to analyze and interpret large amounts of data in the field of toxicology, such as data from toxicological databases and high-content image-based screening data. Physiologically based pharmacokinetic (PBPK) models and nano-quantitative structure–activity relationship (QSAR) models can be used to predict the behavior and toxic effects of nanomaterials, respectively. PBPK and Nano-QSAR are prominent ML tool for harmful event analysis that is used to understand the mechanisms by which chemical compounds can cause toxic effects, while toxicogenomics is the study of the genetic basis of toxic responses in living organisms. Despite the potential of these methods, there are still many challenges and uncertainties that need to be addressed in the field. In this review, we provide an overview of artificial intelligence (AI) and machine learning (ML) techniques in nanomedicine and nanotoxicology to better understand the potential toxic effects of these materials at the nanoscale.",
        "DOI": "10.1007/s00204-023-03471-x",
        "paper_author": "Singh A.V.",
        "affiliation_name": "Bundesinstitut für Risikobewertung",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60083553",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Unsupervised machine learning methods and emerging applications in healthcare",
        "publication": "Knee Surgery, Sports Traumatology, Arthroscopy",
        "citied_by": "68",
        "cover_date": "2023-02-01",
        "Abstract": "Unsupervised machine learning methods are important analytical tools that can facilitate the analysis and interpretation of high-dimensional data. Unsupervised machine learning methods identify latent patterns and hidden structures in high-dimensional data and can help simplify complex datasets. This article provides an overview of key unsupervised machine learning techniques including K-means clustering, hierarchical clustering, principal component analysis, and factor analysis. With a deeper understanding of these analytical tools, unsupervised machine learning methods can be incorporated into health sciences research to identify novel risk factors, improve prevention strategies, and facilitate delivery of personalized therapies and targeted patient care. Level of evidence: I.",
        "DOI": "10.1007/s00167-022-07233-7",
        "paper_author": "Eckhardt C.M.",
        "affiliation_name": "Vagelos College of Physicians and Surgeons",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60011605",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Recent Trends in SERS-Based Plasmonic Sensors for Disease Diagnostics, Biomolecules Detection, and Machine Learning Techniques",
        "publication": "Biosensors",
        "citied_by": "67",
        "cover_date": "2023-03-01",
        "Abstract": "Surface-enhanced Raman spectroscopy/scattering (SERS) has evolved into a popular tool for applications in biology and medicine owing to its ease-of-use, non-destructive, and label-free approach. Advances in plasmonics and instrumentation have enabled the realization of SERS’s full potential for the trace detection of biomolecules, disease diagnostics, and monitoring. We provide a brief review on the recent developments in the SERS technique for biosensing applications, with a particular focus on machine learning techniques used for the same. Initially, the article discusses the need for plasmonic sensors in biology and the advantage of SERS over existing techniques. In the later sections, the applications are organized as SERS-based biosensing for disease diagnosis focusing on cancer identification and respiratory diseases, including the recent SARS-CoV-2 detection. We then discuss progress in sensing microorganisms, such as bacteria, with a particular focus on plasmonic sensors for detecting biohazardous materials in view of homeland security. At the end of the article, we focus on machine learning techniques for the (a) identification, (b) classification, and (c) quantification in SERS for biology applications. The review covers the work from 2010 onwards, and the language is simplified to suit the needs of the interdisciplinary audience.",
        "DOI": "10.3390/bios13030328",
        "paper_author": "Beeram R.",
        "affiliation_name": "Defence Research and Development Organisation India",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60015465",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Camera Measurement of Physiological Vital Signs",
        "publication": "ACM Computing Surveys",
        "citied_by": "67",
        "cover_date": "2023-09-30",
        "Abstract": "The need for remote tools for healthcare monitoring has never been more apparent. Camera measurement of vital signs leverages imaging devices to compute physiological changes by analyzing images of the human body. Building on advances in optics, machine learning, computer vision, and medicine, these techniques have progressed significantly since the invention of digital cameras. This article presents a comprehensive survey of camera measurement of physiological vital signs, describing the vital signs that can be measured and the computational techniques for doing so. I cover both clinical and non-clinical applications and the challenges that need to be overcome for these applications to advance from proofs of concept. Finally, I describe the current resources (datasets and code) available to the research community and provide a comprehensive webpage (https://cameravitals.github.io/) with links to these resource and a categorized list of all papers referenced in this article.",
        "DOI": "10.1145/3558518",
        "paper_author": "McDuff D.",
        "affiliation_name": "Google LLC",
        "affiliation_city": "Mountain View",
        "affiliation_country": "United States",
        "affiliation_id": "60006191",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Joint EANM/SNMMI guideline on radiomics in nuclear medicine: Jointly supported by the EANM Physics Committee and the SNMMI Physics, Instrumentation and Data Sciences Council",
        "publication": "European Journal of Nuclear Medicine and Molecular Imaging",
        "citied_by": "67",
        "cover_date": "2023-01-01",
        "Abstract": "Purpose: The purpose of this guideline is to provide comprehensive information on best practices for robust radiomics analyses for both hand-crafted and deep learning-based approaches. Methods: In a cooperative effort between the EANM and SNMMI, we agreed upon current best practices and recommendations for relevant aspects of radiomics analyses, including study design, quality assurance, data collection, impact of acquisition and reconstruction, detection and segmentation, feature standardization and implementation, as well as appropriate modelling schemes, model evaluation, and interpretation. We also offer an outlook for future perspectives. Conclusion: Radiomics is a very quickly evolving field of research. The present guideline focused on established findings as well as recommendations based on the state of the art. Though this guideline recognizes both hand-crafted and deep learning-based radiomics approaches, it primarily focuses on the former as this field is more mature. This guideline will be updated once more studies and results have contributed to improved consensus regarding the application of deep learning methods for radiomics. Although methodological recommendations in the present document are valid for most medical image modalities, we focus here on nuclear medicine, and specific recommendations when necessary are made for PET/CT, PET/MR, and quantitative SPECT.",
        "DOI": "10.1007/s00259-022-06001-6",
        "paper_author": "Hatt M.",
        "affiliation_name": "Université de Bretagne Occidentale",
        "affiliation_city": "Brest",
        "affiliation_country": "France",
        "affiliation_id": "60019762",
        "affiliation_state": "Brittany"
    },
    {
        "paper_title": "Perivascular adipose tissue as a source of therapeutic targets and clinical biomarkers",
        "publication": "European Heart Journal",
        "citied_by": "65",
        "cover_date": "2023-10-07",
        "Abstract": "Obesity is a modifiable cardiovascular risk factor, but adipose tissue (AT) depots in humans are anatomically, histologically, and functionally heterogeneous. For example, visceral AT is a pro-atherogenic secretory AT depot, while subcutaneous AT represents a more classical energy storage depot. Perivascular adipose tissue (PVAT) regulates vascular biology via paracrine cross-talk signals. In this position paper, the state-of-the-art knowledge of various AT depots is reviewed providing a consensus definition of PVAT around the coronary arteries, as the AT surrounding the artery up to a distance from its outer wall equal to the luminal diameter of the artery. Special focus is given to the interactions between PVAT and the vascular wall that render PVAT a potential therapeutic target in cardiovascular diseases. This Clinical Consensus Statement also discusses the role of PVAT as a clinically relevant source of diagnostic and prognostic biomarkers of vascular function, which may guide precision medicine in atherosclerosis, hypertension, heart failure, and other cardiovascular diseases. In this article, its role as a ‘biosensor’ of vascular inflammation is highlighted with description of recent imaging technologies that visualize PVAT in clinical practice, allowing non-invasive quantification of coronary inflammation and the related residual cardiovascular inflammatory risk, guiding deployment of therapeutic interventions. Finally, the current and future clinical applicability of artificial intelligence and machine learning technologies is reviewed that integrate PVAT information into prognostic models to provide clinically meaningful information in primary and secondary prevention.",
        "DOI": "10.1093/eurheartj/ehad484",
        "paper_author": "Antoniades C.",
        "affiliation_name": "University of Oxford Medical Sciences Division",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60002634",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "The Emerging Role of Raman Spectroscopy as an Omics Approach for Metabolic Profiling and Biomarker Detection toward Precision Medicine",
        "publication": "Chemical Reviews",
        "citied_by": "65",
        "cover_date": "2023-07-12",
        "Abstract": "Omics technologies have rapidly evolved with the unprecedented potential to shape precision medicine. Novel omics approaches are imperative toallow rapid and accurate data collection and integration with clinical information and enable a new era of healthcare. In this comprehensive review, we highlight the utility of Raman spectroscopy (RS) as an emerging omics technology for clinically relevant applications using clinically significant samples and models. We discuss the use of RS both as a label-free approach for probing the intrinsic metabolites of biological materials, and as a labeled approach where signal from Raman reporters conjugated to nanoparticles (NPs) serve as an indirect measure for tracking protein biomarkers in vivo and for high throughout proteomics. We summarize the use of machine learning algorithms for processing RS data to allow accurate detection and evaluation of treatment response specifically focusing on cancer, cardiac, gastrointestinal, and neurodegenerative diseases. We also highlight the integration of RS with established omics approaches for holistic diagnostic information. Further, we elaborate on metal-free NPs that leverage the biological Raman-silent region overcoming the challenges of traditional metal NPs. We conclude the review with an outlook on future directions that will ultimately allow the adaptation of RS as a clinical approach and revolutionize precision medicine.",
        "DOI": "10.1021/acs.chemrev.2c00897",
        "paper_author": "Cutshaw G.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Ames",
        "affiliation_country": "United States",
        "affiliation_id": "60145770",
        "affiliation_state": "IA"
    },
    {
        "paper_title": "Artificial intelligence, machine learning, and deep learning in liver transplantation",
        "publication": "Journal of Hepatology",
        "citied_by": "65",
        "cover_date": "2023-06-01",
        "Abstract": "Liver transplantation (LT) is a life-saving treatment for individuals with end-stage liver disease. The management of LT recipients is complex, predominantly because of the need to consider demographic, clinical, laboratory, pathology, imaging, and omics data in the development of an appropriate treatment plan. Current methods to collate clinical information are susceptible to some degree of subjectivity; thus, clinical decision-making in LT could benefit from the data-driven approach offered by artificial intelligence (AI). Machine learning and deep learning could be applied in both the pre- and post-LT settings. Some examples of AI applications pre-transplant include optimising transplant candidacy decision-making and donor-recipient matching to reduce waitlist mortality and improve post-transplant outcomes. In the post-LT setting, AI could help guide the management of LT recipients, particularly by predicting patient and graft survival, along with identifying risk factors for disease recurrence and other associated complications. Although AI shows promise in medicine, there are limitations to its clinical deployment which include dataset imbalances for model training, data privacy issues, and a lack of available research practices to benchmark model performance in the real world. Overall, AI tools have the potential to enhance personalised clinical decision-making, especially in the context of liver transplant medicine.",
        "DOI": "10.1016/j.jhep.2023.01.006",
        "paper_author": "Bhat M.",
        "affiliation_name": "University Health Network",
        "affiliation_city": "Toronto",
        "affiliation_country": "Canada",
        "affiliation_id": "60014468",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Artificial intelligence and machine learning overview in pathology &amp; laboratory medicine: A general review of data preprocessing and basic supervised concepts",
        "publication": "Seminars in Diagnostic Pathology",
        "citied_by": "64",
        "cover_date": "2023-03-01",
        "Abstract": "Machine learning (ML) is becoming an integral aspect of several domains in medicine. Yet, most pathologists and laboratory professionals remain unfamiliar with such tools and are unprepared for their inevitable integration. To bridge this knowledge gap, we present an overview of key elements within this emerging data science discipline. First, we will cover general, well-established concepts within ML, such as data type concepts, data preprocessing methods, and ML study design. We will describe common supervised and unsupervised learning algorithms and their associated common machine learning terms (provided within a comprehensive glossary of terms that are discussed within this review). Overall, this review will offer a broad overview of the key concepts and algorithms in machine learning, with a focus on pathology and laboratory medicine. The objective is to provide an updated useful reference for those new to this field or those who require a refresher.",
        "DOI": "10.1053/j.semdp.2023.02.002",
        "paper_author": "Albahra S.",
        "affiliation_name": "Cleveland Clinic Foundation",
        "affiliation_city": "Cleveland",
        "affiliation_country": "United States",
        "affiliation_id": "60021160",
        "affiliation_state": "OH"
    },
    {
        "paper_title": "Recent Advances in the Applications of Additive Manufacturing (3D Printing) in Drug Delivery: A Comprehensive Review",
        "publication": "AAPS PharmSciTech",
        "citied_by": "63",
        "cover_date": "2023-02-01",
        "Abstract": "There has been a tremendous increase in the investigations of three-dimensional (3D) printing for biomedical and pharmaceutical applications, and drug delivery in particular, ever since the US FDA approved the first 3D printed medicine, SPRITAM® (levetiracetam) in 2015. Three-dimensional printing, also known as additive manufacturing, involves various manufacturing techniques like fused-deposition modeling, 3D inkjet, stereolithography, direct powder extrusion, and selective laser sintering, among other 3D printing techniques, which are based on the digitally controlled layer-by-layer deposition of materials to form various geometries of printlets. In contrast to conventional manufacturing methods, 3D printing technologies provide the unique and important opportunity for the fabrication of personalized dosage forms, which is an important aspect in addressing diverse patient medical needs. There is however the need to speed up the use of 3D printing in the biopharmaceutical industry and clinical settings, and this can be made possible through the integration of modern technologies like artificial intelligence, machine learning, and Internet of Things, into additive manufacturing. This will lead to less human involvement and expertise, independent, streamlined, and intelligent production of personalized medicines. Four-dimensional (4D) printing is another important additive manufacturing technique similar to 3D printing, but adds a 4th dimension defined as time, to the printing. This paper aims to give a detailed review of the applications and principles of operation of various 3D printing technologies in drug delivery, and the materials used in 3D printing, and highlight the challenges and opportunities of additive manufacturing, while introducing the concept of 4D printing and its pharmaceutical applications.",
        "DOI": "10.1208/s12249-023-02524-9",
        "paper_author": "Muhindo D.",
        "affiliation_name": "University of Mississippi School of Pharmacy",
        "affiliation_city": "University",
        "affiliation_country": "United States",
        "affiliation_id": "60020462",
        "affiliation_state": "MS"
    },
    {
        "paper_title": "Using a Google Web Search Analysis to Assess the Utility of ChatGPT in Total Joint Arthroplasty",
        "publication": "Journal of Arthroplasty",
        "citied_by": "62",
        "cover_date": "2023-07-01",
        "Abstract": "Background: Rapid technological advancements have laid the foundations for the use of artificial intelligence in medicine. The promise of machine learning (ML) lies in its potential ability to improve treatment decision making, predict adverse outcomes, and streamline the management of perioperative healthcare. In an increasing consumer-focused health care model, unprecedented access to information may extend to patients using ChatGPT to gain insight into medical questions. The main objective of our study was to replicate a patient's internet search in order to assess the appropriateness of ChatGPT, a novel machine learning tool released in 2022 that provides dialogue responses to queries, in comparison to Google Web Search, the most widely used search engine in the United States today, as a resource for patients for online health information. For the 2 different search engines, we compared i) the most frequently asked questions (FAQs) associated with total knee arthroplasty (TKA) and total hip arthroplasty (THA) by question type and topic; ii) the answers to the most frequently asked questions; as well as iii) the FAQs yielding a numerical response. Methods: A Google web search was performed with the following search terms: “total knee replacement” and “total hip replacement.” These terms were individually entered and the first 10 FAQs were extracted along with the source of the associated website for each question. The following statements were inputted into ChatGPT: 1) “Perform a google search with the search term ‘total knee replacement’ and record the 10 most FAQs related to the search term” as well as 2) “Perform a google search with the search term ‘total hip replacement’ and record the 10 most FAQs related to the search term.” A Google web search was repeated with the same search terms to identify the first 10 FAQs that included a numerical response for both “total knee replacement” and “total hip replacement.” These questions were then inputted into ChatGPT and the questions and answers were recorded. Results: There were 5 of 20 (25%) questions that were similar when performing a Google web search and a search of ChatGPT for all search terms. Of the 20 questions asked for the Google Web Search, 13 of 20 were provided by commercial websites. For ChatGPT, 15 of 20 (75%) questions were answered by government websites, with the most frequent one being PubMed. In terms of numerical questions, 11 of 20 (55%) of the most FAQs provided different responses between a Google web search and ChatGPT. Conclusion: A comparison of the FAQs by a Google web search with attempted replication by ChatGPT revealed heterogenous questions and responses for open and discrete questions. ChatGPT should remain a trending use as a potential resource to patients that needs further corroboration until its ability to provide credible information is verified and concordant with the goals of the physician and the patient alike.",
        "DOI": "10.1016/j.arth.2023.04.007",
        "paper_author": "Dubin J.A.",
        "affiliation_name": "Sinai Hospital of Baltimore",
        "affiliation_city": "Baltimore",
        "affiliation_country": "United States",
        "affiliation_id": "60005330",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "Radiomics and artificial intelligence for precision medicine in lung cancer treatment",
        "publication": "Seminars in Cancer Biology",
        "citied_by": "61",
        "cover_date": "2023-08-01",
        "Abstract": "Lung cancer is the leading cause of cancer-related deaths worldwide. It exhibits, at the mesoscopic scale, phenotypic characteristics that are generally indiscernible to the human eye but can be captured non-invasively on medical imaging as radiomic features, which can form a high dimensional data space amenable to machine learning. Radiomic features can be harnessed and used in an artificial intelligence paradigm to risk stratify patients, and predict for histological and molecular findings, and clinical outcome measures, thereby facilitating precision medicine for improving patient care. Compared to tissue sampling-driven approaches, radiomics-based methods are superior for being non-invasive, reproducible, cheaper, and less susceptible to intra-tumoral heterogeneity. This review focuses on the application of radiomics, combined with artificial intelligence, for delivering precision medicine in lung cancer treatment, with discussion centered on pioneering and groundbreaking works, and future research directions in the area.",
        "DOI": "10.1016/j.semcancer.2023.05.004",
        "paper_author": "Chen M.",
        "affiliation_name": "Imperial College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60015150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence meets medical robotics",
        "publication": "Science (New York, N.Y.)",
        "citied_by": "60",
        "cover_date": "2023-07-14",
        "Abstract": "Artificial intelligence (AI) applications in medical robots are bringing a new era to medicine. Advanced medical robots can perform diagnostic and surgical procedures, aid rehabilitation, and provide symbiotic prosthetics to replace limbs. The technology used in these devices, including computer vision, medical image analysis, haptics, navigation, precise manipulation, and machine learning (ML) , could allow autonomous robots to carry out diagnostic imaging, remote surgery, surgical subtasks, or even entire surgical procedures. Moreover, AI in rehabilitation devices and advanced prosthetics can provide individualized support, as well as improved functionality and mobility (see the figure). The combination of extraordinary advances in robotics, medicine, materials science, and computing could bring safer, more efficient, and more widely available patient care in the future. -Gemma K. Alderton.",
        "DOI": "10.1126/science.adj3312",
        "paper_author": "Yip M.",
        "affiliation_name": "University of California, San Diego",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60030612",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Multimodal Multi-Head Convolutional Attention with Various Kernel Sizes for Medical Image Super-Resolution",
        "publication": "Proceedings - 2023 IEEE Winter Conference on Applications of Computer Vision, WACV 2023",
        "citied_by": "60",
        "cover_date": "2023-01-01",
        "Abstract": "Super-resolving medical images can help physicians in providing more accurate diagnostics. In many situations, computed tomography (CT) or magnetic resonance imaging (MRI) techniques capture several scans (modes) during a single investigation, which can jointly be used (in a multimodal fashion) to further boost the quality of super-resolution results. To this end, we propose a novel multi-modal multi-head convolutional attention module to super-resolve CT and MRI scans. Our attention module uses the convolution operation to perform joint spatial-channel attention on multiple concatenated input tensors, where the kernel (receptive field) size controls the reduction rate of the spatial attention, and the number of convolutional filters controls the reduction rate of the channel attention, respectively. We introduce multiple attention heads, each head having a distinct receptive field size corresponding to a particular reduction rate for the spatial attention. We integrate our multimodal multi-head convolutional attention (MMHCA) into two deep neural architectures for super-resolution and conduct experiments on three data sets. Our empirical results show the superiority of our attention module over the state-of-the-art attention mechanisms used in super-resolution. Moreover, we conduct an ablation study to assess the impact of the components involved in our attention module, e.g. the number of inputs or the number of heads. Our code is freely available at https://github.com/lilygeorgescu/MHCA.",
        "DOI": "10.1109/WACV56688.2023.00223",
        "paper_author": "Georgescu M.I.",
        "affiliation_name": "Universitatea din Bucuresti",
        "affiliation_city": "Bucharest",
        "affiliation_country": "Romania",
        "affiliation_id": "60001478",
        "affiliation_state": "Bucharest"
    },
    {
        "paper_title": "Explainable artificial intelligence model for identifying COVID-19 gene biomarkers",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "59",
        "cover_date": "2023-03-01",
        "Abstract": "Aim: COVID-19 has revealed the need for fast and reliable methods to assist clinicians in diagnosing the disease. This article presents a model that applies explainable artificial intelligence (XAI) methods based on machine learning techniques on COVID-19 metagenomic next-generation sequencing (mNGS) samples. Methods: In the data set used in the study, there are 15,979 gene expressions of 234 patients with COVID-19 negative 141 (60.3%) and COVID-19 positive 93 (39.7%). The least absolute shrinkage and selection operator (LASSO) method was applied to select genes associated with COVID-19. Support Vector Machine - Synthetic Minority Oversampling Technique (SVM-SMOTE) method was used to handle the class imbalance problem. Logistics regression (LR), SVM, random forest (RF), and extreme gradient boosting (XGBoost) methods were constructed to predict COVID-19. An explainable approach based on local interpretable model-agnostic explanations (LIME) and SHAPley Additive exPlanations (SHAP) methods was applied to determine COVID-19- associated biomarker candidate genes and improve the final model's interpretability. Results: For the diagnosis of COVID-19, the XGBoost (accuracy: 0.930) model outperformed the RF (accuracy: 0.912), SVM (accuracy: 0.877), and LR (accuracy: 0.912) models. As a result of the SHAP, the three most important genes associated with COVID-19 were IFI27, LGR6, and FAM83A. The results of LIME showed that especially the high level of IFI27 gene expression contributed to increasing the probability of positive class. Conclusions: The proposed model (XGBoost) was able to predict COVID-19 successfully. The results show that machine learning combined with LIME and SHAP can explain the biomarker prediction for COVID-19 and provide clinicians with an intuitive understanding and interpretability of the impact of risk factors in the model.",
        "DOI": "10.1016/j.compbiomed.2023.106619",
        "paper_author": "Yagin F.H.",
        "affiliation_name": "Inönü Üniversitesi Tip Fakültesi",
        "affiliation_city": "Malatya",
        "affiliation_country": "Turkey",
        "affiliation_id": "60027720",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A comprehensive review on federated learning based models for healthcare applications",
        "publication": "Artificial Intelligence in Medicine",
        "citied_by": "58",
        "cover_date": "2023-12-01",
        "Abstract": "A disease is an abnormal condition that negatively impacts the functioning of the human body. Pathology determines the causes behind the disease and identifies its development mechanism and functional consequences. Each disease has different identification methods, including X-ray scans for pneumonia, covid-19, and lung cancer, whereas biopsy and CT-scan can identify the presence of skin cancer and Alzheimer's disease, respectively. Early disease detection leads to effective treatment and avoids abiding complications. Deep learning has provided a vast number of applications in medical sectors resulting in accurate and reliable early disease predictions. These models are utilized in the healthcare industry to provide supplementary assistance to doctors in identifying the presence of diseases. Majorly, these models are trained through secondary data sources since healthcare institutions refrain from sharing patients' private data to ensure confidentiality, which limits the effectiveness of deep learning models due to the requirement of extensive datasets for training to achieve optimal results. Federated learning deals with the data in such a way that it doesn't exploit the privacy of a patient's data. In this work, a wide variety of disease detection models trained through federated learning have been rigorously reviewed. This meta-analysis provides an in-depth review of the federated learning architectures, federated learning types, hyperparameters, dataset utilization details, aggregation techniques, performance measures, and augmentation methods applied in the existing models during the development phase. The review also highlights various open challenges associated with the disease detection models trained through federated learning for future research.",
        "DOI": "10.1016/j.artmed.2023.102691",
        "paper_author": "Sharma S.",
        "affiliation_name": "Chitkara University, Punjab",
        "affiliation_city": "Rajpura",
        "affiliation_country": "India",
        "affiliation_id": "60113205",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Interpretable and explainable machine learning: A methods-centric overview with concrete examples",
        "publication": "Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery",
        "citied_by": "58",
        "cover_date": "2023-05-01",
        "Abstract": "Interpretability and explainability are crucial for machine learning (ML) and statistical applications in medicine, economics, law, and natural sciences and form an essential principle for ML model design and development. Although interpretability and explainability have escaped a precise and universal definition, many models and techniques motivated by these properties have been developed over the last 30 years, with the focus currently shifting toward deep learning. We will consider concrete examples of state-of-the-art, including specially tailored rule-based, sparse, and additive classification models, interpretable representation learning, and methods for explaining black-box models post hoc. The discussion will emphasize the need for and relevance of interpretability and explainability, the divide between them, and the inductive biases behind the presented “zoo” of interpretable models and explanation methods. This article is categorized under: Fundamental Concepts of Data and Knowledge > Explainable AI Technologies > Machine Learning Commercial, Legal, and Ethical Issues > Social Considerations.",
        "DOI": "10.1002/widm.1493",
        "paper_author": "Marcinkevičs R.",
        "affiliation_name": "ETH Zürich",
        "affiliation_city": "Zurich",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60025858",
        "affiliation_state": "ZH"
    },
    {
        "paper_title": "A non-invasive artificial intelligence approach for the prediction of human blastocyst ploidy: a retrospective model development and validation study",
        "publication": "The Lancet Digital Health",
        "citied_by": "58",
        "cover_date": "2023-01-01",
        "Abstract": "Background: One challenge in the field of in-vitro fertilisation is the selection of the most viable embryos for transfer. Morphological quality assessment and morphokinetic analysis both have the disadvantage of intra-observer and inter-observer variability. A third method, preimplantation genetic testing for aneuploidy (PGT-A), has limitations too, including its invasiveness and cost. We hypothesised that differences in aneuploid and euploid embryos that allow for model-based classification are reflected in morphology, morphokinetics, and associated clinical information. Methods: In this retrospective study, we used machine-learning and deep-learning approaches to develop STORK-A, a non-invasive and automated method of embryo evaluation that uses artificial intelligence to predict embryo ploidy status. Our method used a dataset of 10 378 embryos that consisted of static images captured at 110 h after intracytoplasmic sperm injection, morphokinetic parameters, blastocyst morphological assessments, maternal age, and ploidy status. Independent and external datasets, Weill Cornell Medicine EmbryoScope+ (WCM-ES+; Weill Cornell Medicine Center of Reproductive Medicine, NY, USA) and IVI Valencia (IVI Valencia, Health Research Institute la Fe, Valencia, Spain) were used to test the generalisability of STORK-A and were compared measuring accuracy and area under the receiver operating characteristic curve (AUC). Findings: Analysis and model development included the use of 10 378 embryos, all with PGT-A results, from 1385 patients (maternal age range 21–48 years; mean age 36·98 years [SD 4·62]). STORK-A predicted aneuploid versus euploid embryos with an accuracy of 69·3% (95% CI 66·9–71·5; AUC 0·761; positive predictive value [PPV] 76·1%; negative predictive value [NPV] 62·1%) when using images, maternal age, morphokinetics, and blastocyst score. A second classification task trained to predict complex aneuploidy versus euploidy and single aneuploidy produced an accuracy of 74·0% (95% CI 71·7–76·1; AUC 0·760; PPV 54·9%; NPV 87·6%) using an image, maternal age, morphokinetic parameters, and blastocyst grade. A third classification task trained to predict complex aneuploidy versus euploidy had an accuracy of 77·6% (95% CI 75·0–80·0; AUC 0·847; PPV 76·7%; NPV 78·0%). STORK-A reported accuracies of 63·4% (AUC 0·702) on the WCM-ES+ dataset and 65·7% (AUC 0·715) on the IVI Valencia dataset, when using an image, maternal age, and morphokinetic parameters, similar to the STORK-A test dataset accuracy of 67·8% (AUC 0·737), showing generalisability. Interpretation: As a proof of concept, STORK-A shows an ability to predict embryo ploidy in a non-invasive manner and shows future potential as a standardised supplementation to traditional methods of embryo selection and prioritisation for implantation or recommendation for PGT-A. Funding: US National Institutes of Health.",
        "DOI": "10.1016/S2589-7500(22)00213-8",
        "paper_author": "Barnes J.",
        "affiliation_name": "Weill Cornell Medicine",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60007997",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Popular deep learning algorithms for disease prediction: a review",
        "publication": "Cluster Computing",
        "citied_by": "58",
        "cover_date": "2023-04-01",
        "Abstract": "Due to its automatic feature learning ability and high performance, deep learning has gradually become the mainstream of artificial intelligence in recent years, playing a role in many fields. Especially in the medical field, the accuracy rate of deep learning even exceeds that of doctors. This paper introduces several deep learning algorithms: Artificial Neural Network (NN), FM-Deep Learning, Convolutional NN and Recurrent NN, and expounds their theory, development history and applications in disease prediction; we analyze the defects in the current disease prediction field and give some current solutions; our paper expounds the two major trends in the future disease prediction and medical field—integrating Digital Twins and promoting precision medicine. This study can better inspire relevant researchers, so that they can use this article to understand related disease prediction algorithms and then make better related research.",
        "DOI": "10.1007/s10586-022-03707-y",
        "paper_author": "Yu Z.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Spatial mapping of cellular senescence: emerging challenges and opportunities",
        "publication": "Nature Aging",
        "citied_by": "57",
        "cover_date": "2023-07-01",
        "Abstract": "Cellular senescence is a well-established driver of aging and age-related diseases. There are many challenges to mapping senescent cells in tissues such as the absence of specific markers and their relatively low abundance and vast heterogeneity. Single-cell technologies have allowed unprecedented characterization of senescence; however, many methodologies fail to provide spatial insights. The spatial component is essential, as senescent cells communicate with neighboring cells, impacting their function and the composition of extracellular space. The Cellular Senescence Network (SenNet), a National Institutes of Health (NIH) Common Fund initiative, aims to map senescent cells across the lifespan of humans and mice. Here, we provide a comprehensive review of the existing and emerging methodologies for spatial imaging and their application toward mapping senescent cells. Moreover, we discuss the limitations and challenges inherent to each technology. We argue that the development of spatially resolved methods is essential toward the goal of attaining an atlas of senescent cells.",
        "DOI": "10.1038/s43587-023-00446-6",
        "paper_author": "Gurkar A.U.",
        "affiliation_name": "University of Pittsburgh School of Medicine",
        "affiliation_city": "Pittsburgh",
        "affiliation_country": "United States",
        "affiliation_id": "60001361",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Advances in Artificial Intelligence for Infectious-Disease Surveillance",
        "publication": "New England Journal of Medicine",
        "citied_by": "57",
        "cover_date": "2023-01-01",
        "Abstract": "Advances in AI for Infectious-Disease Surveillance This article in the AI in Medicine series addresses the use of AI and machine-learning tools to identify and track disease outbreaks and monitor mitigation strategies.",
        "DOI": "10.1056/NEJMra2119215",
        "paper_author": "Brownstein J.S.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Integrative toxicogenomics: Advancing precision medicine and toxicology through artificial intelligence and OMICs technology",
        "publication": "Biomedicine and Pharmacotherapy",
        "citied_by": "57",
        "cover_date": "2023-07-01",
        "Abstract": "More information about a person's genetic makeup, drug response, multi-omics response, and genomic response is now available leading to a gradual shift towards personalized treatment. Additionally, the promotion of non-animal testing has fueled the computational toxicogenomics as a pivotal part of the next-gen risk assessment paradigm. Artificial Intelligence (AI) has the potential to provid new ways analyzing the patient data and making predictions about treatment outcomes or toxicity. As personalized medicine and toxicogenomics involve huge data processing, AI can expedite this process by providing powerful data processing, analysis, and interpretation algorithms. AI can process and integrate a multitude of data including genome data, patient records, clinical data and identify patterns to derive predictive models anticipating clinical outcomes and assessing the risk of any personalized medicine approaches. In this article, we have studied the current trends and future perspectives in personalized medicine & toxicology, the role of toxicogenomics in connecting the two fields, and the impact of AI on personalized medicine & toxicology. In this work, we also study the key challenges and limitations in personalized medicine, toxicogenomics, and AI in order to fully realize their potential.",
        "DOI": "10.1016/j.biopha.2023.114784",
        "paper_author": "Singh A.V.",
        "affiliation_name": "Bundesinstitut für Risikobewertung",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60083553",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Wearable Devices in Cardiovascular Medicine",
        "publication": "Circulation Research",
        "citied_by": "57",
        "cover_date": "2023-03-03",
        "Abstract": "Wearable devices, such as smartwatches and activity trackers, are commonly used by patients in their everyday lives to manage their health and well-being. These devices collect and analyze long-term continuous data on measures of behavioral or physiologic function, which may provide clinicians with a more comprehensive view of a patients’ health compared with the traditional sporadic measures captured by office visits and hospitalizations. Wearable devices have a wide range of potential clinical applications ranging from arrhythmia screening of high-risk individuals to remote management of chronic conditions such as heart failure or peripheral artery disease. As the use of wearable devices continues to grow, we must adopt a multifaceted approach with collaboration among all key stakeholders to effectively and safely integrate these technologies into routine clinical practice. In this Review, we summarize the features of wearable devices and associated machine learning techniques. We describe key research studies that illustrate the role of wearable devices in the screening and management of cardiovascular conditions and identify directions for future research. Last, we highlight the challenges that are currently hindering the widespread use of wearable devices in cardiovascular medicine and provide short- and long-term solutions to promote increased use of wearable devices in clinical care.",
        "DOI": "10.1161/CIRCRESAHA.122.322389",
        "paper_author": "Hughes A.",
        "affiliation_name": "Vanderbilt University Medical Center",
        "affiliation_city": "Nashville",
        "affiliation_country": "United States",
        "affiliation_id": "60030769",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Hybrid Deep learning based Semi-supervised Model for Medical Imaging",
        "publication": "2022 OPJU International Technology Conference on Emerging Technologies for Sustainable Development, OTCON 2022",
        "citied_by": "56",
        "cover_date": "2023-01-01",
        "Abstract": "One of the most promising fields in medicine is the application of artificial intelligence methods to medical imaging. Though annotating medical images is an expensive operation, most of the recent success in this field has relied heavily on vast amounts of meticulously annotated data. The best that we can tell, the method we present in this research, hybrid approach, is the first to use recent developments in semi-supervised learning (SSL) for medical imaging recognition. Due to the growing complexity of healthcare data, machine learning techniques like Deep Neural Network (DNN) models have become more and more popular. Machine learning (ML) techniques can uncover hidden patterns and other important facts from the massive amount of health data that traditional analytics can't find in a reasonable length of time. These advancements will have a significant impact on medical imaging technology, medical healthcare data processing, medical illness diagnostics, and general healthcare. We have two goals: First to conduct a survey on DL techniques to medical pictures; and second proposed hybrid DL-based approaches for image classification. This paper mainly proposed hybrid methodology for medical imaging which can improve semi supervised model.",
        "DOI": "10.1109/OTCON56053.2023.10113904",
        "paper_author": "Sahu H.",
        "affiliation_name": "Amity University Chhattisgarh",
        "affiliation_city": "Raipur",
        "affiliation_country": "India",
        "affiliation_id": "60109376",
        "affiliation_state": "CG"
    },
    {
        "paper_title": "Perspective of artificial intelligence in healthcare data management: A journey towards precision medicine",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "55",
        "cover_date": "2023-08-01",
        "Abstract": "Mounting evidence has highlighted the implementation of big data handling and management in the healthcare industry to improve the clinical services. Various private and public companies have generated, stored, and analyzed different types of big healthcare data, such as omics data, clinical data, electronic health records, personal health records, and sensing data with the aim to move in the direction of precision medicine. Additionally, with the advancement in technologies, researchers are curious to extract the potential involvement of artificial intelligence and machine learning on big healthcare data to enhance the quality of patient's lives. However, seeking solutions from big healthcare data requires proper management, storage, and analysis, which imposes hinderances associated with big data handling. Herein, we briefly discuss the implication of big data handling and the role of artificial intelligence in precision medicine. Further, we also highlighted the potential of artificial intelligence in integrating and analyzing the big data that offer personalized treatment. In addition, we briefly discuss the applications of artificial intelligence in personalized treatment, especially in neurological diseases. Lastly, we discuss the challenges and limitations imposed by artificial intelligence in big data management and analysis to hinder precision medicine.",
        "DOI": "10.1016/j.compbiomed.2023.107051",
        "paper_author": "Gupta N.S.",
        "affiliation_name": "Delhi Technological University",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60002874",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Towards Patient-centered Decision-making in Breast Cancer Surgery: Machine Learning to Predict Individual Patient-reported Outcomes at 1-year Follow-up",
        "publication": "Annals of Surgery",
        "citied_by": "54",
        "cover_date": "2023-01-01",
        "Abstract": "Objective: We developed, tested, and validated machine learning algorithms to predict individual patient-reported outcomes at 1-year follow-up to facilitate individualized, patient-centered decision-making for women with breast cancer. Summary of Background Data: Satisfaction with breasts is a key outcome for women undergoing cancer-related mastectomy and reconstruction. Current decision-making relies on group-level evidence which may lead to suboptimal treatment recommendations for individuals. Methods: We trained, tested, and validated 3 machine learning algorithms using data from 1921 women undergoing cancer-related mastectomy and reconstruction conducted at eleven study sites in North America from 2011 to 2016. Data from 1921 women undergoing cancer-related mastectomy and reconstruction were collected before surgery and at 1-year follow-up. Data from 10 of the 11 sites were randomly split into training and test samples (2:1 ratio) to develop and test 3 algorithms (logistic regression with elastic net penalty, extreme gradient boosting tree, and neural network) which were further validated using the additional sitea's data. AUC to predict clinically-significant changes in satisfaction with breasts at 1-year follow-up using the validated BREAST-Q were the outcome measures. Results: The 3 algorithms performed equally well when predicting both improved or decreased satisfaction with breasts in both testing and validation datasets: For the testing dataset median accuracy = 0.81 (range 0.73-0.83), median AUC = 0.84 (range 0.78-0.85). For the validation dataset median accuracy = 0.83 (range 0.81-0.84), median AUC = 0.86 (range 0.83-0.89). Conclusion: Individual patient-reported outcomes can be accurately predicted using machine learning algorithms, which may facilitate individualized, patient-centered decision-making for women undergoing breast cancer treatment.",
        "DOI": "10.1097/SLA.0000000000004862",
        "paper_author": "Pfob A.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Beyond 20 in the 21st Century: Prospects and Challenges of Non-canonical Amino Acids in Peptide Drug Discovery",
        "publication": "ACS Medicinal Chemistry Letters",
        "citied_by": "53",
        "cover_date": "2023-05-11",
        "Abstract": "Life is constructed primarily using a toolbox of 20 canonical amino acids─relying upon these building blocks for the assembly of proteins and peptides that regulate nearly every cellular task, including cell structure, function, and maintenance. While Nature continues to be a source of inspiration for drug discovery, medicinal chemists are not beholden to only 20 canonical amino acids and have begun to explore non-canonical amino acids (ncAAs) for the construction of designer peptides with improved drug-like properties. However, as our toolbox of ncAAs expands, drug hunters are encountering new challenges in approaching the iterative peptide design-make-test-analyze cycle with a seemingly boundless set of building blocks. This Microperspective focuses on new technologies that are accelerating ncAA interrogation in peptide drug discovery (including HELM notation, late-stage functionalization, and biocatalysis) while shedding light on areas where further investment could not only accelerate the discovery of new medicines but also improve downstream development.",
        "DOI": "10.1021/acsmedchemlett.3c00037",
        "paper_author": "Hickey J.L.",
        "affiliation_name": "Merck &amp; Co., Inc.",
        "affiliation_city": "Rahway",
        "affiliation_country": "United States",
        "affiliation_id": "60007995",
        "affiliation_state": "NJ"
    },
    {
        "paper_title": "Current challenges and potential solutions to the use of digital health technologies in evidence generation: a narrative review",
        "publication": "Frontiers in Digital Health",
        "citied_by": "51",
        "cover_date": "2023-01-01",
        "Abstract": "Digital health is a field that aims to improve patient care through the use of technology, such as telemedicine, mobile health, electronic health records, and artificial intelligence. The aim of this review is to examine the challenges and potential solutions for the implementation and evaluation of digital health technologies. Digital tools are used across the world in different settings. In Australia, the Digital Health Translation and Implementation Program (DHTI) emphasizes the importance of involving stakeholders and addressing infrastructure and training issues for healthcare workers. The WHO's Global Task Force on Digital Health for TB aims to address tuberculosis through digital health innovations. Digital tools are also used in mental health care, but their effectiveness must be evaluated during development. Oncology supportive care uses digital tools for cancer patient intervention and surveillance, but evaluating their effectiveness can be challenging. In the COVID and post-COVID era, digital health solutions must be evaluated based on their technological maturity and size of deployment, as well as the quality of data they provide. To safely and effectively use digital healthcare technology, it is essential to prioritize evaluation using complex systems and evidence-based medical frameworks. To address the challenges of digital health implementation, it is important to prioritize ethical research addressing issues of user consent and addressing socioeconomic disparities in access and effectiveness. It is also important to consider the impact of digital health on health outcomes and the cost-effectiveness of service delivery.",
        "DOI": "10.3389/fdgth.2023.1203945",
        "paper_author": "Mumtaz H.",
        "affiliation_name": "Health Services Academy Islamabad",
        "affiliation_city": "Islamabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60054128",
        "affiliation_state": "Islamabad"
    },
    {
        "paper_title": "Where Medical Statistics Meets Artificial Intelligence.",
        "publication": "New England Journal of Medicine",
        "citied_by": "51",
        "cover_date": "2023-01-01",
        "Abstract": "NA",
        "DOI": "10.1056/NEJMra2212850",
        "paper_author": "Hunter D.J.",
        "affiliation_name": "University of Oxford Medical Sciences Division",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60002634",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "Artificial intelligence in cancer diagnosis and therapy: Current status and future perspective",
        "publication": "Computers in Biology and Medicine",
        "citied_by": "51",
        "cover_date": "2023-10-01",
        "Abstract": "Artificial intelligence (AI) in healthcare plays a pivotal role in combating many fatal diseases, such as skin, breast, and lung cancer. AI is an advanced form of technology that uses mathematical-based algorithmic principles similar to those of the human mind for cognizing complex challenges of the healthcare unit. Cancer is a lethal disease with many etiologies, including numerous genetic and epigenetic mutations. Cancer being a multifactorial disease is difficult to be diagnosed at an early stage. Therefore, genetic variations and other leading factors could be identified in due time through AI and machine learning (ML). AI is the synergetic approach for mining the drug targets, their mechanism of action, and drug-organism interaction from massive raw data. This synergetic approach is also facing several challenges in data mining but computational algorithms from different scientific communities for multi-target drug discovery are highly helpful to overcome the bottlenecks in AI for drug-target discovery. AI and ML could be the epicenter in the medical world for the diagnosis, treatment, and evaluation of almost any disease in the near future. In this comprehensive review, we explore the immense potential of AI and ML when integrated with the biological sciences, specifically in the context of cancer research. Our goal is to illuminate the many ways in which AI and ML are being applied to the study of cancer, from diagnosis to individualized treatment. We highlight the prospective role of AI in supporting oncologists and other medical professionals in making informed decisions and improving patient outcomes by examining the intersection of AI and cancer control. Although AI-based medical therapies show great potential, many challenges must be overcome before they can be implemented in clinical practice. We critically assess the current hurdles and provide insights into the future directions of AI-driven approaches, aiming to pave the way for enhanced cancer interventions and improved patient care.",
        "DOI": "10.1016/j.compbiomed.2023.107356",
        "paper_author": "Sufyan M.",
        "affiliation_name": "Government College University Faisalabad",
        "affiliation_city": "Faisalabad",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60070615",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "New era of artificial intelligence and machine learning-based detection, diagnosis, and therapeutics in Parkinson's disease",
        "publication": "Ageing Research Reviews",
        "citied_by": "51",
        "cover_date": "2023-09-01",
        "Abstract": "Parkinson's disease (PD) is characterized by the loss of neuronal cells, which leads to synaptic dysfunction and cognitive defects. Despite the advancements in treatment strategies, the management of PD is still a challenging event. Early prediction and diagnosis of PD are of utmost importance for effective management of PD. In addition, the classification of patients with PD as compared to normal healthy individuals also imposes drawbacks in the early diagnosis of PD. To address these challenges, artificial intelligence (AI) and machine learning (ML) models have been implicated in the diagnosis, prediction, and treatment of PD. Recent times have also demonstrated the implication of AI and ML models in the classification of PD based on neuroimaging methods, speech recording, gait abnormalities, and others. Herein, we have briefly discussed the role of AI and ML in the diagnosis, treatment, and identification of novel biomarkers in the progression of PD. We have also highlighted the role of AI and ML in PD management through altered lipidomics and gut-brain axis. We briefly explain the role of early PD detection through AI and ML algorithms based on speech recordings, handwriting patterns, gait abnormalities, and neuroimaging techniques. Further, the review discuss the potential role of the metaverse, the Internet of Things, and electronic health records in the effective management of PD to improve the quality of life. Lastly, we also focused on the implementation of AI and ML-algorithms in neurosurgical process and drug discovery.",
        "DOI": "10.1016/j.arr.2023.102013",
        "paper_author": "Gupta R.",
        "affiliation_name": "Delhi",
        "affiliation_city": "Delhi",
        "affiliation_country": "United States",
        "affiliation_id": "121724226",
        "affiliation_state": "LA"
    },
    {
        "paper_title": "Artificial Intelligence and Biosensors in Healthcare and Its Clinical Relevance: A Review",
        "publication": "IEEE Access",
        "citied_by": "51",
        "cover_date": "2023-01-01",
        "Abstract": "Data generated from sources such as wearable sensors, medical imaging, personal health records, and public health organizations have resulted in a massive information increase in the medical sciences over the last decade. Advances in computational hardware, such as cloud computing, graphical processing units (GPUs), Field-programmable gate arrays (FPGAs) and tensor processing units (TPUs), provide the means to utilize these data. Consequently, an array of sophisticated Artificial Intelligence (AI) techniques have been devised to extract valuable insights from the extensive datasets in the healthcare industry. Here, we present an overview of recent progress in AI and biosensors in medical and life sciences. We discuss the role of machine learning in medical imaging, precision medicine, and biosensors for the Internet of Things (IoT). We review the latest advancements in wearable biosensing technologies. These innovative solutions employ AI to assist in monitoring of bodily electro-physiological and electro-chemical signals, as well as in disease diagnosis. These advancements exemplify the trend towards personalized medicine, delivering highly effective, cost-efficient, and precise point-of-care treatment.Furthermore, an overview of the advances in computing technologies, such as accelerated AI, edge computing, and federated learning for medical data, are also documented. Finally, we investigate challenges in data-driven AI approaches, the potential issues generated by biosensors and IoT-based healthcare, and the distribution shifts that occur among different data modalities, concluding with an overview of future prospects.",
        "DOI": "10.1109/ACCESS.2023.3285596",
        "paper_author": "Qureshi R.",
        "affiliation_name": "University of Texas Health Science Center at Houston",
        "affiliation_city": "Houston",
        "affiliation_country": "United States",
        "affiliation_id": "60027512",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Speech Emotion Recognition through Hybrid Features and Convolutional Neural Network",
        "publication": "Applied Sciences (Switzerland)",
        "citied_by": "51",
        "cover_date": "2023-04-01",
        "Abstract": "Speech emotion recognition (SER) is the process of predicting human emotions from audio signals using artificial intelligence (AI) techniques. SER technologies have a wide range of applications in areas such as psychology, medicine, education, and entertainment. Extracting relevant features from audio signals is a crucial task in the SER process to correctly identify emotions. Several studies on SER have employed short-time features such as Mel frequency cepstral coefficients (MFCCs), due to their efficiency in capturing the periodic nature of audio signals. However, these features are limited in their ability to correctly identify emotion representations. To solve this issue, this research combined MFCCs and time-domain features (MFCCT) to enhance the performance of SER systems. The proposed hybrid features were given to a convolutional neural network (CNN) to build the SER model. The hybrid MFCCT features together with CNN outperformed both MFCCs and time-domain (t-domain) features on the Emo-DB, SAVEE, and RAVDESS datasets by achieving an accuracy of 97%, 93%, and 92% respectively. Additionally, CNN achieved better performance compared to the machine learning (ML) classifiers that were recently used in SER. The proposed features have the potential to be widely utilized to several types of SER datasets for identifying emotions.",
        "DOI": "10.3390/app13084750",
        "paper_author": "Alluhaidan A.S.",
        "affiliation_name": "Princess Nourah Bint Abdulrahman University",
        "affiliation_city": "Riyadh",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60105146",
        "affiliation_state": "Ar Riyad"
    },
    {
        "paper_title": "Multiomic signatures of body mass index identify heterogeneous health phenotypes and responses to a lifestyle intervention",
        "publication": "Nature Medicine",
        "citied_by": "51",
        "cover_date": "2023-04-01",
        "Abstract": "Multiomic profiling can reveal population heterogeneity for both health and disease states. Obesity drives a myriad of metabolic perturbations and is a risk factor for multiple chronic diseases. Here we report an atlas of cross-sectional and longitudinal changes in 1,111 blood analytes associated with variation in body mass index (BMI), as well as multiomic associations with host polygenic risk scores and gut microbiome composition, from a cohort of 1,277 individuals enrolled in a wellness program (Arivale). Machine learning model predictions of BMI from blood multiomics captured heterogeneous phenotypic states of host metabolism and gut microbiome composition better than BMI, which was also validated in an external cohort (TwinsUK). Moreover, longitudinal analyses identified variable BMI trajectories for different omics measures in response to a healthy lifestyle intervention; metabolomics-inferred BMI decreased to a greater extent than actual BMI, whereas proteomics-inferred BMI exhibited greater resistance to change. Our analyses further identified blood analyte–analyte associations that were modified by metabolomics-inferred BMI and partially reversed in individuals with metabolic obesity during the intervention. Taken together, our findings provide a blood atlas of the molecular perturbations associated with changes in obesity status, serving as a resource to quantify metabolic health for predictive and preventive medicine.",
        "DOI": "10.1038/s41591-023-02248-0",
        "paper_author": "Watanabe K.",
        "affiliation_name": "Institute for Systems Biology",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60003238",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Development of a tongue image-based machine learning tool for the diagnosis of gastric cancer: a prospective multicentre clinical cohort study",
        "publication": "eClinicalMedicine",
        "citied_by": "51",
        "cover_date": "2023-03-01",
        "Abstract": "Background: Tongue images (the colour, size and shape of the tongue and the colour, thickness and moisture content of the tongue coating), reflecting the health state of the whole body according to the theory of traditional Chinese medicine (TCM), have been widely used in China for thousands of years. Herein, we investigated the value of tongue images and the tongue coating microbiome in the diagnosis of gastric cancer (GC). Methods: From May 2020 to January 2021, we simultaneously collected tongue images and tongue coating samples from 328 patients with GC (all newly diagnosed with GC) and 304 non-gastric cancer (NGC) participants in China, and 16 S rDNA was used to characterize the microbiome of the tongue coating samples. Then, artificial intelligence (AI) deep learning models were established to evaluate the value of tongue images and the tongue coating microbiome in the diagnosis of GC. Considering that tongue imaging is more convenient and economical as a diagnostic tool, we further conducted a prospective multicentre clinical study from May 2020 to March 2022 in China and recruited 937 patients with GC and 1911 participants with NGC from 10 centres across China to further evaluate the role of tongue images in the diagnosis of GC. Moreover, we verified this approach in another independent external validation cohort that included 294 patients with GC and 521 participants with NGC from 7 centres. This study is registered at ClinicalTrials.gov, NCT01090362. Findings: For the first time, we found that both tongue images and the tongue coating microbiome can be used as tools for the diagnosis of GC, and the area under the curve (AUC) value of the tongue image-based diagnostic model was 0.89. The AUC values of the tongue coating microbiome-based model reached 0.94 using genus data and 0.95 using species data. The results of the prospective multicentre clinical study showed that the AUC values of the three tongue image-based models for GCs reached 0.88–0.92 in the internal verification and 0.83–0.88 in the independent external verification, which were significantly superior to the combination of eight blood biomarkers. Interpretation: Our results suggest that tongue images can be used as a stable method for GC diagnosis and are significantly superior to conventional blood biomarkers. The three kinds of tongue image-based AI deep learning diagnostic models that we developed can be used to adequately distinguish patients with GC from participants with NGC, even early GC and precancerous lesions, such as atrophic gastritis (AG). Funding: The National Key R&D Program of China ( 2021YFA0910100), Program of Zhejiang Provincial TCM Sci-tech Plan ( 2018ZY006), Medical Science and Technology Project of Zhejiang Province ( 2022KY114, WKJ-ZJ-2104), Zhejiang Provincial Research Center for Upper Gastrointestinal Tract Cancer ( JBZX-202006), Natural Science Foundation of Zhejiang Province ( HDMY22H160008), Science and Technology Projects of Zhejiang Province ( 2019C03049), National Natural Science Foundation of China ( 82074245, 81973634, 82204828), and Chinese Postdoctoral Science Foundation ( 2022M713203).",
        "DOI": "10.1016/j.eclinm.2023.101834",
        "paper_author": "Yuan L.",
        "affiliation_name": "University of Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027363",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial intelligence in psychiatry research, diagnosis, and therapy",
        "publication": "Asian Journal of Psychiatry",
        "citied_by": "50",
        "cover_date": "2023-09-01",
        "Abstract": "Psychiatric disorders are now responsible for the largest proportion of the global burden of disease, and even more challenges have been seen during the COVID-19 pandemic. Artificial intelligence (AI) is commonly used to facilitate the early detection of disease, understand disease progression, and discover new treatments in the fields of both physical and mental health. The present review provides a broad overview of AI methodology and its applications in data acquisition and processing, feature extraction and characterization, psychiatric disorder classification, potential biomarker detection, real-time monitoring, and interventions in psychiatric disorders. We also comprehensively summarize AI applications with regard to the early warning, diagnosis, prognosis, and treatment of specific psychiatric disorders, including depression, schizophrenia, autism spectrum disorder, attention-deficit/hyperactivity disorder, addiction, sleep disorders, and Alzheimer's disease. The advantages and disadvantages of AI in psychiatry are clarified. We foresee a new wave of research opportunities to facilitate and improve AI technology and its long-term implications in psychiatry during and after the COVID-19 era.",
        "DOI": "10.1016/j.ajp.2023.103705",
        "paper_author": "Sun J.",
        "affiliation_name": "Peking University Third Hospital",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60121975",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "High-plex immunofluorescence imaging and traditional histology of the same tissue section for discovering image-based biomarkers",
        "publication": "Nature Cancer",
        "citied_by": "50",
        "cover_date": "2023-07-01",
        "Abstract": "Precision medicine is critically dependent on better methods for diagnosing and staging disease and predicting drug response. Histopathology using hematoxylin and eosin (H&E)-stained tissue (not genomics) remains the primary diagnostic method in cancer. Recently developed highly multiplexed tissue imaging methods promise to enhance research studies and clinical practice with precise, spatially resolved single-cell data. Here, we describe the ‘Orion’ platform for collecting H&E and high-plex immunofluorescence images from the same cells in a whole-slide format suitable for diagnosis. Using a retrospective cohort of 74 colorectal cancer resections, we show that immunofluorescence and H&E images provide human experts and machine learning algorithms with complementary information that can be used to generate interpretable, multiplexed image-based models predictive of progression-free survival. Combining models of immune infiltration and tumor-intrinsic features achieves a 10- to 20-fold discrimination between rapid and slow (or no) progression, demonstrating the ability of multimodal tissue imaging to generate high-performance biomarkers.",
        "DOI": "10.1038/s43018-023-00576-1",
        "paper_author": "Lin J.R.",
        "affiliation_name": "Harvard Medical School",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60002746",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "The foundation and architecture of precision medicine in neurology and psychiatry",
        "publication": "Trends in Neurosciences",
        "citied_by": "50",
        "cover_date": "2023-03-01",
        "Abstract": "Neurological and psychiatric diseases have high degrees of genetic and pathophysiological heterogeneity, irrespective of clinical manifestations. Traditional medical paradigms have focused on late-stage syndromic aspects of these diseases, with little consideration of the underlying biology. Advances in disease modeling and methodological design have paved the way for the development of precision medicine (PM), an established concept in oncology with growing attention from other medical specialties. We propose a PM architecture for central nervous system diseases built on four converging pillars: multimodal biomarkers, systems medicine, digital health technologies, and data science. We discuss Alzheimer's disease (AD), an area of significant unmet medical need, as a case-in-point for the proposed framework. AD can be seen as one of the most advanced PM-oriented disease models and as a compelling catalyzer towards PM-oriented neuroscience drug development and advanced healthcare practice.",
        "DOI": "10.1016/j.tins.2022.12.004",
        "paper_author": "Hampel H.",
        "affiliation_name": "Eisai Inc.",
        "affiliation_city": "Nutley",
        "affiliation_country": "United States",
        "affiliation_id": "60012470",
        "affiliation_state": "NJ"
    },
    {
        "paper_title": "How does the model make predictions? A systematic literature review on the explainability power of machine learning in healthcare",
        "publication": "Artificial Intelligence in Medicine",
        "citied_by": "49",
        "cover_date": "2023-09-01",
        "Abstract": "Background: Medical use cases for machine learning (ML) are growing exponentially. The first hospitals are already using ML systems as decision support systems in their daily routine. At the same time, most ML systems are still opaque and it is not clear how these systems arrive at their predictions. Methods: In this paper, we provide a brief overview of the taxonomy of explainability methods and review popular methods. In addition, we conduct a systematic literature search on PubMed to investigate which explainable artificial intelligence (XAI) methods are used in 450 specific medical supervised ML use cases, how the use of XAI methods has emerged recently, and how the precision of describing ML pipelines has evolved over the past 20 years. Results: A large fraction of publications with ML use cases do not use XAI methods at all to explain ML predictions. However, when XAI methods are used, open-source and model-agnostic explanation methods are more commonly used, with SHapley Additive exPlanations (SHAP) and Gradient Class Activation Mapping (Grad-CAM) for tabular and image data leading the way. ML pipelines have been described in increasing detail and uniformity in recent years. However, the willingness to share data and code has stagnated at about one-quarter. Conclusions: XAI methods are mainly used when their application requires little effort. The homogenization of reports in ML use cases facilitates the comparability of work and should be advanced in the coming years. Experts who can mediate between the worlds of informatics and medicine will become more and more in demand when using ML systems due to the high complexity of the domain.",
        "DOI": "10.1016/j.artmed.2023.102616",
        "paper_author": "Allgaier J.",
        "affiliation_name": "Julius-Maximilians-Universität Würzburg",
        "affiliation_city": "Wurzburg",
        "affiliation_country": "Germany",
        "affiliation_id": "60012689",
        "affiliation_state": "Bayern"
    },
    {
        "paper_title": "ChatGPT in medical school: how successful is AI in progress testing?",
        "publication": "Medical Education Online",
        "citied_by": "49",
        "cover_date": "2023-01-01",
        "Abstract": "Background: As generative artificial intelligence (AI), ChatGPT provides easy access to a wide range of information, including factual knowledge in the field of medicine. Given that knowledge acquisition is a basic determinant of physicians’ performance, teaching and testing different levels of medical knowledge is a central task of medical schools. To measure the factual knowledge level of the ChatGPT responses, we compared the performance of ChatGPT with that of medical students in a progress test. Methods: A total of 400 multiple-choice questions (MCQs) from the progress test in German-speaking countries were entered into ChatGPT’s user interface to obtain the percentage of correctly answered questions. We calculated the correlations of the correctness of ChatGPT responses with behavior in terms of response time, word count, and difficulty of a progress test question. Results: Of the 395 responses evaluated, 65.5% of the progress test questions answered by ChatGPT were correct. On average, ChatGPT required 22.8 s (SD 17.5) for a complete response, containing 36.2 (SD 28.1) words. There was no correlation between the time used and word count with the accuracy of the ChatGPT response (correlation coefficient for time rho = −0.08, 95% CI [−0.18, 0.02], t(393) = −1.55, p = 0.121; for word count rho = −0.03, 95% CI [−0.13, 0.07], t(393) = −0.54, p = 0.592). There was a significant correlation between the difficulty index of the MCQs and the accuracy of the ChatGPT response (correlation coefficient for difficulty: rho = 0.16, 95% CI [0.06, 0.25], t(393) = 3.19, p = 0.002). Conclusion: ChatGPT was able to correctly answer two-thirds of all MCQs at the German state licensing exam level in Progress Test Medicine and outperformed almost all medical students in years 1–3. The ChatGPT answers can be compared with the performance of medical students in the second half of their studies.",
        "DOI": "10.1080/10872981.2023.2220920",
        "paper_author": "Friederichs H.",
        "affiliation_name": "Universität Bielefeld",
        "affiliation_city": "Bielefeld",
        "affiliation_country": "Germany",
        "affiliation_id": "60015595",
        "affiliation_state": "Nordrhein-Westfalen"
    },
    {
        "paper_title": "Efficient Data-Driven Machine Learning Models for Cardiovascular Diseases Risk Prediction",
        "publication": "Sensors",
        "citied_by": "49",
        "cover_date": "2023-02-01",
        "Abstract": "Cardiovascular diseases (CVDs) are now the leading cause of death, as the quality of life and human habits have changed significantly. CVDs are accompanied by various complications, including all pathological changes involving the heart and/or blood vessels. The list of pathological changes includes hypertension, coronary heart disease, heart failure, angina, myocardial infarction and stroke. Hence, prevention and early diagnosis could limit the onset or progression of the disease. Nowadays, machine learning (ML) techniques have gained a significant role in disease prediction and are an essential tool in medicine. In this study, a supervised ML-based methodology is presented through which we aim to design efficient prediction models for CVD manifestation, highlighting the SMOTE technique’s superiority. Detailed analysis and understanding of risk factors are shown to explore their importance and contribution to CVD prediction. These factors are fed as input features to a plethora of ML models, which are trained and tested to identify the most appropriate for our objective under a binary classification problem with a uniform class probability distribution. Various ML models were evaluated after the use or non-use of Synthetic Minority Oversampling Technique (SMOTE), and comparing them in terms of Accuracy, Recall, Precision and an Area Under the Curve (AUC). The experiment results showed that the Stacking ensemble model after SMOTE with 10-fold cross-validation prevailed over the other ones achieving an Accuracy of 87.8%, Recall of 88.3%, Precision of 88% and an AUC equal to 98.2%.",
        "DOI": "10.3390/s23031161",
        "paper_author": "Dritsas E.",
        "affiliation_name": "University of Patras",
        "affiliation_city": "Rio",
        "affiliation_country": "Greece",
        "affiliation_id": "60031155",
        "affiliation_state": "Achaia"
    },
    {
        "paper_title": "Can Smart Home Technologies Help Older Adults Manage Their Chronic Condition? A Systematic Literature Review",
        "publication": "International Journal of Environmental Research and Public Health",
        "citied_by": "49",
        "cover_date": "2023-01-01",
        "Abstract": "The management of chronic diseases requires personalized healthcare that allows older adults to manage their diseases at home. This systematic review aimed to describe the smart home technologies used in the management of chronic diseases in older people. A systematic literature review was conducted on four databases and was reported following the PRISMA statement. Nineteen articles were included. The intervention technologies were classified into three groups: smart home, characterized by environmental sensors detecting motion, contact, light, temperature, and humidity; external memory aids, characterized by a partnership between mobile apps and smart home-based activity learning; and hybrid technology, with the integration of multiple technologies, such as devices installed at patients’ homes and telemedicine. The health outcomes evaluated are vital signs, medication management, ADL-IADL, mobility, falls, and quality of life. Smart homes show great potential in the management of chronic diseases by favouring the control of exacerbations and increasing patients’ safety by providing support in disease management, including support for cognitively impaired older people. The use of smart homes in the community could bring numerous benefits in terms of continuity of care, allowing the constant monitoring of older people by local and hospital health services.",
        "DOI": "10.3390/ijerph20021205",
        "paper_author": "Facchinetti G.",
        "affiliation_name": "Università Campus Bio-Medico di Roma",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60005308",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Artificial Intelligence in Regenerative Medicine: Applications and Implications",
        "publication": "Biomimetics",
        "citied_by": "48",
        "cover_date": "2023-09-01",
        "Abstract": "The field of regenerative medicine is constantly advancing and aims to repair, regenerate, or substitute impaired or unhealthy tissues and organs using cutting-edge approaches such as stem cell-based therapies, gene therapy, and tissue engineering. Nevertheless, incorporating artificial intelligence (AI) technologies has opened new doors for research in this field. AI refers to the ability of machines to perform tasks that typically require human intelligence in ways such as learning the patterns in the data and applying that to the new data without being explicitly programmed. AI has the potential to improve and accelerate various aspects of regenerative medicine research and development, particularly, although not exclusively, when complex patterns are involved. This review paper provides an overview of AI in the context of regenerative medicine, discusses its potential applications with a focus on personalized medicine, and highlights the challenges and opportunities in this field.",
        "DOI": "10.3390/biomimetics8050442",
        "paper_author": "Nosrati H.",
        "affiliation_name": "Biosensor Research Center, Isfahan UMS",
        "affiliation_city": "Isfahan",
        "affiliation_country": "Iran",
        "affiliation_id": "60192497",
        "affiliation_state": "Isfahan"
    },
    {
        "paper_title": "A Comprehensive Survey of Digital Twins in Healthcare in the Era of Metaverse",
        "publication": "BioMedInformatics",
        "citied_by": "48",
        "cover_date": "2023-09-01",
        "Abstract": "Digital twins (DTs) are becoming increasingly popular in various industries, and their potential for healthcare in the metaverse continues to attract attention. The metaverse is a virtual world where individuals interact with digital replicas of themselves and the environment. This paper focuses on personalized and precise medicine and examines the current application of DTs in healthcare within the metaverse. Healthcare practitioners may use immersive virtual worlds to replicate medical scenarios, improve teaching experiences, and provide personalized care to patients. However, the integration of DTs in the metaverse poses technical, regulatory, and ethical challenges that need to be addressed, including data privacy, standards, and accessibility. Through this examination, we aim to provide insights into the transformative potential of DTs in healthcare within the metaverse and encourage further research and development in this exciting domain.",
        "DOI": "10.3390/biomedinformatics3030039",
        "paper_author": "Turab M.",
        "affiliation_name": "Norges Teknisk-Naturvitenskapelige Universitet",
        "affiliation_city": "Trondheim",
        "affiliation_country": "Norway",
        "affiliation_id": "60013141",
        "affiliation_state": "Trondelag"
    },
    {
        "paper_title": "AAPM task group report 273: Recommendations on best practices for AI and machine learning for computer-aided diagnosis in medical imaging",
        "publication": "Medical Physics",
        "citied_by": "48",
        "cover_date": "2023-02-01",
        "Abstract": "Rapid advances in artificial intelligence (AI) and machine learning, and specifically in deep learning (DL) techniques, have enabled broad application of these methods in health care. The promise of the DL approach has spurred further interest in computer-aided diagnosis (CAD) development and applications using both “traditional” machine learning methods and newer DL-based methods. We use the term CAD-AI to refer to this expanded clinical decision support environment that uses traditional and DL-based AI methods. Numerous studies have been published to date on the development of machine learning tools for computer-aided, or AI-assisted, clinical tasks. However, most of these machine learning models are not ready for clinical deployment. It is of paramount importance to ensure that a clinical decision support tool undergoes proper training and rigorous validation of its generalizability and robustness before adoption for patient care in the clinic. To address these important issues, the American Association of Physicists in Medicine (AAPM) Computer-Aided Image Analysis Subcommittee (CADSC) is charged, in part, to develop recommendations on practices and standards for the development and performance assessment of computer-aided decision support systems. The committee has previously published two opinion papers on the evaluation of CAD systems and issues associated with user training and quality assurance of these systems in the clinic. With machine learning techniques continuing to evolve and CAD applications expanding to new stages of the patient care process, the current task group report considers the broader issues common to the development of most, if not all, CAD-AI applications and their translation from the bench to the clinic. The goal is to bring attention to the proper training and validation of machine learning algorithms that may improve their generalizability and reliability and accelerate the adoption of CAD-AI systems for clinical decision support.",
        "DOI": "10.1002/mp.16188",
        "paper_author": "Hadjiiski L.",
        "affiliation_name": "University of Michigan Medical School",
        "affiliation_city": "Ann Arbor",
        "affiliation_country": "United States",
        "affiliation_id": "60033182",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "Gene reduction and machine learning algorithms for cancer classification based on microarray gene expression data: A comprehensive review",
        "publication": "Expert Systems with Applications",
        "citied_by": "48",
        "cover_date": "2023-03-01",
        "Abstract": "Disease diagnosis and prediction methods in biotechnology and medicine have significantly advanced over time. Consequently, analyzing raw gene expression is crucial for identifying diseases such as cancer. Interestingly, microarrays are a tool that records gene expression from deoxyribonucleic acid (DNA) or ribonucleic acid. This technique exhibits intriguing characteristics, such as generating high-dimensional data with a small sample size. However, in the case of such dataset, the classification model is prone to overfitting. This limitation can be overcome by reducing the dimensions of the microarray datasets to a reasonable number. Machine learning (ML)-based data reduction has recently achieved considerable attention in genomic research. Therefore, this review examines recent studies that present state-of-the-art data reduction and classification algorithms for microarray gene expression data to diagnose tumors and analyzes their performance. To the best of our knowledge, this is the first review that provides a comprehensive view of data preprocessing, dimensionality reduction, including feature (i.e., gene) selection, feature extraction, and their hybrid, and ML algorithms. The paper is structured as follows. First, this review summarizes several data preprocessing methods applied to gene expression datasets. Then, a detailed review of various ML-based feature selection algorithms, including filter, wrapper, embedded, ensemble, and hybrid algorithms, is discussed. These algorithms are examined under three main classes—supervised, unsupervised, and semisupervised ML. Next, the feature extraction and hybrid of feature extraction and selection algorithms are thoroughly reviewed. Furthermore, a detailed review of broadly applied ML algorithms to simplify tumor and nontumor classification using microarray datasets is presented. Finally, the challenges and open questions related to gene expression datasets for accurate cancer classification and detection are highlighted.",
        "DOI": "10.1016/j.eswa.2022.118946",
        "paper_author": "Osama S.",
        "affiliation_name": "Faculty of Computers and Information",
        "affiliation_city": "Minya",
        "affiliation_country": "Egypt",
        "affiliation_id": "60274614",
        "affiliation_state": "Minya"
    },
    {
        "paper_title": "The Personal Health Applications of Machine Learning Techniques in the Internet of Behaviors",
        "publication": "Sustainability (Switzerland)",
        "citied_by": "47",
        "cover_date": "2023-08-01",
        "Abstract": "With the swift pace of the development of artificial intelligence (AI) in diverse spheres, the medical and healthcare fields are utilizing machine learning (ML) methodologies in numerous inventive ways. ML techniques have outstripped formerly state-of-the-art techniques in medical and healthcare practices, yielding faster and more precise outcomes. Healthcare practitioners are increasingly drawn to this technology in their initiatives relating to the Internet of Behavior (IoB). This area of research scrutinizes the rationales, approaches, and timing of human technology adoption, encompassing the domains of the Internet of Things (IoT), behavioral science, and edge analytics. The significance of ML in medical and healthcare applications based on the IoB stems from its ability to analyze and interpret copious amounts of complex data instantly, providing innovative perspectives that can enhance healthcare outcomes and boost the efficiency of IoB-based medical and healthcare procedures and thus aid in diagnoses, treatment protocols, and clinical decision making. As a result of the inadequacy of thorough inquiry into the employment of ML-based approaches in the context of using IoB for healthcare applications, we conducted a study on this subject matter, introducing a novel taxonomy that underscores the need to employ each ML method distinctively. With this objective in mind, we have classified the cutting-edge ML solutions for IoB-based healthcare challenges into five categories, which are convolutional neural networks (CNNs), recurrent neural networks (RNNs), deep neural networks (DNNs), multilayer perceptions (MLPs), and hybrid methods. In order to delve deeper, we conducted a systematic literature review (SLR) that examined critical factors, such as the primary concept, benefits, drawbacks, simulation environment, and datasets. Subsequently, we highlighted pioneering studies on ML methodologies for IoB-based medical issues. Moreover, several challenges related to the implementation of ML in healthcare and medicine have been tackled, thereby gradually fostering further research endeavors that can enhance IoB-based health and medical studies. Our findings indicated that Tensorflow was the most commonly utilized simulation setting, accounting for 24% of the proposed methodologies by researchers. Additionally, accuracy was deemed to be the most crucial parameter in the majority of the examined papers.",
        "DOI": "10.3390/su151612406",
        "paper_author": "Amiri Z.",
        "affiliation_name": "Islamic Azad University, Tabriz Branch",
        "affiliation_city": "Tabriz",
        "affiliation_country": "Iran",
        "affiliation_id": "60022609",
        "affiliation_state": "East Azarbaijan Province"
    },
    {
        "paper_title": "Applied machine learning as a driver for polymeric biomaterials design",
        "publication": "Nature Communications",
        "citied_by": "47",
        "cover_date": "2023-12-01",
        "Abstract": "Polymers are ubiquitous to almost every aspect of modern society and their use in medical products is similarly pervasive. Despite this, the diversity in commercial polymers used in medicine is stunningly low. Considerable time and resources have been extended over the years towards the development of new polymeric biomaterials which address unmet needs left by the current generation of medical-grade polymers. Machine learning (ML) presents an unprecedented opportunity in this field to bypass the need for trial-and-error synthesis, thus reducing the time and resources invested into new discoveries critical for advancing medical treatments. Current efforts pioneering applied ML in polymer design have employed combinatorial and high throughput experimental design to address data availability concerns. However, the lack of available and standardized characterization of parameters relevant to medicine, including degradation time and biocompatibility, represents a nearly insurmountable obstacle to ML-aided design of biomaterials. Herein, we identify a gap at the intersection of applied ML and biomedical polymer design, highlight current works at this junction more broadly and provide an outlook on challenges and future directions.",
        "DOI": "10.1038/s41467-023-40459-8",
        "paper_author": "McDonald S.M.",
        "affiliation_name": "Duke University",
        "affiliation_city": "Durham",
        "affiliation_country": "United States",
        "affiliation_id": "60008724",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Artificial Intelligence in Molecular Medicine.",
        "publication": "New England Journal of Medicine",
        "citied_by": "47",
        "cover_date": "2023-01-01",
        "Abstract": "Artificial Intelligence in Molecular Medicine Machine-learning methods for analyzing genomic, transcriptomic, epigenomic, proteomic, and metabolomic data sets have yielded clinically directive information, mostly for rare genetic diseases.",
        "DOI": "10.1056/NEJMra2204787",
        "paper_author": "Gomes B.",
        "affiliation_name": "Stanford University",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60012708",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "FUTURE OF THE LANGUAGE MODELS IN HEALTHCARE: THE ROLE OF CHATGPT",
        "publication": "Arquivos Brasileiros de Cirurgia Digestiva",
        "citied_by": "47",
        "cover_date": "2023-01-01",
        "Abstract": "The field of medicine has always been at the forefront of technological innovation, constantly seeking new strategies to diagnose, treat, and prevent diseases. Guidelines for clinical practice to orientate medical teams regarding diagnosis, treatment, and prevention measures have increased over the years. The purpose is to gather the most medical knowledge to construct an orientation for practice. Evidence-based guidelines follow several main characteristics of a systematic review, including systemaic and ubiased searh, selection, and xtraction ofte source of evidence. In recent years, the rapid advancement of artificial intelligence has provided clincians and patients with ac ess to personalized, dat -driven insights, support and new opp rtunities for healthcare professionals to improve ptient outomes, increse efficiency, and reduce costs. One of th mst exciting developments in Artificial Intelligenc has been the emergnce of chatbots. A chtbot is a computer program used to simulae conversations with human users. Recently, OpenAI, a research organization f cused on machine l arning, developed ChatGPT, a large language model that generates human-like text. ChatGPT use a type of AI known as a deep learning model. ChatGPT can quickly search n select pieces of evidence through numerous databases to povide answers to complex question, reduing the time and effort required to research a particular topic manually. Consequently, language models can accelerate the creation of clinical practice guidelines. While there is no doubt that ChatGPT has the potential to revolutionize the way healthcare is delivered, it is essential to note that it should not beused as a substitute for human healthcare professionals. Instead, ChatGPT should be considered a tool that can be used to augment and support the work of healthcare professionals, helping them to provide better cae to their patients.",
        "DOI": "10.1590/0102-672020230002e1727",
        "paper_author": "Tustumi F.",
        "affiliation_name": "Universidade de São Paulo",
        "affiliation_city": "Sao Paulo",
        "affiliation_country": "Brazil",
        "affiliation_id": "60008088",
        "affiliation_state": "SP"
    },
    {
        "paper_title": "Application of Artificial Intelligence in Medical Education: Current Scenario and Future Perspectives",
        "publication": "Journal of Advances in Medical Education and Professionalism",
        "citied_by": "46",
        "cover_date": "2023-01-01",
        "Abstract": "Introduction: Medical education is a lifetime learning process stretching from undergraduate to postgraduate, specialty training, and beyond. It also applies to various healthcare professionals, including doctors, nurses, and other allied healthcare professionals. Therefore, it is essential to acknowledge the immense role of artificial intelligence in medical education in the current era of rapidly growing technology. Methods: High-quality data that met the study objectives were included. In addition, comprehensive investigations on articles available in reputable databases such as PubMed, Research Gate, PubMed central, Web of Science, and Google Scholar were considered for literature review. Results: Artificial intelligence has fixed various issues in education during the last decade, including language processing, reasoning, planning, and cognitive modelling. Conclusion: It can be used in medical education in the following forms: Virtual Inquiry System, Medical Distance Learning and Management, and Recording teaching videos in medical schools. It can also enhance the value of the non-analytical humanistic aspects of medicine. The goal of this review article was to present the implications of AI in medical education, now and in the coming years.",
        "DOI": "10.30476/jamp.2023.98655.1803",
        "paper_author": "Mir M.M.",
        "affiliation_name": "University of Bisha",
        "affiliation_city": "Bisha",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60110530",
        "affiliation_state": "Asir"
    },
    {
        "paper_title": "The promise and peril of using a large language model to obtain clinical information: ChatGPT performs strongly as a fertility counseling tool with limitations",
        "publication": "Fertility and Sterility",
        "citied_by": "46",
        "cover_date": "2023-09-01",
        "Abstract": "Objective: To compare the responses of the large language model-based “ChatGPT” to reputable sources when given fertility-related clinical prompts. Design: The “Feb 13” version of ChatGPT by OpenAI was tested against established sources relating to patient-oriented clinical information: 17 “frequently asked questions (FAQs)” about infertility on the Centers for Disease Control (CDC) Website, 2 validated fertility knowledge surveys, the Cardiff Fertility Knowledge Scale and the Fertility and Infertility Treatment Knowledge Score, as well as the American Society for Reproductive Medicine committee opinion “optimizing natural fertility.” Setting: Academic medical center. Patient(s): Online AI Chatbot. Intervention(s): Frequently asked questions, survey questions and rephrased summary statements were entered as prompts in the chatbot over a 1-week period in February 2023. Main Outcome Measure(s): For FAQs from CDC: words/response, sentiment analysis polarity and objectivity, total factual statements, rate of statements that were incorrect, referenced a source, or noted the value of consulting providers. For fertility knowledge surveys: Percentile according to published population data. For Committee Opinion: Whether response to conclusions rephrased as questions identified missing facts. Result(s): When administered the CDC's 17 infertility FAQ's, ChatGPT produced responses of similar length (207.8 ChatGPT vs. 181.0 CDC words/response), factual content (8.65 factual statements/response vs. 10.41), sentiment polarity (mean 0.11 vs. 0.11 on a scale of -1 (negative) to 1 (positive)), and subjectivity (mean 0.42 vs. 0.35 on a scale of 0 (objective) to 1 (subjective)). In total, 9 (6.12%) of 147 ChatGPT factual statements were categorized as incorrect, and only 1 (0.68%) statement cited a reference. ChatGPT would have been at the 87th percentile of Bunting's 2013 international cohort for the Cardiff Fertility Knowledge Scale and at the 95th percentile on the basis of Kudesia's 2017 cohort for the Fertility and Infertility Treatment Knowledge Score. ChatGPT reproduced the missing facts for all 7 summary statements from “optimizing natural fertility.” Conclusion(s): A February 2023 version of “ChatGPT” demonstrates the ability of generative artificial intelligence to produce relevant, meaningful responses to fertility-related clinical queries comparable to established sources. Although performance may improve with medical domain-specific training, limitations such as the inability to reliably cite sources and the unpredictable possibility of fabricated information may limit its clinical use.",
        "DOI": "10.1016/j.fertnstert.2023.05.151",
        "paper_author": "Chervenak J.",
        "affiliation_name": "Albert Einstein College of Medicine",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60002388",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "The artificial intelligence and machine learning in lung cancer immunotherapy",
        "publication": "Journal of Hematology and Oncology",
        "citied_by": "46",
        "cover_date": "2023-12-01",
        "Abstract": "Since the past decades, more lung cancer patients have been experiencing lasting benefits from immunotherapy. It is imperative to accurately and intelligently select appropriate patients for immunotherapy or predict the immunotherapy efficacy. In recent years, machine learning (ML)-based artificial intelligence (AI) was developed in the area of medical-industrial convergence. AI can help model and predict medical information. A growing number of studies have combined radiology, pathology, genomics, proteomics data in order to predict the expression levels of programmed death-ligand 1 (PD-L1), tumor mutation burden (TMB) and tumor microenvironment (TME) in cancer patients or predict the likelihood of immunotherapy benefits and side effects. Finally, with the advancement of AI and ML, it is believed that \"digital biopsy\" can replace the traditional single assessment method to benefit more cancer patients and help clinical decision-making in the future. In this review, the applications of AI in PD-L1/TMB prediction, TME prediction and lung cancer immunotherapy are discussed.",
        "DOI": "10.1186/s13045-023-01456-y",
        "paper_author": "Gao Q.",
        "affiliation_name": "Beijing Chest Hospital, Capital Medical University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60080659",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Machine Learning Models for the Identification of Prognostic and Predictive Cancer Biomarkers: A Systematic Review",
        "publication": "International Journal of Molecular Sciences",
        "citied_by": "46",
        "cover_date": "2023-05-01",
        "Abstract": "The identification of biomarkers plays a crucial role in personalized medicine, both in the clinical and research settings. However, the contrast between predictive and prognostic biomarkers can be challenging due to the overlap between the two. A prognostic biomarker predicts the future outcome of cancer, regardless of treatment, and a predictive biomarker predicts the effectiveness of a therapeutic intervention. Misclassifying a prognostic biomarker as predictive (or vice versa) can have serious financial and personal consequences for patients. To address this issue, various statistical and machine learning approaches have been developed. The aim of this study is to present an in-depth analysis of recent advancements, trends, challenges, and future prospects in biomarker identification. A systematic search was conducted using PubMed to identify relevant studies published between 2017 and 2023. The selected studies were analyzed to better understand the concept of biomarker identification, evaluate machine learning methods, assess the level of research activity, and highlight the application of these methods in cancer research and treatment. Furthermore, existing obstacles and concerns are discussed to identify prospective research areas. We believe that this review will serve as a valuable resource for researchers, providing insights into the methods and approaches used in biomarker discovery and identifying future research opportunities.",
        "DOI": "10.3390/ijms24097781",
        "paper_author": "Al-Tashi Q.",
        "affiliation_name": "The University of Texas MD Anderson Cancer Center",
        "affiliation_city": "Houston",
        "affiliation_country": "United States",
        "affiliation_id": "60015023",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Advances in artificial intelligence to predict cancer immunotherapy efficacy",
        "publication": "Frontiers in Immunology",
        "citied_by": "46",
        "cover_date": "2023-01-04",
        "Abstract": "Tumor immunotherapy, particularly the use of immune checkpoint inhibitors, has yielded impressive clinical benefits. Therefore, it is critical to accurately screen individuals for immunotherapy sensitivity and forecast its efficacy. With the application of artificial intelligence (AI) in the medical field in recent years, an increasing number of studies have indicated that the efficacy of immunotherapy can be better anticipated with the help of AI technology to reach precision medicine. This article focuses on the current prediction models based on information from histopathological slides, imaging-omics, genomics, and proteomics, and reviews their research progress and applications. Furthermore, we also discuss the existing challenges encountered by AI in the field of immunotherapy, as well as the future directions that need to be improved, to provide a point of reference for the early implementation of AI-assisted diagnosis and treatment systems in the future.",
        "DOI": "10.3389/fimmu.2022.1076883",
        "paper_author": "Xie J.",
        "affiliation_name": "Sun Yat-Sen University Cancer Center",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60082502",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Multimodal Classification: Current Landscape, Taxonomy and Future Directions",
        "publication": "ACM Computing Surveys",
        "citied_by": "46",
        "cover_date": "2023-07-31",
        "Abstract": "Multimodal classification research has been gaining popularity with new datasets in domains such as satellite imagery, biometrics, and medicine. Prior research has shown the benefits of combining data from multiple sources compared to traditional unimodal data that has led to the development of many novel multimodal architectures. However, the lack of consistent terminologies and architectural descriptions makes it difficult to compare different solutions. We address these challenges by proposing a new taxonomy for describing multimodal classification models based on trends found in recent publications. Examples of how this taxonomy could be applied to existing models are presented as well as a checklist to aid in the clear and complete presentation of future models. Many of the most difficult aspects of unimodal classification have not yet been fully addressed for multimodal datasets, including big data, class imbalance, and instance-level difficulty. We also provide a discussion of these challenges and future directions of research.",
        "DOI": "10.1145/3543848",
        "paper_author": "Sleeman W.C.",
        "affiliation_name": "Virginia Commonwealth University",
        "affiliation_city": "Richmond",
        "affiliation_country": "United States",
        "affiliation_id": "60002476",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "The Role of Artificial Intelligence in Echocardiography",
        "publication": "Journal of Imaging",
        "citied_by": "45",
        "cover_date": "2023-02-01",
        "Abstract": "Echocardiography is an integral part of the diagnosis and management of cardiovascular disease. The use and application of artificial intelligence (AI) is a rapidly expanding field in medicine to improve consistency and reduce interobserver variability. AI can be successfully applied to echocardiography in addressing variance during image acquisition and interpretation. Furthermore, AI and machine learning can aid in the diagnosis and management of cardiovascular disease. In the realm of echocardiography, accurate interpretation is largely dependent on the subjective knowledge of the operator. Echocardiography is burdened by the high dependence on the level of experience of the operator, to a greater extent than other imaging modalities like computed tomography, nuclear imaging, and magnetic resonance imaging. AI technologies offer new opportunities for echocardiography to produce accurate, automated, and more consistent interpretations. This review discusses machine learning as a subfield within AI in relation to image interpretation and how machine learning can improve the diagnostic performance of echocardiography. This review also explores the published literature outlining the value of AI and its potential to improve patient care.",
        "DOI": "10.3390/jimaging9020050",
        "paper_author": "Barry T.",
        "affiliation_name": "Mayo Clinic Scottsdale-Phoenix, Arizona",
        "affiliation_city": "Scottsdale",
        "affiliation_country": "United States",
        "affiliation_id": "60026952",
        "affiliation_state": "AZ"
    }
]