[
    {
        "paper_title": "Lithium Batteries and the Solid Electrolyte Interphase (SEI)—Progress and Outlook",
        "publication": "Advanced Energy Materials",
        "citied_by": "293",
        "cover_date": "2023-03-10",
        "Abstract": "Interfacial dynamics within chemical systems such as electron and ion transport processes have relevance in the rational optimization of electrochemical energy storage materials and devices. Evolving the understanding of fundamental electrochemistry at interfaces would also help in the understanding of relevant phenomena in biological, microbial, pharmaceutical, electronic, and photonic systems. In lithium-ion batteries, the electrochemical instability of the electrolyte and its ensuing reactive decomposition proceeds at the anode surface within the Helmholtz double layer resulting in a buildup of the reductive products, forming the solid electrolyte interphase (SEI). This review summarizes relevant aspects of the SEI including formation, composition, dynamic structure, and reaction mechanisms, focusing primarily on the graphite anode with insights into the lithium metal anode. Furthermore, the influence of the electrolyte and electrode materials on SEI structure and properties is discussed. An update is also presented on state-of-the-art approaches to quantitatively characterize the structure and changing properties of the SEI. Lastly, a framework evaluating the standing problems and future research directions including feasible computational, machine learning, and experimental approaches are outlined.",
        "DOI": "10.1002/aenm.202203307",
        "paper_author": "Adenusi H.",
        "affiliation_name": "Hong Kong Quantum AI Lab Limited",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60276647",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Learning local equivariant representations for large-scale atomistic dynamics",
        "publication": "Nature Communications",
        "citied_by": "253",
        "cover_date": "2023-12-01",
        "Abstract": "A simultaneously accurate and computationally efficient parametrization of the potential energy surface of molecules and materials is a long-standing goal in the natural sciences. While atom-centered message passing neural networks (MPNNs) have shown remarkable accuracy, their information propagation has limited the accessible length-scales. Local methods, conversely, scale to large simulations but have suffered from inferior accuracy. This work introduces Allegro, a strictly local equivariant deep neural network interatomic potential architecture that simultaneously exhibits excellent accuracy and scalability. Allegro represents a many-body potential using iterated tensor products of learned equivariant representations without atom-centered message passing. Allegro obtains improvements over state-of-the-art methods on QM9 and revMD17. A single tensor product layer outperforms existing deep MPNNs and transformers on QM9. Furthermore, Allegro displays remarkable generalization to out-of-distribution data. Molecular simulations using Allegro recover structural and kinetic properties of an amorphous electrolyte in excellent agreement with ab-initio simulations. Finally, we demonstrate parallelization with a simulation of 100 million atoms.",
        "DOI": "10.1038/s41467-023-36329-y",
        "paper_author": "Musaelian A.",
        "affiliation_name": "Harvard University",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60009982",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "A review of hybrid renewable energy systems: Solar and wind-powered solutions: Challenges, opportunities, and policy implications",
        "publication": "Results in Engineering",
        "citied_by": "213",
        "cover_date": "2023-12-01",
        "Abstract": "The review comprehensively examines hybrid renewable energy systems that combine solar and wind energy technologies, focusing on their current challenges, opportunities, and policy implications. Despite the individual merits of solar and wind energy systems, their intermittent nature and geographical limitations have spurred interest in hybrid solutions that maximize efficiency and reliability through integrated systems. A critical analysis of available literature indicates that hybrid systems significantly mitigate energy intermittency issues, enhance grid stability, and can be more cost-effective due to shared infrastructure. The review identifies key challenges, such as system optimization, energy storage, and seamless power management, and discusses technological innovations like machine learning algorithms and advanced inverters that hold the potential for overcoming these hurdles. Importantly, the review elucidates the role of policy in accelerating the adoption of these systems by highlighting successful case studies of government incentives, public-private partnerships, and regulatory frameworks that have fostered investments in hybrid renewable energy systems. The study concludes with the outcomes obtained that signify the potential for hybrid renewable energy systems to not only meet but exceed future energy demands sustainably, provided there is concerted effort in research, investment, and policy-making.",
        "DOI": "10.1016/j.rineng.2023.101621",
        "paper_author": "Hassan Q.",
        "affiliation_name": "University Of Diyala",
        "affiliation_city": "Baqubah",
        "affiliation_country": "Iraq",
        "affiliation_id": "60104392",
        "affiliation_state": "Diyala Governorate"
    },
    {
        "paper_title": "The rise of self-driving labs in chemical and materials sciences",
        "publication": "Nature Synthesis",
        "citied_by": "186",
        "cover_date": "2023-06-01",
        "Abstract": "Accelerating the discovery of new molecules and materials, as well as developing green and sustainable ways to synthesize them, will help to address global challenges in energy, sustainability and healthcare. The recent growth of data science and automated experimentation techniques has resulted in the advent of self-driving labs (SDLs) via the integration of machine learning, lab automation and robotics. An SDL is a machine-learning-assisted modular experimental platform that iteratively operates a series of experiments selected by the machine learning algorithm to achieve a user-defined objective. These intelligent robotic assistants help researchers to accelerate the pace of fundamental and applied research through rapid exploration of the chemical space. In this Review, we introduce SDLs and provide a roadmap for their implementation by non-expert scientists. We present the status quo of successful SDL implementations in the field and discuss their current limitations and future opportunities to accelerate finding solutions for societal needs. [Figure not available: see fulltext.]",
        "DOI": "10.1038/s44160-022-00231-0",
        "paper_author": "Abolhasani M.",
        "affiliation_name": "NC State College of Engineering",
        "affiliation_city": "Raleigh",
        "affiliation_country": "United States",
        "affiliation_id": "60279548",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "CHGNet as a pretrained universal neural network potential for charge-informed atomistic modelling",
        "publication": "Nature Machine Intelligence",
        "citied_by": "184",
        "cover_date": "2023-09-01",
        "Abstract": "Large-scale simulations with complex electron interactions remain one of the greatest challenges for atomistic modelling. Although classical force fields often fail to describe the coupling between electronic states and ionic rearrangements, the more accurate ab initio molecular dynamics suffers from computational complexity that prevents long-time and large-scale simulations, which are essential to study technologically relevant phenomena. Here we present the Crystal Hamiltonian Graph Neural Network (CHGNet), a graph neural network-based machine-learning interatomic potential (MLIP) that models the universal potential energy surface. CHGNet is pretrained on the energies, forces, stresses and magnetic moments from the Materials Project Trajectory Dataset, which consists of over 10 years of density functional theory calculations of more than 1.5 million inorganic structures. The explicit inclusion of magnetic moments enables CHGNet to learn and accurately represent the orbital occupancy of electrons, enhancing its capability to describe both atomic and electronic degrees of freedom. We demonstrate several applications of CHGNet in solid-state materials, including charge-informed molecular dynamics in LixMnO2, the finite temperature phase diagram for LixFePO4 and Li diffusion in garnet conductors. We highlight the significance of charge information for capturing appropriate chemistry and provide insights into ionic systems with additional electronic degrees of freedom that cannot be observed by previous MLIPs.",
        "DOI": "10.1038/s42256-023-00716-3",
        "paper_author": "Deng B.",
        "affiliation_name": "Department of Materials Science and Engineering",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60121382",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Machine learning for a sustainable energy future",
        "publication": "Nature Reviews Materials",
        "citied_by": "178",
        "cover_date": "2023-03-01",
        "Abstract": "Transitioning from fossil fuels to renewable energy sources is a critical global challenge; it demands advances — at the materials, devices and systems levels — for the efficient harvesting, storage, conversion and management of renewable energy. Energy researchers have begun to incorporate machine learning (ML) techniques to accelerate these advances. In this Perspective, we highlight recent advances in ML-driven energy research, outline current and future challenges, and describe what is required to make the best use of ML techniques. We introduce a set of key performance indicators with which to compare the benefits of different ML-accelerated workflows for energy research. We discuss and evaluate the latest advances in applying ML to the development of energy harvesting (photovoltaics), storage (batteries), conversion (electrocatalysis) and management (smart grids). Finally, we offer an overview of potential research areas in the energy field that stand to benefit further from the application of ML.",
        "DOI": "10.1038/s41578-022-00490-5",
        "paper_author": "Yao Z.",
        "affiliation_name": "Shanghai Jiao Tong University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60025084",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "AI for life: Trends in artificial intelligence for biotechnology",
        "publication": "New Biotechnology",
        "citied_by": "177",
        "cover_date": "2023-05-25",
        "Abstract": "Due to popular successes (e.g., ChatGPT) Artificial Intelligence (AI) is on everyone's lips today. When advances in biotechnology are combined with advances in AI unprecedented new potential solutions become available. This can help with many global problems and contribute to important Sustainability Development Goals. Current examples include Food Security, Health and Well-being, Clean Water, Clean Energy, Responsible Consumption and Production, Climate Action, Life below Water, or protect, restore and promote sustainable use of terrestrial ecosystems, sustainably manage forests, combat desertification, and halt and reverse land degradation and halt biodiversity loss. AI is ubiquitous in the life sciences today. Topics include a wide range from machine learning and Big Data analytics, knowledge discovery and data mining, biomedical ontologies, knowledge-based reasoning, natural language processing, decision support and reasoning under uncertainty, temporal and spatial representation and inference, and methodological aspects of explainable AI (XAI) with applications of biotechnology. In this pre-Editorial paper, we provide an overview of open research issues and challenges for each of the topics addressed in this special issue. Potential authors can directly use this as a guideline for developing their paper.",
        "DOI": "10.1016/j.nbt.2023.02.001",
        "paper_author": "Holzinger A.",
        "affiliation_name": "BOKU University",
        "affiliation_city": "Vienna",
        "affiliation_country": "Austria",
        "affiliation_id": "60024895",
        "affiliation_state": "Vienna"
    },
    {
        "paper_title": "Response surface methodology (RSM) for optimizing engine performance and emissions fueled with biofuel: Review of RSM for sustainability energy transition",
        "publication": "Results in Engineering",
        "citied_by": "172",
        "cover_date": "2023-06-01",
        "Abstract": "Response Surface Methodology (RSM) is a statistical method to design experiments and optimize the effect of process variables. RSM is based on the principles of design of experiments or DOE. Design of experiments or DOE is a field of applied statistics that plans, conducts, analyses, and interprets controlled tests to assess factors that affect parameter values. Response surface methodology or RSM uses a statistical method for designing experiments and optimization. Despite the potential of response surface methodology to predict and optimize engine performance and emissions characteristics, a comprehensive review on RSM for biofuels, particularly for internal combustion engines (ICEs), is difficult to find. The review of response surface methodology is sometimes included together with other machine learning approaches such as ANN. Therefore, a review article that is exclusively written to address the specific of RSM for biofuel and ICE is required. This review article offers a fresh perspective on the application of RSM for biofuel in ICE. This article aims to critically review the RSM to optimize engine performance and emissions using biofuel. The study concludes with several possible research gaps for future works of RSM biofuel application. Although response surface methodology or RSM has drawbacks such as extrapolation inaccuracy outside the investigational ranges and discrete variables error, RSM has numerous advantages to design, model, estimate, and optimize biofuel for ICE with satisfactory accuracy. With its prediction and optimization capability, response surface methodology has the potential to assist the development of ICE optimization powered by biofuel for sustainability energy transition.",
        "DOI": "10.1016/j.rineng.2023.101213",
        "paper_author": "Veza I.",
        "affiliation_name": "Universiti Teknologi PETRONAS",
        "affiliation_city": "Seri Iskandar",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60001278",
        "affiliation_state": "Perak"
    },
    {
        "paper_title": "A Review on Digital Twin Technology in Smart Grid, Transportation System and Smart City: Challenges and Future",
        "publication": "IEEE Access",
        "citied_by": "172",
        "cover_date": "2023-01-01",
        "Abstract": "With recent advances in information and communication technology (ICT), the bleeding edge concept of digital twin (DT) has enticed the attention of many researchers to revolutionize the entire modern industries. DT concept refers to a digital representation of a physical entity that is able to reflect its physical behavior by applying platforms and bidirectional interaction of data in real-time. The remarkable deployment of the internet of things in the power grid has led to reliable access to information that improves its performance and equips it with a powerful tool for real-time data management and analysis. This paper aims to trace the continuous investigation and propose practical ideas in originating and developing DT technology, according to various application domains of power systems, and also describes the proposed solutions to deal with the challenges associated with DT. Indeed, with the development of modern cities, different energy layers such as transportation systems, smart grids, and microgrids have emerged facing various issues that challenge the multi-dimensional energy management system. For example, in transportation systems, traffic is a major problem that requires real-time management, planning, and analysis. In power grids, remote data transfer within the grid and also various analyzes needing real data are just some of the current challenges in the field. These problems can be cracked by providing and analyzing a real twin framework in each section. All in all, this paper aims to survey different applications of DT in the development of the various aspects of energy management within a city including transportation systems, power grids, and microgrids. Besides, the security of DT technology based on ML is discussed. It also provides a complete view for the readers to be able to develop and deploy a DT technology for various power system applications.",
        "DOI": "10.1109/ACCESS.2023.3241588",
        "paper_author": "Jafari M.",
        "affiliation_name": "Shiraz University of Technology",
        "affiliation_city": "Shiraz",
        "affiliation_country": "Iran",
        "affiliation_id": "60072431",
        "affiliation_state": "Fars"
    },
    {
        "paper_title": "Adsorption of uranium (VI) by metal-organic frameworks and covalent-organic frameworks from water",
        "publication": "Coordination Chemistry Reviews",
        "citied_by": "171",
        "cover_date": "2023-01-15",
        "Abstract": "As we all know, energy and environment are two everlasting themes for the development of society. Nuclear power source, as a clean energy that is easy to be stored, has been rapidly developed in the past few decades. Because uranium is the main nuclear fuel, mining uranium from seawater is essential. Besides, uranium-containing wastewater discharged by nuclear industry also pose a serious threat for ecological environment. Considering the radioactivity and toxicity of uranium, it is urgent for us to remove U(VI) from wastewater. To achieve these ends, various uranium adsorption materials have been developed. Among them, metal–organic frameworks (MOFs) and covalent organic frameworks (COFs) have aroused wide concern owing to the advantages of high specific surface areas, abundant active adsorption sites and controllable pore structure. However, there is huge room for MOFs and COFs in the application of uranium treatment. Herein, we provide a comprehensive review on MOFs and COFs for the enrichment and removal of U(VI) from seawater and wastewater, including synthetic approach, influencing factors, possible adsorption mechanism, as well as the performance comparison with other materials. In addition, the problem of current research is pointed out and the future direction about MOFs and COFs in uranium treatment is discussed. Noteworthy, a novel recurrent neural network (RNN) model is creatively put forward to connect the adsorption and detection of U(VI). More interestingly, the deep machine learning (ML) algorithm can replace the use of inductively couple plasma optimal emission spectrometry (ICP-OES). The goal of this paper is to provide guidance for the synthesis of novel MOFs and COFs U-adsorbents and broaden their application in the treatment of U(VI).",
        "DOI": "10.1016/j.ccr.2022.214917",
        "paper_author": "Mei D.",
        "affiliation_name": "Tongji University",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60073652",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A Primer on Rate-Splitting Multiple Access: Tutorial, Myths, and Frequently Asked Questions",
        "publication": "IEEE Journal on Selected Areas in Communications",
        "citied_by": "166",
        "cover_date": "2023-05-01",
        "Abstract": "Rate-Splitting Multiple Access (RSMA) has emerged as a powerful multiple access, interference management, and multi-user strategy for next generation communication systems. In this tutorial, we depart from the orthogonal multiple access (OMA) versus non-orthogonal multiple access (NOMA) discussion held in 5G, and the conventional multi-user linear precoding approach used in space-division multiple access (SDMA), multi-user and massive MIMO in 4G and 5G, and show how multi-user communications and multiple access design for 6G and beyond should be intimately related to the fundamental problem of interference management. We start from foundational principles of interference management and rate-splitting, and progressively delineate RSMA frameworks for downlink, uplink, and multi-cell networks. We show that, in contrast to past generations of multiple access techniques (OMA, NOMA, SDMA), RSMA offers numerous benefits: 1) enhanced spectral, energy and computation efficiency; 2) universality by unifying and generalizing OMA, SDMA, NOMA, physical-layer multicasting, multi-user MIMO under a single framework that holds for any number of antennas at each node (SISO, SIMO, MISO, and MIMO settings); 3) flexibility by coping with any interference levels (from very weak to very strong), network loads (underloaded, overloaded), services (unicast, multicast), traffic, user deployments (channel directions and strengths); 4) robustness to inaccurate channel state information (CSI) and resilience to mixed-critical quality of service; 5) reliability under short channel codes and low latency. We then discuss how those benefits translate into numerous opportunities for RSMA in over forty different applications and scenarios of 6G, e.g., multi-user MIMO with statistical/quantized CSI, FDD/TDD/cell-free massive MIMO, millimeter wave and terahertz, cooperative relaying, physical layer security, reconfigurable intelligent surfaces, cloud-radio access network, internet-of-things, massive access, joint communication and jamming, non-orthogonal unicast and multicast, multigroup multicast, multibeam satellite, space-air-ground integrated networks, unmanned aerial vehicles, integrated sensing and communications, grant-free access, network slicing, cognitive radio, optical/visible light communications, mobile edge computing, machine/federated learning, etc. We finally address common myths and answer frequently asked questions, opening the discussions to interesting future research avenues. Supported by the numerous benefits and applications, the tutorial concludes on the underpinning role played by RSMA in next generation networks, which should inspire future research, development, and standardization of RSMA-aided communication for 6G.",
        "DOI": "10.1109/JSAC.2023.3242718",
        "paper_author": "Clerckx B.",
        "affiliation_name": "Imperial College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60015150",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Multidiscipline Applications of Triboelectric Nanogenerators for the Intelligent Era of Internet of Things",
        "publication": "Nano-Micro Letters",
        "citied_by": "166",
        "cover_date": "2023-12-01",
        "Abstract": "Multidiscipline application of triboelectric nanogenerators (TENGs) for intelligent Internet of Things (IoTs) are summarized from the aspects of agriculture, industry, city, emergency monitoring, and artificial intelligence.Perspectives on the challenges and future research directions of TENGs in IoTs have been proposed.",
        "DOI": "10.1007/s40820-022-00981-8",
        "paper_author": "Cao X.",
        "affiliation_name": "Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60019499",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Ultrastretchable, Self-Healing Conductive Hydrogel-Based Triboelectric Nanogenerators for Human-Computer Interaction",
        "publication": "ACS Applied Materials and Interfaces",
        "citied_by": "165",
        "cover_date": "2023-02-01",
        "Abstract": "The rapid development of wearable electronic devices and virtual reality technology has revived interest in flexible sensing and control devices. Here, we report an ionic hydrogel (PTSM) prepared from polypropylene amine (PAM), tannic acid (TA), sodium alginate (SA), and MXene. Based on the multiple weak H-bonds, this hydrogel exhibits excellent stretchability (strain >4600%), adhesion, and self-healing. The introduction of MXene nanosheets endows the hydrogel sensor with a high gauge factor (GF) of 6.6. Meanwhile, it also enables triboelectric nanogenerators (PTSM-TENGs) fabricated from silicone rubber-encapsulated hydrogels to have excellent energy harvesting efficiency, with an instantaneous output power density of 54.24 mW/m2. We build a glove-based human-computer interaction (HMI) system using PTSM-TENGs. The multidimensional signal features of PTSM-TENG are extracted and analyzed by the HMI system, and the functions of gesture visualization and robot hand control are realized. In addition, triboelectric signals can be used for object recognition with the help of machine learning techniques. The glove based on PTSM-TENG achieves the classification and recognition of five objects through contact, with an accuracy rate of 98.7%. Therefore, strain sensors and triboelectric nanogenerators based on hydrogels have broad application prospects in man-machine interface, intelligent recognition systems, auxiliary control systems, and other fields due to their excellent stretchable and high self-healing performance.",
        "DOI": "10.1021/acsami.2c17904",
        "paper_author": "Zhang H.",
        "affiliation_name": "China University of Petroleum (East China)",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60105111",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Spotlight on Luminescence Thermometry: Basics, Challenges, and Cutting-Edge Applications",
        "publication": "Advanced Materials",
        "citied_by": "158",
        "cover_date": "2023-09-07",
        "Abstract": "Luminescence (nano)thermometry is a remote sensing technique that relies on the temperature dependency of the luminescence features (e.g., bandshape, peak energy or intensity, and excited state lifetimes and risetimes) of a phosphor to measure temperature. This technique provides precise thermal readouts with superior spatial resolution in short acquisition times. Although luminescence thermometry is just starting to become a more mature subject, it exhibits enormous potential in several areas, e.g., optoelectronics, photonics, micro- and nanofluidics, and nanomedicine. This work reviews the latest trends in the field, including the establishment of a comprehensive theoretical background and standardized practices. The reliability, repeatability, and reproducibility of the technique are also discussed, along with the use of multiparametric analysis and artificial-intelligence algorithms to enhance thermal readouts. In addition, examples are provided to underscore the challenges that luminescence thermometry faces, alongside the need for a continuous search and design of new materials, experimental techniques, and analysis procedures to improve the competitiveness, accessibility, and popularity of the technology.",
        "DOI": "10.1002/adma.202302749",
        "paper_author": "Brites C.D.S.",
        "affiliation_name": "CICECO – Instituto de Materiais de Aveiro",
        "affiliation_city": "Aveiro",
        "affiliation_country": "Portugal",
        "affiliation_id": "60013980",
        "affiliation_state": "Aveiro"
    },
    {
        "paper_title": "Electrochemical reduction of carbon dioxide to multicarbon (C<inf>2+</inf>) products: challenges and perspectives",
        "publication": "Energy and Environmental Science",
        "citied_by": "154",
        "cover_date": "2023-06-23",
        "Abstract": "Electrocatalytic CO2 reduction has been developed as a promising and attractive strategy to achieve carbon neutrality for sustainable chemical production. Among various reduction products, multi-carbon (C2+) compounds with higher energy density are desirable value-added products. Herein, we review and discuss the recent progress and challenges in preparing C2+ products. We start with the elaboration of the most recent advancement of carbon-carbon coupling results and the newly proposed mechanisms, which are much more complicated than that of single-carbon products. The complex scenarios involved in the initial CO2 activation process, the catalyst micro/nanostructure design, and mass transfer conditions optimization have been thoroughly discussed. In addition, we also propose the synergistic realization of high C2+ product selectivity through the rational design of the catalyst and elaborate on the influence of electrolytes (anion/cation/pH/ionic liquid) using theoretical calculation analysis and machine learning prediction. Several in situ/operando techniques have been elaborated for tracking the structural evolution and recording the reaction intermediates during electrocatalysis. Additional insights into the triphasic interfacial reaction systems with improved C2+ selectivity are also provided. By presenting these advances and future challenges with potential solutions related to the integral development of electrochemical reduction of carbon dioxide to C2+ products, we hope to shed some light on the forthcoming research on electrochemical carbon dioxide recycling.",
        "DOI": "10.1039/d3ee00964e",
        "paper_author": "Chang B.",
        "affiliation_name": "King Abdullah University of Science and Technology",
        "affiliation_city": "Thuwal",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60092945",
        "affiliation_state": "Makkah"
    },
    {
        "paper_title": "Emerging electrolytes with fluorinated solvents for rechargeable lithium-based batteries",
        "publication": "Chemical Society Reviews",
        "citied_by": "154",
        "cover_date": "2023-04-03",
        "Abstract": "Electrolytes that can ensure the movement of ions and regulate interfacial chemistries for fast mass and charge transfer are essential in many types of electrochemical energy storage devices. However, in the emerging energy-dense lithium-based batteries, the uncontrollable side-reactions and consumption of the electrolyte result in poor electrochemical performances and severe safety concerns. In this case, fluorination has been demonstrated to be one of the most effective strategies to overcome the above-mentioned issues without significantly contributing to engineering and technical difficulties. Herein, we present a comprehensive overview of the fluorinated solvents that can be employed in lithium-based batteries. Firstly, the basic parameters that dictate the properties of solvents/electrolytes are elaborated, including physical properties, solvation structure, interface chemistry, and safety. Specifically, we focus on the advances and scientific challenges associated with different solvents and the enhancement in their performance after fluorination. Secondly, we discuss the synthetic methods for new fluorinated solvents and their reaction mechanisms in depth. Thirdly, the progress, structure-performance relationship, and applications of fluorinated solvents are reviewed. Subsequently, we provide suggestions on the solvent selection for different battery chemistries. Finally, the existing challenges and further efforts on fluorinated solvents are summarized. The combination of advanced synthesis and characterization approaches with the assistance of machine learning will enable the design of new fluorinated solvents for advanced lithium-based batteries.",
        "DOI": "10.1039/d2cs00873d",
        "paper_author": "Wang Y.",
        "affiliation_name": "Nankai University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60018038",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Observation of high-energy neutrinos from the Galactic plane",
        "publication": "Science",
        "citied_by": "153",
        "cover_date": "2023-06-30",
        "Abstract": "The origin of high-energy cosmic rays, atomic nuclei that continuously impact Earth's atmosphere, is unknown. Because of deflection by interstellar magnetic fields, cosmic rays produced within the Milky Way arrive at Earth from random directions. However, cosmic rays interact with matter near their sources and during propagation, which produces high-energy neutrinos. We searched for neutrino emission using machine learning techniques applied to 10 years of data from the IceCube Neutrino Observatory. By comparing diffuse emission models to a background-only hypothesis, we identified neutrino emission from the Galactic plane at the 4.5s level of significance. The signal is consistent with diffuse emission of neutrinos from the Milky Way but could also arise from a population of unresolved point sources.",
        "DOI": "10.1126/science.adc9818",
        "paper_author": "Abbasi R.",
        "affiliation_name": "Loyola University Chicago",
        "affiliation_city": "Chicago",
        "affiliation_country": "United States",
        "affiliation_id": "60003545",
        "affiliation_state": "IL"
    },
    {
        "paper_title": "Hybrid VMD-CNN-GRU-based model for short-term forecasting of wind power considering spatio-temporal features",
        "publication": "Engineering Applications of Artificial Intelligence",
        "citied_by": "149",
        "cover_date": "2023-05-01",
        "Abstract": "Accurate and reliable short-term forecasting of wind power is vital for balancing energy and integrating wind power into a grid. A novel hybrid deep learning model is designed in this study to increase the prediction accuracy of short-term wind power forecasting on a wind farm in Jiang County, Shanxi, China. The proposed hybrid deep learning model comprises variable mode decomposition (VMD), convolutional neural network (CNN), and gated recurrent unit (GRU). VMD substantially reduces the volatility of wind speed sequences. CNN automatically extracts complex spatial features from wind power data, and GRU can directly extract temporal features from historical input data. The forecasting accuracy of the combined VMD-CNN-GRU model is higher than that of any single model for wind power. The study used data obtained in 15 min intervals from the wind farm to determine the effectiveness of the proposed model against other advanced models. Compared with the other deep learning models, VMD-CNN-GRU is the best at short-term forecasting, with an RMSE of 1.5651, MAE of 0.8161, MAPE of 11.62%, and R2 of 0.9964. This method is valuable for practical applications and can be used to maintain safe wind farm operations in the future.",
        "DOI": "10.1016/j.engappai.2023.105982",
        "paper_author": "Zhao Z.",
        "affiliation_name": "Xi'an University of Architecture and Technology",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60031454",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "Experimentally realized in situ backpropagation for deep learning in photonic neural networks",
        "publication": "Science",
        "citied_by": "146",
        "cover_date": "2023-04-28",
        "Abstract": "Integrated photonic neural networks provide a promising platform for energy-efficient, high-throughput machine learning with extensive scientific and commercial applications. Photonic neural networks efficiently transform optically encoded inputs using Mach-Zehnder interferometer mesh networks interleaved with nonlinearities. We experimentally trained a three-layer, four-port silicon photonic neural network with programmable phase shifters and optical power monitoring to solve classification tasks using \"in situ backpropagation,\"a photonic analog of the most popular method to train conventional neural networks. We measured backpropagated gradients for phase-shifter voltages by interfering forward- and backwardpropagating light and simulated in situ backpropagation for 64-port photonic neural networks trained on MNIST image recognition given errors. All experiments performed comparably to digital simulations (>94% test accuracy), and energy scaling analysis indicated a route to scalable machine learning.",
        "DOI": "10.1126/science.ade8450",
        "paper_author": "Pai S.",
        "affiliation_name": "Stanford Engineering",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60141508",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Short term load forecasting based on ARIMA and ANN approaches",
        "publication": "Energy Reports",
        "citied_by": "144",
        "cover_date": "2023-05-01",
        "Abstract": "Forecasting electricity demand requires accurate and sustainable data acquisition systems which rely on smart grid systems. To predict the demand expected by the grid, many smart meters are required to collect sufficient data. However, the problem is multi-dimensional and simple power aggregation techniques may fail to capture the relational similarities between the various types of users. Therefore, accurate forecasting of energy demand plays a key role in planning, setting up, and implementing networks for the renewable energy systems, and continuously providing energy to consumers. This is also a key element for planning the requirement for storage devices and their storage capacity. Additionally, errors in hour-to-hour forecasting may cause considerable economic and consumer losses. This paper aims to address the knowledge gap in techniques based on machine learning (ML) for predicting load by using two forecasting methods: Auto Regressive Integrated Moving Average (ARIMA) and Artificial Neural Network (ANN); and compares the performance of both methods using Mean Absolute Percentage Error (MAPE). The study is based on daily real load electricity data for 709 individual households were randomly chosen over an 18-month period in Ireland. The results reveal that the (ANN) offers better results than ARIMA for the non-linear load data.",
        "DOI": "10.1016/j.egyr.2023.01.060",
        "paper_author": "Tarmanini C.",
        "affiliation_name": "Ondokuz Mayis Üniversitesi",
        "affiliation_city": "Samsun",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60009477",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Machine learning-aided real-time detection of keyhole pore generation in laser powder bed fusion",
        "publication": "Science",
        "citied_by": "143",
        "cover_date": "2023-01-06",
        "Abstract": "Porosity defects are currently a major factor that hinders the widespread adoption of laser-based metal additive manufacturing technologies. One common porosity occurs when an unstable vapor depression zone (keyhole) forms because of excess laser energy input. With simultaneous high-speed synchrotron x-ray imaging and thermal imaging, coupled with multiphysics simulations, we discovered two types of keyhole oscillation in laser powder bed fusion of Ti-6Al-4V. Amplifying this understanding with machine learning, we developed an approach for detecting the stochastic keyhole porosity generation events with submillisecond temporal resolution and near-perfect prediction rate. The highly accurate data labeling enabled by operando x-ray imaging allowed us to demonstrate a facile and practical way to adopt our approach in commercial systems.",
        "DOI": "10.1126/science.add4667",
        "paper_author": "Ren Z.",
        "affiliation_name": "University of Virginia School of Engineering and Applied Science",
        "affiliation_city": "Charlottesville",
        "affiliation_country": "United States",
        "affiliation_id": "60152865",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "Interpretable machine learning for building energy management: A state-of-the-art review",
        "publication": "Advances in Applied Energy",
        "citied_by": "142",
        "cover_date": "2023-02-01",
        "Abstract": "Machine learning has been widely adopted for improving building energy efficiency and flexibility in the past decade owing to the ever-increasing availability of massive building operational data. However, it is challenging for end-users to understand and trust machine learning models because of their black-box nature. To this end, the interpretability of machine learning models has attracted increasing attention in recent studies because it helps users understand the decisions made by these models. This article reviews previous studies that adopted interpretable machine learning techniques for building energy management to analyze how model interpretability is improved. First, the studies are categorized according to the application stages of interpretable machine learning techniques: ante-hoc and post-hoc approaches. Then, the studies are analyzed in detail according to specific techniques with critical comparisons. Through the review, we find that the broad application of interpretable machine learning in building energy management faces the following significant challenges: (1) different terminologies are used to describe model interpretability which could cause confusion, (2) performance of interpretable ML in different tasks is difficult to compare, and (3) current prevalent techniques such as SHAP and LIME can only provide limited interpretability. Finally, we discuss the future R&D needs for improving the interpretability of black-box models that could be significant to accelerate the application of machine learning for building energy management.",
        "DOI": "10.1016/j.adapen.2023.100123",
        "paper_author": "Chen Z.",
        "affiliation_name": "The Hong Kong Polytechnic University",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008928",
        "affiliation_state": "Hong Kong"
    },
    {
        "paper_title": "A Hyperheuristic with Q-Learning for the Multiobjective Energy-Efficient Distributed Blocking Flow Shop Scheduling Problem",
        "publication": "IEEE Transactions on Cybernetics",
        "citied_by": "142",
        "cover_date": "2023-05-01",
        "Abstract": "Carbon peaking and carbon neutrality, which are the significant national strategy for sustainable development, have attracted considerable attention from production enterprises. In this study, the energy consumption is considered in the distributed blocking flow shop scheduling problem (DBFSP). A hyperheuristic with Q-learning (HHQL) is presented to address the energy-efficient DBFSP (EEDBFSP). Q-learning is employed to select an appropriate low-level heuristic (LLH) from a predesigned LLH set according to historical information fed back by LLH. An initialization method, which considers both total tardiness (TTD) and total energy consumption (TEC), is proposed to construct the initial population. The ϵ-greedy strategy is introduced to utilize the learned knowledge while retaining a certain degree of exploration in the process of selecting LLH. The acceleration operation of the job on the critical path is designed to optimize TTD. The deceleration operation of the job on the noncritical path is designed to optimize TEC. The statistical and computational experimentation in an extensive benchmark testified that the HHQL outperforms the other comparison algorithm regarding efficiency and significance in solving EEDBFSP.",
        "DOI": "10.1109/TCYB.2022.3192112",
        "paper_author": "Zhao F.",
        "affiliation_name": "Lanzhou University of Technology",
        "affiliation_city": "Lanzhou",
        "affiliation_country": "China",
        "affiliation_id": "60025945",
        "affiliation_state": "Gansu"
    },
    {
        "paper_title": "Electrochemical Impedance Spectroscopy: A New Chapter in the Fast and Accurate Estimation of the State of Health for Lithium-Ion Batteries",
        "publication": "Energies",
        "citied_by": "140",
        "cover_date": "2023-02-01",
        "Abstract": "Highlights: What are the main findings? Rapid acquisition technology of electrochemical impedance spectroscopy. EIS was used to quickly and effectively estimate the SOH of LIBs. Machine learning method and equivalent circuit method to estimate battery health state. What is the implication of the main finding? EIS were found to be better SOH estimation method. The technology based on EIS has the characteristics of high precision advantages. The method based on EIS of LIBs SOH estimation has been applied to the BMS. Lithium-ion batteries stand out from other clean energy sources because of their high energy density and small size. With the increasing application scope and scale of lithium-ion batteries, real-time and accurate monitoring of its state of health plays an important role in ensuring the healthy and stable operation of an energy storage system. Due to the interaction of various aging reactions in the aging process of lithium-ion batteries, the capacity attenuation shows no regularity. However, the traditional monitoring method is mainly based on voltage and current, which cannot reflect the internal mechanism, so the accuracy is greatly reduced. Recently, with the development of electrochemical impedance spectroscopy, it has been possible to estimate the state of health quickly and accurately online. Electrochemical impedance spectroscopy can measure battery impedance in a wide frequency range, so it can reflect the internal aging state of lithium-ion batteries. In this paper, the latest impedance spectroscopy measurement technology and electrochemical impedance spectroscopy based on lithium-ion battery health state estimation technology are summarized, along with the advantages and disadvantages of the summary and prospects. This fills the gap in this aspect and is conducive to the further development of this technology.",
        "DOI": "10.3390/en16041599",
        "paper_author": "Zhang M.",
        "affiliation_name": "Qingdao University",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60030434",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "SpikingJelly: An open-source machine learning infrastructure platform for spike-based intelligence",
        "publication": "Science Advances",
        "citied_by": "137",
        "cover_date": "2023-01-01",
        "Abstract": "Spiking neural networks (SNNs) aim to realize brain-inspired intelligence on neuromorphic chips with high energy efficiency by introducing neural dynamics and spike properties. As the emerging spiking deep learning paradigm attracts increasing interest, traditional programming frameworks cannot meet the demands of the automatic differentiation, parallel computation acceleration, and high integration of processing neuromorphic datasets and deployment. In this work, we present the SpikingJelly framework to address the aforementioned dilemma. We contribute a full-stack toolkit for preprocessing neuromorphic datasets, building deep SNNs, optimizing their parameters, and deploying SNNs on neuromorphic chips. Compared to existing methods, the training of deep SNNs can be accelerated 11×, and the superior extensibility and flexibility of SpikingJelly enable users to accelerate custom models at low costs through multilevel inheritance and semiautomatic code generation. SpikingJelly paves the way for synthesizing truly energy-efficient SNN-based machine intelligence systems, which will enrich the ecology of neuromorphic computing.",
        "DOI": "10.1126/sciadv.adi1480",
        "paper_author": "Fang W.",
        "affiliation_name": "Peking University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014966",
        "affiliation_state": "NA"
    }
]