[
    {
        "paper_title": "GeoGail: A Model-Based Imitation Learning Framework for Human Trajectory Synthesizing",
        "paper_author": "Wu Y.",
        "publication": "ACM Transactions on Knowledge Discovery from Data",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "Synthesized human trajectories are crucial for a large number of applications. Existing solutions are mainly based on the generative adversarial network (GAN), which is limited due to the lack of modeling the human decision-making process. In this article, we propose a novel imitation learning-based method to synthesize human trajectories. This model utilizes a novel semantics-based interaction mechanism between the decision-making strategy and visitations to diverse geographical locations to model them in the semantic domain in a uniform manner. To augment the modeling ability to the real-world human decision-making policy, we propose a feature extraction model to extract the internal latent factors of variation of different individuals and then propose a novel self-attention-based policy net to capture the long-term correlation of mobility and decision-making patterns. Then, to better reward users' mobility behavior, we propose a novel multi-scale reward net combined with mutual information to model the instant reward, long-term reward, and individual characteristics in a cohesive manner. Extensive experimental results on two real-world trajectory datasets show that our proposed model can synthesize the most high-quality trajectory data compared with six state-of-the-art baselines in terms of a number of key usability metrics and can well support practical applications based on trajectory data, demonstrating its effectiveness. Furthermore, our proposed method can learn explainable knowledge automatically from data, including explainable statistical features of trajectories and statistical relation between decision-making policy and features.",
        "DOI": "10.1145/3699961",
        "affiliation_name": "Beijing National Research Center for Information Science and Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60104026",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Adaptive Reward Mechanisms based on Reinforcement Learning Techniques for Mobile Robots in Unknown Environment",
        "paper_author": "Arumugam V.",
        "publication": "International Journal of Vehicle Structures and Systems",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "This research addresses the static and dynamic unpredictable nature of their surroundings, which presents challenges for mobile robots operating in uncertain contexts, sometimes hindering their ability to learn appropriate policies. In this paper, a method based on reinforcement learning (RL) techniques is proposed to enhance the learning process of mobile robots through adaptive reward mechanisms. The system continuously modifies the rewards obtained during the learning process with the goal of improving the resilience and adaptability of robot behaviour. This investigation covers various RL algorithms, such as Deep Q-Networks (DQN), Improvement of Proximal Policy Optimization (IPPO) and Actor-Critic techniques, along with reward schemes that are flexible and customized to the specific demands of mobile robot activities. It assesses the effectiveness of these strategies in terms of learning efficiency, flexibility to changes in the environment and robustness to uncertainty through extensive testing in simulated scenarios. The results demonstrate to an adaptive reward method might enhance mobile robots learning skills and enable them to navigate and perform tasks more adeptly in demanding and dynamic environments.",
        "DOI": "10.4273/ijvss.16.6.13",
        "affiliation_name": "Saveetha School of Engineering",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60109336",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Machine Learning-Based Mapping of Daily Methane Concentration in Rice Paddies Using Meteorological Data and Satellite Images: A Case of South Korea",
        "paper_author": "Jang J.",
        "publication": "Korean Journal of Remote Sensing",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "Methane from rice fields has a strong greenhouse effect and its accurate estimation is essential to combat climate change. In this study, we conducted an analysis based on the Gradient Boosting Machine (GBM) model using Local Data Assimilation and Prediction System (LDAPS) data, Normalized Difference Vegetation Index (NDVI), and Normalized Difference Water Index (NDWI) from VIIRS and Moderate Resolution Imaging Spectroradiometer (MODIS), and FluxNet ground observations of the Cheorwon rice paddy region. This was used to estimate methane emissions from rice paddy fields in South Korea and to create a gridded spatial information map of methane concentrations. Using data with a spatial resolution of 1.5 kilometers, we identified detailed changes within the region and generated daily maps to analyze daily changes and seasonal characteristics. To predict methane concentration, we considered the correlation between meteorological factors such as latent heat flux, humidity, soil moisture, and soil temperature and methane emissions as key variables. Latent heat flux and humidity were selected as key variables considering that the migration of methane gas is affected by the evapotranspiration process. In addition, soil moisture, which creates the anaerobic conditions necessary for methane production, and soil temperature, which affects the activity of methanogenic microorganisms, were included in the analysis. Taking these various factors into consideration, we analyzed methane emission data from rice fields in Korea and visualized them on a map to understand the pattern of methane production in response to changing weather conditions. The developed model showed a correlation coefficient of 0.91 and Mean Absolute Error (MAE) of 28.97 in the 5-fold cross-validation and an average correlation coefficient of 0.87 and MAE of 35.46 in the Leave One Year Out (LOYO) cross-validation. These results are expected to contribute to the understanding of methane generation patterns under changing weather conditions and accurate methane emission estimation. In addition, the developed model and the constructed methane concentration map can be utilized as an important basis for establishing greenhouse gas reduction policies in the agricultural sector and effective climate change response strategies in the future.",
        "DOI": "10.7780/kjrs.2024.40.6.1.18",
        "affiliation_name": "Pukyong National University",
        "affiliation_city": "Busan",
        "affiliation_country": "South Korea",
        "affiliation_id": "60011883",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Al-Based Paddy Rice Yield Prediction Using Satellite Images, Meteorological Data, and Digital Elevation Model: Case Study of South Korea, 2000-2023",
        "paper_author": "Sim J.",
        "publication": "Korean Journal of Remote Sensing",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "The increasing uncertainty in crop production caused by climate change underscores the necessity of accurate yield predictions for staple crops like rice. This study developed a rice yield prediction model that accounts for climate change by integrating satellite imagery and artificial intelligence. Key variables, including temperature, precipitation, and solar radiation, were derived from Korea Meteorological Administration Automated Synoptic Observing System (ASOS) data and combined with NASAs Shuttle Radar Topography Mission Digital Elevation Model (SRTM DEM) to incorporate topographic factors. A comprehensive database integrating Vegetation indices from Moderate Resolution Imaging Spectroradiometer (MODIS) and Visible Infrared Imaging Radiometer Suite (VIIRS) was established, and Automated Machine Learning (AutoML) was employed to optimize the rice yield prediction model. Validation results demonstrated high predictive accuracy, with the model utilizing ASOS data achieving a MAPE of 4.091% in 2023. This study contributes to data-driven decision-making for climate-resilient agricultural policies and enhanced food security.",
        "DOI": "10.7780/kjrs.2024.40.6.1.25",
        "affiliation_name": "Rural Development Administration",
        "affiliation_city": "Jeonju",
        "affiliation_country": "South Korea",
        "affiliation_id": "60068698",
        "affiliation_state": "Jeollabuk-do"
    },
    {
        "paper_title": "Machine learning-driven wind energy mapping enhanced by natural neighbor interpolation",
        "paper_author": "Widodo D.A.",
        "publication": "Journal of Energy Systems",
        "citied_by": "0",
        "cover_date": "2024-12-31",
        "Abstract": "In the present work, a prediction on the wind energy potential in Semarang City (Central Java Province, Indonesia) has been performed by leveraging a novel combination of machine learning and natural neighbor interpolation (NNI) methodology. This integrated approach uniquely combines the predictive power of machine learning to estimate wind speeds based on historical and spatial data, with the spatial mapping capabilities of NNI, which provides a more accurate and seamless visualization of wind speed distribution. This combination addresses challenges of data sparsity and variability, offering a more reliable and localized mapping approach than traditional methods. Additionally, air density is considered to calculate energy density, enabling a comprehensive evaluation of wind energy potential. The results show an average monthly wind speed of 5.23 m/s, ranging from 3.38 m/s to 7.39 m/s. Wind speeds between 7 m/s and 10 m/s are predicted to occur for up to 10 months annually, with an estimated energy density of 102.7 W/m2. These findings underscore the feasibility of small-scale wind power generation in the study area and provide actionable insights for advancing renewable energy policies and implementations at the local level.",
        "DOI": "10.30521/jes.1499631",
        "affiliation_name": "University Negeri Semarang",
        "affiliation_city": "Semarang",
        "affiliation_country": "Indonesia",
        "affiliation_id": "120409475",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Design and Simulation of International Trade Pathway for Digital Economy Based on Machine Learning Algorithm",
        "paper_author": "Liu Q.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "In the rapidly evolving landscape of the digital economy, understanding and optimizing international trade pathways is crucial for enhancing economic efficiency and competitiveness. This study presents a comprehensive design and simulation framework utilizing advanced machine learning algorithms to analyze and predict trade patterns in the digital economy. By leveraging large datasets encompassing trade volumes, digital goods, economic indicators, and policy variables, In this paper develop predictive models that identify key factors influencing international trade dynamics. Our approach employs techniques such as supervised learning for demand forecasting and unsupervised learning for clustering trade relationships. The simulation component allows for scenario analysis, enabling stakeholders to visualize potential trade outcomes under varying conditions and policy interventions. This research aims to provide actionable insights for policymakers, businesses, and researchers, facilitating informed decision-making and strategic planning in the context of global digital trade. Ultimately, our findings contribute to a deeper understanding of the interplay bet. In this paper en digital transformation and international trade, highlighting the need for adaptive strategies in a digitally driven global marketplace.",
        "DOI": "10.1145/3705618.3705639",
        "affiliation_name": "Guangdong University of Science and Technology",
        "affiliation_city": "Dongguan",
        "affiliation_country": "China",
        "affiliation_id": "60264491",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Transformations of national economies under conditions of instability",
        "paper_author": "Cherniavska T.",
        "publication": "Transformations of national economies under conditions of instability",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "The monograph \"Transformation of National Economies in Conditions of Instability\" is dedicated to theoretical-methodological and practical approaches to addressing diverse and pressing challenges faced by key sectors of national economies under risks and threats of various scales and natures. The authors present innovative approaches and unique solutions for transforming the development of structural elements within socio-economic systems, with a particular focus on implementing advanced international experience and standards in the context of modern trends in the global economy. The book consists of nine chapters, each exploring significant aspects of current development challenges and offering forward-looking solutions of strategic importance.",
        "DOI": "10.21303/978-9916-9850-6-9",
        "affiliation_name": "State University of Applied Sciences",
        "affiliation_city": "Konin",
        "affiliation_country": "Poland",
        "affiliation_id": "121596067",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Emerging technology solutions to support national emergency workforce capacity-building initiatives: lessons from Ugandan policy and practice",
        "paper_author": "McMullen E.",
        "publication": "Emergency Medicine Journal",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "Trauma and emergency care is a national priority in Uganda due to the high burden of injury, impacting a primarily young and rural population. With a significant gap in qualified emergency medicine professionals, a need exists to rapidly upskill the current health workforce and to strengthen access to learning for non-specialist emergency care providers nationally. This review was completed in partnership with the Ugandan Ministry of Health and a consortium of UK partners to support national emergency workforce capacity building in Uganda and East Africa. The review built on policy and practice expertise to explore the feasibility of using emerging digital solutions, such as virtual and augmented reality, to meet the challenges of delivering rapid and equitable access to emergency care training at scale. Data collection included a narrative literature review, key informant interviews, an expert focus group, a technical workshop and field observations. Findings included (1) the identification of local technology expertise and experience, in direct contrast to literature and global perceptions of low-resource environments, (2) high and broad levels of national engagement with digital solutions, (3) existing ambition and infrastructure available to feasibly deliver training at scale and (4) delivery implications for comparable contexts. The review concludes that these emerging technologies should be considered a practical option in the design and delivery of health workforce training at scale. A series of recommendations are proposed for the policy and practice of health professional education and training in Uganda and for comparable contexts.",
        "DOI": "10.1136/emermed-2024-213947",
        "affiliation_name": "Royal College of Emergency Medicine",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60275547",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Scheduling of futuristic railway microgrids—A FRA-pruned twins-actor DDPG approach",
        "paper_author": "Zhao S.",
        "publication": "Energy",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "Transport decarbonization including railway electrification has become a global trend in tackling the climate change challenge due to the substantive green-house-gas emissions from the transport sector. However, within the context of the rapidly growing electricity demand due to railway decarbonization, the existing power supply infrastructures are often stretched beyond their rating capacity, thus slowing down the railway electrification pace. To address this challenge, this paper presents a novel railway microgrid solution to economically and efficiently cater for the growing electricity demands of the railway sector. The proposed railway microgrid uses the existing traction network, local renewable generations and local power grid as its energy sources to meet both the traction and non-traction loads in the electrified railway systems. It also employs hydrogen storage systems and aggregated electric vehicle (EV) fleets to support flexible energy scheduling. To address the uncertainty of renewable energy and implement efficient energy scheduling, machine learning tools and agents are introduced in formulating and solving the optimal scheduling problem, including bidirectional long short-term memory (BiLSTM) and an improved twins-actor deep deterministic policy gradient (Twins-Actor DDPG) method. To reduce the overall computational complexity, a fast recursive algorithm (FRA) is adopted to streamline the machine learning agents. Case studies confirm that the proposed optimal microgrid operation can achieve up to 18.7% costs reduction for the daily operation of the railway power supply system while meeting the electricity demand, and FRA can achieve up to 78.6% agent size reduction and 93.1% computational cost savings.",
        "DOI": "10.1016/j.energy.2024.134089",
        "affiliation_name": "Scottish Power Ltd.",
        "affiliation_city": "Glasgow",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60029086",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A knowledge-assisted deep reinforcement learning approach for energy management in hybrid electric vehicles",
        "paper_author": "Zare A.",
        "publication": "Energy",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "Achieving a robust Energy Management Strategy (EMS) for Hybrid Electric Vehicles (HEVs) requires meeting several control objectives, such as drivability, reducing fuel consumption, and maintaining the state of battery charge (SoC), making the EMS a critical component of HEVs. The current EMS relies on prior knowledge of the instantaneous optimal working points of the Internal Combustion Engine (ICE), which leads to suboptimal solutions in episodic driving cycles. Previous efforts to implement Reinforcement Learning (RL) encountered challenges such as slow convergence, instability in tracking driving cycles, and inadequate performance under real driving conditions. This paper presents an intelligent EMS based on a hybrid Knowledge-Assisted system that integrates a Deterministic Policy Gradient (KA-DDPG) and a Deep Q-Network (KA-DQN) to overcome the challenges of RL and achieve optimal EMS actions under various driving conditions. Two versions of the proposed algorithm—offline and online—are presented. Simulation results show that KA-DDPG requires less computation time, reduces fuel consumption by 6.99 %–7.26 % in offline mode and 5.18 %–5.67 % in online mode, and maintains SoC stability. These methods improve average negative electric motor torque and result in greater energy savings, while the robustness of the algorithm has been examined by changing the vehicle's weight.",
        "DOI": "10.1016/j.energy.2024.134113",
        "affiliation_name": "Sharif University of Technology",
        "affiliation_city": "Tehran",
        "affiliation_country": "Iran",
        "affiliation_id": "60027666",
        "affiliation_state": "Tehran"
    },
    {
        "paper_title": "Safe off-policy reinforcement learning on eco-driving for a P2-P3 hybrid electric truck",
        "paper_author": "Wang Z.",
        "publication": "Energy",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "With the rapid development of intelligent transportation system(ITS) and network technology, vehicles can receive more information about traffic conditions. Although many researchers have conducted the research on eco-driving, many methods ignore the unsafety of reinforcement learning agent or use complex mechanism to improve behavior or they set simple reward function to express the relationship between the SOC and fuel consumption. This paper proposes a safe-off policy eco-driving strategy(SOPEDS) based on a hierarchical frame for a hybrid electric truck in a truck-following scenario in order to solve the problems. Firstly, the truck-following strategy in the upper layer is designed based on the deep deterministic policy gradient(DDPG) algorithm. Then the relevant safe mechanism is introduced in order to reduce the collision risk. In the lower layer, the energy management strategy designed by using reinforcement learning(RL) algorithm. And a new function is designed to shape the reward function to guide agent learning. Finally, the performance of the proposed method is proved by experiments. The results show the fuel saving rate can reach 97.46% of the DP. Our research improved driving safety and introduced a reward function design method which is meaningful for RL training processing for other vehicles.",
        "DOI": "10.1016/j.energy.2024.133884",
        "affiliation_name": "Yanshan University",
        "affiliation_city": "Qinhuangdao",
        "affiliation_country": "China",
        "affiliation_id": "60018465",
        "affiliation_state": "Hebei"
    },
    {
        "paper_title": "Forecasting energy poverty using different machine learning techniques for Missouri",
        "paper_author": "Balkissoon S.",
        "publication": "Energy",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "Energy poverty in Missouri was analyzed using the four quadrant approach using both state and county level data sets for two separate definitions of the grid. Predictions used machine learning techniques including decision trees, random forest, extreme gradient boosting and support vector machines. It was determined that the extreme gradient boosting performed the best when compared to all the other models after the hyperparameters were tuned. The F1 scores for the county level data sets were higher than for the state levels thus indicating greater predictability for the National Oceanic and Atmospheric Administration (NOAA) climatological regional runs. For the county level data, the F1 score was the highest for region 1, which coincided with one of the highest expenditure risk values whilst regions 2–4 were the lowest scoring area. In grid 2, the largest class distribution changed from grid 1’s expenditure risk to the no risk category. This grid had more variability in terms of the double risk class when compared to grid 1 and, as such, its predictability in terms of its F1 scores was reduced. There were similarities in the ranking of the prediction scores for the regions for both grids as regions 1 and 6 incurred the largest F1 values. Thus energy poverty can be classified and predicted for Missouri, which in turn may aid policy makers via quantitative regional risk analysis. This data-driven informed policy making can lead to the development and implementation of laws and social programs to help ameliorate energy poverty.",
        "DOI": "10.1016/j.energy.2024.133904",
        "affiliation_name": "National Center for Atmospheric Research",
        "affiliation_city": "Boulder",
        "affiliation_country": "United States",
        "affiliation_id": "60021243",
        "affiliation_state": "CO"
    },
    {
        "paper_title": "Research on the multi-area cooperative control method for novel power systems",
        "paper_author": "Xi L.",
        "publication": "Energy",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "As new energy sources increasingly penetrate novel power systems, the coordinated control of frequency regulation units has become more challenging, leading to the degraded performance of power grid control. The automatic generation control methods based on traditional reinforcement learning overly depend on exploration, making it difficult quickly obtain optimal solutions for multi-area cooperative control and resulting in suboptimal performance. To address this issue, this paper proposes a multi-area coordinated control method using a greedy actor-critic algorithm enhanced with expert experience replay. This method decouple the role of entropy for exploration and policy collapse, utilizing a proposal policy to secure high-value actions for policy updates. Thus the exploration and exploitation are balanced and the local optima is avoided. Additionally, the expert experience replay collects expert demonstration data with high-value to assist the learning of multi-agent. Therefore, the meaningless exploration in early training is reduced and the rapid attainment of optimal solutions is facilitated. This paper validates the proposed method through simulations on the model of the improved IEEE standard two-area load frequency control and the model of the Sichuan, Chongqing, and Hubei three-area. Compared with other various reinforcement learning methods, the proposed method is demonstrated with superior control performance.",
        "DOI": "10.1016/j.energy.2024.133912",
        "affiliation_name": "Beijing Jiaotong University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60022381",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A novel energy management framework for retired battery-integrated microgrid with peak shaving and frequency regulation",
        "paper_author": "Wan Y.",
        "publication": "Energy",
        "citied_by": "1",
        "cover_date": "2024-12-30",
        "Abstract": "As intermittent renewable energy sources (RESs) increasingly become integral to the power grid, the imperative to ensure frequency stability of power grid has emerged as a critical challenge. Addressing this, this paper proposes a novel energy management framework in retired battery-integrated microgrid with grid frequency regulation (FR) and peak shaving. The EV battery can be hierarchically utilized by the two-stage control framework to improve economic efficiency. In the first stage energy management, a novel heuristic algorithm called the walrus optimization algorithm (WaOA) is employed to implement the optimal energy scheduling of microgrid for minimizing operating costs. In the second stage control strategy, a deep deterministic policy gradient (DDPG) agent is applied to dynamically adjust the power sharing of energy storage station according to the states of retired batteries. Furthermore, a comprehensive retired battery aging model is incorporated into the proposed strategy to reduce total battery capacity loss. The simulation results verify the superior performance of the proposed energy management framework under various microgrid scenarios. This work provides a practical approach to the cascaded utilization of EV batteries, which further improves the sustainability and economics of EV batteries.",
        "DOI": "10.1016/j.energy.2024.133907",
        "affiliation_name": "Aalborg University",
        "affiliation_city": "Aalborg",
        "affiliation_country": "Denmark",
        "affiliation_id": "60022134",
        "affiliation_state": "Nordjylland"
    },
    {
        "paper_title": "Design and optimization of a modular hydrogen-based integrated energy system to maximize revenue via nuclear-renewable sources",
        "paper_author": "Mahmud S.",
        "publication": "Energy",
        "citied_by": "4",
        "cover_date": "2024-12-30",
        "Abstract": "This paper demonstrates a novel modular distributed framework that uses optimal energy-dispatching strategies to enable greater flexibility and profitability in nuclear-renewable integrated energy systems (NR-IES). Hydrogen is used as a commodity in this framework since its production can improve grid stability and system operational flexibility, decarbonize heavy industry, and create an additional revenue stream for electricity generators, particularly nuclear power plants with high operational expenses. The proposed solution addresses the challenges associated with merging multiple software and services from various domains by using functional mock-up units (FMU) to co-simulate diverse subsystems designed in various platforms. The tightly coupled integrated energy system (IES) is optimized to maximize revenue by utilizing the deep reinforcement learning (DRL) technique to make smart dispatching decisions based on variable electricity prices and the availability of renewable energy. Proximal policy optimization (PPO) algorithm is used in training and testing the DRL agent. Over a period of 120 days, the proposed hydrogen-based IES framework showed about 10% revenue boost compared to a non-hydrogen generating baseline IES while also providing an easily-adoptable framework which can help to improve the flexibility of future generation nuclear power plants.",
        "DOI": "10.1016/j.energy.2024.133763",
        "affiliation_name": "The University of Toledo",
        "affiliation_city": "Toledo",
        "affiliation_country": "United States",
        "affiliation_id": "60021624",
        "affiliation_state": "OH"
    },
    {
        "paper_title": "Incremental learning user profile and deep reinforcement learning for managing building energy in heating water",
        "paper_author": "Yin L.",
        "publication": "Energy",
        "citied_by": "0",
        "cover_date": "2024-12-30",
        "Abstract": "Deep reinforcement learning (DRL) has garnered growing attention as a data-driven control technique in the field of built environments. However, the existing DRL approaches for managing water systems cannot consider information from multiple time steps, are prone to overestimation, fall into the problem of locally optimal solutions, and fail to cope with time-varying environments, resulting in an inability to minimize energy consumption while considering water comfort and hygiene of occupants. Therefore, this study proposes an incremental learning user profile and deep reinforcement learning (ILUPDRL) method for controlling hot water systems. This study employs hot water user profiles to reflect the hot water demand (HWD) habits. The proposed ILUPDRL addresses the challenges arising from evolving HWD through incremental learning of hot water user profiles. Moreover, to enable the ILUPDRL to consider information from multiple time steps, this study proposes the recurrent proximal policy optimization (RPPO) algorithm and integrates the RPPO into the ILUPDRL. The simulation results show that the ILUPDRL achieves up to 67.53 % energy savings while considering the water comfort and water hygiene of occupants.",
        "DOI": "10.1016/j.energy.2024.133705",
        "affiliation_name": "Guangxi University",
        "affiliation_city": "Nanning",
        "affiliation_country": "China",
        "affiliation_id": "60030270",
        "affiliation_state": "Guangxi"
    },
    {
        "paper_title": "Emerging multifaceted application of artificial intelligence in chest radiography: a narrative review",
        "paper_author": "Nwaiwu V.C.",
        "publication": "Journal of Medical Artificial Intelligence",
        "citied_by": "1",
        "cover_date": "2024-12-30",
        "Abstract": "Background and Objective: Chest radiography, otherwise known as chest X-ray (CXR) is the most in demand and widely performed investigation in radiology department; owing to the multiple combining effect of rise in prevalence of respiratory diseases globally and the growing need of heath assessment for pre-employment, pre-operative and migration purposes. However, this task is already proving overwhelming, placing an immeasurable burden of workload on radiographers, radiologist, and the entire health system; this has resulted in long waiting time, fatigue-based technical error, interpretation error, reporting delays and backlogs. To ameliorate this predicament, medical imaging has witnessed the introduction of artificial intelligence (AI). Thus, with the raid evolutionary trend in technology, this article seeks to review current state of evidence on AI use in CXR and level of progress made to minimize these errors and delays. In addition, point out challenges, as well as unfold areas for future research to better detection rates and improve overall clinical outcomes. Methods: A search for relevant literature that focuses on AI in CXR was conducted with the help of certain keywords [machine learning (ML), chest radiography, deep learning (DL), natural language processing (NLP), expert system (ES) and fuzzy logic (FL)]. Thereafter, a narrative logical approach to technically analysing and synthesizing findings across domains of AI (ML, DL, NLP, ES, FL) and robot technologies as it relates to CXR done. Key Content and Findings: A thorough evaluation of the substance of evidence these studies bring to enhance overall workflow and health outcomes show that ML is very useful in performing administrative and imaging tasks such as exam scheduling, worklist management and image acquisition. On the other hand, DL is better suited for classification tasks on a broad spectrum of chest anomalies in CXR. However, a hybrid approach involving ML-DL, FL-DL and NLP-DL/ML technologies seems to further improve reporting accuracy and offer more insights into CXR interpretation. Further studies on training and refining models for clinical use in this perspective is demanded. Conclusions: AI still in its early stages; this review to serve as road map to implementation and policy making, guide routine practice and improve clinical governance.",
        "DOI": "10.21037/jmai-24-67",
        "affiliation_name": "Lincoln University College, Malaysia",
        "affiliation_city": "Petaling Jaya",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60107209",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "CARL: Unsupervised Code-Based Adversarial Attacks for Programming Language Models via Reinforcement Learning",
        "paper_author": "Yao K.",
        "publication": "ACM Transactions on Software Engineering and Methodology",
        "citied_by": "0",
        "cover_date": "2024-12-28",
        "Abstract": "Code based adversarial attacks play a crucial role in revealing vulnerabilities of software system. Recently, pre-trained programming language models (PLMs) have demonstrated remarkable success in various significant software engineering tasks, progressively transforming the paradigm of software development. Despite their impressive capabilities, these powerful models are vulnerable to adversarial attacks. Therefore, it is necessary to carefully investigate the robustness and vulnerabilities of the PLMs by means of adversarial attacks. Adversarial attacks entail imperceptible input modifications that cause target models to make incorrect predictions. Existing approaches for attacking PLMs often employ either identifier renaming or the greedy algorithm, which may yield sub-optimal performance or lead to high inference times. In response to these limitations, we propose CARL, an unsupervised black-box attack model that leverages reinforcement learning to generate imperceptible adversarial examples. Specifically, CARL comprises a programming language encoder and a perturbation prediction layer. In order to achieve more effective and efficient attack, we cast the task as a sequence decision-making process, optimizing through policy gradient with a suite of reward functions. We conduct extensive experiments to validate the effectiveness of CARL on code summarization, code translation, and code refinement tasks, covering various programming languages and PLMs. The experimental results demonstrate that CARL surpasses state-of-the-art code attack models, achieving the highest attack success rate across multiple tasks and PLMs while maintaining high attack efficiency, imperceptibility, consistency, and fluency.",
        "DOI": "10.1145/3688839",
        "affiliation_name": "Computer Network Information Center Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60031881",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "The Mechanism of Green Finance on “Dual” Carbon Emission Goals Based on Lasso and DML Methods",
        "paper_author": "Ma X.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Green finance faces challenges in determining its direct impact on reducing carbon emissions due to its strong endogeneity issues. This research introduces fresh insights on the relationship between green finance policies and carbon emissions through a natural experiment and the use of machine learning methods to address the endogeneity problem. Based on green finance data mainly from 1997 to 2021, the empirical results show the following: (1) Green finance development in any form can promote the reduction of carbon emission. (2) A higher level of tertiary industry and economic development stands for positive influences on the effect of green finance on reducing carbon emissions. (3) Meanwhile, regions with proper energy consumption structure performance better in suppressing carbon emissions through green finance. (4) Innovations have a positive mediating impact of green finance system on the reduction in carbon emission. According to the findings, it is recommended that decision-makers weigh the potential to align green financing with carbon emissions cuts in order to achieve economic and societal advantages. This should take into account the considerable prospects present in developing areas and the need for equilibrium among innovation, consumption, and economic levels.",
        "DOI": "10.1145/3703187.3703191",
        "affiliation_name": "Shandong University, Weihai",
        "affiliation_city": "Weihai",
        "affiliation_country": "China",
        "affiliation_id": "60108071",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An Advanced Deep Reinforcement Learning Framework for Docking Unmanned Surface Vessels in Variable Environmental Conditions and Amid Moving Ships",
        "paper_author": "Tranos T.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "This work utilizes advanced reinforcement learning techniques to optimize the docking process of unmanned surface vessels (USVs) in challenging maritime environments.The proposed methodology accounts for fluctuating environmental conditions, such as wind, as well as the dynamic presence of moving ships as objects and varying traffic densities.It integrates learning models and rich state spaces with predictive information to enhance decision-making capabilities that can anticipate and react to environmental changes and vessel movements, ensuring safe and efficient docking procedures.Experiments were conducted in a simulated environment of the port of Piraeus using real data on environmental conditions and ship movements.In addition, we tried to evaluate the proposed method in conditions different from those it was trained, in order to measure the generalization ability of the USV agent's policy and also to achieve more plausibility in the results.",
        "DOI": "10.1145/3688671.3688779",
        "affiliation_name": "Institute of Informatics &amp; Telecommunications",
        "affiliation_city": "Athens",
        "affiliation_country": "Greece",
        "affiliation_id": "60014138",
        "affiliation_state": "Attica"
    },
    {
        "paper_title": "Mapping the Current Status of CTI Knowledge Graphs through a Bibliometric Analysis",
        "paper_author": "Papoutsoglou M.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Bibliometric analysis in the field of cybersecurity and Cyber Threat Intelligence (CTI) is crucial for identifying research trends, key themes, and collaborative networks, which can guide future research directions and policy decisions.This paper presents a comprehensive bibliometric analysis of the current status of research on knowledge graphs in cybersecurity, highlighting significant trends and thematic clusters.The analysis reveals a rapidly growing interest in integrating knowledge graphs with advanced machine learning and AI techniques, such as deep learning and neural networks, to enhance cyber threat intelligence and response strategies.Key findings include the prominence of natural language processing, entity recognition, and relation extraction as critical methodologies in this field.Thematic evolution analysis shows the adoption of large language models (LLMs) and an ongoing focus on structured knowledge representation.The study underscores the potential of knowledge graphs to improve cybersecurity through better data organization, threat detection, and intelligence extraction.",
        "DOI": "10.1145/3688671.3688738",
        "affiliation_name": "Centre for Research and Technology-Hellas",
        "affiliation_city": "Thessaloniki",
        "affiliation_country": "Greece",
        "affiliation_id": "60026208",
        "affiliation_state": "Macedonia"
    },
    {
        "paper_title": "Optimizing Pretrained Transformers for Autonomous Driving",
        "paper_author": "Kochliaridis V.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Vision-based end-to-end driving systems have demonstrated impressive capabilities through the utilization of large Transformer architectures.More specifically, researchers have combined Transformers with Imitation Learning, in order to construct agents that learn to map navigation states to actions from large datasets created by experts.Although this approach usually works well, it relies on specific datasets and expert actions, and thus achieving limited generalization capability, which can be quite catastrophic in uncertain navigation environments, such as urban areas.To overcome this limitation, we further expand the training process of the agent by applying the Phasic Policy Gradient algorithm, a Deep Reinforcement Learning (DRL) method that improves its generalization capability by enabling it to explore and interact with the environment.We further enhance our approach by integrating a custom reward function that penalizes the weaknesses of the pretrained agent, alongside with additional DRL techniques to enhance its efficiency and accelerate convergence.Our experimental results in the CARLA simulation environment demonstrate that our approach not only achieves robustness in comparison to previous approaches, but also shows potential for wider application in similar navigation scenarios.",
        "DOI": "10.1145/3688671.3688778",
        "affiliation_name": "Aristotle University of Thessaloniki",
        "affiliation_city": "Thessaloniki",
        "affiliation_country": "Greece",
        "affiliation_id": "60015331",
        "affiliation_state": "Central Macedonia"
    },
    {
        "paper_title": "DIGITAL TRANSFORMATION AND CORPORATE INNOVATION: EMPIRICAL DISCOVERY BASED ON MACHINE LEARNING",
        "paper_author": "Pu T.",
        "publication": "Asian Academy of Management Journal of Accounting and Finance",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "With the flourishing development of the digital economy, the phenomenon of digital transformation at the firm level has attracted scholars’ attention regarding its impact on microeconomic activities. However, whether the transformational changes induced by digital technologies affect corporate innovation and the underlying mechanisms have not been fully explored. Based on panel data from Chinese listed firms spanning from 2012 to 2021, this paper constructs a measure of digital transformation using machine learning techniques and investigates its relationship with corporate innovation. The findings suggest that digital transformation effectively promotes corporate innovation, a result robust to a battery of sensitivity checks. Mechanism analysis reveals that digital transformation significantly enhances innovation by increasing R&D input and improving innovation efficiency. Further analysis indicates that the innovation-promoting effect of digital transformation is mainly manifested in high-quality innovation output, with greater benefits observed for state-owned enterprises and non-high-tech industry enterprises. Overall, our study provides valuable policy insights for enhancing innovation levels among enterprises in developing countries like China through digital transformation strategies.",
        "DOI": "10.21315/aamjaf2024.20.2.4",
        "affiliation_name": "Universiti Sains Malaysia",
        "affiliation_city": "Minden",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60000906",
        "affiliation_state": "Penang"
    },
    {
        "paper_title": "The role of academia and private sector in smart agriculture applications",
        "paper_author": "Boz Yilmazer E.",
        "publication": "Turkish Journal of Agricultural Economics",
        "citied_by": "0",
        "cover_date": "2024-12-27",
        "Abstract": "Purpose: In agriculture, it is important to collect data on issues such as climate conditions, soil cultivation, diseases, irrigation and harvest, process them and convert them into information and use them in farmers' production decisions. In this context, in the research, interviews were held with technical staff working on Research and Development (R&D) at universities in Izmir and Aydın and companies producing smart agricultural technology. These interviews aimed to examine the activities, roles and problems of academicians and companies in smart applications that will shape the agricultural sector in the future. Design/Methodology/Approach: The main material of the research consists of data obtained from interviews with a total of 19 people, 12 academicians and 7 technology company officials who carry out R&D activities in the agricultural field in Izmir and Aydın provinces. Simple statistical calculations and content analysis were used in the analysis of the data as required by the qualitative research method. Findings: As a result of the coding made as per the method, smart agriculture application (technology-sustainability), dissemination (organization), policy (planning-problems-solutions) codes came to the fore. These codes also explain the roles of the university and the private sector, which are scientific stakeholders of smart agricultural practices, in the technology collaboration. Originality/Value: Agriculture 4.0, which is called efficient planning, management and digitalization of agricultural activities, includes a number of technologies. These are sensor technologies, artificial intelligence (AI), machine learning, automation and robotic systems, remote access, etc. In addition to the benefits of detecting and solving problems in advance, these technologies also provide benefits in terms of saving manpower, enabling efficient and precise operations, efficient use of farm resources, increasing productivity and ensuring food safety. Smart agricultural practices are also used in Turkish agriculture in parallel with developments in the world. Agriculture and technology cooperation continues to develop in Turkey with technoparks and agroparks that have accelerated their activities in recent years. This research is unique in the sense of collecting current data on the subject and sharing suggestions about possible problems from the perspective of the academy and the private sector.",
        "DOI": "10.24181/tarekoder.1511288",
        "affiliation_name": "Aydin Adnan Menderes University",
        "affiliation_city": "Aydin",
        "affiliation_country": "Turkey",
        "affiliation_id": "60023033",
        "affiliation_state": "Efeler"
    },
    {
        "paper_title": "A Trustworthy and Responsible Decision-Making Framework for Resource Management in Food-Energy-Water Nexus: A Control-Theoretical Approach",
        "paper_author": "Uslu S.",
        "publication": "ACM Transactions on Intelligent Systems and Technology",
        "citied_by": "0",
        "cover_date": "2024-12-26",
        "Abstract": "This article introduces a hybrid framework for trustworthy and responsible natural resource management, aimed at building bottom-up trust to enhance cooperation among decision-makers in the food, energy, and water sectors. Cooperation is highly critical for the adoption and application of resource management alternatives (solutions), including those generated by AI-based recommender systems, in communities due to significant impact of these sectors on the environment and the economic productivity of affected communities. While algorithms can recommend solutions, effectively communicating and gaining community acceptance of these solutions is crucial. Our research stands out by emphasizing the collaboration between humans and machines, which is essential for addressing broader challenges related to climate change and the need for expert tradeoff handling in the management of natural resources. To support future decision-making, we propose a successful control-theory model based on previous decision-making and actor behavior. We utilize control theory to depict how community decisions can be affected by how much individuals trust and accept proposed solutions on irrigation water rights and crop operations in an iterative and interactive decision support environment. This model interacts with stakeholders to collect their feedback on the acceptability of solutions, while also examining the influence of consensus levels, trust sensitivities, and the number of decision-making rounds on the acceptance of proposed solutions. Furthermore, we investigate a system of multiple decision-making and explore the impact of learning actors who adjust their trust sensitivities based on solution acceptance and the number of decision-making rounds. Additionally, our approach can be employed to evaluate and refine potential policy modifications. Although we assess potential outcomes using hypothetical actions by individuals, it is essential to emphasize our primary objective of developing a tool that accurately captures real human behavior and fosters improved collaboration in community decision-making. Ultimately, our aim is to enhance the harmony between AI-based recommender systems and human values, promoting a deeper understanding and integration between the two.",
        "DOI": "10.1145/3660640",
        "affiliation_name": "Indiana University-Purdue University Indianapolis",
        "affiliation_city": "Indianapolis",
        "affiliation_country": "United States",
        "affiliation_id": "60024609",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Mitigating the Impact of Inaccurate Feedback in Dynamic Learning-to-Rank: A Study of Overlooked Interesting Items",
        "paper_author": "Zhang C.",
        "publication": "ACM Transactions on Intelligent Systems and Technology",
        "citied_by": "0",
        "cover_date": "2024-12-26",
        "Abstract": "Dynamic Learning-to-Rank (DLTR) is a method of updating a ranking policy in real time based on user feedback, which may not always be accurate. Although previous DLTR work has achieved fair and unbiased DLTR under inaccurate feedback, they face the tradeoff between fairness and user utility and also have limitations in the setting of feeding items. Existing DLTR works improve ranking utility by eliminating bias from inaccurate feedback on observed items, but the impact of another pervasive form of inaccurate feedback, overlooked or ignored interesting items, remains unclear. For example, users may browse the rankings too quickly to catch interesting items or miss interesting items because the snippets are not optimized enough. This phenomenon raises two questions: (i) Will overlooked interesting items affect the ranking results? and (ii) Is it possible to improve utility without sacrificing fairness if these effects are eliminated? These questions are particularly relevant for small and medium-sized retailers who are just starting out and may have limited data, leading to the use of inaccurate feedback to update their models. In this article, we find that inaccurate feedback in the form of overlooked interesting items has a negative impact on DLTR performance in terms of utility. To address this, we treat the overlooked interesting items as noise and propose a novel DLTR method, the Co-teaching Rank (CoTeR), that has good utility and fairness performance when inaccurate feedback is present in the form of overlooked interesting items. Our solution incorporates a co-teaching-based component with a customized loss function and data sampling strategy, as well as a mean pooling strategy to further accommodate newly added products without historical data. Through experiments, we demonstrate that CoTeR not only enhances utilities but also preserves ranking fairness and can smoothly handle newly introduced items.",
        "DOI": "10.1145/3653983",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Smart Integration of Renewable Energy into Transportation: Challenges, Innovations, and Future Research Directions",
        "paper_author": "Sayeed M.A.",
        "publication": "Journal of Renewable Energies",
        "citied_by": "0",
        "cover_date": "2024-12-25",
        "Abstract": "The integration of renewable energy into transportation systems is essential for reducing greenhouse gas emissions and achieving global sustainability goals. This review explores the challenges, innovations, and future directions of incorporating renewable energy sources such as solar, wind, and bioenergy into transportation infrastructures. Key challenges include the intermittency of renewable energy, the need for advancements in energy storage systems, and the regulatory and economic barriers hindering widespread adoption. Innovations such as electric vehicles (EVs), vehicle-to-grid (V2G) technologies, and smart grids are pivotal in enabling this transition. Furthermore, artificial intelligence (AI) and machine learning (ML) offer significant potential to optimize energy management, enhance efficiency, and facilitate the smooth integration of renewable energy with transportation systems. The review also discusses successful case studies from different regions and examines policy frameworks supporting renewable energy in transportation. Future directions point toward increased collaboration between industries, technological advancements, and supportive policies to create a more sustainable, resilient transportation sector. Ultimately, this review aims to provide a comprehensive understanding of how smart integration of renewable energy into transportation can drive a cleaner, more sustainable future.",
        "DOI": "10.54966/jreen.v27i2.1300",
        "affiliation_name": "University of Technology and Applied Sciences Shinas",
        "affiliation_city": "Shinas",
        "affiliation_country": "Oman",
        "affiliation_id": "60089500",
        "affiliation_state": "Al Batinah"
    },
    {
        "paper_title": "Integrating machine learning methods for computing greenhouse gas emissions baselines in agriculture",
        "paper_author": "Moreira B.R.d.A.",
        "publication": "Journal of Cleaner Production",
        "citied_by": "0",
        "cover_date": "2024-12-25",
        "Abstract": "Addressing climate change requires significant reductions in global greenhouse gas (GHG) emissions. In Australia, agriculture accounts for approximately 16.8% of total emissions. Despite advancements in emissions accounting, critical gaps remain, particularly concerning the data-driven selection of reference years and the use of aggregated metrics. These issues often overlook sectoral dynamics, highlighting the need for context-specific, disaggregated baselines that more accurately reflect the complexities of emission assessment from agriculture. This study presents an analytical methodology that integrates machine learning (ML) techniques, specifically dynamic Generalised Additive Models (GAMs) and Conditional Inference Trees (CITs). Applied to 30 years of CO2-e data from Australian inventories, the ML-based approach predicted significant periods of aggregated emissions: from 1990 to 2005 and from 2006 to 2022, with 2005 identified as a critical transition point. The analysis revealed a significant decline in aggregated emissions, with a median of 70.5 Mt CO2-e over the past five years, down from a peak of 76.4 Mt CO2-e estimated in 2005. By optimising the bias-variance trade-off, the algorithms effectively captured underlying patterns while accounting for variability due to climate-related extreme events, such as the Millennium Drought. Another key contribution of this research is the establishment of accurate and adaptable sector- and activity-level baselines, which enhance decision-making related to resource allocation and performance targets. Although applied to Australian agricultural emissions data, this methodology has global applicability. As climate variability intensifies, its predictive and benchmarking capabilities can improve the utility of historical data, supporting dynamic, data-driven approaches crucial for facilitating the net-zero transition.",
        "DOI": "10.1016/j.jclepro.2024.144416",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Toward optimal disease surveillance with graph-based active learning",
        "paper_author": "Tsui J.L.H.",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "0",
        "cover_date": "2024-12-24",
        "Abstract": "Tracking the spread of emerging pathogens is critical to the design of timely and effective public health responses. Policymakers face the challenge of allocating finite resources for testing and surveillance across locations, with the goal of maximizing the information obtained about the underlying trends in prevalence and incidence. We model this decision-making process as an iterative node classification problem on an undirected and unweighted graph, in which nodes represent locations and edges represent movement of infectious agents among them. To begin, a single node is randomly selected for testing and determined to be either infected or uninfected. Test feedback is then used to update estimates of the probability of unobserved nodes being infected and to inform the selection of nodes for testing at the next iterations, until certain test budget is exhausted. Using this framework, we evaluate and compare the performance of previously developed active learning policies for node selection, including Node Entropy and Bayesian Active Learning by Disagreement. We explore the performance of these policies under different outbreak scenarios using simulated outbreaks on both synthetic and empirical networks. Further, we propose a policy that considers the distance-weighted average entropy of infection predictions among neighbors of each candidate node. Our proposed policy outperforms existing ones in most outbreak scenarios given small test budgets, highlighting the need to consider an exploration-exploitation trade-off in policy design. Our findings could inform the design of cost-effective surveillance strategies for emerging and endemic pathogens and reduce uncertainties associated with early risk assessments in resource-constrained situations.",
        "DOI": "10.1073/pnas.2412424121",
        "affiliation_name": "University of California, Los Angeles",
        "affiliation_city": "Los Angeles",
        "affiliation_country": "United States",
        "affiliation_id": "60027550",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "SoK: Access Control Policy Generation from High-level Natural Language Requirements",
        "paper_author": "Jayasundara S.H.",
        "publication": "ACM Computing Surveys",
        "citied_by": "0",
        "cover_date": "2024-12-23",
        "Abstract": "Administrator-centered access control failures can cause data breaches, putting organizations at risk of financial loss and reputation damage. Existing graphical policy configuration tools and automated policy generation frameworks attempt to help administrators configure and generate access control policies by avoiding such failures. However, graphical policy configuration tools are prone to human errors, making them unusable. On the other hand, automated policy generation frameworks are prone to erroneous predictions, making them unreliable. Therefore, to find ways to improve their usability and reliability, we conducted a Systematic Literature Review analyzing 49 publications. The thematic analysis of the publications revealed that graphical policy configuration tools are developed to write and visualize policies manually. Moreover, automated policy generation frameworks are developed using machine learning (ML) and natural language processing (NLP) techniques to automatically generate access control policies from high-level requirement specifications. Despite their utility in the access control domain, limitations of these tools, such as the lack of flexibility, and limitations of frameworks, such as the lack of domain adaptation, negatively affect their usability and reliability, respectively. Our study offers recommendations to address these limitations through real-world applications and recent advancements in the NLP domain, paving the way for future research.",
        "DOI": "10.1145/3706057",
        "affiliation_name": "RMIT University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60011362",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "New management pathways for follow-up of CPAP-treated sleep apnoea patients including digital medicine and multimodal telemonitoring",
        "paper_author": "Pépin J.L.",
        "publication": "Thorax",
        "citied_by": "0",
        "cover_date": "2024-12-23",
        "Abstract": "Background The ever-increasing number of patients diagnosed with obstructive sleep apnoea (OSA) and treated by long-term continuous positive airway pressure (CPAP) overstretches conventional follow-up pathways. New approaches to the management of CPAP-treated patient follow-up are needed to strike a balance between remote monitoring through digital technologies and in-person patient-healthcare-professional contacts. Focusing on the reshaping of the management of care pathways of CPAP-treated patients, with a specific focus on telemonitoring platforms, we aimed to review the evidence on how digital medicine and artificial intelligence (AI) tools are facilitating patient phenotyping and triage, risk stratification and the allocation of resources between the various healthcare professionals for an optimal follow-up of CPAP-treated patients. Phenotyping OSA is a heterogeneous condition with diverse phenotypes differing in symptoms, comorbidities, demographics, lifestyle and socioeconomic context. Different phenotypes are associated with different CPAP adherence patterns and differing long-term prognosis. This diversity demands greater plurality in management pathways with different types and levels of support to ensure treatment adherence and risk reduction for patients while easing the burden on health services. In multidimensional phenotyping, we discuss alternatives to the apnoea hypopnoea index (AHI) as a measure of OSA severity. Then we consider risk stratification taking advantage of the wealth of CPAP monitoring data already available in databases that can now be exploited using AI and machine learning to direct (stratify) patients into appropriate follow-up management pathways. Integrated care clinics for high-risk patients We look at the role of integrated OSA care clinics particularly for the management of high-risk patients with low adherence and progression of comorbidities. Here, multidisciplinary teams might propose comorbidity management, and the use of connected wearable devices for long-term monitoring of physical activity, along with remote CPAP monitoring. Remote management pathways The pros and cons of remote management pathways to replace in-person follow-up visits are considered, including the need to re-evaluate CPAP-device reimbursement policies in some countries. While remote CPAP monitoring has become the cornerstone of follow-up providing information on adherence and efficacy, the processing of alerts needs to be improved, particularly regarding mask changes and early detection of CPAP failures. Challenges The implementation of CPAP monitoring alone, as well as its extension to multimodal monitoring, can present challenges that remain to be addressed (eg, access to digital care). The extent and components of remote follow-up must be adapted to each specific OSA phenotype. Finally, we give examples of certain patient phenotypes (eg, comorbid insomnia with OSA) with specific follow-up requirements, for which remote (even multimodal) monitoring alone has limitations and the intervention of both sleep specialists and/or their colleagues from other disciplines is needed. Conclusion Appropriately tailored combined digital and in-person CPAP follow-up pathways would present advantages both for patients with OSA and healthcare services.",
        "DOI": "10.1136/thorax-2024-221422",
        "affiliation_name": "Laboratoire Hypoxie et Physiopathologies Cardiovasculaires et Respiratoires",
        "affiliation_city": "La Tronche",
        "affiliation_country": "France",
        "affiliation_id": "60209335",
        "affiliation_state": "Auvergne-Rhone-Alpes"
    },
    {
        "paper_title": "Identifying E-cigarette Content on TikTok: Using a BERTopic Modeling Approach",
        "paper_author": "Lee J.",
        "publication": "Nicotine &amp; tobacco research : official journal of the Society for Research on Nicotine and Tobacco",
        "citied_by": "1",
        "cover_date": "2024-12-23",
        "Abstract": "INTRODUCTION: The use of hashtags is a common way to promote e-cigarette content on social media. Analysis of hashtags may provide insight into e-cigarette promotion on social media. However, the examination of text data is complicated by the voluminous amount of social media data. This study used machine learning approaches (ie, Bidirectional Encoder Representations from Transformers [BERT] topic modeling) to identify e-cigarette content on TikTok. AIMS AND METHODS: We used 13 unique hashtags related to e-cigarettes (eg, #vape) for data collection. The final analytic sample included 12 573 TikTok posts. To identify the best fitting number of topic clusters, we used both quantitative (ie, coherence test) and qualitative approaches (ie, researchers checked the relevance of text from each topic). We, then, grouped and characterized clustered text for each theme. RESULTS: We evaluated that N = 18 was the ideal number of topic clusters. The 9 overarching themes were identified: Social media and TikTok-related features (N = 4; \"duet,\" \"viral\"), Vape shops and brands (N = 3; \"store\"), Vape tricks (N = 3; \"ripsaw\"), Modified use of e-cigarettes (N = 1; \"coil,\" \"wire\"), Vaping and girls (N = 1; \"girl\"), Vape flavors (N = 1; \"flavors\"), Vape and cigarettes (N = 1; \"smoke\"), Vape identities and communities (N = 1; \"community\"), and Non-English language (N = 3; Romanian and Spanish). CONCLUSIONS: This study used a machine learning method, BERTopic modeling, to successfully identify relevant themes on TikTok. This method can inform future social media research examining other tobacco products, and tobacco regulatory policies such as monitoring of e-cigarette marketing on social media. IMPLICATIONS: This study can inform future social media research examining other tobacco products, and tobacco regulatory policies such as monitoring of e-cigarette marketing on social media.",
        "DOI": "10.1093/ntr/ntae171",
        "affiliation_name": "Cockrell School of Engineering",
        "affiliation_city": "Austin",
        "affiliation_country": "United States",
        "affiliation_id": "60150401",
        "affiliation_state": "TX"
    },
    {
        "paper_title": "Machine learning framework for wastewater circular economy — Towards smarter nutrient recoveries",
        "paper_author": "Soo A.",
        "publication": "Desalination",
        "citied_by": "3",
        "cover_date": "2024-12-21",
        "Abstract": "As the world's supply chains become disrupted through geopolitical instability and the race towards a net-zero future, policies have been implemented to improve the security of certain minerals and raw materials critical to a country's survival and sustainability goals. Circular economies (CE) are sought to be an ecosystem that will reduce virgin material consumption rates, lower carbon emissions, and decelerate the rate of landfilling. However, cost-effective and commercially attractive substitutes to conventional products are needed for this to be realised. Machine learning (ML) and the explosion of interest in artificial intelligence (AI) have led to growing interests in predictive and generative applications for sustainability. Phosphorous and, nutrients overall, operate on finite reserves essential for food supply chains; while such nutrients are largely present in municipal wastewater streams. Wastewater treatment plants (WWTPs) must then face a transformational force to become nutrient recovery centres, rather than follow a linear treat-for-disposal model. In this framework paper, ML is positioned as an enabler for scaled, cost-effective and safer recovery of nutrients and other valuable products — tying in economic, societal, technical and commercial factors through open data connectivity. Moreover, the paper issues a policy guide for institutions wishing to advance food, energy and water security through machine learning, circular economy wastewater treatment plants (ML CE WWTP).",
        "DOI": "10.1016/j.desal.2024.118092",
        "affiliation_name": "University of Technology Sydney",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60023932",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Fraud detection in decentralized autonomous organization (DAO) with machine learning",
        "paper_author": "Thompson A.F.B.",
        "publication": "Intelligent Cybersecurity and Resilience for Critical Industries: Challenges and Applications",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "A decentralized autonomous organization (DAO) is a type of enterprise that operates on a decentralized structure where all members have equal contribution, right, and decision-making in the organization. This organization makes use of smart contracts, a software where the rules and policies of the organization are embedded. They are susceptible to threats and fraudulent activities which compromise their security. A flaw in the DAO's smart contract could lead to exploitation by hackers. This research is aimed at developing a fraud detection system using machine learning models and evaluating the performance of the system using standard performance metrics. Machine learning algorithms were employed to detect frauds in the DAO platform built under the Ethereum blockchain using a dataset of transactions, consisting of fraudulent and non-fraudulent transactions. Algorithms employed were the logistic regression, XGBoost, and random forest. These models were built and trained, and hyper parameter tuning was carried out on them. The results obtained from the evaluation metrics show that random forest and XGBoost give better results when compared to logistic regression. Logistic regression had accuracy and precision of 82.07% and 55.53%. Random forest had accuracy and precision of 98.52% and 96.49%. For XGBoost, its accuracy and precision are 98.12% are 93.33%. Other evaluation metrics were used in carrying out analysis, showing the best performing models, the random forest and the XGBoost. At the end of this research, a model for predicting threats in DAO was developed for the ecosystem. The developed system could be utilized in making predictions from past information like patterns of transactions and other available features, to ascertain if the account is fraudulent or not, that account can be terminated.",
        "DOI": "NA",
        "affiliation_name": "Elizade University",
        "affiliation_city": "Ilara-Mokin",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60113935",
        "affiliation_state": "Ondo"
    },
    {
        "paper_title": "Usage of algorithms and intelligent systems in the financial engineering process of insurance business in the VUCA world",
        "paper_author": "Ratnakaram S.",
        "publication": "AIP Conference Proceedings",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Algorithms and Intelligent Systems (&IS) have the potential scope and play a major role in the Insurance business in the VUCA (Volatility, Uncertainty, Complexity, and Ambiguity) world. &IS is transforming the major sectors of the economies worldwide. Particularly in the Insurance business, these two technologies are influenced by the ever-changing game rules of the sector. This sector has started using A& IS as one of the important tools in the design and development of Financially Engineered (FE) insurance products. Also, Insurance companies are using these technologies in their core business operational areas. FE is a process of creating innovative financial and insurance models using financial theory, financial mathematics, statistics, economics, econometrics, computer software, and other computational intelligence systems like algorithms, intelligent systems, machine learning, deep learning, etc. The main focus of the present research study is, how A& IS are contributing or playing a major technical tool role in the financial engineering process of the insurance sector. A& IS-enabled financial engineering process is happening at the product design, and development stage. Also, these are used in the core insurance business operational areas. These areas are, identifying customer behavior to convert and list them as prospective customers, filing of applications, underwriting process, claim settlement, fraud detection, reinsurance [15] [8], etc. Exploratory cum Descriptive research methodology was followed in the present study by researchers and proved finally the significant role of &IS in the financial engineering process of the insurance business.",
        "DOI": "10.1063/5.0234840",
        "affiliation_name": "O.P. Jindal Global University",
        "affiliation_city": "Sonipat",
        "affiliation_country": "India",
        "affiliation_id": "60106300",
        "affiliation_state": "HR"
    },
    {
        "paper_title": "Advances and opportunities in digital diabetic healthcare systems",
        "paper_author": "Vadia N.",
        "publication": "Decision Support System for Diabetes Healthcare: Advancements and Applications",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Diabetes has far-reaching implications, not only for those directly affected but also for caregivers, families, and communities. Unhealthy eating and sedentary lifestyles fuel the diabetes surge. Challenges to effectively controlling blood sugar in patients stem from limited access to specialized care, poor medication adherence, and inadequate self-care motivation. Nonetheless, healthcare is rapidly transforming, with state-of-the-art digital technologies like smartphone apps, telemedicine, m-health, device integration, machine learning, and AI poised to reshape diabetes management. These innovations offer great potential to improve care efficacy and encourage patients to play a more active self-care role. These innovations hold immense potential to enhance the efficacy of diabetes management while empowering patients to take a more active role in their self-care. The current healthcare system has given some great instances of overhauling the diabetes ecosystem by utilizing the possibilities of digital transformation. A revolutionary shift in diabetes management via digital transformation offers tremendous potential for optimizing healthcare cost and resource efficiency. This approach promises to elevate the quality and uniformity of diabetes care, transcending geographical constraints and also contributing to enhanced governance and policy formulation across diverse healthcare sectors. Furthermore, it catalyzes encouraging innovation and fostering collaboration among industry stakeholders, ultimately leading to the development of innovative products and solutions that support diabetes management and care. To create a better, more attainable future for individuals with diabetes, this chapter focuses on the most recent digital and technological developments and breakthroughs to identify the appropriate device for diabetes monitoring and management.",
        "DOI": "NA",
        "affiliation_name": "Marwadi University",
        "affiliation_city": "Rajkot",
        "affiliation_country": "India",
        "affiliation_id": "60138770",
        "affiliation_state": "GJ"
    },
    {
        "paper_title": "A Machine Learning architecture to forecast Irregular Border Crossings and Asylum requests for policy support in Europe: A case study",
        "paper_author": "Bosco C.",
        "publication": "Data and Policy",
        "citied_by": "0",
        "cover_date": "2024-12-20",
        "Abstract": "Anticipating future migration trends is instrumental to the development of effective policies to manage the challenges and opportunities that arise from population movements. However, anticipation is challenging. Migration is a complex system, with multifaceted drivers, such as demographic structure, economic disparities, political instability, and climate change. Measurements encompass inherent uncertainties, and the majority of migration theories are either under-specified or hardly actionable. Moreover, approaches for forecasting generally target specific migration flows, and this poses challenges for generalisation. In this paper, we present the results of a case study to predict Irregular Border Crossings (IBCs) through the Central Mediterranean Route and Asylum requests in Italy. We applied a set of Machine Learning techniques in combination with a suite of traditional data to forecast migration flows. We then applied an ensemble modelling approach for aggregating the results of the different Machine Learning models to improve the modelling prediction capacity. Our results show the potential of this modelling architecture in producing forecasts of IBCs and Asylum requests over 6 months. The explained variance of our models through a validation set is as high as 80%. This study offers a robust basis for the construction of timely forecasts. In the discussion, we offer a comment on how this approach could benefit migration management in the European Union at various levels of policy making.",
        "DOI": "10.1017/dap.2024.48",
        "affiliation_name": "European Commission Joint Research Centre",
        "affiliation_city": "Brussels",
        "affiliation_country": "Belgium",
        "affiliation_id": "60103695",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Ecosystem heterogeneity is key to limiting the increasing climate-driven risks to European forests",
        "paper_author": "Forzieri G.",
        "publication": "One Earth",
        "citied_by": "1",
        "cover_date": "2024-12-20",
        "Abstract": "The rise in forest disturbances due to climate change poses a serious threat to key forest ecosystem services, yet impact and adaptation assessments are scarce at European scale. Here, we estimate the forest biomass loss in Europe due to fires, windthrows, and insect outbreaks over 1979–2018 and evaluate potential adaptation benefits by integrating machine learning with disturbance data and satellite products. Results show an average overall annual biomass loss of 41.6 ± 5.3 Mt at European level subject to a significant rise of 2.3 ± 0.3 Mt year−1, largely influenced by climate change (72%–98%). The contribution of insect outbreaks appears prominent (79%) compared to windthrows (20%) and fires (1%) and linked to their upsurge after the year 2000. However, impacts vary greatly across Europe depending on local environmental conditions. We estimate that enhancing ecosystem heterogeneity could reduce biomass loss by about 18%, and such action should therefore be fostered in forest adaptation policies.",
        "DOI": "10.1016/j.oneear.2024.10.005",
        "affiliation_name": "INRAE",
        "affiliation_city": "Paris",
        "affiliation_country": "France",
        "affiliation_id": "60123163",
        "affiliation_state": "Ile-de-France"
    },
    {
        "paper_title": "AutoQuo: An Adaptive plan optimizer with reinforcement learning for query plan selection",
        "paper_author": "Xiong X.",
        "publication": "Knowledge-Based Systems",
        "citied_by": "1",
        "cover_date": "2024-12-20",
        "Abstract": "An efficient execution plan generation is crucial for optimizing database queries. In exploring large table spaces to identify the most optimal table join orders, traditional cost-based optimizers may encounter challenges when confronted with complicated queries. Thus, learning-based optimizers have recently been proposed to leverage past experience and generate high-quality execution plans. However, these optimizers demonstrate limited generalization capabilities for workloads with diverse distributions. In this study, an adaptive plan selector based on reinforcement learning is proposed to address these issues. However, three challenges remain: (1) How to generate optimal multi-table join orders? We adopt an exploration–exploitation strategy to traverse the vast search space composed of candidate tables, thereby evaluating the significance of each table. Long short-term memory (LSTM) networks are subsequently used to predict the performance of join orders and generate high-quality candidate plans. (2) How to automatically learn new features in novel datasets? We employ the Actor–Critic strategy, which involves jointly cross-training the policy and value networks. By adjusting the parameters based on real feedback obtained from the database, the new datasets are automatically learnt. (3) How to automatically select the best plan? We introduce a constraint-aware optimal plan selection model that captures the relationship between constraints and plans. This model guides the selection of the best plan under constraints of execution time, cardinality, cost, and mean-squared error (MSE). The experimental results on real datasets demonstrated the superiority of the proposed approach over state-of-the-art baselines. Compared with PostgreSQL, we observed a reduction of 29.73% in total latency and 28.36% in tail latency.",
        "DOI": "10.1016/j.knosys.2024.112664",
        "affiliation_name": "Xinjiang University",
        "affiliation_city": "Urumqi",
        "affiliation_country": "China",
        "affiliation_id": "60015780",
        "affiliation_state": "Xinjiang"
    },
    {
        "paper_title": "Transformer-based in-context policy learning for efficient active flow control across various airfoils",
        "paper_author": "Zheng C.",
        "publication": "Journal of Fluid Mechanics",
        "citied_by": "0",
        "cover_date": "2024-12-19",
        "Abstract": "Active flow control based on reinforcement learning has received much attention in recent years. Indeed, the requirement for substantial data for trial-and-error in reinforcement learning policies has posed a significant impediment to their practical application, which also serves as a limiting factor in the training of cross-case agents. This study proposes an in-context active flow control policy learning framework grounded in reinforcement learning data. A transformer-based policy improvement operator is set up to model the process of reinforcement learning as a causal sequence and autoregressively give actions with sufficiently long context on new unseen cases. In flow separation problems, this framework demonstrates the capability to successfully learn and apply efficient flow control strategies across various airfoil configurations. Compared with general reinforcement learning, this learning mode without the need for updating the network parameter has even higher efficiency. This study presents an effective novel technique in using a single transformer model to address the flow separation active flow control problem on different airfoils. Additionally, the study provides an innovative demonstration of incorporating reinforcement-learning-based flow control with aerodynamic shape optimization, leading to collective enhancement in performance. This method efficiently lessens the training burden of the new flow control policy during shape optimization, and opens up a promising avenue for interdisciplinary intelligent co-design of future vehicles.",
        "DOI": "10.1017/jfm.2024.1133",
        "affiliation_name": "Zhejiang University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60003970",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "How machine learning boosts the understanding of organic pollutant adsorption on carbonaceous materials: A comprehensive review with statistical insights",
        "paper_author": "Wang Z.",
        "publication": "Separation and Purification Technology",
        "citied_by": "3",
        "cover_date": "2024-12-18",
        "Abstract": "The application of machine learning (ML) is promising to solve the difficulty of predicting the adsorption of various organic pollutants on carbonaceous materials. This study highlights how ML advances the adsorption research, emphasizes the robust model construction specialized for presenting various application scenarios of adsorption models. We introduce, for the first time, a systematic data preparation workflow tailored for optimizing adsorption studies. Emphasis is given to addressing key challenges in data preparation, including managing adsorption datasets, preventing data leakage, and choosing descriptors wisely. Various algorithms used in 39 previous related studies were included in statistical analysis, and the applications of emerging algorithms in adsorption were prospected. For the data-driven model, the application of importance analysis is beneficial for comprehending adsorption mechanisms, transforming the black-box models into a glass-box ones. It facilitates the identification of primary features governing the adsorption of distinct emerging contaminants and the optimized design of efficient carbonaceous adsorbents. In addition, this review provides prospects for the advanced ML applications in adsorption research, such as its integration with reinforcement learning policies. We also explore the potential of ML in addressing the complexities associated with multi-component adsorption. In sum, this review offers unprecedented illumination into the opportunities and challenges posed by ML in the realm of aqueous adsorption processes.",
        "DOI": "10.1016/j.seppur.2024.127790",
        "affiliation_name": "University of Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60027363",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Flipped Classroom Mobile Learning Model and Its Application to Enhance Digital Intelligence Quotient among Secondary Students",
        "paper_author": "Phumeechanya N.",
        "publication": "International Journal of Interactive Mobile Technologies",
        "citied_by": "0",
        "cover_date": "2024-12-17",
        "Abstract": "Digital intelligence quotient (DQ) is an essential skill for becoming a digital citizen. In Thailand, the development of DQ is a key policy initiative for youth development. Using mobile applications in a flipped classroom (FC) setting enhances learning outcomes and fosters the development of critical skills. This paper proposes a mobile application integrated with a FC model to improve secondary education students’ DQ. The study utilized an experimental research design with a one-group pretest-posttest approach to compare students’ DQ, analyzed using a paired sample t-test, and assessed student satisfaction. The sample consisted of 60 lower secondary school students under Thailand’s Nakhon Pathom Secondary Education Service Area Office. The research findings are as follows: 1) The developed learning model was rated as highly appropriate; 2) The content and technical quality of the FC mobile application was rated very good; 3) Students’ DQ significantly improved after using the application, with a statistical significance level of 0.05. Among the eight sub-skills, screen time management showed the highest improvement; and 4) Student satisfaction with the learning model was at the highest level. Based on these findings, the developed model can enhance students’ DQ and is adaptable for other audiences requiring digital navigation skills, making the results relevant to broader educational objectives beyond traditional coursework.",
        "DOI": "10.3991/ijim.v18i24.50077",
        "affiliation_name": "Nakhon Pathom Rajabhat University",
        "affiliation_city": "Nakhon Pathom",
        "affiliation_country": "Thailand",
        "affiliation_id": "60021938",
        "affiliation_state": "Nakhon Pathom"
    },
    {
        "paper_title": "Discrepant Global Surface Ozone Responses to Emission- and Heatwave-Induced Regime Shifts",
        "paper_author": "Tao C.",
        "publication": "Environmental Science and Technology",
        "citied_by": "0",
        "cover_date": "2024-12-17",
        "Abstract": "Heatwaves have substantial but poorly quantified impacts on surface ozone photochemical regimes. As heatwaves of increasing severity occur, communities face more serious exposure to ozone, necessitating a more comprehensive understanding of the impact of heatwaves on the nonlinear response of ozone to its precursors for guiding policies in emission reductions. Here we estimate the spatiotemporal evolution of global ozone chemistry based on machine learning and in situ observations and show that emission changes and heatwaves alter ozone photochemical regimes, leading to diverse ozone changes across regions. Sustained emission reductions in East Asia decreased the ozone formation sensitivity to formaldehyde (HCHO) and fine particulate matter (PM2.5), counteracting the adverse high-temperature effect. Quantified results reveal that heatwaves increased the sensitivity of ozone to HCHO and PM2.5, enhancing their positive contributions and causing increased ozone trends across most regions, with a global average anomaly of 9.4 μg/m3. Meanwhile, heatwave-induced PM2.5 anomalies concentrated in wildfire-risk zones, coupled with increased HCHO, elevated downwind ozone levels. Specifically, the effects in wildfire-endangered western Canada and heatwave-exposed southeastern United States contributed to a chemically driven ozone increase of 0.18 μg/m3/month in Northern America. Our results demonstrate that more targeted and substantial regulation of volatile organic compounds will be beneficial in mitigating future intensifying climate penalty effects.",
        "DOI": "10.1021/acs.est.4c08422",
        "affiliation_name": "Shandong University",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60031031",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Monitoring Sustainable Development Goals in European Legislation using Hybrid AI",
        "paper_author": "Corazza M.",
        "publication": "ACM International Conference Proceeding Series",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "There is an urgency to detect in legal acts the corresponding provisions where a policy is implemented, to track its evolution over time, to measure the effectiveness of the norms, and to evaluate the impact on society. From this perspective, the Sustainable Development Goals program (SDG) provides a fundamental instrument for monitoring ground basis pillar of the world wide policies. In this work, we propose a method which leverages both the structural nature of legislative documents in AKN-XML and unsupervised machine learning to perform a match between individual articles and definitions and the 2030 Agenda for Sustainable Development Goals, yielding a more fine-grained annotation of individual articles and definitions, instead of the preexisting document-level annotation. Our work provides better traceability of the SDGs policies in the EU legislation permitting the legislator to detect the articles where the association is weakest. During the legal drafting, our tool could be integrated into the editor to suggest better legal definitions for improving the implementation of the SDGs.",
        "DOI": "10.1145/3680127.3680223",
        "affiliation_name": "Alma Mater Studiorum Università di Bologna",
        "affiliation_city": "Bologna",
        "affiliation_country": "Italy",
        "affiliation_id": "60028218",
        "affiliation_state": "BO"
    },
    {
        "paper_title": "Artificial Intelligence and Entrepreneurship",
        "paper_author": "Fossen F.M.",
        "publication": "Foundations and Trends in Entrepreneurship",
        "citied_by": "0",
        "cover_date": "2024-12-16",
        "Abstract": "Advances in artificial intelligence (AI) have brought the world to the threshold of significant new technological breakthroughs. These developments bring new opportunities and challenges to existing and potential entrepreneurs, raising pressing and promising research questions. We review emerging but fast-growing literature on impacts of AI on entrepreneurship, providing a resource for researchers in entrepreneurship and neighboring disciplines. We begin with a review of definitions of AI and show that ambiguity and broadness of definitions adopted in empirical studies may result in obscured evidence on impacts of AI on entrepreneurship. Against this background, we present and discuss existing theories and evidence on how AI technologies affect entrepreneurial opportunities and decision-making under uncertainty, the adoption of AI technologies by startups, entry barriers, and the performance of entrepreneurial businesses. We add an original empirical analysis of survey data from the German Socio-economic Panel revealing that entrepreneurs, particularly those with employees, are aware of and use AI technologies significantly more frequently than paid employees. Next, we discuss how AI may affect entrepreneurship indirectly through impacting local and sectoral labor markets. The reviewed evidence suggests that AI technologies that are designed to automate jobs are likely to result in a higher level of necessity entrepreneurship in a region, whereas AI technologies that transform jobs without necessarily displacing human workers increase the level of opportunity entrepreneurship. More generally, AI impacts regional entrepreneurship ecosystems (EE) in multiple ways by altering the importance of existing EE elements and processes, creating new ones, and potentially reducing the role of geography for entrepreneurship. Lastly, we address the question of how the regulation of AI may affect the entrepreneurship landscape by focusing on the case of the European Union and its data protection and AI legislation. We conclude our survey by discussing implications for entrepreneurship research and policy.",
        "DOI": "10.1561/0300000130",
        "affiliation_name": "John Cabot University",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60103326",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "A comparative study of machine learning models for predicting Aman rice yields in Bangladesh",
        "paper_author": "Islam T.",
        "publication": "Heliyon",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Aman rice, a major staple crop in Bangladesh, is cultivated during the monsoon season and is highly dependent on climatic conditions such as rainfall and temperature. This study aims to identify the most effective machine learning models for predicting Aman rice yields by leveraging 52 years of historical data (1970–2022). Data preprocessing included outlier correction, statistical imputation, and aggregation of monthly averages for varibales like rainfall, temperature, humidity and others during the monsoon (June–September). Various machine learning models - Random Forest, Neural Network, Decision Tree, Linear Regression, and Gradient Boosting - were employed to capture yield trends under changing climatic conditions. Each model was evaluated based on Root Mean Squared Error (RMSE), R-squared (R2), and Mean Absolute Error (MAE). Random Forest emerged as the most accurate model showing robustness to climate variability through sensitivity analysis. While Gradient Boosting also performed well, though with slightly higher error margins. Linear Regression provided reasonable outputs, but it struggled with non-linear patterns. In contrast, Neural Networks and Decision Trees showed less accuracy in capturing intricate relationships between climate variables and rice yields. The Random Forest model predicts Aman rice yields to reach 133.31 metric tonnes by 2030 (34.11 % of total rice production) and 140 metric tonnes by 2050 (32.86 %). Climate projections suggest a rise in temperatures from 26.5°C to 37.41 °C in 2030 to 27.33°C-38.26 °C by 2050, with monsoon rainfall increasing slightly from 302.37 mm to 305.7 mm. These changes in climatic conditions could place additional stress on rice production, especially due to higher temperatures. The findings align with international studies highlighting the challenges that rising temperatures and fluctuating rainfall pose to crop yields. These findings emphasize the need for adaptive agricultural techniques and policies to mitigate climate change impacts on rice production, supporting food security and sustainable development in Bangladesh.",
        "DOI": "10.1016/j.heliyon.2024.e40764",
        "affiliation_name": "Khulna University of Engineering and Technology",
        "affiliation_city": "Khulna",
        "affiliation_country": "Bangladesh",
        "affiliation_id": "60025301",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Corrigendum to ‘Coastal flood risk assessment using ensemble multi-criteria decision-making with machine learning approaches’ [Environ. Res., 245 (2024), 118042] (Environmental Research (2024) 245, (S0013935123028463), (10.1016/j.envres.2023.118042))",
        "paper_author": "Asiri M.M.",
        "publication": "Environmental Research",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Request: During the review process, we have received feedback that we should update the terminology used in the paper to refer to the “Arab Gulf” instead of the “Persian Gulf.” This is due to a strict policy we have to avoid using the term “Persian Gulf” in our publications. To address this, we would like to request permission to resubmit a revised version of the paper with the necessary changes. Specifically, we will update the label in content and map in the paper to use the label “Arab Gulf” instead of “Persian Gulf.” No other changes to the content or analysis will be made. We apologize for any inconvenience this may cause, and we appreciate your understanding and consideration of our request. The authors regret < insert corrigendum text>. The authors would like to apologize for any inconvenience caused.",
        "DOI": "10.1016/j.envres.2024.120323",
        "affiliation_name": "University of Hafr Al-Batin",
        "affiliation_city": "Hafar al Batin",
        "affiliation_country": "Saudi Arabia",
        "affiliation_id": "60110523",
        "affiliation_state": "Ash Sharqiyah"
    },
    {
        "paper_title": "Automatic standard building category classification from smart meter data – A supervised learning approach",
        "paper_author": "Lien S.K.",
        "publication": "Energy and Buildings",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Increased availability of smart meter data offers better insight into buildings’ electricity usage. By classifying smart meter data by building type and presence of heating appliances, we can efficiently gain metadata about the buildings that is useful for research, grid planning, and energy efficiency policy employment. However, current smart meter classification approaches are largely based on limited datasets and building classes, or on unsupervised methods that don't align with standard building categories and offer limited control over grouping. This article presents a supervised automatic building category classification approach for labelling smart meter data from buildings into standard building categories in the Norwegian building regulations (TEK17), and whether they have electric heating or not. 82 novel physics-based domain features are presented which can be extracted from any hourly electricity smart meter data series from buildings with a duration of months-years. The features are specifically designed to identify the building and heating type of a smart meter data series by capturing patterns such as seasonality, daily usage trends, similarities with standardized building load profiles, temperature dependency, and other domain-specific characteristics. The classification approach is trained and tested on a large dataset of 2724 buildings from 12 different building categories, both residential and non-residential, and correctly identifies the heating type and building category of unseen Norwegian smart meter data from buildings in 84 % of the test cases. The approach is generalizable to meter data from other Norwegian buildings and is also tested on buildings from other climate zones. The proposed method for smart meter data classification is proven to have high accuracy and applicability for extracting metadata for both residential and non-residential buildings in Norway.",
        "DOI": "10.1016/j.enbuild.2024.114954",
        "affiliation_name": "Norges Teknisk-Naturvitenskapelige Universitet",
        "affiliation_city": "Trondheim",
        "affiliation_country": "Norway",
        "affiliation_id": "60013141",
        "affiliation_state": "Trondelag"
    },
    {
        "paper_title": "Nationwide operational mapping of grassland first mowing dates combining machine learning and Sentinel-2 time series",
        "paper_author": "Rivas H.",
        "publication": "Remote Sensing of Environment",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Grassland dynamics are modulated by management intensity and impact overall ecosystem functioning. In mowed grasslands, the first mowing date is a key indicator of management intensification. The aim of this work was to assess several supervised regression models for mapping grassland first mowing date at national-level using Sentinel-2 time series. Three deep-learning architectures, two conventional machine learning models and two threshold-based methods (fixed and relative) were compared. Algorithms were trained/calibrated and tested from field observations, using a spatial cross-validation approach. Our findings showed that time aware deep-learning models – Lightweight Temporal Attention Encoder (LTAE) and 1D Convolutional Neural Network (1D-CNN) – yielded higher performances compared to Multilayer Perceptron, Random Forest and Ridge Regression models. Threshold-based methods under-performed compared to all other models. Best model (LTAE) mean absolute error was within six days with a coefficient of determination of 0.52. Additionally, errors were accentuated at extreme (late/early) mowing dates, which were underrepresented in the data set. Oversampling techniques did not improve predicting extreme mowing dates. Finally, the best prediction accuracy was obtained when the number of clear dates surrounding the mowing event was greater than 2. Our outputs evidenced time aware deep-learning models’ potential for large-scale grassland first mowing event monitoring. A national-level map was produced to support bird-life monitoring or public policies for biodiversity and agro-ecological transition in France.",
        "DOI": "10.1016/j.rse.2024.114476",
        "affiliation_name": "Université Toulouse III - Paul Sabatier",
        "affiliation_city": "Toulouse",
        "affiliation_country": "France",
        "affiliation_id": "60027245",
        "affiliation_state": "Occitanie"
    },
    {
        "paper_title": "Inter-annual changes in transboundary air quality from KORUS-AQ 2016 to SIJAQ 2022 campaign periods and assessment of emission reduction strategies in Northeast Asia",
        "paper_author": "Park M.J.",
        "publication": "Environmental Pollution",
        "citied_by": "0",
        "cover_date": "2024-12-15",
        "Abstract": "Northeast Asia suffers from high concentrations of particulate matter (PM), prompting nations to actively implement emission reduction policies. This study evaluated the recent inter-annual changes in the chemical transformation and transboundary transport of PM over Northeast Asia, based on both ground and aircraft measurements, as well as WRF-Chem simulations, during two comprehensive campaigns: the Korea–United States Air Quality (KORUS-AQ) campaign in 2016 and the Satellite Integrated Joint Monitoring of Air Quality (SIJAQ) campaign in 2022, both conducted around the Korean Peninsula. Ground measurements in 2022 revealed significant reductions in air pollutants compared to 2016 levels. In the Beijing–Tianjin–Hebei region, PM2.5 and SO2 concentrations decreased by 47.2% and 73.9%, respectively, attributable to successful SOx and NOx emission reduction strategies. Similar trends were observed in downwind areas, including Seoul, where PM2.5 and SO2 levels declined by 30.0% and 41.4%, respectively. WRF-Chem model results indicated substantial decreases in sulfates, nitrates, and their precursors in both surface and upper atmosphere in 2022 compared to 2016. Moreover, model-calculated gas-to-particle conversion ratios, which peaked in the Yellow Sea in 2016, decreased by 15% in 2022 and shifted slightly eastward to the western Korean Peninsula. This shift suggests a potential decline in secondary PM formation processed in the Yellow Sea, coinciding with reduced long-range transport of gaseous pollutants. A comparison of model sensitivity experiments, accounting for both bottom-up emission changes and meteorological variations, revealed that while weather and climate factors such as precipitation and pressure patterns between 2016 and 2022 contributed to the overall decrease in PM concentrations, the primary driver was the reduction in emissions during this period. This study highlighted that the main driver of the substantial improvement in air quality over East Asia was the implementation of emission reduction policies targeting PM and its precursors in the main source regions in China.",
        "DOI": "10.1016/j.envpol.2024.125114",
        "affiliation_name": "Ulsan National Institute of Science and Technology",
        "affiliation_city": "Ulsan",
        "affiliation_country": "South Korea",
        "affiliation_id": "60103153",
        "affiliation_state": "NA"
    }
]