[
    {
        "paper_title": "Review of Particle Physics",
        "publication": "Progress of Theoretical and Experimental Physics",
        "citied_by": "3632",
        "cover_date": "2022-08-01",
        "Abstract": "The Review summarizes much of particle physics and cosmology. Using data from previous editions, plus 2,143 new measurements from 709 papers, we list, evaluate, and average measured properties of gauge bosons and the recently discovered Higgs boson, leptons, quarks, mesons, and baryons. We summarize searches for hypothetical particles such as supersymmetric particles, heavy bosons, axions, dark photons, etc. Particle properties and search limits are listed in Summary Tables. We give numerous tables, figures, formulae, and reviews of topics such as Higgs Boson Physics, Supersymmetry, Grand Unified Theories, Neutrino Mixing, Dark Energy, Dark Matter, Cosmology, Particle Detectors, Colliders, Probability and Statistics. Among the 120 reviews are many that are new or heavily revised, including a new review on Machine Learning, and one on Spectroscopy of Light Meson Resonances. The Review is divided into two volumes. Volume 1 includes the Summary Tables and 97 review articles. Volume 2 consists of the Particle Listings and contains also 23 reviews that address specific aspects of the data presented in the Listings. The complete Review (both volumes) is published online on the website of the Particle Data Group (pdg.lbl.gov) and in a journal. Volume 1 is available in print as the PDG Book. A Particle Physics Booklet with the Summary Tables and essential tables, figures, and equations from selected review articles is available in print, as a web version optimized for use on phones, and as an Android app.",
        "DOI": "10.1093/ptep/ptac097",
        "paper_author": "Workman R.L.",
        "affiliation_name": "The George Washington University",
        "affiliation_city": "Washington, D.C.",
        "affiliation_country": "United States",
        "affiliation_id": "60003088",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Water electrolysis: from textbook knowledge to the latest scientific strategies and industrial developments",
        "publication": "Chemical Society Reviews",
        "citied_by": "918",
        "cover_date": "2022-05-16",
        "Abstract": "Replacing fossil fuels with energy sources and carriers that are sustainable, environmentally benign, and affordable is amongst the most pressing challenges for future socio-economic development. To that goal, hydrogen is presumed to be the most promising energy carrier. Electrocatalytic water splitting, if driven by green electricity, would provide hydrogen with minimal CO2 footprint. The viability of water electrolysis still hinges on the availability of durable earth-abundant electrocatalyst materials and the overall process efficiency. This review spans from the fundamentals of electrocatalytically initiated water splitting to the very latest scientific findings from university and institutional research, also covering specifications and special features of the current industrial processes and those processes currently being tested in large-scale applications. Recently developed strategies are described for the optimisation and discovery of active and durable materials for electrodes that ever-increasingly harness first-principles calculations and machine learning. In addition, a technoeconomic analysis of water electrolysis is included that allows an assessment of the extent to which a large-scale implementation of water splitting can help to combat climate change. This review article is intended to cross-pollinate and strengthen efforts from fundamental understanding to technical implementation and to improve the ‘junctions’ between the field's physical chemists, materials scientists and engineers, as well as stimulate much-needed exchange among these groups on challenges encountered in the different domains.",
        "DOI": "10.1039/d0cs01079k",
        "paper_author": "Chatenet M.",
        "affiliation_name": "Université Grenoble Alpes",
        "affiliation_city": "Saint Martin d'Heres",
        "affiliation_country": "France",
        "affiliation_id": "60104653",
        "affiliation_state": "Auvergne-Rhone-Alpes"
    },
    {
        "paper_title": "Exosomes as a new frontier of cancer liquid biopsy",
        "publication": "Molecular Cancer",
        "citied_by": "465",
        "cover_date": "2022-12-01",
        "Abstract": "Liquid biopsy, characterized by minimally invasive detection through biofluids such as blood, saliva, and urine, has emerged as a revolutionary strategy for cancer diagnosis and prognosis prediction. Exosomes are a subset of extracellular vesicles (EVs) that shuttle molecular cargoes from donor cells to recipient cells and play a crucial role in mediating intercellular communication. Increasing studies suggest that exosomes have a great promise to serve as novel biomarkers in liquid biopsy, since large quantities of exosomes are enriched in body fluids and are involved in numerous physiological and pathological processes. However, the further clinical application of exosomes has been greatly restrained by the lack of high-quality separation and component analysis methods. This review aims to provide a comprehensive overview on the conventional and novel technologies for exosome isolation, characterization and content detection. Additionally, the roles of exosomes serving as potential biomarkers in liquid biopsy for the diagnosis, treatment monitoring, and prognosis prediction of cancer are summarized. Finally, the prospects and challenges of applying exosome-based liquid biopsy to precision medicine are evaluated.",
        "DOI": "10.1186/s12943-022-01509-9",
        "paper_author": "Yu D.",
        "affiliation_name": "Jiangsu University",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60017482",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Edge Artificial Intelligence for 6G: Vision, Enabling Technologies, and Applications",
        "publication": "IEEE Journal on Selected Areas in Communications",
        "citied_by": "464",
        "cover_date": "2022-01-01",
        "Abstract": "The thriving of artificial intelligence (AI) applications is driving the further evolution of wireless networks. It has been envisioned that 6G will be transformative and will revolutionize the evolution of wireless from 'connected things' to 'connected intelligence'. However, state-of-the-art deep learning and big data analytics based AI systems require tremendous computation and communication resources, causing significant latency, energy consumption, network congestion, and privacy leakage in both of the training and inference processes. By embedding model training and inference capabilities into the network edge, edge AI stands out as a disruptive technology for 6G to seamlessly integrate sensing, communication, computation, and intelligence, thereby improving the efficiency, effectiveness, privacy, and security of 6G networks. In this paper, we shall provide our vision for scalable and trustworthy edge AI systems with integrated design of wireless communication strategies and decentralized machine learning models. New design principles of wireless networks, service-driven resource allocation optimization methods, as well as a holistic end-to-end system architecture to support edge AI will be described. Standardization, software and hardware platforms, and application scenarios are also discussed to facilitate the industrialization and commercialization of edge AI systems.",
        "DOI": "10.1109/JSAC.2021.3126076",
        "paper_author": "Letaief K.B.",
        "affiliation_name": "Hong Kong University of Science and Technology",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008592",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Learning robust perceptive locomotion for quadrupedal robots in the wild",
        "publication": "Science Robotics",
        "citied_by": "450",
        "cover_date": "2022-01-01",
        "Abstract": "Legged robots that can operate autonomously in remote and hazardous environments will greatly increase opportunities for exploration into underexplored areas. Exteroceptive perception is crucial for fast and energy-efficient locomotion: Perceiving the terrain before making contact with it enables planning and adaptation of the gait ahead of time to maintain speed and stability. However, using exteroceptive perception robustly for locomotion has remained a grand challenge in robotics. Snow, vegetation, and water visually appear as obstacles on which the robot cannot step or are missing altogether due to high reflectance. In addition, depth perception can degrade due to difficult lighting, dust, fog, reflective or transparent surfaces, sensor occlusion, and more. For this reason, the most robust and general solutions to legged locomotion to date rely solely on proprioception. This severely limits locomotion speed because the robot has to physically feel out the terrain before adapting its gait accordingly. Here, we present a robust and general solution to integrating exteroceptive and proprioceptive perception for legged locomotion. We leverage an attention-based recurrent encoder that integrates proprioceptive and exteroceptive input. The encoder is trained end to end and learns to seamlessly combine the different perception modalities without resorting to heuristics. The result is a legged locomotion controller with high robustness and speed. The controller was tested in a variety of challenging natural and urban environments over multiple seasons and completed an hour-long hike in the Alps in the time recommended for human hikers.",
        "DOI": "10.1126/scirobotics.abk2822",
        "paper_author": "Miki T.",
        "affiliation_name": "ETH Zürich",
        "affiliation_city": "Zurich",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60025858",
        "affiliation_state": "ZH"
    },
    {
        "paper_title": "Deep physical neural networks trained with backpropagation",
        "publication": "Nature",
        "citied_by": "418",
        "cover_date": "2022-01-27",
        "Abstract": "Deep-learning models have become pervasive tools in science and engineering. However, their energy requirements now increasingly limit their scalability1. Deep-learning accelerators2–9 aim to perform deep learning energy-efficiently, usually targeting the inference phase and often by exploiting physical substrates beyond conventional electronics. Approaches so far10–22 have been unable to apply the backpropagation algorithm to train unconventional novel hardware in situ. The advantages of backpropagation have made it the de facto training method for large-scale neural networks, so this deficiency constitutes a major impediment. Here we introduce a hybrid in situ–in silico algorithm, called physics-aware training, that applies backpropagation to train controllable physical systems. Just as deep learning realizes computations with deep neural networks made from layers of mathematical functions, our approach allows us to train deep physical neural networks made from layers of controllable physical systems, even when the physical layers lack any mathematical isomorphism to conventional artificial neural network layers. To demonstrate the universality of our approach, we train diverse physical neural networks based on optics, mechanics and electronics to experimentally perform audio and image classification tasks. Physics-aware training combines the scalability of backpropagation with the automatic mitigation of imperfections and noise achievable with in situ algorithms. Physical neural networks have the potential to perform machine learning faster and more energy-efficiently than conventional electronic processors and, more broadly, can endow physical systems with automatically designed physical functionalities, for example, for robotics23–26, materials27–29 and smart sensors30–32.",
        "DOI": "10.1038/s41586-021-04223-6",
        "paper_author": "Wright L.G.",
        "affiliation_name": "Cornell University College of Engineering",
        "affiliation_city": "Ithaca",
        "affiliation_country": "United States",
        "affiliation_id": "60104946",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Recent Progress and Future Prospects on All-Organic Polymer Dielectrics for Energy Storage Capacitors",
        "publication": "Chemical Reviews",
        "citied_by": "403",
        "cover_date": "2022-02-09",
        "Abstract": "With the development of advanced electronic devices and electric power systems, polymer-based dielectric film capacitors with high energy storage capability have become particularly important. Compared with polymer nanocomposites with widespread attention, all-organic polymers are fundamental and have been proven to be more effective choices in the process of scalable, continuous, and large-scale industrial production, leading to many dielectric and energy storage applications. In the past decade, efforts have intensified in this field with great progress in newly discovered dielectric polymers, fundamental production technologies, and extension toward emerging computational strategies. This review summarizes the recent progress in the field of energy storage based on conventional as well as heat-resistant all-organic polymer materials with the focus on strategies to enhance the dielectric properties and energy storage performances. The key parameters of all-organic polymers, such as dielectric constant, dielectric loss, breakdown strength, energy density, and charge-discharge efficiency, have been thoroughly studied. In addition, the applications of computer-aided calculation including density functional theory, machine learning, and materials genome in rational design and performance prediction of polymer dielectrics are reviewed in detail. Based on a comprehensive understanding of recent developments, guidelines and prospects for the future development of all-organic polymer materials with dielectric and energy storage applications are proposed.",
        "DOI": "10.1021/acs.chemrev.1c00793",
        "paper_author": "Feng Q.K.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "High-entropy nanoparticles: Synthesis-structureproperty relationships and data-driven discovery",
        "publication": "Science",
        "citied_by": "385",
        "cover_date": "2022-04-08",
        "Abstract": "High-entropy nanoparticles have become a rapidly growing area of research in recent years. Because of their multielemental compositions and unique high-entropy mixing states (i.e., solid-solution) that can lead to tunable activity and enhanced stability, these nanoparticles have received notable attention for catalyst design and exploration. However, this strong potential is also accompanied by grand challenges originating from their vast compositional space and complex atomic structure, which hinder comprehensive exploration and fundamental understanding. Through a multidisciplinary view of synthesis, characterization, catalytic applications, high-throughput screening, and data-driven materials discovery, this review is dedicated to discussing the important progress of high-entropy nanoparticles and unveiling the critical needs for their future development for catalysis, energy, and sustainability applications.",
        "DOI": "10.1126/science.abn3103",
        "paper_author": "Yao Y.",
        "affiliation_name": "A. James Clark School of Engineering",
        "affiliation_city": "College Park",
        "affiliation_country": "United States",
        "affiliation_id": "60078684",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "Cellular, Wide-Area, and Non-Terrestrial IoT: A Survey on 5G Advances and the Road Toward 6G",
        "publication": "IEEE Communications Surveys and Tutorials",
        "citied_by": "372",
        "cover_date": "2022-01-01",
        "Abstract": "The next wave of wireless technologies is proliferating in connecting things among themselves as well as to humans. In the era of the Internet of Things (IoT), billions of sensors, machines, vehicles, drones, and robots will be connected, making the world around us smarter. The IoT will encompass devices that must wirelessly communicate a diverse set of data gathered from the environment for myriad new applications. The ultimate goal is to extract insights from this data and develop solutions that improve quality of life and generate new revenue. Providing large-scale, long-lasting, reliable, and near real-time connectivity is the major challenge in enabling a smart connected world. This paper provides a comprehensive survey on existing and emerging communication solutions for serving IoT applications in the context of cellular, wide-area, as well as non-terrestrial networks. Specifically, wireless technology enhancements for providing IoT access in the fifth-generation (5G) and beyond cellular networks, and communication networks over the unlicensed spectrum are presented. Aligned with the main key performance indicators of 5G and beyond 5G networks, we investigate solutions and standards that enable energy efficiency, reliability, low latency, and scalability (connection density) of current and future IoT networks. The solutions include grant-free access and channel coding for short-packet communications, non-orthogonal multiple access, and on-device intelligence. Further, a vision of new paradigm shifts in communication networks in the 2030s is provided, and the integration of the associated new technologies like artificial intelligence, non-terrestrial networks, and new spectra is elaborated. In particular, the potential of using emerging deep learning and federated learning techniques for enhancing the efficiency and security of IoT communication are discussed, and their promises and challenges are introduced. Finally, future research directions toward beyond 5G IoT networks are pointed out.",
        "DOI": "10.1109/COMST.2022.3151028",
        "paper_author": "Vaezi M.",
        "affiliation_name": "Villanova University College of Engineering",
        "affiliation_city": "Villanova",
        "affiliation_country": "United States",
        "affiliation_id": "60279531",
        "affiliation_state": "PA"
    },
    {
        "paper_title": "Theory-oriented screening and discovery of advanced energy transformation materials in electrocatalysis",
        "publication": "Advanced Powder Materials",
        "citied_by": "363",
        "cover_date": "2022-01-01",
        "Abstract": "Various metal-based electrocatalysts from nanocrystals, to clusters and single-atoms, have been well-discovered towards high-efficient power devices and electrocatalytic conversion. To accelerate energy transformation materials discovery, developing high-throughput DFT calculations and machine-learning techniques is of great necessity. This review comprehensively outlines the latest progress of theory-guided design of advanced energy transformation materials. Especially, we focus on the study of single atoms in various power devices, such as fuel cell (oxygen reduction reaction, ORR; acid oxidation reaction; alcohol oxidation reaction), and other reactions for energy-related electrocatalytic conversion of small molecules, such as H2O2 evolution reactions (2e− ORR), water splitting (H2 evolution reaction/O2 evolution reaction, HER/OER), N2 reduction reaction (NRR), and CO2 reduction reactions (CO2RR). Firstly, the electronic structure, interaction mechanism, and reaction activation path are discussed to provide an overall blueprint in electrocatalysis and batteries mentioned above. Thereafter, the experimental synthesis strategies, structural recognition, and electrocatalytic performance for the advanced energy transformation materials are figured out. Finally, some viewpoints into the current issues and future design concept of the advanced energy transformation materials are provided.",
        "DOI": "10.1016/j.apmate.2021.10.004",
        "paper_author": "Jing H.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Review—Towards 5th Generation AI and IoT Driven Sustainable Intelligent Sensors Based on 2D MXenes and Borophene",
        "publication": "ECS Sensors Plus",
        "citied_by": "319",
        "cover_date": "2022-03-01",
        "Abstract": "Sensors are considered to be an important vector for sustainable development. The demand to meet the needs of future generations is accelerating the development of intelligent sensor-systems integrated with internet of things (IoTs), fifth generation (5G) communication, artificial intelligence (AI) and machine learning (ML) strategies. The inclusion of 2D nanomaterials with the IoTs/AI/ML has revolutionized the diversified applications of sensors in healthcare, wearable electronics, safety, environment, defense, and agriculture. Owing to their unique physicochemical characteristics and surface functionalities, borophene and MXenes have emerged as advanced 2D-materials (A2M) to architect future-generation sensors. ML-AI based theoretical modeling has guided the research and development of A2M-sensors economically by reducing cost, human resources, and contamination. A2M-sensors are flexible, wearable, intelligent, biocompatible, portable, energy-efficient, self-sustained, point-of-care, and economical, which can drastically transform the conventional sensing strategies. This review provides an insight in to the state-of-the-art A2M-based physical, chemical, and biosensor to efficiently detect chemical species, gases/vapors, drugs, biomarkers/pathogens, pressure, metal ions, radiations, temperature, light, and humidity. Besides the fundamental challenges creating a gap between theoretical predictions, practical-evaluations, in-lab-technology, and commercial viability, their potential solutions, field-deployable prospects are addressed to realize commercialization, thereby ensuring ability of future generations to maintain sustainable communities.",
        "DOI": "10.1149/2754-2726/ac5ac6",
        "paper_author": "Chaudhary V.",
        "affiliation_name": "Bhagini Nivedita College",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60251061",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Data-driven probabilistic machine learning in sustainable smart energy/smart energy systems: Key developments, challenges, and future research opportunities in the context of smart grid paradigm",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "316",
        "cover_date": "2022-05-01",
        "Abstract": "The current trend indicates that energy demand and supply will eventually be controlled by autonomous software that optimizes decision-making and energy distribution operations. New state-of-the-art machine learning (ML) technologies are integral in optimizing decision-making in energy distribution networks and systems. This study was conducted on data-driven probabilistic ML techniques and their real-time applications to smart energy systems and networks to highlight the urgency of this area of research. This study focused on two key areas: i) the use of ML in core energy technologies and ii) the use cases of ML for energy distribution utilities. The core energy technologies include the use of ML in advanced energy materials, energy systems and storage devices, energy efficiency, smart energy material manufacturing in the smart grid paradigm, strategic energy planning, integration of renewable energy, and big data analytics in the smart grid environment. The investigated ML area in energy distribution systems includes energy consumption and price forecasting, the merit order of energy price forecasting, and the consumer lifetime value. Cybersecurity topics for power delivery and utilization, grid edge systems and distributed energy resources, power transmission, and distribution systems are also briefly studied. The primary goal of this work was to identify common issues useful in future studies on ML for smooth energy distribution operations. This study was concluded with many energy perspectives on significant opportunities and challenges. It is noted that if the smart ML automation is used in its targeting energy systems, the utility sector and energy industry could potentially save from $237 billion up to $813 billion.",
        "DOI": "10.1016/j.rser.2022.112128",
        "paper_author": "Ahmad T.",
        "affiliation_name": "Jinan University",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60017456",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "A universal graph deep learning interatomic potential for the periodic table",
        "publication": "Nature Computational Science",
        "citied_by": "314",
        "cover_date": "2022-11-01",
        "Abstract": "Interatomic potentials (IAPs), which describe the potential energy surface of atoms, are a fundamental input for atomistic simulations. However, existing IAPs are either fitted to narrow chemistries or too inaccurate for general applications. Here we report a universal IAP for materials based on graph neural networks with three-body interactions (M3GNet). The M3GNet IAP was trained on the massive database of structural relaxations performed by the Materials Project over the past ten years and has broad applications in structural relaxation, dynamic simulations and property prediction of materials across diverse chemical spaces. About 1.8 million materials from a screening of 31 million hypothetical crystal structures were identified to be potentially stable against existing Materials Project crystals based on M3GNet energies. Of the top 2,000 materials with the lowest energies above the convex hull, 1,578 were verified to be stable using density functional theory calculations. These results demonstrate a machine learning-accelerated pathway to the discovery of synthesizable materials with exceptional properties.",
        "DOI": "10.1038/s43588-022-00349-3",
        "paper_author": "Chen C.",
        "affiliation_name": "Aiiso Yufeng Li Family Department of Chemical and Nano Engineering",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60121662",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Building energy consumption prediction for residential buildings using deep learning and other machine learning techniques",
        "publication": "Journal of Building Engineering",
        "citied_by": "311",
        "cover_date": "2022-01-01",
        "Abstract": "The high proportion of energy consumed in buildings has engendered the manifestation of many environmental problems which deploy adverse impacts on the existence of mankind. The prediction of building energy use is essentially proclaimed to be a method for energy conservation and improved decision-making towards decreasing energy usage. Also, the construction of energy efficient buildings will aid the reduction of total energy consumed in newly constructed buildings. Machine Learning (ML) method is recognised as the best suited approach for producing desired outcomes in prediction task. Hence, in several studies, ML has been applied in the field of energy consumption of operational building. However, there are not many studies investigating the suitability of ML methods for forecasting the potential building energy consumption at the early design phase to reduce the construction of more energy inefficient buildings. To address this gap, this paper presents the utilization of several machine learning techniques namely Artificial Neural Network (ANN), Gradient Boosting (GB), Deep Neural Network (DNN), Random Forest (RF), Stacking, K Nearest Neighbour (KNN), Support Vector Machine (SVM), Decision tree (DT) and Linear Regression (LR) for predicting annual building energy consumption using a large dataset of residential buildings. This study also examines the effect of the building clusters on the model performance. The novelty of this paper is to develop a model that enables designers input key features of a building design and forecast the annual average energy consumption at the early stages of development. This result reveals DNN as the most efficient predictive model for energy use at the early design phase and this presents a motivation for building designers to utilize it before construction to make informed decision, manage and optimize design.",
        "DOI": "10.1016/j.jobe.2021.103406",
        "paper_author": "Olu-Ajayi R.",
        "affiliation_name": "University of Hertfordshire",
        "affiliation_city": "Hatfield",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60032760",
        "affiliation_state": "Hertfordshire"
    },
    {
        "paper_title": "Artificial Intelligence Applied to Battery Research: Hype or Reality?",
        "publication": "Chemical Reviews",
        "citied_by": "277",
        "cover_date": "2022-06-22",
        "Abstract": "This is a critical review of artificial intelligence/machine learning (AI/ML) methods applied to battery research. It aims at providing a comprehensive, authoritative, and critical, yet easily understandable, review of general interest to the battery community. It addresses the concepts, approaches, tools, outcomes, and challenges of using AI/ML as an accelerator for the design and optimization of the next generation of batteries-a current hot topic. It intends to create both accessibility of these tools to the chemistry and electrochemical energy sciences communities and completeness in terms of the different battery R&D aspects covered.",
        "DOI": "10.1021/acs.chemrev.1c00108",
        "paper_author": "Lombardo T.",
        "affiliation_name": "Université de Picardie Jules Verne",
        "affiliation_city": "Amiens",
        "affiliation_country": "France",
        "affiliation_id": "60016097",
        "affiliation_state": "Hauts-de-France"
    },
    {
        "paper_title": "Spiking Neural Networks and Their Applications: A Review",
        "publication": "Brain Sciences",
        "citied_by": "265",
        "cover_date": "2022-07-01",
        "Abstract": "The past decade has witnessed the great success of deep neural networks in various domains. However, deep neural networks are very resource-intensive in terms of energy consumption, data requirements, and high computational costs. With the recent increasing need for the autonomy of machines in the real world, e.g., self-driving vehicles, drones, and collaborative robots, exploitation of deep neural networks in those applications has been actively investigated. In those applications, energy and computational efficiencies are especially important because of the need for real-time responses and the limited energy supply. A promising solution to these previously infeasible applications has recently been given by biologically plausible spiking neural networks. Spiking neural networks aim to bridge the gap between neuroscience and machine learning, using biologically realistic models of neurons to carry out the computation. Due to their functional similarity to the biological neural network, spiking neural networks can embrace the sparsity found in biology and are highly compatible with temporal code. Our contributions in this work are: (i) we give a comprehensive review of theories of biological neurons; (ii) we present various existing spike-based neuron models, which have been studied in neuroscience; (iii) we detail synapse models; (iv) we provide a review of artificial neural networks; (v) we provide detailed guidance on how to train spike-based neuron models; (vi) we revise available spike-based neuron frameworks that have been developed to support implementing spiking neural networks; (vii) finally, we cover existing spiking neural network applications in computer vision and robotics domains. The paper concludes with discussions of future perspectives.",
        "DOI": "10.3390/brainsci12070863",
        "paper_author": "Yamazaki K.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Fayetteville",
        "affiliation_country": "United States",
        "affiliation_id": "60158796",
        "affiliation_state": "AR"
    },
    {
        "paper_title": "Applying Classical, Ab Initio, and Machine-Learning Molecular Dynamics Simulations to the Liquid Electrolyte for Rechargeable Batteries",
        "publication": "Chemical Reviews",
        "citied_by": "255",
        "cover_date": "2022-06-22",
        "Abstract": "Rechargeable batteries have become indispensable implements in our daily life and are considered a promising technology to construct sustainable energy systems in the future. The liquid electrolyte is one of the most important parts of a battery and is extremely critical in stabilizing the electrode-electrolyte interfaces and constructing safe and long-life-span batteries. Tremendous efforts have been devoted to developing new electrolyte solvents, salts, additives, and recipes, where molecular dynamics (MD) simulations play an increasingly important role in exploring electrolyte structures, physicochemical properties such as ionic conductivity, and interfacial reaction mechanisms. This review affords an overview of applying MD simulations in the study of liquid electrolytes for rechargeable batteries. First, the fundamentals and recent theoretical progress in three-class MD simulations are summarized, including classical, ab initio, and machine-learning MD simulations (section 2). Next, the application of MD simulations to the exploration of liquid electrolytes, including probing bulk and interfacial structures (section 3), deriving macroscopic properties such as ionic conductivity and dielectric constant of electrolytes (section 4), and revealing the electrode-electrolyte interfacial reaction mechanisms (section 5), are sequentially presented. Finally, a general conclusion and an insightful perspective on current challenges and future directions in applying MD simulations to liquid electrolytes are provided. Machine-learning technologies are highlighted to figure out these challenging issues facing MD simulations and electrolyte research and promote the rational design of advanced electrolytes for next-generation rechargeable batteries",
        "DOI": "10.1021/acs.chemrev.1c00904",
        "paper_author": "Yao N.",
        "affiliation_name": "Tsinghua University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60025278",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Research and application of machine learning for additive manufacturing",
        "publication": "Additive Manufacturing",
        "citied_by": "237",
        "cover_date": "2022-04-01",
        "Abstract": "Additive manufacturing (AM) is poised to bring a revolution due to its unique production paradigm. It offers the prospect of mass customization, flexible production, on-demand and decentralized manufacturing. However, a number of challenges stem from not only the complexity of manufacturing systems but the demand for increasingly complex and high-quality products, in terms of design principles, standardization and quality control. These challenges build up barriers to the widespread adoption of AM in the industry and the in-depth research of AM in academia. To tackle the challenges, machine learning (ML) technologies rise to play a critical role as they are able to provide effective ways to quality control, process optimization, modelling of complex systems, and energy management. Hence, this paper employs a systematic literature review method as it is a defined and methodical way of identifying, assessing, and analysing published literature. Then, a keyword co-occurrence and cluster analysis are employed for analysing relevant literature. Several aspects of AM, including Design for AM (DfAM), material analytics, in situ monitoring and defect detection, property prediction and sustainability, have been clustered and summarized to present state-of-the-art research in the scope of ML for AM. Finally, the challenges and opportunities of ML for AM are uncovered and discussed.",
        "DOI": "10.1016/j.addma.2022.102691",
        "paper_author": "Qin J.",
        "affiliation_name": "Cardiff University",
        "affiliation_city": "Cardiff",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60023998",
        "affiliation_state": "South Glamorgan, Wales"
    },
    {
        "paper_title": "Challenges and opportunities in quantum machine learning",
        "publication": "Nature Computational Science",
        "citied_by": "235",
        "cover_date": "2022-09-01",
        "Abstract": "At the intersection of machine learning and quantum computing, quantum machine learning has the potential of accelerating data analysis, especially for quantum data, with applications for quantum materials, biochemistry and high-energy physics. Nevertheless, challenges remain regarding the trainability of quantum machine learning models. Here we review current methods and applications for quantum machine learning. We highlight differences between quantum and classical machine learning, with a focus on quantum neural networks and quantum deep learning. Finally, we discuss opportunities for quantum advantage with quantum machine learning.",
        "DOI": "10.1038/s43588-022-00311-3",
        "paper_author": "Cerezo M.",
        "affiliation_name": "Los Alamos National Laboratory",
        "affiliation_city": "Los Alamos",
        "affiliation_country": "United States",
        "affiliation_id": "60006164",
        "affiliation_state": "NM"
    },
    {
        "paper_title": "CNN-LSTM: An efficient hybrid deep learning architecture for predicting short-term photovoltaic power production",
        "publication": "Electric Power Systems Research",
        "citied_by": "231",
        "cover_date": "2022-07-01",
        "Abstract": "Climate change is pushing an increasing number of nations to use green energy resources, particularly solar power as an applicable substitute to traditional power sources. However, photovoltaic power generation is highly weather-dependent, relying mostly on solar irradiation that is highly unstable, and unpredictable which makes power generation challenging. Accurate photovoltaic power predictions can substantially improve the operation of solar power systems. This is vital for supplying prime electricity to customers and ensuring the resilience of power plants’ operation. This research is motivated by the recent adoption and advances in DL models and their successful use in the sector of energy. The suggested model merges two deep learning architectures, the long short-term memory (LSTM) and convolutional neural network (CNN). Using a real-world dataset from Rabat, Morocco, as a case study to illustrate the effectiveness of the suggested topology. According to error metrics, MAE, MAPE, and RMSE, the suggested architecture CNN-LSTM performance exceeds that of standard machine learning and single DL models in terms of prediction, precision, and stability.",
        "DOI": "10.1016/j.epsr.2022.107908",
        "paper_author": "Agga A.",
        "affiliation_name": "Ecole Mohammadia d'Ingenieurs, Mohammed V University in Rabat",
        "affiliation_city": "Rabat",
        "affiliation_country": "Morocco",
        "affiliation_id": "60011371",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Breaking adsorption-energy scaling limitations of electrocatalytic nitrate reduction on intermetallic CuPd nanocubes by machine-learned insights",
        "publication": "Nature Communications",
        "citied_by": "230",
        "cover_date": "2022-12-01",
        "Abstract": "The electrochemical nitrate reduction reaction (NO3RR) to ammonia is an essential step toward restoring the globally disrupted nitrogen cycle. In search of highly efficient electrocatalysts, tailoring catalytic sites with ligand and strain effects in random alloys is a common approach but remains limited due to the ubiquitous energy-scaling relations. With interpretable machine learning, we unravel a mechanism of breaking adsorption-energy scaling relations through the site-specific Pauli repulsion interactions of the metal d-states with adsorbate frontier orbitals. The non-scaling behavior can be realized on (100)-type sites of ordered B2 intermetallics, in which the orbital overlap between the hollow *N and subsurface metal atoms is significant while the bridge-bidentate *NO3 is not directly affected. Among those intermetallics predicted, we synthesize monodisperse ordered B2 CuPd nanocubes that demonstrate high performance for NO3RR to ammonia with a Faradaic efficiency of 92.5% at −0.5 VRHE and a yield rate of 6.25 mol h−1 g−1 at −0.6 VRHE. This study provides machine-learned design rules besides the d-band center metrics, paving the path toward data-driven discovery of catalytic materials beyond linear scaling limitations.",
        "DOI": "10.1038/s41467-022-29926-w",
        "paper_author": "Gao Q.",
        "affiliation_name": "Virginia Tech College of Engineering",
        "affiliation_city": "Blacksburg",
        "affiliation_country": "United States",
        "affiliation_id": "60157272",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "Recent Advances in Machine Learning Research for Nanofluid-Based Heat Transfer in Renewable Energy System",
        "publication": "Energy and Fuels",
        "citied_by": "229",
        "cover_date": "2022-07-07",
        "Abstract": "Nanofluids have gained significant popularity in the field of sustainable and renewable energy systems. The heat transfer capacity of the working fluid has a huge impact on the efficiency of the renewable energy system. The addition of a small amount of high thermal conductivity solid nanoparticles to a base fluid improves heat transfer. Even though a large amount of research data is available in the literature, some results are contradictory. Many influencing factors, as well as nonlinearity and refutations, make nanofluid research highly challenging and obstruct its potentially valuable uses. On the other hand, data-driven machine learning techniques would be very useful in nanofluid research for forecasting thermophysical features and heat transfer rate, identifying the most influential factors, and assessing the efficiencies of different renewable energy systems. The primary aim of this review study is to look at the features and applications of different machine learning techniques employed in the nanofluid-based renewable energy system, as well as to reveal new developments in machine learning research. A variety of modern machine learning algorithms for nanofluid-based heat transfer studies in renewable and sustainable energy systems are examined, along with their advantages and disadvantages. Artificial neural networks-based model prediction using contemporary commercial software is simple to develop and the most popular. The prognostic capacity may be further improved by combining a marine predator algorithm, genetic algorithm, swarm intelligence optimization, and other intelligent optimization approaches. In addition to the well-known neural networks and fuzzy- and gene-based machine learning techniques, newer ensemble machine learning techniques such as Boosted regression techniques, K-means, K-nearest neighbor (KNN), CatBoost, and XGBoost are gaining popularity due to their improved architectures and adaptabilities to diverse data types. The regularly used neural networks and fuzzy-based algorithms are mostly black-box methods, with the user having little or no understanding of how they function. This is the reason for concern, and ethical artificial intelligence is required.",
        "DOI": "10.1021/acs.energyfuels.2c01006",
        "paper_author": "Sharma P.",
        "affiliation_name": "Delhi Skill and Entrepreneurship University",
        "affiliation_city": "New Delhi",
        "affiliation_country": "India",
        "affiliation_id": "60282982",
        "affiliation_state": "DL"
    },
    {
        "paper_title": "Past, present, and future of sustainable finance: insights from big data analytics through machine learning of scholarly research",
        "publication": "Annals of Operations Research",
        "citied_by": "229",
        "cover_date": "2022-01-01",
        "Abstract": "Sustainable finance is a rich field of research. Yet, existing reviews remain limited due to the piecemeal insights offered through a sub-set rather than the entire corpus of sustainable finance. To address this gap, this study aims to conduct a large-scale review that would provide a state-of-the-art overview of the performance and intellectual structure of sustainable finance. To do so, this study engages in a review of sustainable finance research using big data analytics through machine learning of scholarly research. In doing so, this study unpacks the most influential articles and top contributing journals, authors, institutions, and countries, as well as the methodological choices and research contexts for sustainable finance research. In addition, this study reveals insights into seven major themes of sustainable finance research, namely socially responsible investing, climate financing, green financing, impact investing, carbon financing, energy financing, and governance of sustainable financing and investing. To drive the field forward, this study proposes several suggestions for future sustainable finance research, which include developing and diffusing innovative sustainable financing instruments, magnifying and managing the profitability and returns of sustainable financing, making sustainable finance more sustainable, devising and unifying policies and frameworks for sustainable finance, tackling greenwashing of corporate sustainability reporting in sustainable finance, shining behavioral finance on sustainable finance, and leveraging the power of new-age technologies such as artificial intelligence, blockchain, internet of things, and machine learning for sustainable finance.",
        "DOI": "10.1007/s10479-021-04410-8",
        "paper_author": "Kumar S.",
        "affiliation_name": "Malaviya National Institute of Technology Jaipur",
        "affiliation_city": "Jaipur",
        "affiliation_country": "India",
        "affiliation_id": "60017757",
        "affiliation_state": "RJ"
    },
    {
        "paper_title": "Biodiesel production from mixed oils: A sustainable approach towards industrial biofuel production",
        "publication": "Chemical Engineering Journal Advances",
        "citied_by": "227",
        "cover_date": "2022-05-15",
        "Abstract": "Biodiesel is considered eco-friendly, biodegradable, non-toxic, and carbon-neutral fuel. It is made from edible or non-edible oil feedstocks including other triglyceride sources. The production of biodiesel depends on the availability of a particular feedstock and the cost of desired raw materials. Biodiesel is mainly produced by the transesterification process using a suitable catalyst preferably a heterogeneous catalyst as it is more beneficial in terms of reusability, recovery, product purity, and production cost as well. Various reactors are developed to produce cost-effective biodiesel at the commercial level. The latest trend in biodiesel synthesis is the application of the machine learning (ML) technique to optimize the process parameters. The application of a mixture of two or more oils as feedstock either non-edible or edible oil is emphasized for biodiesel synthesis and is presently getting more importance. In this paper, the production of biodiesel from various mixed oil (hybrid oil) is reviewed and the effects of mixed oil on the reaction, physicochemical properties, fatty acid composition, and fuel quality of the product are discussed. The study highlighted the activity of various catalysts in the reaction of mixed oil and the economic feasibility. It was found that the ratio of mixed oil is an important factor in terms of conversion and quality of biodiesel. It is also revealed that the application of the ML technique is essentially useful to optimize production efficiency. The utilization of mixed oils will overcome the issues related to the non-availability of feedstocks and reduce the overall cost with improved quality of biodiesel. This approach enhances the production possibility of biodiesel at a large-scale and may boost the biorefinery sector satisfying the future energy demand if the research at the advanced level goes in the right direction.",
        "DOI": "10.1016/j.ceja.2022.100284",
        "paper_author": "Brahma S.",
        "affiliation_name": "Bodoland University",
        "affiliation_city": "Kokrajhar",
        "affiliation_country": "India",
        "affiliation_id": "60111754",
        "affiliation_state": "AS"
    },
    {
        "paper_title": "Review on deep learning applications in frequency analysis and control of modern power system",
        "publication": "International Journal of Electrical Power and Energy Systems",
        "citied_by": "222",
        "cover_date": "2022-03-01",
        "Abstract": "The penetration of renewable energy resources (RES) generation and the interconnection of regional power grids in wide area and large scale have led the modern power system to exhibit more and more complex dynamic features, such as time-varying nonlinearity, uncertainty, data diversity, and local observability. The increasing complexity of power system's dynamic characteristics makes the traditional analysis and control methods inefficient, even invalid. As a new technology path of Machine Learning, Deep learning (DL) has distinct advantages in solving complex problems such as power system frequency analysis and control due to its powerful ability of data analysis, prediction, and classification. This paper reviews the history, state of art and the future of the DL's application in power system frequency analysis and control. Firstly, the basic principle and research progress of DL, the training methods, typical structures, and application peculiarity of DL were introduced. Secondly, the application status of DL in frequency situation awareness, frequency security and stability assessment, and frequency regulation and control were summarized, and the adaptability of DL application to each kind of issue was discussed. Finally, the development trend of DL and its application in power system frequency were prospected.",
        "DOI": "10.1016/j.ijepes.2021.107744",
        "paper_author": "Zhang Y.",
        "affiliation_name": "Shandong University",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60031031",
        "affiliation_state": "Shandong"
    }
]