[
    {
        "paper_title": "Global incidence, prevalence, years lived with disability (YLDs), disability-adjusted life-years (DALYs), and healthy life expectancy (HALE) for 371 diseases and injuries in 204 countries and territories and 811 subnational locations, 1990–2021: a systematic analysis for the Global Burden of Disease Study 2021",
        "publication": "The Lancet",
        "citied_by": "608",
        "cover_date": "2024-05-18",
        "Abstract": "Background: Detailed, comprehensive, and timely reporting on population health by underlying causes of disability and premature death is crucial to understanding and responding to complex patterns of disease and injury burden over time and across age groups, sexes, and locations. The availability of disease burden estimates can promote evidence-based interventions that enable public health researchers, policy makers, and other professionals to implement strategies that can mitigate diseases. It can also facilitate more rigorous monitoring of progress towards national and international health targets, such as the Sustainable Development Goals. For three decades, the Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) has filled that need. A global network of collaborators contributed to the production of GBD 2021 by providing, reviewing, and analysing all available data. GBD estimates are updated routinely with additional data and refined analytical methods. GBD 2021 presents, for the first time, estimates of health loss due to the COVID-19 pandemic. Methods: The GBD 2021 disease and injury burden analysis estimated years lived with disability (YLDs), years of life lost (YLLs), disability-adjusted life-years (DALYs), and healthy life expectancy (HALE) for 371 diseases and injuries using 100 983 data sources. Data were extracted from vital registration systems, verbal autopsies, censuses, household surveys, disease-specific registries, health service contact data, and other sources. YLDs were calculated by multiplying cause-age-sex-location-year-specific prevalence of sequelae by their respective disability weights, for each disease and injury. YLLs were calculated by multiplying cause-age-sex-location-year-specific deaths by the standard life expectancy at the age that death occurred. DALYs were calculated by summing YLDs and YLLs. HALE estimates were produced using YLDs per capita and age-specific mortality rates by location, age, sex, year, and cause. 95% uncertainty intervals (UIs) were generated for all final estimates as the 2·5th and 97·5th percentiles values of 500 draws. Uncertainty was propagated at each step of the estimation process. Counts and age-standardised rates were calculated globally, for seven super-regions, 21 regions, 204 countries and territories (including 21 countries with subnational locations), and 811 subnational locations, from 1990 to 2021. Here we report data for 2010 to 2021 to highlight trends in disease burden over the past decade and through the first 2 years of the COVID-19 pandemic. Findings: Global DALYs increased from 2·63 billion (95% UI 2·44–2·85) in 2010 to 2·88 billion (2·64–3·15) in 2021 for all causes combined. Much of this increase in the number of DALYs was due to population growth and ageing, as indicated by a decrease in global age-standardised all-cause DALY rates of 14·2% (95% UI 10·7–17·3) between 2010 and 2019. Notably, however, this decrease in rates reversed during the first 2 years of the COVID-19 pandemic, with increases in global age-standardised all-cause DALY rates since 2019 of 4·1% (1·8–6·3) in 2020 and 7·2% (4·7–10·0) in 2021. In 2021, COVID-19 was the leading cause of DALYs globally (212·0 million [198·0–234·5] DALYs), followed by ischaemic heart disease (188·3 million [176·7–198·3]), neonatal disorders (186·3 million [162·3–214·9]), and stroke (160·4 million [148·0–171·7]). However, notable health gains were seen among other leading communicable, maternal, neonatal, and nutritional (CMNN) diseases. Globally between 2010 and 2021, the age-standardised DALY rates for HIV/AIDS decreased by 47·8% (43·3–51·7) and for diarrhoeal diseases decreased by 47·0% (39·9–52·9). Non-communicable diseases contributed 1·73 billion (95% UI 1·54–1·94) DALYs in 2021, with a decrease in age-standardised DALY rates since 2010 of 6·4% (95% UI 3·5–9·5). Between 2010 and 2021, among the 25 leading Level 3 causes, age-standardised DALY rates increased most substantially for anxiety disorders (16·7% [14·0–19·8]), depressive disorders (16·4% [11·9–21·3]), and diabetes (14·0% [10·0–17·4]). Age-standardised DALY rates due to injuries decreased globally by 24·0% (20·7–27·2) between 2010 and 2021, although improvements were not uniform across locations, ages, and sexes. Globally, HALE at birth improved slightly, from 61·3 years (58·6–63·6) in 2010 to 62·2 years (59·4–64·7) in 2021. However, despite this overall increase, HALE decreased by 2·2% (1·6–2·9) between 2019 and 2021. Interpretation: Putting the COVID-19 pandemic in the context of a mutually exclusive and collectively exhaustive list of causes of health loss is crucial to understanding its impact and ensuring that health funding and policy address needs at both local and global levels through cost-effective and evidence-based interventions. A global epidemiological transition remains underway. Our findings suggest that prioritising non-communicable disease prevention and treatment policies, as well as strengthening health systems, continues to be crucially important. The progress on reducing the burden of CMNN diseases must not stall; although global trends are improving, the burden of CMNN diseases remains unacceptably high. Evidence-based interventions will help save the lives of young children and mothers and improve the overall health and economic conditions of societies across the world. Governments and multilateral organisations should prioritise pandemic preparedness planning alongside efforts to reduce the burden of diseases and injuries that will strain resources in the coming decades. Funding: Bill & Melinda Gates Foundation.",
        "DOI": "10.1016/S0140-6736(24)00757-8",
        "paper_author": "Ferrari A.J.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "The Romance of American psychology: Political culture in the age of experts",
        "publication": "The Romance of American Psychology: Political Culture in the Age of Experts",
        "citied_by": "401",
        "cover_date": "2024-03-29",
        "Abstract": "Psychological insight is the creed of our time. A quiet academic discipline two generations ago, psychology has become a voice of great cultural authority, informing everything from family structure to government policy. How has this fledgling science become the source of contemporary America's most potent ideology? In this groundbreaking book-the first to fully explore the political and cultural significance of psychology in post-World War II America-Ellen Herman tells the story of Americans' love affair with the behavioral sciences. It began during wartime. The atmosphere of crisis sustained from the 1940s through the Cold War gave psychological \"experts\" an opportunity to prove their social theories and behavioral techniques. Psychologists, sociologists, and anthropologists carved a niche within government and began shaping military, foreign, and domestic policy. Herman examines this marriage of politics and psychology, which continued through the tumultuous 1960s. Psychological professionals' influence also spread among the general public. Drawn by promises of mental health and happiness, people turned to these experts for enlightenment. Their opinions validated postwar social movements from civil rights to feminism and became the basis of a new world view. Fascinating and long overdue, this book illuminates one of the dominant forces in American society. This title is part of UC Press's Voices Revived program, which commemorates University of California Press's mission to seek out and cultivate the brightest minds and give them voice, reach, and impact. Drawing on a backlist dating to 1893, Voices Revived makes high-quality, peer-reviewed scholarship accessible once again using print-on-demand technology. This title was originally published in 1995.",
        "DOI": "NA",
        "paper_author": "Herman E.",
        "affiliation_name": "University of Oregon",
        "affiliation_city": "Eugene",
        "affiliation_country": "United States",
        "affiliation_id": "60012317",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "Global burden of 288 causes of death and life expectancy decomposition in 204 countries and territories and 811 subnational locations, 1990–2021: a systematic analysis for the Global Burden of Disease Study 2021",
        "publication": "The Lancet",
        "citied_by": "394",
        "cover_date": "2024-05-18",
        "Abstract": "Background: Regular, detailed reporting on population health by underlying cause of death is fundamental for public health decision making. Cause-specific estimates of mortality and the subsequent effects on life expectancy worldwide are valuable metrics to gauge progress in reducing mortality rates. These estimates are particularly important following large-scale mortality spikes, such as the COVID-19 pandemic. When systematically analysed, mortality rates and life expectancy allow comparisons of the consequences of causes of death globally and over time, providing a nuanced understanding of the effect of these causes on global populations. Methods: The Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) 2021 cause-of-death analysis estimated mortality and years of life lost (YLLs) from 288 causes of death by age-sex-location-year in 204 countries and territories and 811 subnational locations for each year from 1990 until 2021. The analysis used 56 604 data sources, including data from vital registration and verbal autopsy as well as surveys, censuses, surveillance systems, and cancer registries, among others. As with previous GBD rounds, cause-specific death rates for most causes were estimated using the Cause of Death Ensemble model—a modelling tool developed for GBD to assess the out-of-sample predictive validity of different statistical models and covariate permutations and combine those results to produce cause-specific mortality estimates—with alternative strategies adapted to model causes with insufficient data, substantial changes in reporting over the study period, or unusual epidemiology. YLLs were computed as the product of the number of deaths for each cause-age-sex-location-year and the standard life expectancy at each age. As part of the modelling process, uncertainty intervals (UIs) were generated using the 2·5th and 97·5th percentiles from a 1000-draw distribution for each metric. We decomposed life expectancy by cause of death, location, and year to show cause-specific effects on life expectancy from 1990 to 2021. We also used the coefficient of variation and the fraction of population affected by 90% of deaths to highlight concentrations of mortality. Findings are reported in counts and age-standardised rates. Methodological improvements for cause-of-death estimates in GBD 2021 include the expansion of under-5-years age group to include four new age groups, enhanced methods to account for stochastic variation of sparse data, and the inclusion of COVID-19 and other pandemic-related mortality—which includes excess mortality associated with the pandemic, excluding COVID-19, lower respiratory infections, measles, malaria, and pertussis. For this analysis, 199 new country-years of vital registration cause-of-death data, 5 country-years of surveillance data, 21 country-years of verbal autopsy data, and 94 country-years of other data types were added to those used in previous GBD rounds. Findings: The leading causes of age-standardised deaths globally were the same in 2019 as they were in 1990; in descending order, these were, ischaemic heart disease, stroke, chronic obstructive pulmonary disease, and lower respiratory infections. In 2021, however, COVID-19 replaced stroke as the second-leading age-standardised cause of death, with 94·0 deaths (95% UI 89·2–100·0) per 100 000 population. The COVID-19 pandemic shifted the rankings of the leading five causes, lowering stroke to the third-leading and chronic obstructive pulmonary disease to the fourth-leading position. In 2021, the highest age-standardised death rates from COVID-19 occurred in sub-Saharan Africa (271·0 deaths [250·1–290·7] per 100 000 population) and Latin America and the Caribbean (195·4 deaths [182·1–211·4] per 100 000 population). The lowest age-standardised death rates from COVID-19 were in the high-income super-region (48·1 deaths [47·4–48·8] per 100 000 population) and southeast Asia, east Asia, and Oceania (23·2 deaths [16·3–37·2] per 100 000 population). Globally, life expectancy steadily improved between 1990 and 2019 for 18 of the 22 investigated causes. Decomposition of global and regional life expectancy showed the positive effect that reductions in deaths from enteric infections, lower respiratory infections, stroke, and neonatal deaths, among others have contributed to improved survival over the study period. However, a net reduction of 1·6 years occurred in global life expectancy between 2019 and 2021, primarily due to increased death rates from COVID-19 and other pandemic-related mortality. Life expectancy was highly variable between super-regions over the study period, with southeast Asia, east Asia, and Oceania gaining 8·3 years (6·7–9·9) overall, while having the smallest reduction in life expectancy due to COVID-19 (0·4 years). The largest reduction in life expectancy due to COVID-19 occurred in Latin America and the Caribbean (3·6 years). Additionally, 53 of the 288 causes of death were highly concentrated in locations with less than 50% of the global population as of 2021, and these causes of death became progressively more concentrated since 1990, when only 44 causes showed this pattern. The concentration phenomenon is discussed heuristically with respect to enteric and lower respiratory infections, malaria, HIV/AIDS, neonatal disorders, tuberculosis, and measles. Interpretation: Long-standing gains in life expectancy and reductions in many of the leading causes of death have been disrupted by the COVID-19 pandemic, the adverse effects of which were spread unevenly among populations. Despite the pandemic, there has been continued progress in combatting several notable causes of death, leading to improved global life expectancy over the study period. Each of the seven GBD super-regions showed an overall improvement from 1990 and 2021, obscuring the negative effect in the years of the pandemic. Additionally, our findings regarding regional variation in causes of death driving increases in life expectancy hold clear policy utility. Analyses of shifting mortality trends reveal that several causes, once widespread globally, are now increasingly concentrated geographically. These changes in mortality concentration, alongside further investigation of changing risks, interventions, and relevant policy, present an important opportunity to deepen our understanding of mortality-reduction strategies. Examining patterns in mortality concentration might reveal areas where successful public health interventions have been implemented. Translating these successes to locations where certain causes of death remain entrenched can inform policies that work to improve life expectancy for people everywhere. Funding: Bill & Melinda Gates Foundation.",
        "DOI": "10.1016/S0140-6736(24)00367-2",
        "paper_author": "Naghavi M.",
        "affiliation_name": "Institute for Health Metrics and Evaluation",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60091926",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Global burden and strength of evidence for 88 risk factors in 204 countries and 811 subnational locations, 1990–2021: a systematic analysis for the Global Burden of Disease Study 2021",
        "publication": "The Lancet",
        "citied_by": "376",
        "cover_date": "2024-05-18",
        "Abstract": "Background: Understanding the health consequences associated with exposure to risk factors is necessary to inform public health policy and practice. To systematically quantify the contributions of risk factor exposures to specific health outcomes, the Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) 2021 aims to provide comprehensive estimates of exposure levels, relative health risks, and attributable burden of disease for 88 risk factors in 204 countries and territories and 811 subnational locations, from 1990 to 2021. Methods: The GBD 2021 risk factor analysis used data from 54 561 total distinct sources to produce epidemiological estimates for 88 risk factors and their associated health outcomes for a total of 631 risk–outcome pairs. Pairs were included on the basis of data-driven determination of a risk–outcome association. Age-sex-location-year-specific estimates were generated at global, regional, and national levels. Our approach followed the comparative risk assessment framework predicated on a causal web of hierarchically organised, potentially combinative, modifiable risks. Relative risks (RRs) of a given outcome occurring as a function of risk factor exposure were estimated separately for each risk–outcome pair, and summary exposure values (SEVs), representing risk-weighted exposure prevalence, and theoretical minimum risk exposure levels (TMRELs) were estimated for each risk factor. These estimates were used to calculate the population attributable fraction (PAF; ie, the proportional change in health risk that would occur if exposure to a risk factor were reduced to the TMREL). The product of PAFs and disease burden associated with a given outcome, measured in disability-adjusted life-years (DALYs), yielded measures of attributable burden (ie, the proportion of total disease burden attributable to a particular risk factor or combination of risk factors). Adjustments for mediation were applied to account for relationships involving risk factors that act indirectly on outcomes via intermediate risks. Attributable burden estimates were stratified by Socio-demographic Index (SDI) quintile and presented as counts, age-standardised rates, and rankings. To complement estimates of RR and attributable burden, newly developed burden of proof risk function (BPRF) methods were applied to yield supplementary, conservative interpretations of risk–outcome associations based on the consistency of underlying evidence, accounting for unexplained heterogeneity between input data from different studies. Estimates reported represent the mean value across 500 draws from the estimate's distribution, with 95% uncertainty intervals (UIs) calculated as the 2·5th and 97·5th percentile values across the draws. Findings: Among the specific risk factors analysed for this study, particulate matter air pollution was the leading contributor to the global disease burden in 2021, contributing 8·0% (95% UI 6·7–9·4) of total DALYs, followed by high systolic blood pressure (SBP; 7·8% [6·4–9·2]), smoking (5·7% [4·7–6·8]), low birthweight and short gestation (5·6% [4·8–6·3]), and high fasting plasma glucose (FPG; 5·4% [4·8–6·0]). For younger demographics (ie, those aged 0–4 years and 5–14 years), risks such as low birthweight and short gestation and unsafe water, sanitation, and handwashing (WaSH) were among the leading risk factors, while for older age groups, metabolic risks such as high SBP, high body-mass index (BMI), high FPG, and high LDL cholesterol had a greater impact. From 2000 to 2021, there was an observable shift in global health challenges, marked by a decline in the number of all-age DALYs broadly attributable to behavioural risks (decrease of 20·7% [13·9–27·7]) and environmental and occupational risks (decrease of 22·0% [15·5–28·8]), coupled with a 49·4% (42·3–56·9) increase in DALYs attributable to metabolic risks, all reflecting ageing populations and changing lifestyles on a global scale. Age-standardised global DALY rates attributable to high BMI and high FPG rose considerably (15·7% [9·9–21·7] for high BMI and 7·9% [3·3–12·9] for high FPG) over this period, with exposure to these risks increasing annually at rates of 1·8% (1·6–1·9) for high BMI and 1·3% (1·1–1·5) for high FPG. By contrast, the global risk-attributable burden and exposure to many other risk factors declined, notably for risks such as child growth failure and unsafe water source, with age-standardised attributable DALYs decreasing by 71·5% (64·4–78·8) for child growth failure and 66·3% (60·2–72·0) for unsafe water source. We separated risk factors into three groups according to trajectory over time: those with a decreasing attributable burden, due largely to declining risk exposure (eg, diet high in trans-fat and household air pollution) but also to proportionally smaller child and youth populations (eg, child and maternal malnutrition); those for which the burden increased moderately in spite of declining risk exposure, due largely to population ageing (eg, smoking); and those for which the burden increased considerably due to both increasing risk exposure and population ageing (eg, ambient particulate matter air pollution, high BMI, high FPG, and high SBP). Interpretation: Substantial progress has been made in reducing the global disease burden attributable to a range of risk factors, particularly those related to maternal and child health, WaSH, and household air pollution. Maintaining efforts to minimise the impact of these risk factors, especially in low SDI locations, is necessary to sustain progress. Successes in moderating the smoking-related burden by reducing risk exposure highlight the need to advance policies that reduce exposure to other leading risk factors such as ambient particulate matter air pollution and high SBP. Troubling increases in high FPG, high BMI, and other risk factors related to obesity and metabolic syndrome indicate an urgent need to identify and implement interventions. Funding: Bill & Melinda Gates Foundation.",
        "DOI": "10.1016/S0140-6736(24)00933-4",
        "paper_author": "Brauer M.",
        "affiliation_name": "Institute for Health Metrics and Evaluation",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60091926",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Fueling the future: A comprehensive review of hydrogen energy systems and their challenges",
        "publication": "International Journal of Hydrogen Energy",
        "citied_by": "256",
        "cover_date": "2024-02-07",
        "Abstract": "This comprehensive study assesses the current state of the hydrogen energy system and investigates its potential to transform the global energy landscape while addressing important concerns about climate change. While hydrogen energy has numerous advantages, including sustainability and cleanliness, it faces substantial challenges in the areas of storage, manufacturing, distribution, infrastructure, safety, and cost. Scholars, lawmakers, business leaders, and the general public must all work together to address these complex issues. The research emphasizes the significance of breakthrough technology and astute government policies for the successful development and widespread deployment of hydrogen energy systems. It highlights that this revolutionary effort cannot be performed in solitude. Public education and enhanced awareness appear to be significant factors in promoting greater acceptance and use of hydrogen energy. Furthermore, the study identifies critical future research objectives. It underlines the importance of enhancing the efficiency, sustainability, safety, and economic feasibility of hydrogen energy systems. The development of new storage systems, superior infrastructure designs, and seamless integration technologies is vital to achieving the full potential of hydrogen energy. Finally, the research presented here gives a critical assessment of the hydrogen energy situation and outlines a roadmap toward a more sustainable and resilient future. The review's conclusions are significant for policymakers, academics, and stakeholders because they provide critical insights into the opportunities and problems associated with realizing the full potential of hydrogen energy.",
        "DOI": "10.1016/j.ijhydene.2023.08.044",
        "paper_author": "Le T.T.",
        "affiliation_name": "Ho Chi Minh City University of Technology - HUTECH",
        "affiliation_city": "Ho Chi Minh City",
        "affiliation_country": "Viet Nam",
        "affiliation_id": "60071399",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Policy Analysts in the Bureaucracy",
        "publication": "Policy Analysts in the Bureaucracy",
        "citied_by": "228",
        "cover_date": "2024-01-01",
        "Abstract": "Who advises our policy makers in Washington? What brings these advisors to the federal bureaucracy and keeps them there? And how do their clients and the bureaucratic context influence the choices they make in selecting, defining, and working on problems of public policy? In the late 1960s, professional policy advisors-called policy analysts-began to emerge in the Washington bureaucracy. Their job: to provide information and advice about the consequences of choosing different policies. Arnold J. Meltsner examines the various roles they asumed and the ways in which their priorities and methods were affected by the people they advised and the bureaucratic environment. Drawing on interviews with analysts and using his own experience as a government consultant, Meltsner shows how political and organizational considerations extended the boundaries of the advisor’s role in a way that went far beyond the analyst’s own notions of what policy analysis was. As the profession began to take shape, there were few standards of external organizations to set expectations for the analyst’s work. As advisors on the inside, many policy analysts became adept at writing speeches and memos and making political calculations. In short, they took on the folkways of the bureaucrat. This detailed and vivid account of the experiences of analysts in a government agency is written not only for students of the subject but for all those interested in the general processes of our government. By providing a picture of the roles and behavior of the policy analyst, Meltsner points out the predicaments facing those who try to improve the effectiveness of analytical expertise within the government. This title is part of UC Press’s Voices Revived program, which commemorates University of California Press’s mission to seek out and cultivate the brightest minds and give them voice, reach, and impact. Drawing on a backlist dating to 1893, Voices Revived makes high-quality, peer-reviewed scholarship accessible once again using print-on-demand technology. This title was originally published in 1976.",
        "DOI": "NA",
        "paper_author": "Meltsner A.J.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Recent advancement and assessment of green hydrogen production technologies",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "228",
        "cover_date": "2024-01-01",
        "Abstract": "Hydrogen energy has garnered substantial support from industry, government, and the public, positioning it as a pivotal future fuel source. However, its commercial realisation faces significant hurdles, including slow infrastructure growth and the high cost of producing clean hydrogen. This review uniquely emphasises the different colour codes of hydrogen, which have been rarely discussed in the literature to date. Hydrogen production methods are classified by colour codes, with green hydrogen, produced from renewable sources such as wind and solar, being the most desirable option. The demand for green hydrogen across various sectors is expected to surge. This review comprehensively evaluates the major hydrogen production methods based on cost, environmental impact, and technological maturity. Recent data confirm the increased efficiency, cost-competitiveness, and scalability of green hydrogen production technologies. The cost of green hydrogen has declined significantly, making it competitive with blue hydrogen (produced from fossil fuels with carbon capture). The review also scrutinises several recent hydrogen production technologies, highlighting their advantages, disadvantages, and technological readiness. Among these, the solid oxide electrolysis cell (SOEC) currently outperforms others, with anion exchange membrane (AEM) and electrified steam methane reforming (ESMR) also showing promise. This review also succinctly summarises global progress in hydrogen infrastructure and policies. By spotlighting the diverse colour codes of hydrogen and discussing the crucial takeaways and implications for the future, this review offers a comprehensive overview of the hydrogen energy landscape. This unique focus enriches the literature and enhances our understanding of hydrogen as a promising energy source.",
        "DOI": "10.1016/j.rser.2023.113941",
        "paper_author": "Zainal B.S.",
        "affiliation_name": "Universiti Tenaga Nasional",
        "affiliation_city": "Kajang",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60005762",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Political survival: Politicians and public policy in Latin America",
        "publication": "Political Survival: Politicians and Public Policy in Latin America",
        "citied_by": "217",
        "cover_date": "2024-03-29",
        "Abstract": "This title is part of UC Press's Voices Revived program, which commemorates University of California Press's mission to seek out and cultivate the brightest minds and give them voice, reach, and impact. Drawing on a backlist dating to 1893, Voices Revived makes high-quality, peer-reviewed scholarship accessible once again using print-on-demand technology. This title was originally published in 1987.",
        "DOI": "NA",
        "paper_author": "Ames B.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Green hydrogen: A pathway to a sustainable energy future",
        "publication": "International Journal of Hydrogen Energy",
        "citied_by": "207",
        "cover_date": "2024-01-02",
        "Abstract": "The development of sustainable energy sources has become a major challenge for society. Green hydrogen, produced through the electrolysis of water using renewable energy sources, offers a potential solution to reducing our dependence on fossil fuels. The paper examines the integration of green hydrogen into various sectors, such as transportation, industry, power generation, and heating, highlighting its potential to decarbonize traditionally carbon-intensive areas. Furthermore, it analyses the strategies and policies employed by the European Union, Australia, Japan, the United States, and Canada to drive the development and adoption of green hydrogen technologies. The challenges and barriers that need to be addressed to fully realize the potential of green hydrogen, such as technological limitations, infrastructure development, costs and economic feasibility, regulatory and policy frameworks, and public perception and acceptance, have been investigated. Recommendations for overcoming these challenges and accelerating the adoption of green hydrogen technologies are provided, and the importance of research and development in this sector is emphasized.",
        "DOI": "10.1016/j.ijhydene.2023.08.321",
        "paper_author": "Hassan Q.",
        "affiliation_name": "University Of Diyala",
        "affiliation_city": "Baqubah",
        "affiliation_country": "Iraq",
        "affiliation_id": "60104392",
        "affiliation_state": "Diyala Governorate"
    },
    {
        "paper_title": "The world of plastic waste: A review",
        "publication": "Cleaner Materials",
        "citied_by": "160",
        "cover_date": "2024-03-01",
        "Abstract": "People discover various materials from time to time that break the boundaries of traditional materials. Plastic is a revolutionized material, and is referred to as “a material with 1,000 uses”. This review summarized up-to-date research on plastic and its waste pollution. Plastic has a domain throughout human life with its versatile properties such as lightweight, high durability, flexibility, and low production cost. This article describes the applications, benefits, production, consumption, and classifications of plastics. Plastic commercialization began with the Second World War and grew all over the world within less than a century. The global annual production of plastic is more than 359 million tons. Despite all the benefits, plastics cause severe environmental and public health issues. Accordingly, this study addresses the major issues of plastic waste on the environment and human health. Plastics can degrade into micro to nano sizes, and those fine particles are more spreadable in air, water, and soil. Therefore, both terrestrial and aquatic animals go through various negative impacts such as ingestion, entangling, ulcers, low reproduction, and oxidative stress. Microplastics also degrade human health due to cardiovascular diseases, chronic kidney disease, birth defects, cancer, etc. The closing contains the developed end-of-life options (e.g., recycling and reprocessing, incineration with energy recovery, modification reuse, value addition, and landfilling) of biodegradable and non-biodegradable plastic wastes. Several international, regional/national level legislations and policies/concepts (e.g., plastic trade, 3R policy, and circular economy) are available to manage plastic and plastic waste generation. Plastic waste management is also discussed offering practical insights and real-world scenarios. Solutions and challenges in effective plastic waste management guide to create a more sustainable and environmentally responsible approach. Finally, this review article highlights the importance of judicious decisions and the involvement of all stakeholders to overcome the plastic waste crisis.",
        "DOI": "10.1016/j.clema.2024.100220",
        "paper_author": "Nayanathara Thathsarani Pilapitiya P.G.C.",
        "affiliation_name": "Uva Wellassa University",
        "affiliation_city": "Badulla",
        "affiliation_country": "Sri Lanka",
        "affiliation_id": "60104606",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The social determinants of mental health and disorder: evidence, prevention and recommendations",
        "publication": "World Psychiatry",
        "citied_by": "159",
        "cover_date": "2024-02-01",
        "Abstract": "People exposed to more unfavourable social circumstances are more vulnerable to poor mental health over their life course, in ways that are often determined by structural factors which generate and perpetuate intergenerational cycles of disadvantage and poor health. Addressing these challenges is an imperative matter of social justice. In this paper we provide a roadmap to address the social determinants that cause mental ill health. Relying as far as possible on high-quality evidence, we first map out the literature that supports a causal link between social determinants and later mental health outcomes. Given the breadth of this topic, we focus on the most pervasive social determinants across the life course, and those that are common across major mental disorders. We draw primarily on the available evidence from the Global North, acknowledging that other global contexts will face both similar and unique sets of social determinants that will require equitable attention. Much of our evidence focuses on mental health in groups who are marginalized, and thus often exposed to a multitude of intersecting social risk factors. These groups include refugees, asylum seekers and displaced persons, as well as ethnoracial minoritized groups; lesbian, gay, bisexual, transgender and queer (LGBTQ+) groups; and those living in poverty. We then introduce a preventive framework for conceptualizing the link between social determinants and mental health and disorder, which can guide much needed primary prevention strategies capable of reducing inequalities and improving population mental health. Following this, we provide a review of the evidence concerning candidate preventive strategies to intervene on social determinants of mental health. These interventions fall broadly within the scope of universal, selected and indicated primary prevention strategies, but we also briefly review important secondary and tertiary strategies to promote recovery in those with existing mental disorders. Finally, we provide seven key recommendations, framed around social justice, which constitute a roadmap for action in research, policy and public health. Adoption of these recommendations would provide an opportunity to advance efforts to intervene on modifiable social determinants that affect population mental health.",
        "DOI": "10.1002/wps.21160",
        "paper_author": "Kirkbride J.B.",
        "affiliation_name": "University College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60022148",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Burden of disease scenarios for 204 countries and territories, 2022–2050: a forecasting analysis for the Global Burden of Disease Study 2021",
        "publication": "The Lancet",
        "citied_by": "152",
        "cover_date": "2024-05-18",
        "Abstract": "Background: Future trends in disease burden and drivers of health are of great interest to policy makers and the public at large. This information can be used for policy and long-term health investment, planning, and prioritisation. We have expanded and improved upon previous forecasts produced as part of the Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) and provide a reference forecast (the most likely future), and alternative scenarios assessing disease burden trajectories if selected sets of risk factors were eliminated from current levels by 2050. Methods: Using forecasts of major drivers of health such as the Socio-demographic Index (SDI; a composite measure of lag-distributed income per capita, mean years of education, and total fertility under 25 years of age) and the full set of risk factor exposures captured by GBD, we provide cause-specific forecasts of mortality, years of life lost (YLLs), years lived with disability (YLDs), and disability-adjusted life-years (DALYs) by age and sex from 2022 to 2050 for 204 countries and territories, 21 GBD regions, seven super-regions, and the world. All analyses were done at the cause-specific level so that only risk factors deemed causal by the GBD comparative risk assessment influenced future trajectories of mortality for each disease. Cause-specific mortality was modelled using mixed-effects models with SDI and time as the main covariates, and the combined impact of causal risk factors as an offset in the model. At the all-cause mortality level, we captured unexplained variation by modelling residuals with an autoregressive integrated moving average model with drift attenuation. These all-cause forecasts constrained the cause-specific forecasts at successively deeper levels of the GBD cause hierarchy using cascading mortality models, thus ensuring a robust estimate of cause-specific mortality. For non-fatal measures (eg, low back pain), incidence and prevalence were forecasted from mixed-effects models with SDI as the main covariate, and YLDs were computed from the resulting prevalence forecasts and average disability weights from GBD. Alternative future scenarios were constructed by replacing appropriate reference trajectories for risk factors with hypothetical trajectories of gradual elimination of risk factor exposure from current levels to 2050. The scenarios were constructed from various sets of risk factors: environmental risks (Safer Environment scenario), risks associated with communicable, maternal, neonatal, and nutritional diseases (CMNNs; Improved Childhood Nutrition and Vaccination scenario), risks associated with major non-communicable diseases (NCDs; Improved Behavioural and Metabolic Risks scenario), and the combined effects of these three scenarios. Using the Shared Socioeconomic Pathways climate scenarios SSP2-4.5 as reference and SSP1-1.9 as an optimistic alternative in the Safer Environment scenario, we accounted for climate change impact on health by using the most recent Intergovernmental Panel on Climate Change temperature forecasts and published trajectories of ambient air pollution for the same two scenarios. Life expectancy and healthy life expectancy were computed using standard methods. The forecasting framework includes computing the age-sex-specific future population for each location and separately for each scenario. 95% uncertainty intervals (UIs) for each individual future estimate were derived from the 2·5th and 97·5th percentiles of distributions generated from propagating 500 draws through the multistage computational pipeline. Findings: In the reference scenario forecast, global and super-regional life expectancy increased from 2022 to 2050, but improvement was at a slower pace than in the three decades preceding the COVID-19 pandemic (beginning in 2020). Gains in future life expectancy were forecasted to be greatest in super-regions with comparatively low life expectancies (such as sub-Saharan Africa) compared with super-regions with higher life expectancies (such as the high-income super-region), leading to a trend towards convergence in life expectancy across locations between now and 2050. At the super-region level, forecasted healthy life expectancy patterns were similar to those of life expectancies. Forecasts for the reference scenario found that health will improve in the coming decades, with all-cause age-standardised DALY rates decreasing in every GBD super-region. The total DALY burden measured in counts, however, will increase in every super-region, largely a function of population ageing and growth. We also forecasted that both DALY counts and age-standardised DALY rates will continue to shift from CMNNs to NCDs, with the most pronounced shifts occurring in sub-Saharan Africa (60·1% [95% UI 56·8–63·1] of DALYs were from CMNNs in 2022 compared with 35·8% [31·0–45·0] in 2050) and south Asia (31·7% [29·2–34·1] to 15·5% [13·7–17·5]). This shift is reflected in the leading global causes of DALYs, with the top four causes in 2050 being ischaemic heart disease, stroke, diabetes, and chronic obstructive pulmonary disease, compared with 2022, with ischaemic heart disease, neonatal disorders, stroke, and lower respiratory infections at the top. The global proportion of DALYs due to YLDs likewise increased from 33·8% (27·4–40·3) to 41·1% (33·9–48·1) from 2022 to 2050, demonstrating an important shift in overall disease burden towards morbidity and away from premature death. The largest shift of this kind was forecasted for sub-Saharan Africa, from 20·1% (15·6–25·3) of DALYs due to YLDs in 2022 to 35·6% (26·5–43·0) in 2050. In the assessment of alternative future scenarios, the combined effects of the scenarios (Safer Environment, Improved Childhood Nutrition and Vaccination, and Improved Behavioural and Metabolic Risks scenarios) demonstrated an important decrease in the global burden of DALYs in 2050 of 15·4% (13·5–17·5) compared with the reference scenario, with decreases across super-regions ranging from 10·4% (9·7–11·3) in the high-income super-region to 23·9% (20·7–27·3) in north Africa and the Middle East. The Safer Environment scenario had its largest decrease in sub-Saharan Africa (5·2% [3·5–6·8]), the Improved Behavioural and Metabolic Risks scenario in north Africa and the Middle East (23·2% [20·2–26·5]), and the Improved Nutrition and Vaccination scenario in sub-Saharan Africa (2·0% [–0·6 to 3·6]). Interpretation: Globally, life expectancy and age-standardised disease burden were forecasted to improve between 2022 and 2050, with the majority of the burden continuing to shift from CMNNs to NCDs. That said, continued progress on reducing the CMNN disease burden will be dependent on maintaining investment in and policy emphasis on CMNN disease prevention and treatment. Mostly due to growth and ageing of populations, the number of deaths and DALYs due to all causes combined will generally increase. By constructing alternative future scenarios wherein certain risk exposures are eliminated by 2050, we have shown that opportunities exist to substantially improve health outcomes in the future through concerted efforts to prevent exposure to well established risk factors and to expand access to key health interventions. Funding: Bill & Melinda Gates Foundation.",
        "DOI": "10.1016/S0140-6736(24)00685-8",
        "paper_author": "Vollset S.E.",
        "affiliation_name": "Institute for Health Metrics and Evaluation",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60091926",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Current status and future trends of the global burden of MASLD",
        "publication": "Trends in Endocrinology and Metabolism",
        "citied_by": "137",
        "cover_date": "2024-08-01",
        "Abstract": "Metabolic dysfunction-associated steatotic liver disease (MASLD) has emerged as the most common chronic liver disease globally, affecting more than a third of the world's adult population. This comprehensive narrative review summarizes the global incidence and prevalence rates of MASLD and its related adverse hepatic and extrahepatic outcomes. We also discuss the substantial economic burden of MASLD on healthcare systems, thus further highlighting the urgent need for global efforts to tackle this common and burdensome liver condition. We emphasize the clinical relevance of early interventions and a holistic approach that includes public health strategies to reduce the global impact of MASLD.",
        "DOI": "10.1016/j.tem.2024.02.007",
        "paper_author": "Miao L.",
        "affiliation_name": "The Second Affiliated Hospital and Yuying Children's Hospital of Wenzhou Medical University",
        "affiliation_city": "Wenzhou",
        "affiliation_country": "China",
        "affiliation_id": "60122346",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "GenBank 2024 Update",
        "publication": "Nucleic Acids Research",
        "citied_by": "114",
        "cover_date": "2024-01-05",
        "Abstract": "GenBank® (https://www.ncbi.nlm.nih.gov/genbank/) is a comprehensive, public database that contains 25 trillion base pairs from over 3.7 billion nucleotide sequences for 557 000 formally described species. Daily data exchange with the European Nucleotide Archive (ENA) and the DNA Data Bank of Japan (DDBJ) ensures worldwide coverage. Recent updates include policies for including spatio-temporal metadata, clarified documentation for GenBank data processing, enhanced foreign contamination screening tools, new processes in the Submission Portal, migration of Entrez Genome and Assembly displays into NCBI Datasets, and the impending retirement of tbl2asn, replaced by table2asn.",
        "DOI": "10.1093/nar/gkad903",
        "paper_author": "Sayers E.W.",
        "affiliation_name": "National Center for Biotechnology Information (NCBI)",
        "affiliation_city": "Bethesda",
        "affiliation_country": "United States",
        "affiliation_id": "60087823",
        "affiliation_state": "MD"
    },
    {
        "paper_title": "A tool to assess risk of bias in non-randomized follow-up studies of exposure effects (ROBINS-E)",
        "publication": "Environment International",
        "citied_by": "109",
        "cover_date": "2024-04-01",
        "Abstract": "Background: Observational epidemiologic studies provide critical data for the evaluation of the potential effects of environmental, occupational and behavioural exposures on human health. Systematic reviews of these studies play a key role in informing policy and practice. Systematic reviews should incorporate assessments of the risk of bias in results of the included studies. Objective: To develop a new tool, Risk Of Bias In Non-randomized Studies - of Exposures (ROBINS-E) to assess risk of bias in estimates from cohort studies of the causal effect of an exposure on an outcome. Methods and results: ROBINS-E was developed by a large group of researchers from diverse research and public health disciplines through a series of working groups, in-person meetings and pilot testing phases. The tool aims to assess the risk of bias in a specific result (exposure effect estimate) from an individual observational study that examines the effect of an exposure on an outcome. A series of preliminary considerations informs the core ROBINS-E assessment, including details of the result being assessed and the causal effect being estimated. The assessment addresses bias within seven domains, through a series of ‘signalling questions’. Domain-level judgements about risk of bias are derived from the answers to these questions, then combined to produce an overall risk of bias judgement for the result, together with judgements about the direction of bias. Conclusion: ROBINS-E provides a standardized framework for examining potential biases in results from cohort studies. Future work will produce variants of the tool for other epidemiologic study designs (e.g. case-control studies). We believe that ROBINS-E represents an important development in the integration of exposure assessment, evidence synthesis and causal inference.",
        "DOI": "10.1016/j.envint.2024.108602",
        "paper_author": "Higgins J.P.T.",
        "affiliation_name": "Bristol Medical School",
        "affiliation_city": "Bristol",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60171764",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "An update on the global disparities in kidney disease burden and care across world countries and regions",
        "publication": "The Lancet Global Health",
        "citied_by": "95",
        "cover_date": "2024-03-01",
        "Abstract": "Background: Since 2015, the International Society of Nephrology (ISN) Global Kidney Health Atlas (ISN-GKHA) has spearheaded multinational efforts to understand the status and capacity of countries to provide optimal kidney care, particularly in low-resource settings. In this iteration of the ISN-GKHA, we sought to extend previous findings by assessing availability, accessibility, quality, and affordability of medicines, kidney replacement therapy (KRT), and conservative kidney management (CKM). Methods: A consistent approach was used to obtain country-level data on kidney care capacity during three phases of data collection in 2016, 2018, and 2022. The current report includes a detailed literature review of published reports, databases, and registries to obtain information on the burden of chronic kidney disease and estimate the incidence and prevalence of treated kidney failure. Findings were triangulated with data from a multinational survey of opinion leaders based on the WHO's building blocks for health systems (ie, health financing, service delivery, access to essential medicines and health technology, health information systems, workforce, and governance). Country-level data were stratified by the ISN geographical regions and World Bank income groups and reported as counts and percentages, with global, regional, and income level estimates presented as medians with interquartile ranges. Findings: The literature review used information on prevalence of chronic kidney disease from 161 countries. The global median prevalence of chronic kidney disease was 9·5% (IQR 5·9–11·7) with the highest prevalence in Eastern and Central Europe (12·8%, 11·9–14·1). For the survey analysis, responses received covered 167 (87%) of 191 countries, representing 97·4% (7·700 billion of 7·903 billion) of the world population. Chronic haemodialysis was available in 162 (98%) of 165 countries, chronic peritoneal dialysis in 130 (79%), and kidney transplantation in 116 (70%). However, 121 (74%) of 164 countries were able to provide KRT to more than 50% of people with kidney failure. Children did not have access to haemodialysis in 12 (19%) of 62 countries, peritoneal dialysis in three (6%) countries, or kidney transplantation in three (6%) countries. CKM (non-dialysis management of people with kidney failure chosen through shared decision making) was available in 87 (53%) of 165 countries. The annual median costs of KRT were: US$19 380 per person for haemodialysis, $18 959 for peritoneal dialysis, and $26 903 for the first year of kidney transplantation. Overall, 74 (45%) of 166 countries allocated public funding to provide free haemodialysis at the point of delivery; use of this funding scheme increased with country income level. The median global prevalence of nephrologists was 11·8 per million population (IQR 1·8–24·8) with an 80-fold difference between low-income and high-income countries. Differing degrees of health workforce shortages were reported across regions and country income levels. A quarter of countries had a national chronic kidney disease-specific strategy (41 [25%] of 162) and chronic kidney disease was recognised as a health priority in 78 (48%) of 162 countries. Interpretation: This study provides new information about the global burden of kidney disease and its treatment. Countries in low-resource settings have substantially diminished capacity for kidney care delivery. These findings have major policy implications for achieving equitable access to kidney care. Funding: International Society of Nephrology.",
        "DOI": "10.1016/S2214-109X(23)00570-3",
        "paper_author": "Bello A.K.",
        "affiliation_name": "University of Alberta, Faculty of Medicine and Dentistry",
        "affiliation_city": "Edmonton",
        "affiliation_country": "Canada",
        "affiliation_id": "60019490",
        "affiliation_state": "AB"
    },
    {
        "paper_title": "WHO's global oral health status report 2022: Actions, discussion and implementation",
        "publication": "Oral Diseases",
        "citied_by": "93",
        "cover_date": "2024-03-01",
        "Abstract": "NA",
        "DOI": "10.1111/odi.14516",
        "paper_author": "Jain N.",
        "affiliation_name": "Riga Stradins University",
        "affiliation_city": "Riga",
        "affiliation_country": "Latvia",
        "affiliation_id": "60069085",
        "affiliation_state": "RIX"
    },
    {
        "paper_title": "Trustworthy artificial intelligence and the European Union AI act: On the conflation of trustworthiness and acceptability of risk",
        "publication": "Regulation and Governance",
        "citied_by": "89",
        "cover_date": "2024-01-01",
        "Abstract": "In its AI Act, the European Union chose to understand trustworthiness of AI in terms of the acceptability of its risks. Based on a narrative systematic literature review on institutional trust and AI in the public sector, this article argues that the EU adopted a simplistic conceptualization of trust and is overselling its regulatory ambition. The paper begins by reconstructing the conflation of “trustworthiness” with “acceptability” in the AI Act. It continues by developing a prescriptive set of variables for reviewing trust research in the context of AI. The paper then uses those variables for a narrative review of prior research on trust and trustworthiness in AI in the public sector. Finally, it relates the findings of the review to the EU's AI policy. Its prospects to successfully engineer citizen's trust are uncertain. There remains a threat of misalignment between levels of actual trust and the trustworthiness of applied AI.",
        "DOI": "10.1111/rego.12512",
        "paper_author": "Laux J.",
        "affiliation_name": "Oxford Social Sciences Division",
        "affiliation_city": "Oxford",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60175816",
        "affiliation_state": "Oxfordshire"
    },
    {
        "paper_title": "Adoption of green finance and green innovation for achieving circularity: An exploratory review and future directions",
        "publication": "Geoscience Frontiers",
        "citied_by": "86",
        "cover_date": "2024-07-01",
        "Abstract": "There is growing attention from governments and regulators towards crucial matters such as climate change and global warming, resulting in a pressing need to investigate the factors that make it possible for businesses to engage in green finance (GF). The externality of environmental pollution prioritizes the need of green innovation (GI) in public management. GF distributes financial resources to the research and development (R&D) of clean energy and environmentally friendly goods and processes; it is complementary to the GI process for environmental protection. GF policies help to alleviate the impacts of financial constraints and GI impaired industries involving new products, processes, services and the global market. To better understand how GF and GI have functioned as a catalyst for circular economy practices, this paper seeks to present a historical and contemporary overview of these concepts. The research is thoroughly dissected by a systematic literature evaluation of articles from 2016 to 2023 that appear in peer-reviewed journals and are indexed in the SCOPUS database. To attain supply chain circularity, this article encompasses four major research themes concerning the adoption of GF and green technologies. The research also includes a network analysis of shortlisted articles to examine the overall citation trends. It is shown that several institutional theories are associated with the investigated area. As a final step, a framework is provided to illustrate how GF and GIs might be used to achieve supply chain circularity. The research findings provide a novel concept related to GF within the context of GI which are significant for environmentalists, policymakers, green investors, and researchers. Through its findings, the study provides a conceptual framework that promotes sustainable strategies to effectively balance financial considerations and environmental innovation. It helps to leverage the potential of green research and practice to create value for businesses and to benefit society at large. The analysis provides an unexplored and significant contribution to current literature in terms of delivering evidence of the past and present approaches to GF and GI in a circular economy. The results of this study will attract the attention of policymakers and stakeholders to develop and combine the two concepts in research and practice to attain environmental balance in the circular economy and to promote long term sustainability.",
        "DOI": "10.1016/j.gsf.2023.101669",
        "paper_author": "Agrawal R.",
        "affiliation_name": "Indian Institute of Management",
        "affiliation_city": "Bodhgaya",
        "affiliation_country": "India",
        "affiliation_id": "128502585",
        "affiliation_state": "BR"
    },
    {
        "paper_title": "The Heart of the World",
        "publication": "Global Heart",
        "citied_by": "82",
        "cover_date": "2024-01-01",
        "Abstract": "Cardiovascular diseases (CVDs) are the leading cause of mortality globally. Of the 20.5 million CVD-related deaths in 2021, approximately 80% occurred in low- and middle-income countries. Using data from the Global Burden of Disease Study, NCD Risk Factor Collaboration, NCD Countdown initiative, WHO Global Health Observatory, and WHO Global Health Expenditure database, we present the burden of CVDs, associated risk factors, their association with national health expenditures, and an index of critical policy implementation. The Central Europe, Eastern Europe, and Central Asia region face the highest levels of CVD mortality globally. Although CVD mortality levels are generally lower in women than men, this is not true in almost 30% of countries in the North Africa and Middle East and Sub-Saharan regions. Raised blood pressure remains the leading global CVD risk factor, contributing to 10.8 million deaths in 2019. The regions with the highest proportion of countries achieving the maximum score for the WHF Policy Index were South Asia, Central Europe, Eastern Europe, and Central Asia, and the High-Income regions. The Sub-Saharan Africa region had the highest proportion of countries scoring two or less. Policymakers must assess their country’s risk factor profile to craft effective strategies for CVD prevention and management. Fundamental strategies such as the implementation of National Tobacco Control Programmes, ensuring the availability of CVD medications, and establishing specialised units within health ministries to tackle non-communicable diseases should be embraced in all countries. Adequate healthcare system funding is equally vital, ensuring reasonable access to care for all communities.",
        "DOI": "10.5334/gh.1288",
        "paper_author": "Di Cesare M.",
        "affiliation_name": "University of Essex",
        "affiliation_city": "Colchester",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60001359",
        "affiliation_state": "Essex"
    },
    {
        "paper_title": "Infectious Diseases Society of America Guidelines on the Diagnosis of COVID-19 (June 2020)",
        "publication": "Clinical Infectious Diseases",
        "citied_by": "76",
        "cover_date": "2024-06-15",
        "Abstract": "Background: Accurate molecular diagnostic tests are necessary for confirming a diagnosis of coronavirus disease 2019 (COVID-19). Direct detection of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) nucleic acids in respiratory tract specimens informs patient, healthcare institution, and public health-level decision-making. The number of available SARS-CoV-2 nucleic acid detection tests is rapidly increasing, as is the COVID-19 diagnostic literature. Thus, the Infectious Diseases Society of America (IDSA) recognized a significant need for frequently updated systematic reviews of the literature to inform evidence-based best practice guidance. Objective: The IDSA's goal was to develop an evidence-based diagnostic guidelines to assist clinicians, clinical laboratorians, patients, and policy makers in decisions related to the optimal use of SARS-CoV-2 nucleic acid amplification tests. In addition, the society provides a conceptual framework for understanding molecular diagnostic test performance, discusses the nuance of test result interpretation in a variety of practice settings, and highlights important unmet research needs in the COVID-19 diagnostic testing arena. Methods: IDSA convened a multidisciplinary panel of infectious diseases clinicians, clinical microbiologists, and experts in systematic literature review to identify and prioritize clinical questions and outcomes related to the use of SARS-CoV-2 molecular diagnostics. Grading of Recommendations Assessment, Development and Evaluation methodology was used to assess the certainty of evidence and make testing recommendations. Results: The panel agreed on 15 diagnostic recommendations. Conclusions: Universal access to accurate SARS-CoV-2 nucleic acid testing is critical for patient care, hospital infection prevention, and the public response to the COVID-19 pandemic. Information on the clinical performance of available tests is rapidly emerging, but the quality of evidence of the current literature is considered low to very low. Recognizing these limitations, the IDSA panel weighed available diagnostic evidence and recommends nucleic acid testing for all symptomatic individuals suspected of having COVID-19. In addition, testing is recommended for asymptomatic individuals who have had a known or suspected contact with a COVID-19 case. Testing asymptomatic individuals without known exposure is suggested when the results will impact isolation/quarantine/personal protective equipment usage decisions, dictate eligibility for surgery, or inform administration of immunosuppressive therapy. Ultimately, prioritization of testing will depend on institution-specific resources and the needs of different patient populations.",
        "DOI": "10.1093/cid/ciaa760",
        "paper_author": "Hanson K.E.",
        "affiliation_name": "The University of Utah",
        "affiliation_city": "Salt Lake City",
        "affiliation_country": "United States",
        "affiliation_id": "60025488",
        "affiliation_state": "UT"
    },
    {
        "paper_title": "How does climate change affect food security? Evidence from China",
        "publication": "Environmental Impact Assessment Review",
        "citied_by": "76",
        "cover_date": "2024-01-01",
        "Abstract": "The trend of global warming has sparked a growing concern about the impact of climate change on food security. China is a vast country with different climate situations in each region. This study examines the impact of climate change on food security in China using panel data from 31 provinces and cities (1984–2020). Results show that climate change significantly affects food security, bringing more uncertainty risks. Agricultural policies can mitigate this impact by reducing production costs and improving farmers' risk resistance and motivation. Regional heterogeneity exists, with climate change having significant moderating effects on food security in non-food-producing regions and rainfall having significant effects in north and central regions. Relevant policy implications are suggested for strengthening climate change resilience, improving system design, and coordinating regional agricultural production.",
        "DOI": "10.1016/j.eiar.2023.107324",
        "paper_author": "Lee C.C.",
        "affiliation_name": "Nanchang University",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60008332",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "From fossil fuel energy to hydrogen energy: Transformation of fossil fuel energy economies into hydrogen economies through social entrepreneurship",
        "publication": "International Journal of Hydrogen Energy",
        "citied_by": "76",
        "cover_date": "2024-02-07",
        "Abstract": "Social entrepreneurship plays a crucial role in global sustainable development, enhancing the quality of life and preserving environmental, human, and social capital. However, when it comes to the energy transition, it faces numerous challenges and experiences conflicts in terms of costs, technological innovation, and public policies. This study seeks to illustrate one of the new alternative energy schemes which could replace fossil fuels in the future: hydrogen. This transformation would result in significant social impacts, leading to the question, “how should it be done?” Social entrepreneurship can integrate socio-economic actors and agents and help them to devise and implement new forms of energy innovation. Therefore, a descriptive qualitative methodology was implemented, that allows us to analyze the process of building entrepreneurship with a social vision and to propose a model that enables the transition from fossil economies to the hydrogen economies. Among the most significant results, the importance of the support of the three primary axes of each country and the role of social entrepreneurship as a key element for the transition stand out. The discussion contributes to the debate on the path that academia should lead, and the fundamental role of entrepreneurship based on social conscience as a driver of change.",
        "DOI": "10.1016/j.ijhydene.2023.06.123",
        "paper_author": "Garzón Baquero J.E.",
        "affiliation_name": "Universidad de Santander",
        "affiliation_city": "Bucaramanga",
        "affiliation_country": "Colombia",
        "affiliation_id": "60106657",
        "affiliation_state": "Santander"
    },
    {
        "paper_title": "Accountability in artificial intelligence: what it is and how it works",
        "publication": "AI and Society",
        "citied_by": "71",
        "cover_date": "2024-08-01",
        "Abstract": "Accountability is a cornerstone of the governance of artificial intelligence (AI). However, it is often defined too imprecisely because its multifaceted nature and the sociotechnical structure of AI systems imply a variety of values, practices, and measures to which accountability in AI can refer. We address this lack of clarity by defining accountability in terms of answerability, identifying three conditions of possibility (authority recognition, interrogation, and limitation of power), and an architecture of seven features (context, range, agent, forum, standards, process, and implications). We analyze this architecture through four accountability goals (compliance, report, oversight, and enforcement). We argue that these goals are often complementary and that policy-makers emphasize or prioritize some over others depending on the proactive or reactive use of accountability and the missions of AI governance.",
        "DOI": "10.1007/s00146-023-01635-y",
        "paper_author": "Novelli C.",
        "affiliation_name": "Alma Mater Studiorum Università di Bologna",
        "affiliation_city": "Bologna",
        "affiliation_country": "Italy",
        "affiliation_id": "60028218",
        "affiliation_state": "BO"
    },
    {
        "paper_title": "Effectiveness and impact of universal prophylaxis with nirsevimab in infants against hospitalisation for respiratory syncytial virus in Galicia, Spain: initial results of a population-based longitudinal study",
        "publication": "The Lancet Infectious Diseases",
        "citied_by": "70",
        "cover_date": "2024-08-01",
        "Abstract": "Background: Galicia (Spain) was one of the first regions worldwide to incorporate nirsevimab for universal respiratory syncytial virus (RSV) prophylaxis in infants into its immunisation programme. The NIRSE-GAL longitudinal population-based study aimed to assess nirsevimab effectiveness in preventing hospitalisations (ie, admittance to hospital). Methods: The 2023–24 immunisation campaign with nirsevimab in Galicia began on Sept 25, 2023, and concluded on March 31, 2024. The campaign targeted three groups: infants born during the campaign (seasonal group), infants younger than 6 months at the start of the campaign (catch-up group), and infants aged 6–24 months with high-risk factors at the start of the campaign (high-risk group). Infants in the seasonal group were offered immunisation on the first day of life before discharge from hospital. Infants in the catch-up and high-risk groups received electronic appointments to attend a public hospital or health-care centre for nirsevimab administration. For this interim analysis, we used data collected from Sept 25 to Dec 31, 2023, from children born up to Dec 15, 2023. Data were retrieved from public health registries. Nirsevimab effectiveness in preventing RSV-associated lower respiratory tract infection (LRTI) hospitalisations; severe RSV-related LRTI requiring intensive care unit admission, mechanical ventilation, or oxygen support; all-cause LRTI hospitalisations; and all-cause hospitalisations was estimated using adjusted Poisson regression models. Data from five past RSV seasons (2016–17, 2017–18, 2018–19, 2019–20, and 2022–23), excluding the COVID-19 pandemic period, were used to estimate the number of RSV-related LRTI hospitalisations averted along with its IQR. The number needed to immunise to avoid one case in the 2023–24 season was then estimated from the averted cases. Nirsevimab safety was routinely monitored. The NIRSE-GAL study protocol was registered on ClinicalTrials.gov (NCT06180993), and follow-up of participants is ongoing. Findings: 9408 (91·7%) of 10 259 eligible infants in the seasonal and catch-up groups received nirsevimab, including 6220 (89·9%) of 6919 in the catch-up group and 3188 (95·4%) of 3340 in the seasonal group. 360 in the high-risk group were offered nirsevimab, 348 (97%) of whom received it. Only infants in the seasonal and catch-up groups were included in analyses to estimate nirsevimab effectiveness and impact because there were too few events in the high-risk group. In the catch-up and seasonal groups combined, 30 (0·3%) of 9408 infants who received nirsevimab and 16 (1·9%) of 851 who did not receive nirsevimab were hospitalised for RSV-related LRTI, corresponding to an effectiveness of 82·0% (95% CI 65·6–90·2). Effectiveness was 86·9% (69·1–94·2) against severe RSV-related LRTI requiring oxygen support, 69·2% (55·9–78·0) against all-cause LRTI hospitalisations, and 66·2% (56·0–73·7) against all-cause hospitalisations. Nirsevimab effectiveness against other endpoints of severe RSV-related LRTI could not be estimated because of too few events. RSV-related LRTI hospitalisations were reduced by 89·8% (IQR 87·5–90·3), and the number needed to immunise to avoid one RSV-related LRTI hospitalisation was 25 (IQR 24–32). No severe adverse events related to nirsevimab were registered. Interpretation: Nirsevimab substantially reduced infant hospitalisations for RSV-associated LRTI, severe RSV-associated LRTI requiring oxygen, and all-cause LRTI when given in real-world conditions. These findings offer policy makers and health authorities robust, real-world, population-based evidence to guide the development of strategies for RSV prevention. Funding: Sanofi and AstraZeneca. Translation: For the Spanish translation of the abstract see Supplementary Materials section.",
        "DOI": "10.1016/S1473-3099(24)00215-9",
        "paper_author": "Ares-Gómez S.",
        "affiliation_name": "Instituto de Investigación Sanitaria de Santiago de Compostela",
        "affiliation_city": "Santiago de Compostela",
        "affiliation_country": "Spain",
        "affiliation_id": "60272603",
        "affiliation_state": "Galicia"
    },
    {
        "paper_title": "Enterprise pollution reduction through digital transformation? Evidence from Chinese manufacturing enterprises",
        "publication": "Technology in Society",
        "citied_by": "69",
        "cover_date": "2024-06-01",
        "Abstract": "Digital transformation provides new opportunities for the green development of enterprises. Clarifying the impact and mechanism of digital transformation on enterprise pollution reduction has important policy implications for the synergistic development of digitalization and greenization. This paper explores the impact of digital transformation on enterprise pollution abatement using data from Chinese manufacturing enterprises and fixed effects models. The empirical results show that digital transformation contributes to enterprise pollution reduction. Furthermore, the pollution reduction role of digital transformation is more pronounced in enterprises with high degrees of pollution intensity. Digital transformation acts on pollution reduction through productivity improvement and scale expansion, while a mechanism for green technology innovation does not exist. Additionally, industry attributes and external environment heterogeneity affect the pollution abatement role of digital transformation. Enterprises can achieve stronger pollution abatement from digital transformation when they belong to high-polluting industries, high-tech industries, areas with high environmental regulation (HER), and cohorts. The paper provides new micro evidence that digital transformation promotes pollution reduction, enriches the literature on the environmental impact of digital transformation, and provides beneficial insights for enterprises to drive pollution reduction in the era of the digital economy.",
        "DOI": "10.1016/j.techsoc.2024.102520",
        "paper_author": "Zhao S.",
        "affiliation_name": "Hohai University",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60010851",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "A bibliometric analysis of sustainable development goals (SDGs): a review of progress, challenges, and opportunities",
        "publication": "Environment, Development and Sustainability",
        "citied_by": "65",
        "cover_date": "2024-05-01",
        "Abstract": "The Sustainable Development Goals (SDGs) are a global appeal to protect the environment, combat climate change, eradicate poverty, and ensure access to a high quality of life and prosperity for all. The next decade is crucial for determining the planet’s direction in ensuring that populations can adapt to climate change. This study aims to investigate the progress, challenges, opportunities, trends, and prospects of the SDGs through a bibliometric analysis from 2015 to 2022, providing insight into the evolution and maturity of scientific research in the field. The Web of Science core collection citation database was used for the bibliometric analysis, which was conducted using VOSviewer and RStudio. We analyzed 12,176 articles written in English to evaluate the present state of progress, as well as the challenges and opportunities surrounding the SDGs. This study utilized a variety of methods to identify research hotspots, including analysis of keywords, productive researchers, and journals. In addition, we conducted a comprehensive literature review by utilizing the Web of Science database. The results show that 31% of SDG-related research productivity originates from the USA, China, and the UK, with an average citation per article of 15.06. A total of 45,345 authors around the world have contributed to the field of SDGs, and collaboration among authors is also quite high. The core research topics include SDGs, climate change, Agenda 2030, the circular economy, poverty, global health, governance, food security, sub-Saharan Africa, the Millennium Development Goals, universal health coverage, indicators, gender, and inequality. The insights gained from this analysis will be valuable for young researchers, practitioners, policymakers, and public officials as they seek to identify patterns and high-quality articles related to SDGs. By advancing our understanding of the subject, this research has the potential to inform and guide future efforts to promote sustainable development. The findings indicate a concentration of research and development on SDGs in developed countries rather than in developing and underdeveloped countries. Graphical abstract: (Figure presented.).",
        "DOI": "10.1007/s10668-023-03225-w",
        "paper_author": "Mishra M.",
        "affiliation_name": "Fakir Mohan University",
        "affiliation_city": "Balasore",
        "affiliation_country": "India",
        "affiliation_id": "60107788",
        "affiliation_state": "OR"
    },
    {
        "paper_title": "Changing the global obesity narrative to recognize and reduce weight stigma: A position statement from the World Obesity Federation",
        "publication": "Obesity Reviews",
        "citied_by": "59",
        "cover_date": "2024-01-01",
        "Abstract": "Weight stigma, defined as pervasive misconceptions and stereotypes associated with higher body weight, is both a social determinant of health and a human rights issue. It is imperative to consider how weight stigma may be impeding health promotion efforts on a global scale. The World Obesity Federation (WOF) convened a global working group of practitioners, researchers, policymakers, youth advocates, and individuals with lived experience of obesity to consider the ways that global obesity narratives may contribute to weight stigma. Specifically, the working group focused on how overall obesity narratives, food and physical activity narratives, and scientific and public-facing language may contribute to weight stigma. The impact of weight stigma across the lifespan was also considered. Taking a global perspective, nine recommendations resulted from this work for global health research and health promotion efforts that can help to reduce harmful obesity narratives, both inside and outside health contexts.",
        "DOI": "10.1111/obr.13642",
        "paper_author": "Nutter S.",
        "affiliation_name": "University of Victoria",
        "affiliation_city": "Victoria",
        "affiliation_country": "Canada",
        "affiliation_id": "60003122",
        "affiliation_state": "BC"
    },
    {
        "paper_title": "Friendly intruders: Childcare professionals and family life",
        "publication": "Friendly Intruders: Childcare Professionals and Family Life",
        "citied_by": "57",
        "cover_date": "2024-03-29",
        "Abstract": "The governments of many industrialized societies have developed extensive childcare facilities and services to meet the needs of young children and their working parents, but no such program on a national scale has yet evolve in the United Staes. Some who oppose federal aid or control believe that mothers should remain at home with their preschool children rather than turn them over to childcare professionals--the \"friendly intruders\" of the titels--and that any other policy is a threat to the moral climate and stability of family life. However, since the demand for childcare services is very great, and since Congress has previously passed relevant legislation (which was vetoed by President Nixon), the issue of childcare will surely rise again soon. In this study, based upon direct observation of a local childcare program in California, the author examines several pof the practical policy issues concerning childcare which have not yet been resolved. Who will control such programs in the future, public school systems or others? Which agencies or institutions will certify the competence of childcare personnel? To what extent will parents contribute to the content of the programs provided for their young children? A major part of Professor Joffe's study is concerned with the emerging professionalism of early childhood educators. In a pattern now understood to be classic, such persons seek status and recognition through education, certification, and membership in professional associations. However, what happens when parents and professional disagree about values, behavioral norms, and the educational content of a nursery school program? Who is the \"expert\" in such a confrontation? The author observed profoundly different orientations to childcare not only between professionals and parents, but also among different groups of parents, especially along racial and class lines; how can professionals accommodate such differences? The author's conclusions emerge from careful study of day-by-day encounters between staff, parents and supervisors, giving to her book a sense of immediacy and well-focused understanding that is rarely achieved in academic studies. Parents, educators and policy analysts concerned with the subject will find it indispensable. This title is part of UC Press's Voices Revived program, which commemorates University of California Press's mission to seek out and cultivate the brightest minds and give them voice, reach, and impact. Drawing on a backlist dating to 1893, Voices Revived makes high-quality, peer-reviewed scholarship accessible once again using print-on-demand technology. This title was originally published in 1977.",
        "DOI": "NA",
        "paper_author": "Joffe C.E.",
        "affiliation_name": "Bixby Center for Global Reproductive Health",
        "affiliation_city": "Bixby",
        "affiliation_country": "United States",
        "affiliation_id": "109504772",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Drivers of generative AI adoption in higher education through the lens of the Theory of Planned Behaviour",
        "publication": "Technology in Society",
        "citied_by": "56",
        "cover_date": "2024-06-01",
        "Abstract": "Drawing on the Theory of Planned Behaviour (TPB), this study investigates the relationship between the perceived benefits, strengths, weaknesses, and risks of generative AI (GenAI) tools and the fundamental factors of the TPB model (i.e., attitude, subjective norms, and perceived behavioural control). The study also investigates the structural association between the TPB variables and intention to use GenAI tools, and how the latter might affect the actual usage of GenAI tools in higher education. The paper adopts a quantitative approach, relying on an anonymous self-administered online questionnaire to gather primary data from 130 lecturers and 168 students in higher education institutions (HEIs) in several countries, and PLS-SEM for data analysis. The results indicate that although lecturers' and students' perceptions of the risks and weaknesses of GenAI tools differ, the perceived strengths and advantages of GenAI technologies have a significant and positive impact on their attitudes, subjective norms, and perceived behavioural control. The TPB core variables positively and significantly impact lecturers' and students’ intentions to use GenAI tools, which in turn significantly and positively impact their adoption of such tools. This paper advances theory by outlining the factors shaping the adoption of GenAI technologies in HEIs. It provides stakeholders with a variety of managerial and policy implications for how to formulate suitable rules and regulations to utilise the advantages of these tools while mitigating the impacts of their disadvantages. Limitations and future research opportunities are also outlined.",
        "DOI": "10.1016/j.techsoc.2024.102521",
        "paper_author": "Ivanov S.",
        "affiliation_name": "Varna University of Management",
        "affiliation_city": "Varna",
        "affiliation_country": "Bulgaria",
        "affiliation_id": "60086319",
        "affiliation_state": "Varna"
    },
    {
        "paper_title": "Exploring how economic growth, renewable energy, internet usage, and mineral rents influence CO<inf>2</inf> emissions: A panel quantile regression analysis for 27 OECD countries",
        "publication": "Resources Policy",
        "citied_by": "54",
        "cover_date": "2024-05-01",
        "Abstract": "This study aims to investigate the impacts of renewable energy consumption, internet usage, mineral rent, and economic growth on CO2 emissions across 27 OECD nations between 2001 and 2020. We employ a panel quantile regression technique to discover the heterogeneous effects of these variables for the various quantile levels of environmental destruction. The panel quantile regression approach found the Environmental Kuznets curve dominated countries in which CO2 emissions were low. Additionally, the negative relationship between renewable energy consumption and CO2 emissions yielded in the paper suggests the potential benefits of incentivizing and investing in renewable sources. Internet usage demonstrates a negative impact on CO2 emissions, showcasing the role of digital technologies in promoting sustainability. Accordingly, internet use improves environmental quality due to more efficient, sustainable, and eco-friendly practices, which increase productivity. However, a positive association between mineral rents and environmental deterioration emphasizes the necessity of strategic policies to balance economic benefits with environmental preservation. Our study provides policymakers with valuable insights into tailoring effective strategies for sustainable development, renewable energy adoption, digitalization, and natural resource utilization while addressing environmental degradation.",
        "DOI": "10.1016/j.resourpol.2024.105025",
        "paper_author": "Işık C.",
        "affiliation_name": "Anadolu Üniversitesi",
        "affiliation_city": "Eskisehir",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60016238",
        "affiliation_state": "Eskisehir"
    },
    {
        "paper_title": "Insights into the management of food waste in developing countries: with special reference to India",
        "publication": "Environmental Science and Pollution Research",
        "citied_by": "54",
        "cover_date": "2024-03-01",
        "Abstract": "Up to one third of the food that is purposely grown for human sustenance is wasted and never consumed, with adverse consequences for the environment and socio-economic aspects. In India, managing food waste is a significant environmental concern. Food waste output is increasing in Indian cities and towns as a result of the country’s urban expansion, modernization, and population growth. Poor management of food waste can have negative consequences for the environment and pose a risk to the public’s health issues. This review focuses on the current challenges, management strategies, and future perspectives of food waste management in India. The efficient management of food waste involves a comprehensive study regarding the characterization of food waste and improved waste management methods. In addition, the government policies and rules for managing food waste that is in effect in India are covered in this review.",
        "DOI": "10.1007/s11356-023-27901-6",
        "paper_author": "Sahoo A.",
        "affiliation_name": "Banaras Hindu University",
        "affiliation_city": "Varanasi",
        "affiliation_country": "India",
        "affiliation_id": "60008721",
        "affiliation_state": "UP"
    },
    {
        "paper_title": "Tobacco promotion restriction policies on social media",
        "publication": "Tobacco Control",
        "citied_by": "54",
        "cover_date": "2024-05-01",
        "Abstract": "Tobacco promotion is prolific on social media, with each platform setting their own restrictions on tobacco promotion and sales. We evaluated the policies related to tobacco product promotion and sales on 11 sites that are popular with youth in May 2021: Discord, Facebook, Instagram, Pinterest, Reddit, Snapchat, TikTok, Tumblr, Twitch, Twitter and YouTube. Nine of the 11 sites prohibited paid advertising for tobacco products. However, only three of them clearly prohibited sponsored content (ie, social influencers) that promotes tobacco. Six platforms restricted content that sells tobacco products and three tried to prohibit underage access to content that promotes or sells tobacco products. Although most platform policies prohibited paid tobacco advertising, few addressed more novel strategies, such as sponsored/ influencer content and few had age-gating to prevent youth access. There is a pressing need to regulate tobacco promotion on social media platforms.",
        "DOI": "10.1136/tc-2022-057348",
        "paper_author": "Kong G.",
        "affiliation_name": "Yale School of Medicine",
        "affiliation_city": "New Haven",
        "affiliation_country": "United States",
        "affiliation_id": "60017994",
        "affiliation_state": "CT"
    },
    {
        "paper_title": "Do renewable energy, environmental regulations and green innovation matter for China's zero carbon transition: Evidence from green total factor productivity",
        "publication": "Journal of Environmental Management",
        "citied_by": "53",
        "cover_date": "2024-02-01",
        "Abstract": "Rapid developments in environmental infrastructure have contributed to significant improvements in green total factor productivity, but further investigation is required to provide a detailed assessment to understand the policy mechanisms involved. This paper analyzes environmental progress in China through MMQR, CCEMG, and AMG as empirical strategies for 30 provinces in China. Our empirical results reveal that energy optimization through renewable energy is the most effective channel to improve green total factor productivity, though it is not the only available option. Since environmental regulations, infrastructure development, and green technology innovation also directly impact energy efficiency, adopting these within policy channels will positively impact environmental sustainability. Our empirical approach helps suggest novel environmental policy suggestions. In particular, policymakers must introduce structural changes within energy developments to foster renewable energy. Furthermore, China must increase environmental spending to upgrade its energy infrastructure further and solve ecological issues. These insights offer valuable policy guidance for decision-makers in China and globally, aiming to foster economic and environmental sustainability and achieve zero-carbon transition goals.",
        "DOI": "10.1016/j.jenvman.2024.120030",
        "paper_author": "Jiang Y.",
        "affiliation_name": "Chengdu University of Technology",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60026846",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Effects of new urbanization on China's carbon emissions: A quasi-natural experiment based on the improved PSM-DID model",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "53",
        "cover_date": "2024-03-01",
        "Abstract": "Examining the influence mechanisms of new urbanization on urban carbon emissions is of great practical significance to guide cities' low-carbon and sustainable development and achieve China's “dual carbon” goal. To investigate the impact of the new urbanization policy on carbon emissions, this study conducted quasi-natural experiments on 19 urban agglomerations, including 115 cities in China, from 2011 to 2018. Based on the improved propensity score matching-difference-in-differences model, the study constructed an evaluation system based on the technique for order performance by similarity to an ideal solution or the TOPSIS-entropy method for analyzing the development status of new urbanization. Finally, the influence mechanisms and regional heterogeneity of multidimensional new urbanization development on carbon emissions were examined. The results were threefold. (1) The new urbanization policy significantly inhibits carbon emissions in the pilot cities. (2) The new urbanization policy affects urban carbon emissions through economic and population urbanization, which have an inverted U-shaped relationship with carbon emissions, and public service and environmental urbanization, which inhibit carbon emissions. (3) Regional heterogeneity exists among mechanisms. For relatively developed regions, the policy significantly affects carbon emission reduction. In rapidly developing regions, the policy implementation increases carbon emissions. The policy does not significantly impact carbon emissions in remote and underdeveloped regions. This study is a significant reference for formulating a carbon emissions reduction strategy according to local conditions.",
        "DOI": "10.1016/j.techfore.2023.123164",
        "paper_author": "Xu A.",
        "affiliation_name": "Zhejiang Gongshang University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60012581",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Setting safety standards: Regulation in the public and private sectors",
        "publication": "Setting Safety Standards: Regulation in the Public and Private Sectors",
        "citied_by": "52",
        "cover_date": "2024-06-21",
        "Abstract": "In this highly original and meticulously researched comparison of public and private standards-setting, Ross E. Cheit questions the old maxim that government-set safety standards are too severe while those set by the private sector are too lenient. Identifying the comparative institutional advantages of each arrangement through four paired case studies of grain elevators, woodstoves, aviation fire safety, and gas space heaters, he finds instead that some private standards are surprisingly strict, while government is better positioned to survey real-world experience and sponsor research likely to improve standards-setting. Setting Safety Standards challenges those political scientists who argue that only public institutions can advance the public interest in the controversial field of health and safety. Cheit draws attention to such little-known organizations as Underwriters Laboratories and the National Fire Protection Association, private-sector alternatives to the government regulation so frequently criticized as time-consuming, inflexible, and unreasonable. These organizations, he shows, play a far more significant role in regulation than most federal agencies, even though the standards they develop are widely-and often mistakenly-assumed to be less concerned with due process than government standards and often unduly lax. This study should be widely read by public policy and regulation experts in both the public and the private sectors as well as by academics in the field. This title is part of UC Press's Voices Revived program, which commemorates University of California Press's mission to seek out and cultivate the brightest minds and give them voice, reach, and impact. Drawing on a backlist dating to 1893, Voices Revived makes high-quality, peer-reviewed scholarship accessible once again using print-on-demand technology. This title was originally published in 1990.",
        "DOI": "NA",
        "paper_author": "Cheit R.E.",
        "affiliation_name": "Brown University",
        "affiliation_city": "Providence",
        "affiliation_country": "United States",
        "affiliation_id": "60011460",
        "affiliation_state": "RI"
    },
    {
        "paper_title": "The 2024 Europe report of the Lancet Countdown on health and climate change: unprecedented warming demands unprecedented action",
        "publication": "The Lancet Public Health",
        "citied_by": "51",
        "cover_date": "2024-07-01",
        "Abstract": "NA",
        "DOI": "10.1016/S2468-2667(24)00055-0",
        "paper_author": "van Daalen K.R.",
        "affiliation_name": "Centro Nacional de Supercomputación",
        "affiliation_city": "Barcelona",
        "affiliation_country": "Spain",
        "affiliation_id": "60097745",
        "affiliation_state": "Barcelona"
    },
    {
        "paper_title": "Exploring the impact of ChatGPT on education: A web mining and machine learning approach",
        "publication": "International Journal of Management Education",
        "citied_by": "51",
        "cover_date": "2024-03-01",
        "Abstract": "ChatGPT, an artificial intelligence model, has garnered significant interest within education. This study examined public sentiment regarding ChatGPT's influence on education by utilizing web mining and natural language processing (NLP) techniques. By adopting an empirical approach and leveraging machine learning models to process 2003 web articles, the study extracts valuable insights. The results indicate that ChatGPT has emerged as a crucial educational tool, offering advantages for both students and educators. Notably, the study emphasized ChatGPT's role in enhancing students' writing abilities and fostering dynamic, interactive learning environments. ChatGPT's capacity to address a broad spectrum of questions demonstrates its versatility and adaptability, contributing to more inclusive and personalized educational experiences. However, the study also uncovered challenges tied to academic integrity, such as plagiarism and cheating, which stem from incorporating AI-driven tools like ChatGPT into education. This raises concerns regarding ethical aspects, including responsible AI usage and data privacy, and highlights the need for institutions to develop guidelines and policies for AI tool implementation in education. This study's findings hold theoretical and practical implications for integrating ChatGPT into educational settings. It is the first to employ web mining and NLP techniques to analyze public opinions on ChatGPT's impact on education comprehensively.",
        "DOI": "10.1016/j.ijme.2024.100932",
        "paper_author": "Rejeb A.",
        "affiliation_name": "Széchenyi István University",
        "affiliation_city": "Gyor",
        "affiliation_country": "Hungary",
        "affiliation_id": "60016160",
        "affiliation_state": "Gyor-Moson-Sopron"
    },
    {
        "paper_title": "Inclusive green environment for all? An investigation of spatial access equity of urban green space and associated socioeconomic drivers in China",
        "publication": "Landscape and Urban Planning",
        "citied_by": "50",
        "cover_date": "2024-01-01",
        "Abstract": "The inequitable distribution of urban green spaces (UGS) has attracted increasing attention given the important role of green environments for sustainable development. However, many recent studies have yielded different results between cities in different geographic regions and development stages and even within the same city. Hence, this study addresses two research gaps in the green justice literature: (1) What are the spatial equity levels of different types of UGS, and what are their differences as well as spatial distribution characteristics? (2) What differences exist in the spatial equity levels of UGS in cities at various socioeconomic stages? On the basis of these gaps, we explain why contradictory findings have been found in the existing literature. This study focuses on three types of UGS in China, namely, community green spaces, street greenery, and public parks, and explores the driving effects of socioeconomic factors on the spatial equity of UGS in 263 Chinese cities. The results show that GDP and the population growth rate increase the spatial equity of community green spaces and street greenery. By contrast, economic development and increased in-migration can worsen the equity level of public green space accessibility. Our study provides evidence and insights for Chinese central and local governments to implement highly effective and sustainable greening programs to promote inclusive urban greening in Chinese cities.",
        "DOI": "10.1016/j.landurbplan.2023.104926",
        "paper_author": "LU Y.",
        "affiliation_name": "College of Computer Science and Technology, Zhejiang University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60117751",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Structural stigma and LGBTQ+ health: a narrative review of quantitative studies",
        "publication": "The Lancet Public Health",
        "citied_by": "48",
        "cover_date": "2024-02-01",
        "Abstract": "Health disparities related to sexual orientation and gender identity exist across multiple outcomes. Scholarship has begun to evaluate whether structural stigma—ie, societal-level conditions, cultural norms, and institutional policies that constrain opportunities, resources, and wellbeing—contributes to health burdens among LGBTQ+ individuals. We conducted a comprehensive review of quantitative studies examining this hypothesis. We found 98 articles that linked objective (ie, non-self-reported) measures of structural stigma to mental (n=57), behavioural (ie, substance use; n=27; HIV/AIDS or sexually transmitted infection; n=20), and physical (n=20) health outcomes. There was generally consistent evidence that structural stigma increases risk of poor health among LGBTQ+ individuals. Several methodological strengths were identified, including the use of multiple measures (eg, laws or policies [59%, 58 of 98]), designs (eg, quasi-experiments [21%, 21 of 98]), and samples (eg, probability-based [56%, 55 of 98]). However, important gaps exist. Just over half of studies included area-level covariates or non-LGBTQ+ comparison groups, which are necessary to address alternative explanations for the observed associations. Additionally, while studies (n=90) have begun to identify candidate mechanisms, only nine (10%) formally tested mediation. We offer suggestions for future research to advance this literature, which has implications not only for the identification of structural determinants of LGBTQ+ health but also for the development of public health interventions that reduce LGBTQ+ health disparities.",
        "DOI": "10.1016/S2468-2667(23)00312-2",
        "paper_author": "Hatzenbuehler M.L.",
        "affiliation_name": "Harvard Faculty of Arts and Sciences",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60006303",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Disrupting the Technology Innovation Efficiency of Manufacturing Enterprises Through Digital Technology Promotion: An Evidence of 5G Technology Construction in China",
        "publication": "IEEE Transactions on Engineering Management",
        "citied_by": "48",
        "cover_date": "2024-01-01",
        "Abstract": "Applying digital technology to help enterprises' innovation activities has become a trend in the context of global industrial digital transformation. Can 5G, an emerging digital technology, help manufacturing enterprises improve the efficiency of technological innovation? This article regards the 5G Technology Pilot Construction policy conducted in China in 2018 as an experiment and investigates how promoting and applying this new digital technology impacts the technology innovation efficiency of manufacturing enterprises. Our research finds that the promotion of 5G technology can significantly improve the technology innovation efficiency of manufacturing enterprises. In addition, the empowering effect of promoting 5G technology on the technology innovation efficiency of manufacturing enterprises is more prominent for cities with higher digital financial capabilities and enterprises with lower technology capabilities. These research findings have important policy implications and theoretical references for countries worldwide to widely promote the construction of 5G technology and combine different scenarios to promote the technology innovation efficiency of manufacturing enterprises.",
        "DOI": "10.1109/TEM.2023.3261940",
        "paper_author": "Jiang Z.",
        "affiliation_name": "Zhejiang Gongshang University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60012581",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Executive Cognitive Structure, Digital Policy, and Firms' Digital Transformation",
        "publication": "IEEE Transactions on Engineering Management",
        "citied_by": "48",
        "cover_date": "2024-01-01",
        "Abstract": "Executives play a key role in the digital transformation of enterprises. However, currently, few studies explore the impact of the executive cognitive structure on the digital transformation of enterprises. In this article, we reveal the relationships of the executive cognitive structure with the digital transformation of enterprises and the situational boundary from the perspectives of cognitive centrality and complexity. Relying on cognitive and institutional theory, we argue that both executive cognitive complexity and centrality facilitate corporate digital transformation. In addition, we also believe that the strong institutional pressure caused by digital policies has enhanced the roles of executive cognitive centrality and cognitive complexity in promoting the digital transformation of enterprises. Considering China's A-share automotive industry listed companies from 2014 to 2019 as the research object, we have obtained strong empirical evidence for our views. This article is the first to analyze the factors driving firms' digital transformation from the perspective of executive cognition.",
        "DOI": "10.1109/TEM.2022.3190889",
        "paper_author": "Zhu Z.",
        "affiliation_name": "South China University of Technology",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60024542",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Social network platforms and climate change in China: Evidence from TikTok",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "45",
        "cover_date": "2024-03-01",
        "Abstract": "The actions and policies enacted by today's youth hold profound implications for future generations, underscoring their pivotal role in advocating for climate issues. Younger cohorts exhibit heightened concern regarding climate change and are highly visible on social media platforms. Hence, this study aims to delineate the portrayal of climate-related news and disasters on TikTok. The research draws upon fifty TikTok accounts focused on climate-related content. Employing social network analysis, PageRank, and Superedge Rank methodologies, this investigation evaluates how TikTok users—called TikTokers—address climate change and its impact on social media. The assessment scrutinizes climate-related news, disasters, and the resultant networks to gauge the influence wielded by social influencers in disseminating messages. Results reveal that among the four key entities—internet influencers, government, scientists, and producers—internet influencers exert the most substantial influence on climate change news dissemination on TikTok, while the government plays an influential role in climate disasters. Like other social media platforms, TikTok is a valuable arena for gauging public sentiment on critical health concerns like global warming. Nonetheless, ensuring the reliability and depth of messages shared on TikTok necessitates the presence of credible experts who can deliver comprehensive and scientifically sound information within the platform's time constraints.",
        "DOI": "10.1016/j.techfore.2023.123197",
        "paper_author": "Sun Y.",
        "affiliation_name": "Tianjin University of Commerce",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60029368",
        "affiliation_state": "Tianjin"
    },
    {
        "paper_title": "Impact of energy poverty on public health: A non-linear study from an international perspective",
        "publication": "World Development",
        "citied_by": "45",
        "cover_date": "2024-02-01",
        "Abstract": "Research on energy poverty and its impact has been quite extensive, but the impact of such poverty on public health is still lacking. This paper thus presents the relationship between energy poverty and public health of 185 countries from 2000 to 2020 as well as the role of urbanization development levels in this nexus. To achieve this goal, this study uses a partial linear function coefficient (PLFC) method to analyze the relationship between them, which can also clearly exhibit the non-linear impact of energy poverty on public health. First, both linear and non-linear regression results show that energy poverty has significantly negative impacts on public health. Second, urbanization level plays a significant moderating effect in the energy poverty and public health nexus, meaning that energy poverty affects public health under the influence of urbanization. According to the PLFC model results, countries that exceed the threshold of urbanization have significantly reduced the adverse effects of energy poverty on public health. Third, this study investigates the heterogeneous impact of energy poverty across different regions, comparing the Sub-Saharan Africa region with other areas. The results reveal in the Sub-Saharan Africa region that affordable energy under the influence of urbanization provides a new pathway for improving public health in that region, whereas this effect is considerably smaller in other regions. Additionally, a series of tests confirm the robustness of the results. This paper offers a reference for the development and implementation of renewable energy-related public health policies.",
        "DOI": "10.1016/j.worlddev.2023.106444",
        "paper_author": "Lee C.C.",
        "affiliation_name": "Nanchang University",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60008332",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "Does smart city pilot improve urban green economic efficiency: Accelerator or inhibitor",
        "publication": "Environmental Impact Assessment Review",
        "citied_by": "45",
        "cover_date": "2024-01-01",
        "Abstract": "Improving urban green economic efficiency is a necessary response to environmental constraints and the transformation of economic development mode, and how to improve green economic efficiency through smart city pilot has become an important consideration. In this study, we construct the Date Envelopment Analysis-Slack Based Model to measure the green economic efficiency, and further evaluate the impacts of smart city on green economic efficiency using the propensity score matching-Differences-in-Differences (PSM-DID) model. The mainly results are as follows. The urban green economic efficiency can be improved by smart city pilot, and be improved by smart city through technology effect, structure effect and energy effect. Smart city with the dual attributes, information technology and environmental regulation, acts as a role of accelerator that both promote economic efficiency and environment, and thus accelerates the improvement of green economic efficiency. Smart city plays a significant role in cities with high level of talent aggregation and financial development, low level of population density, network infrastructure and urban expansion. The results of this paper provide the policy implications for the construction of smart city and sustainable development.",
        "DOI": "10.1016/j.eiar.2023.107328",
        "paper_author": "Chen Y.",
        "affiliation_name": "Zhejiang Normal University",
        "affiliation_city": "Jinhua",
        "affiliation_country": "China",
        "affiliation_id": "60003078",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Integration of carbon emission reduction policies and technologies: Research progress on carbon capture, utilization and storage technologies",
        "publication": "Separation and Purification Technology",
        "citied_by": "44",
        "cover_date": "2024-09-06",
        "Abstract": "Since the industrial revolution, the greenhouse effect has become more and more serious, causing great impacts on human beings and society. Many countries have formulated carbon neutrality and introduced a series of emission reduction measures. This paper summarizes and evaluates for the first time three universally appropriate carbon reduction measures: energy upgrading, biotechnology, and carbon capture, utilization and storage (CCUS) technology in conjunction with the policies of each country. The choice of carbon reduction methods depends on the economic situation and natural resources of each country. For example, the Middle East is more in need of energy upgrades, South America is focused on biotechnology, and Western Europe is currently more suited to CCUS technology. This paper also predicts the carbon reduction capacity and capital consumption of 10 carbon reduction methods based on International Energy Agency (IEA) data and the current development of emission reduction technologies. This can provide a reference for countries to choose appropriate carbon reduction methods. Meanwhile, this paper comprehensively reviews the principles of CCUS technology, including the current progress, problems, and prospects for application. The CCUS technology plays a significant role in promoting the transformation of the energy structure and responding to global climate change. Promoting the rapid development and wide application of CCUS technology requires the joint efforts of governments, enterprises and the public: government policy, enterprise investment and public support. This paper can provide references for countries to select appropriate carbon reduction methods and guidance for researchers to further improve the effect of CCUS.",
        "DOI": "10.1016/j.seppur.2024.127153",
        "paper_author": "Chu H.",
        "affiliation_name": "Anhui University of Technology",
        "affiliation_city": "Maanshan",
        "affiliation_country": "China",
        "affiliation_id": "60008060",
        "affiliation_state": "Anhui"
    },
    {
        "paper_title": "Chagas disease",
        "publication": "The Lancet",
        "citied_by": "44",
        "cover_date": "2024-01-13",
        "Abstract": "Chagas disease persists as a global public health problem due to the high morbidity and mortality burden. Despite the possibility of a cure and advances in transmission control, epidemiological transformations, such as urbanisation and globalisation, and the emerging importance of oral and vertical transmission mean that Chagas disease should be considered an emerging disease, with new cases occurring worldwide. Important barriers to diagnosis, treatment, and care remain, resulting in repressed numbers of reported cases, which in turn leads to inadequate public policies. The validation of new diagnostic tools and treatment options is needed, as existing tools pose serious limitations to access to health care. Integrated models of surveillance, with community and intersectional participation, embedded in the concept of One Health, are essential for control. In addition, mitigation strategies for the main social determinants of health, including difficulties imposed by migration, are important to improve access to comprehensive health care in a globalised scenario.",
        "DOI": "10.1016/S0140-6736(23)01787-7",
        "paper_author": "de Sousa A.S.",
        "affiliation_name": "Instituto Nacional de Infectologia Evandro Chagas (INI)",
        "affiliation_city": "Rio de Janeiro",
        "affiliation_country": "Brazil",
        "affiliation_id": "60023997",
        "affiliation_state": "RJ"
    },
    {
        "paper_title": "Economic, social, and regulatory challenges of green hydrogen production and utilization in the US: A review",
        "publication": "International Journal of Hydrogen Energy",
        "citied_by": "43",
        "cover_date": "2024-01-02",
        "Abstract": "Green Hydrogen (GH) is increasingly recognized as a viable solution in the United States (US) for meeting energy demands, achieving net zero emissions by 2050, and mitigating the intermittent nature of renewable sources such as wind and solar. This review paper identifies and examines three crucial research areas concerning GH. Despite significant federal, state, and business investment in the development of hydrogen technology, numerous questions have remained unanswered including economic viability, social acceptance, and policies and regulations. In comparison to the US, Europe, and Asia have taken a lead role in studying the social and regulatory aspects of GH. The study shows limited focus on social acceptance, and the absence of dedicated policies and regulations for hydrogen. The US lacks coordinated policies for GH and is blended with natural gas. The literature shows that the relationship between economics, social sciences, and policies and regulations are intrinsic. The success of GH in the US will require massive investments, public and private collaboration, research on social sciences, and regulatory support. Hence, the GH rollout will bridge the energy transition, and climate and development targets which guide future industrial, government and public decisions.",
        "DOI": "10.1016/j.ijhydene.2023.08.157",
        "paper_author": "Bade S.O.",
        "affiliation_name": "University of North Dakota",
        "affiliation_city": "Grand Forks",
        "affiliation_country": "United States",
        "affiliation_id": "60026161",
        "affiliation_state": "ND"
    },
    {
        "paper_title": "Transportation infrastructure upgrading and green development efficiency: Empirical analysis with double machine learning method",
        "publication": "Journal of Environmental Management",
        "citied_by": "42",
        "cover_date": "2024-05-01",
        "Abstract": "In order to deal with the environmental problems such as pollution emissions and climate change, sustainable development in the field of transportation has gradually become a hot topic to all sectors of society. In addition, promoting the green and low-carbon transformation of China's transportation is also an important issue in the new era. Thus, it is particularly important to correctly identify the green effect of high-speed rail. However, the traditional causal reasoning model faces several challenges such as ‘dimensional curse’ and multicollinearity. Based on the panel data of 283 prefecture-level cities in China from 2003 to 2019, this study uses the double machine learning model to explore the impact of transportation infrastructure upgrading on the efficiency of urban green development in China. The research shows that the upgrading of transportation infrastructure can effectively improve the efficiency of urban green development by 4%. Service industry agglomeration and green innovation are verified as two mediating channels. Moreover, the synthetic difference in difference model is employed to evaluate the regional impact of high-speed rail, and finds that the regional impact of transportation policies often exceeds the impact of individual cities. We further apply the conclusions of this paper to the research at the micro enterprise level. Goodman-Bacon decomposition and a variety of robustness tests confirm the validity of our conclusions. The study's comprehensive empirical analysis not only validates the positive effects of transportation upgrades on green development, but also offers novel insights into the underlying mechanisms and policy implications of transportation upgrading.",
        "DOI": "10.1016/j.jenvman.2024.120922",
        "paper_author": "Ling S.",
        "affiliation_name": "Tianjin University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60019533",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Policy uncertainty, renewable energy, corruption and CO<inf>2</inf> emissions nexus in BRICS-1 countries: a panel CS-ARDL approach",
        "publication": "Environment, Development and Sustainability",
        "citied_by": "42",
        "cover_date": "2024-08-01",
        "Abstract": "Due to the ecological impacts of fossil energy, renewable energy has become crucial for inclusion in the energy supply to realize a sustainable environment, enhance public welfare, and combat global climate change. However, the transition to renewable energy and eco-sustainability is hampered by certain factors, such as uncertainties in economic policies and corruption. To this end, this study delves into the effects of renewable energy, policy uncertainty, and corruption on CO2 emissions for a panel comprising Brazil, Russia, India, and China (BRICS-1) regulating the environment Kuznets growth curve (EKGC) hypothesis for a period 1990–2020. The unique panel cross-sectional augmented ARDL (CS-ARDL) approach was used in the study, which addresses the constraints of standard procedures by integrating cross-sectional dependence heterogeneity and endogeneity. The findings demonstrated that renewable energy consumption and corruption control contribute to long-term emissions reductions; however, policy uncertainty threatens environmental sustainability. In addition, BRICS-1 nations can benefit from the EKGC theory. The study offers significant ramifications for reducing pollution and suggests that policymakers establish sustainable measures to reduce policy uncertainties, control corruption, and enact environmental regulations that foster a safer environment for all citizens.",
        "DOI": "10.1007/s10668-023-03546-w",
        "paper_author": "Sadiq M.",
        "affiliation_name": "Central South University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60017060",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "Do natural resources impact economic growth: An investigation of P5 + 1 countries under sustainable management",
        "publication": "Geoscience Frontiers",
        "citied_by": "42",
        "cover_date": "2024-05-01",
        "Abstract": "Natural resources represent the base of our living and the entire economic activity. Their depletion is a major challenge for the economic development of both developed and developing economies. Their efficient use is an indispensable requirement and must be the aim of the public policies designed by the authorities worldwide. In this research, we have investigated the impact of the natural resources rent on the economic growth in some major wealthy economies of the world (P5 + 1 countries namely: US, UK, France, China, Russia, and Germany). We have applied a quantile-on-quantile regression to analyse this impact on different quantiles and a cross-sectional autoregressive distributed lag (CS-ARDL) approach for the panel of these six countries. The Dumitrescu-Hurlin panel causality test was also used to check the causality between natural resource rents and economic growth in these countries. Results show a negative relationship between natural resources rent and economic growth for the panel but a different impact on quantiles in each country. Only for China and the US, a positive effect can be noticed for both lower and higher quantiles of natural resources and economic growth. The Dumitrescu-Hurlin causality test shows that natural resources can predict economic growth only in China, the U.S., and the panel. In contrast, no causality was found for the other four countries included in the panel. We suggest that nations invest in wind and solar projects, use biofuels and nuclear energy, introduce a temporary profit tax to protect consumers from escalating energy prices, and increase energy efficiency in buildings and industry. Businesses would benefit from a regulatory framework that is uniform and exhaustive, as well as easier to traverse and more receptive to innovation and creativity. Public-private partnership investments in innovation, innovation incentives, and environmental sector opportunities may foster long-term economic growth.",
        "DOI": "10.1016/j.gsf.2023.101595",
        "paper_author": "Singh S.",
        "affiliation_name": "Chandigarh University",
        "affiliation_city": "Mohali",
        "affiliation_country": "India",
        "affiliation_id": "60111704",
        "affiliation_state": "PB"
    },
    {
        "paper_title": "Towards a carbon-neutral community: Integrated renewable energy systems (IRES)–sources, storage, optimization, challenges, strategies and opportunities",
        "publication": "Journal of Energy Storage",
        "citied_by": "41",
        "cover_date": "2024-04-01",
        "Abstract": "The depletion of fossil fuels and the impacts of climate deterioration present significant challenges to achieving sustainable development goals. Developed nations worldwide are actively transitioning their energy mix to address these challenges. One promising solution is integrated renewable energy systems (IRES), which offer low-emission energy supply systems and proximity to end consumers. Compared to traditional or single-source energy supply systems, IRES have potential to reduce carbon emissions by 10 % to 50 % and can achieve a substantial 42 % reduction in operating costs. Furthermore, energy storage technologies effectively address energy supply intermittency issues, leading to additional reductions in operating costs and the carbon footprint. This comprehensive review examines renewable energy sources (RES), energy storage technologies, and system optimization methods that pertain to IRES. It highlights the significant potential of IRES in energy conservation and emissions reduction. This study identifies the challenges such as government policies, renewable energy (RE) instability, energy storage technologies, and public acceptance, and proposes strategies for overcoming these obstacles from three perspectives of the government, researchers, and the public. Importantly, the review emphasizes potential breakthroughs for future IRES development, including artificial intelligence, battery pollution, phase change energy storage, and building lifecycle emission reduction, providing actionable avenues for advancing IRES development. The study concludes that with concerted efforts in policy and technological innovation, IRES can not only meet but potentially exceed future energy demands.",
        "DOI": "10.1016/j.est.2024.110663",
        "paper_author": "Zhu Y.",
        "affiliation_name": "Harbin Institute of Technology",
        "affiliation_city": "Harbin",
        "affiliation_country": "China",
        "affiliation_id": "60019616",
        "affiliation_state": "Heilongjiang"
    },
    {
        "paper_title": "Reassessing the role of urban green space in air pollution control",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "41",
        "cover_date": "2024-01-01",
        "Abstract": "The assumption that vegetation improves air quality is prevalent in scientific, popular, and political discourse. However, experimental and modeling studies show the effect of green space on air pollutant concentrations in urban settings is highly variable and context specific. We revisited the link between vegetation and air quality using satellite-derived changes of urban green space and air pollutant concentrations from 2,615 established monitoring stations over Europe and the United States. Between 2010 and 2019, stations recorded declines in ambient NO2, (particulate matter) PM10, and PM2.5(average of -3.14% y-1), but not O3(+0.5% y-1), pointing to the general success of recent policy interventions to restrict anthropogenic emissions. The effect size of total green space on air pollution was weak and highly variable, particularly at the street scale (15 to 60 m radius) where vegetation can restrict ventilation. However, when isolating changes in tree cover, we found a negative association with air pollution at borough to city scales (120 to 16,000 m) particularly for O3and PM. The effect of green space was smaller than the pollutant deposition and dispersion effects of meteorological drivers including precipitation, humidity, and wind speed. When averaged across spatial scales, a one SD increase in green space resulted in a 0.8% (95% CI: -3.5 to 2%) decline in air pollution. Our findings suggest that while urban greening may improve air quality at the borough-to-city scale, the impact is moderate and may have detrimental street-level effects depending on aerodynamic factors like vegetation type and urban form.",
        "DOI": "10.1073/pnas.2306200121",
        "paper_author": "Venter Z.S.",
        "affiliation_name": "Trondheim hovedkontor",
        "affiliation_city": "Trondheim",
        "affiliation_country": "Norway",
        "affiliation_id": "60020071",
        "affiliation_state": "Sor-Trondelag"
    },
    {
        "paper_title": "Endocrine disruptors: Unravelling the link between chemical exposure and Women's reproductive health",
        "publication": "Environmental Research",
        "citied_by": "41",
        "cover_date": "2024-01-15",
        "Abstract": "An Endocrine Disrupting Chemical (EDC) is any compound that disrupts the function of the endocrine system in humans and is ubiquitous in the environment either as a result of natural events or through anthropogenic activities. Bisphenol A, phthalates, parabens, pesticides, triclosan, polychlorinated biphenyls, and heavy metals, which are frequently found in the pharmaceutical, cosmetic, and packaging sectors, are some of the major sources of EDC pollutants. EDCs have been identified to have a deteriorating effect on the female reproductive system, as evidenced by the increasing number of reproductive disorders such as endometriosis, uterine fibroids, polycystic ovary syndrome, premature ovarian failure, menstrual irregularity, menarche, and infertility. Studying EDCs in relation to women's health is essential for understanding the complex interactions between environmental factors and health outcomes. It enables the development of strategies to mitigate risks, protect reproductive and overall health, and inform public policy decisions to safeguard women's well-being. Healthcare professionals must know the possible dangers of EDC exposure and ask about environmental exposures while evaluating patients. This may result in more precise diagnosis and personalized treatment regimens. This review summarises the existing understanding of prevalent EDCs that impact women's health and involvement in female reproductive dysfunction and underscores the need for more research. Further insights on potential mechanisms of action of EDCs on female has been emphasized in the article. We also discuss the role of nutritional intervention in reducing the effect of EDCs on women's reproductive health. EDC pollution can be further reduced by adhering to strict regulations prohibiting the release of estrogenic substances into the environment.",
        "DOI": "10.1016/j.envres.2023.117385",
        "paper_author": "Hassan S.",
        "affiliation_name": "Sathyabama Institute of Science and Technology",
        "affiliation_city": "Chennai",
        "affiliation_country": "India",
        "affiliation_id": "60023330",
        "affiliation_state": "TN"
    },
    {
        "paper_title": "Effect of green bonds, oil prices, and COVID-19 on industrial CO<inf>2</inf> emissions in the USA: Evidence from novel wavelet local multiple correlation approach",
        "publication": "Energy and Environment",
        "citied_by": "41",
        "cover_date": "2024-09-01",
        "Abstract": "This study explores the effect of green bonds, oil prices, and the coronavirus disease 2019 (COVID-19) pandemic on industrial carbon dioxide (CO2) emissions. In this context, this study examines the United States of America (USA), which is the biggest economy in the world, uses weekly data between March 6, 2020 and September 30, 2022, and applies a novel wavelet local multiple correlation (WLMC) approach under time-varying and frequency-varying perspective. The novel empirical findings shows that (i) there is a strong negative (positive) co-movement between industrial CO2 emissions and green bonds in the short-run (long-run); (ii) there is a strong positive (negative) co-movement between industrial CO2 emissions and oil price in the medium-run (long-run); (iii) there is a strong negative (positive) co-movement between industrial CO2 emissions and the COVID-19 pandemic in the medium-run (long-run); (iv) the oil price is the dominant factor, whereas there are changing effect of the variables on each other at different times and frequencies; and (vi) overall, there are long-run asymmetric and dynamic correlations between industrial CO2 emissions and variables. Hence, the empirical results highlight the asymmetric, time-varying, and frequency-varying effects of green bonds, oil prices, and the COVID-19 pandemic on industrial CO2 emissions by presenting fresh and novel evidence. Moreover, the study proposes policy implications for the USA government.",
        "DOI": "10.1177/0958305X231167463",
        "paper_author": "Adebayo T.S.",
        "affiliation_name": "Uluslararası Kıbrıs Üniversitesi",
        "affiliation_city": "Nicosia",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60104395",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Mental health among the general population and healthcare workers during the COVID-19 pandemic: A meta-analysis of well-being and psychological distress prevalence",
        "publication": "Current Psychology",
        "citied_by": "41",
        "cover_date": "2024-03-01",
        "Abstract": "The COVID-19 pandemic has constituted a global health crisis that has threatened the mental health of individuals worldwide. The present paper sought to systematically review and meta-analyze studies reporting the prevalence during the COVID-19 pandemic of well-being and psychological distress as defined by the dual-continua model, which includes (absence of) psychological distress and (presence of) well-being among the general population and healthcare workers. Systematic searches were conducted in various databases: PubMed, PsycINFO, Scopus, and Web of Science from inception until 6 December 2020. From a total of 158 studies (N = 880,352) included in the meta-analysis, only seven reported the prevalence of well-being. A random-effect model was used to estimate the pooled prevalence among the general population and healthcare workers on depression (25%; 31%), anxiety (27%; 31%), stress (35%; 32%), and well-being (52%; 45%), respectively. Sub-group analyses based on region, income, percentage of women, preparedness of country to respond to COVID-19, and economic vulnerabilities were conducted in order to examine sources of heterogeneity in psychological distress. Results revealed differences among the two groups and indicated that disparities in terms of preparedness to fight the pandemic can distinctly affect mental health in the general population and healthcare workers. Addressing mental health during and after a health crisis should be in the spotlight of the international and national public health agenda. Considering the protective role of well-being to minimize psychological symptoms, mental health policies during the COVID-19 should include strategies to combat the psychological consequences of the pandemic by promoting well-being practices.",
        "DOI": "10.1007/s12144-022-02913-6",
        "paper_author": "Blasco-Belled A.",
        "affiliation_name": "Universitat de Girona",
        "affiliation_city": "Girona",
        "affiliation_country": "Spain",
        "affiliation_id": "60009952",
        "affiliation_state": "Girona"
    },
    {
        "paper_title": "Urban climate adaptability and green total-factor productivity: Evidence from double dual machine learning and differences-in-differences techniques",
        "publication": "Journal of Environmental Management",
        "citied_by": "40",
        "cover_date": "2024-01-15",
        "Abstract": "Climate change has increasingly become a significant challenge to sustainable socio-economic development, and climate adaptation is a key issue that relevant research focuses on regional sustainable development models. By employing panel data between 2007 and 2020 from 284 Chinese prefecture-level cities, this study adopts quasi-experimental methods, including a difference-in-differences design and double dual machine learning model, to study the impact of climate adaptability on green regional sustainable development. Empirical results confirm that the pilot policy of building climate-resilient cities significantly improves urban green total-factor productivity. Difference-in-difference models (derived from entropy-weight and propensity score matching) and double dual learning models also support the improving effect of regional green total-factor productivity after policy intervention. The digital economy has strengthened the green development effect of pilot policies for building climate-adaptive cities. In addition, policy interventions to build climate-adaptive cities promote green urban development by optimizing industrial development structures and enhancing economic growth resilience. In addition, climate adaptability can also attract highly skilled talent and high-quality enterprises, facilitate science and technological progress in urban areas, and thus promoting the green development of cities in China. This study objectively evaluates the effects of climate policies and provides insights for global adaptation to climate change and optimization of public policies.",
        "DOI": "10.1016/j.jenvman.2023.119588",
        "paper_author": "Wen H.",
        "affiliation_name": "Nanchang University",
        "affiliation_city": "Nanchang",
        "affiliation_country": "China",
        "affiliation_id": "60008332",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "Investigating the asymmetric effects of renewable energy-carbon neutrality nexus: Can technological innovation, trade openness, and transport services deliver the target for Germany?",
        "publication": "Energy and Environment",
        "citied_by": "40",
        "cover_date": "2024-02-01",
        "Abstract": "The present millennium records the most devastating effects of global warming than what was evident in the pre-industrial era. The pervasive effects of global warming have raised concerns about the sustainability of the present and future generations. Hence, researchers are working assiduously towards proffering the most effective method of halting the surging emissions from global, regional, and national angles. This study contributes to the extant literature by providing the first empirical verification of how renewable energy, technological innovations, trade openness, and transport services impact carbon emissions in Germany. The empirical evidence is anchored on annual time series data from 1990 to 2020 estimated using the novel nonlinear ARDL to explore the positive and negative shocks associated with the short and long-run nexus. The wavelet coherence estimator is equally for ascertaining the multiple time scales in the time series and extends the knowledge frontier to the literature. The following findings are eminent from the overall analyses. First, long-run cointegration is supported among the variables of interest Second, only the adverse effects of renewable energy and technology are substantial enough to mitigate carbon emissions. The trade-induced emissions are established with the positive impacts of trade openness on carbon emissions. Transport services contribute significantly to carbon emissions in the long-run and short-run periods. However, mitigating effects of small magnitude are apparent in the long-run due to the perceived transition to green transportation. Policy implications supporting the transition to 100% renewable energy and green transportation are significant steps towards achieving Germany's carbon neutrality target.",
        "DOI": "10.1177/0958305X221127020",
        "paper_author": "Ibrahim R.L.",
        "affiliation_name": "University of Lagos",
        "affiliation_city": "Lagos",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60006448",
        "affiliation_state": "Lagos"
    },
    {
        "paper_title": "THE ECONOMIC IMPACTS OF COVID-19: EVIDENCE FROM A NEW PUBLIC DATABASE BUILT USING PRIVATE SECTOR DATA*",
        "publication": "Quarterly Journal of Economics",
        "citied_by": "39",
        "cover_date": "2024-05-01",
        "Abstract": "*We thank the corporate partners who provided the underlying data used to construct the public database built in this article: Affinity Solutions (especially Atul Chadha and Arun Rajagopal), Lightcast (Anton Libsch and Bledi Taska), CoinOut (Jeff Witten), Earnin (Arun Natesan and Ram Palaniappan), Homebase (Ray Sandza and Andrew Vogeley), Intuit (Christina Foo and Krithika Swaminathan), Kronos (David Gilbertson), Paychex (Mike Nichols and Shadi Sifain), Womply (Derek Doel and Ryan Thorpe), and Zearn (Billy McRae and Shalinee Sharma). We are very grateful to Nathaniel Hendren, who collaborated with us to launch the initial version of the database and helped conduct preliminary analyses for the first draft of this article in spring 2020. We are also grateful to Ryan Rippel of the Gates Foundation for his support in launching this project and to Gregory Bruich for early conversations that helped spark this work. We thank David Autor, Gabriel Chodorow-Reich, Haley O’Donnell, Emmanuel Farhi, Jason Furman, Steven Hamilton, Erik Hurst, Xavier Jaravel, Lawrence Katz, Fabian Lange, Emmanuel Saez, Ludwig Straub, Danny Yagan, and numerous seminar participants for helpful comments. The work was funded by the Chan-Zuckerberg Initiative, Bill & Melinda Gates Foundation, Overdeck Family Foundation, Andrew and Melora Balson, Harvard University, Brown University, JPB Foundation, Smith Richardson Foundation, and the University of Toronto. The project was approved under Harvard University IRB 20-0586. The Opportunity Insights Economic Tracker Team as of July 2023 has consisted of Hamidah Alatas, Camille Baker, Harvey Barnhard, Matt Bell, Gregory Bruich, Tina Chelidze, Lucas Chu, Westley Cineus, Sebi Devlin-Foltz, Michael Droste, Dhruv Gaur, Federico Gonzalez, Rayshauna Gray, Abigail Hiller, Matthew Jacob, Tyler Jacobson, Margaret Kallus, Fiona Kastel, Laura Kincaide, Caitlin Kupsc, Sarah LaBauve, Lucía Lamas, Maddie Marino, Kai Matheson, Jared Miller, Christian Mott, Kate Musen, Danny Onorato, Sarah Oppenheimer, Trina Ott, Lynn Overmann, Max Pienkny, Jeremiah Prince, Sebastian Puerta, Daniel Reuter, Peter Ruhm, Tom Rutter, Emanuel Schertz, Shannon Felton Spence, Krista Stapleford, Kamelia Stavreva, Ceci Steyn, James Stratton, Clare Suter, Elizabeth Thach, Nicolaj Thor, Amanda Wahlers, Kristen Watkins, Alanna Williams, David Williams, Chase Williamson, Shady Yassin, Ruby Zhang, and Austin Zheng. We build a publicly available database that tracks economic activity in the United States at a granular level in real time using anonymized data from private companies. We report weekly statistics on consumer spending, business revenues, job postings, and employment rates disaggregated by county, sector, and income group. Using the publicly available data, we show how the COVID-19 pandemic affected the economy by analyzing heterogeneity in its effects across subgroups. High-income individuals reduced spending sharply in March 2020, particularly in sectors that require in-person interaction. This reduction in spending greatly reduced the revenues of small businesses in affluent, dense areas. Those businesses laid off many of their employees, leading to widespread job losses, especially among low-wage workers in such areas. High-wage workers experienced a V-shaped recession that lasted a few weeks, whereas low-wage workers experienced much larger, more persistent job losses. Even though consumer spending and job postings had recovered fully by December 2021, employment rates in low-wage jobs remained depressed in areas that were initially hard hit, indicating that the temporary fall in labor demand led to a persistent reduction in labor supply. Building on this diagnostic analysis, we evaluate the effects of fiscal stimulus policies designed to stem the downward spiral in economic activity. Cash stimulus payments led to sharp increases in spending early in the pandemic, but much smaller responses later in the pandemic, especially for high-income households. Real-time estimates of marginal propensities to consume provided better forecasts of the impacts of subsequent rounds of stimulus payments than historical estimates. Overall, our findings suggest that fiscal policies can stem secondary declines in consumer spending and job losses, but cannot restore full employment when the initial shock to consumer spending arises from health concerns. More broadly, our analysis demonstrates how public statistics constructed from private sector data can support many research and real-time policy analyses, providing a new tool for empirical macroeconomics. JEL codes: E01, E32.",
        "DOI": "10.1093/qje/qjad048",
        "paper_author": "Chetty R.",
        "affiliation_name": "Harvard University",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United States",
        "affiliation_id": "60009982",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Deaths from Excessive Alcohol Use - United States, 2016–2021",
        "publication": "Morbidity and Mortality Weekly Report",
        "citied_by": "39",
        "cover_date": "2024-02-29",
        "Abstract": "Deaths from causes fully attributable to alcohol use have increased during the past 2 decades in the United States, particularly from 2019 to 2020, concurrent with the onset of the COVID-19 pandemic. However, previous studies of trends have not assessed underlying causes of deaths that are partially attributable to alcohol use, such as injuries or certain types of cancer. CDC’s Alcohol-Related Disease Impact application was used to estimate the average annual number and age-standardized rate of deaths from excessive alcohol use in the United States based on 58 alcohol-related causes of death during three periods (2016–2017, 2018–2019, and 2020–2021). Average annual number of deaths from excessive alcohol use increased 29.3%, from 137,927 during 2016–2017 to 178,307 during 2020–2021; age-standardized alcohol-related death rates increased from 38.1 to 47.6 per 100,000 population. During this time, deaths from excessive alcohol use among males increased 26.8%, from 94,362 per year to 119,606, and among females increased 34.7%, from 43,565 per year to 58,701. Implementation of evidence-based policies that reduce the availability and accessibility of alcohol and increase its price (e.g., policies that reduce the number and concentration of places selling alcohol and increase alcohol taxes) could reduce excessive alcohol use and alcohol-related deaths.",
        "DOI": "10.15585/mmwr.mm7308a1",
        "paper_author": "Esser M.B.",
        "affiliation_name": "National Center for Chronic Disease Prevention and Health Promotion",
        "affiliation_city": "Atlanta",
        "affiliation_country": "United States",
        "affiliation_id": "60030966",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Public environmental concern, government environmental regulation and urban carbon emission reduction—Analyzing the regulating role of green finance and industrial agglomeration",
        "publication": "Science of the Total Environment",
        "citied_by": "38",
        "cover_date": "2024-05-10",
        "Abstract": "In the multifaceted realm of environmental governance, emphasizing public environmental participation as an informal regulatory mechanism, alongside the influence of formal governmental environmental regulation on regional carbon emissions, contributes to providing empirical evidence and policy insights for China's “dual‑carbon target” action plan. Using data from 282 prefecture-level cities in China from 2011 to 2020, this research develops an analytical framework for urban carbon emissions encompassing public environmental concern, environmental regulation, green finance, and industrial agglomeration. And through an amalgamation of theoretical insights and empirical validation, the study elucidates the mechanisms by which public environmental concern impact urban carbon emissions. It further delves into the mediating role of environmental regulation and the moderating effects of green finance and industrial agglomeration. It reveals that: (1) Public environmental concern significantly reduces urban carbon emissions, particularly in northern cities, non-environmental protection key cities, and resource regeneration cities. And this suppressive influence is markedly more potent via mobile platforms compared to PC channels; (2) Environmental regulation serves as a partially mediating role between public environmental concern and urban carbon emissions, suggesting that public environmental concern reduces emissions by amplifying governmental environmental oversight; (3) Both green finance and industrial agglomeration play a positive moderating role on the effect of public environmental concern in reducing urban carbon emissions.",
        "DOI": "10.1016/j.scitotenv.2024.171549",
        "paper_author": "Wang Y.",
        "affiliation_name": "Chongqing Normal University",
        "affiliation_city": "Chongqing",
        "affiliation_country": "China",
        "affiliation_id": "60010752",
        "affiliation_state": "Chongqing"
    },
    {
        "paper_title": "US Obstetrician-Gynecologists' Perceived Impacts of Post- Dobbs v Jackson State Abortion Bans",
        "publication": "JAMA Network Open",
        "citied_by": "38",
        "cover_date": "2024-01-17",
        "Abstract": "Importance: Following the Dobbs v Jackson Women's Health Organization decision in June 2022, 17 US states have functionally banned abortion except in narrow circumstances, and physicians found in violation of these laws face felony charges, loss of their medical license, fines, and prison sentences. Patient impacts are being studied closely, but less research has focused on the consequences for obstetrician-gynecologists (OB-GYNs), for whom medically necessary care provision may now carry serious personal and professional consequences. Objective: To characterize perceptions of the impact of abortion restrictions on clinical practice, moral distress, mental health, and turnover intention among US OB-GYNs practicing in states with functional bans on abortion. Design, Setting, and Participants: This qualitative study included semistructured, remote interviews with OB-GYNs from 13 US states with abortion bans. Volunteer sample of 54 OB-GYNs practicing in states that had banned abortion as of March 2023. Exposure: State abortion bans enacted between June 2022 and March 2023. Main Outcomes and Measures: OB-GYNs' perceptions of clinical and personal impacts of abortion bans. Results: This study included 54 OB-GYNs (mean [SD] age, 42 [7] years; 44 [81%] female participants; 3 [6%] non-Hispanic Black or African American participants; 45 [83%] White participants) who practiced in general obstetrics and gynecology (39 [72%]), maternal-fetal medicine (7 [13%]), and complex family planning (8 [15%]). Two major domains were identified in which the laws affected OB-GYNs: (1) clinical impacts (eg, delays in care until patients became more sick or legal sign-off on a medical exception to the ban was obtained; restrictions on counseling patients on pregnancy options; inability to provide appropriate care oneself or make referrals for such care); and (2) personal impacts (eg, moral distress; fears and perceived consequences of law violation; intention to leave the state; symptoms of depression and anxiety). Conclusions and relevance: In this qualitative study of OB-GYNs practicing under abortion bans, participants reported deep and pervasive impacts of state laws, with implications for workforce sustainability, physician health, and patient outcomes. In the context of public policies that restrict physicians' clinical autonomy, organization-level supports for physicians are essential to maintain workforce sustainability, clinician health and well-being, and availability of timely and accessible health care throughout the US.",
        "DOI": "10.1001/jamanetworkopen.2023.52109",
        "paper_author": "Sabbath E.L.",
        "affiliation_name": "Boston College",
        "affiliation_city": "Chestnut Hill",
        "affiliation_country": "United States",
        "affiliation_id": "60031117",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Declining global fertility rates and the implications for family planning and family building: an IFFS consensus document based on a narrative review of the literature",
        "publication": "Human Reproduction Update",
        "citied_by": "37",
        "cover_date": "2024-03-01",
        "Abstract": "BACKGROUND: Family-planning policies have focused on contraceptive approaches to avoid unintended pregnancies, postpone, or terminate pregnancies and mitigate population growth. These policies have contributed to significantly slowing world population growth. Presently, half the countries worldwide exhibit a fertility rate below replacement level. Not including the effects of migration, many countries are predicted to have a population decline of >50% from 2017 to 2100, causing demographic changes with profound societal implications. Policies that optimize chances to have a child when desired increase fertility rates and are gaining interest as a family-building method. Increasingly, countries have implemented child-friendly policies (mainly financial incentives in addition to public funding of fertility treatment in a limited number of countries) to mitigate decreasing national populations. However, the extent of public spending on child benefits varies greatly from country to country. To our knowledge, this International Federation of Fertility Societies (IFFS) consensus document represents the first attempt to describe major disparities in access to fertility care in the context of the global trend of decreasing growth in the world population, based on a narrative review of the existing literature. OBJECTIVE AND RATIONALE: The concept of family building, the process by which individuals or couples create or expand their families, has been largely ignored in family-planning paradigms. Family building encompasses various methods and options for individuals or couples who wish to have children. It can involve biological means, such as natural conception, as well as ART, surrogacy, adoption, and foster care. Family-building acknowledges the diverse ways in which individuals or couples can create their desired family and reflects the understanding that there is no one-size-fits-all approach to building a family. Developing education programs for young adults to increase family-building awareness and prevent infertility is urgently needed. Recommendations are provided and important knowledge gaps identified to provide professionals, the public, and policymakers with a comprehensive understanding of the role of child-friendly policies. SEARCH METHODS: A narrative review of the existing literature was performed by invited global leaders who themselves significantly contributed to this research field. Each section of the review was prepared by two to three experts, each of whom searched the published literature (PubMed) for peer reviewed full papers and reviews. Sections were discussed monthly by all authors and quarterly by the review board. The final document was prepared following discussions among all team members during a hybrid invitational meeting where full consensus was reached. OUTCOMES: Major advances in fertility care have dramatically improved family-building opportunities since the 1990s. Although up to 10% of all children are born as a result of fertility care in some wealthy countries, there is great variation in access to care. The high cost to patients of infertility treatment renders it unaffordable for most. Preliminary studies point to the increasing contribution of fertility care to the global population and the associated economic benefits for society. WIDER IMPLICATIONS: Fertility care has rarely been discussed in the context of a rapid decrease in world population growth. Soon, most countries will have an average number of children per woman far below the replacement level. While this may have a beneficial impact on the environment, underpopulation is of great concern in many countries. Although governments have implemented child-friendly policies, distinct discrepancies in access to fertility care remain.",
        "DOI": "10.1093/humupd/dmad028",
        "paper_author": "Fauser B.C.J.M.",
        "affiliation_name": "University Medical Center Utrecht",
        "affiliation_city": "Utrecht",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60032724",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "It's time we put agency into Behavioural Public Policy",
        "publication": "Behavioural Public Policy",
        "citied_by": "36",
        "cover_date": "2024-01-01",
        "Abstract": "Promoting agency - people's ability to form intentions and to act on them freely - must become a primary objective for Behavioural Public Policy (BPP). Contemporary BPPs do not directly pursue this objective, which is problematic for many reasons. From an ethical perspective, goals like personal autonomy and individual freedom cannot be realised without nurturing citizens' agency. From an efficacy standpoint, BPPs that override agency - for example, by activating automatic psychological processes - leave citizens 'in the dark', incapable of internalising and owning the process of behaviour change. This may contribute to non-persistent treatment effects, compensatory negative spillovers or psychological reactance and backfiring effects. In this paper, we argue agency-enhancing BPPs can alleviate these ethical and efficacy limitations to longer-lasting and meaningful behaviour change. We set out philosophical arguments to help us understand and conceptualise agency. Then, we review three alternative agency-enhancing behavioural frameworks: (1) boosts to enhance people's competences to make better decisions; (2) debiasing to encourage people to reduce the tendency for automatic, impulsive responses; and (3) nudge+ to enable citizens to think alongside nudges and evaluate them transparently. Using a multi-dimensional framework, we highlight differences in their workings, which offer comparative insights and complementarities in their use. We discuss limitations of agency-enhancing BPPs and map out future research directions.",
        "DOI": "10.1017/bpp.2024.6",
        "paper_author": "Banerjee S.",
        "affiliation_name": "Vrije Universiteit Amsterdam",
        "affiliation_city": "Amsterdam",
        "affiliation_country": "Netherlands",
        "affiliation_id": "60008734",
        "affiliation_state": "Noord-Holland"
    },
    {
        "paper_title": "Sustainable aviation fuel technologies, costs, emissions, policies, and markets: A critical review",
        "publication": "Journal of Cleaner Production",
        "citied_by": "36",
        "cover_date": "2024-04-10",
        "Abstract": "This critical review comprehensively assesses the current landscape of sustainable aviation fuel (SAF) technologies, their associated costs, emissions profiles, policy implications, and market dynamics. This review highlights several key findings regarding bio-jet fuels as a low-carbon emission alternative to traditional jet fuel. First, the hydroprocessed esters and fatty acids (HEFA) technology stands out, boasting the highest possible technology readiness level (TRL) and fuel readiness level (FRL) of 9, indicating its advanced stage of development and readiness for commercial deployment. Second, most bio-jet fuel production technologies entail costs averaging at least 120% higher than conventional fossil-based jet fuel while achieving emissions reductions of at least 27%. Despite these high costs, only 38% of existing policies provide monetary incentives to SAF producers, resulting in SAF production operating at only 3.5% of its total potential capacity. Consequently, the paper highlights open research questions at the intersection of SAF technology development, policy, and market.",
        "DOI": "10.1016/j.jclepro.2024.141472",
        "paper_author": "Watson M.J.",
        "affiliation_name": "College of Engineering",
        "affiliation_city": "Notre Dame",
        "affiliation_country": "United States",
        "affiliation_id": "60155914",
        "affiliation_state": "IN"
    },
    {
        "paper_title": "Impact of trade liberalization and renewable energy on load capacity factor: Evidence from novel dual adjustment approach",
        "publication": "Energy and Environment",
        "citied_by": "36",
        "cover_date": "2024-03-01",
        "Abstract": "Several nations, including Mexico, are encountering problems with accomplishing the targets of sustainable development goals (SDGs). This study addresses how to develop SDG agenda for Mexico, which may also be applied to other emerging markets with comparable profiles. Therefore, this study utilizes a newly developed load capacity factor (LCF, a detailed environmental evaluation tool) that combines biocapacity (supply side) and ecological foot (demand side) to examine the effect of renewable energy consumption and trade openness on LCF while controlling for nonrenewable energy consumption and economic growth in the case of Mexico during 1970–2017. Using the dual adjustment approach, we find evidence of long-run cointegration nexus among the series. In addition, trade openness affects LCF positively, whereas renewable energy consumption, economic growth, and nonrenewable energy consumption impact LCF negatively. Furthermore, results of the frequency domain causality show that all the variables can predict LCF in the long-term. Based on these results, Mexico should focus on promoting public understanding of green energy and environmental preservation measures and participate in the production of nonenergy-consuming and ecologically friendly products while compelling polluting enterprises to migrate to countries with less stringent environmental restrictions.",
        "DOI": "10.1177/0958305X221137559",
        "paper_author": "Huilan W.",
        "affiliation_name": "Shandong Women’s University",
        "affiliation_city": "Jinan",
        "affiliation_country": "China",
        "affiliation_id": "60261038",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "Burden of bacterial antimicrobial resistance in low-income and middle-income countries avertible by existing interventions: an evidence review and modelling analysis",
        "publication": "The Lancet",
        "citied_by": "35",
        "cover_date": "2024-06-01",
        "Abstract": "National action plans enumerate many interventions as potential strategies to reduce the burden of bacterial antimicrobial resistance (AMR). However, knowledge of the benefits achievable by specific approaches is needed to inform policy making, especially in low-income and middle-income countries (LMICs) with substantial AMR burden and low health-care system capacity. In a modelling analysis, we estimated that improving infection prevention and control programmes in LMIC health-care settings could prevent at least 337 000 (95% CI 250 200–465 200) AMR-associated deaths annually. Ensuring universal access to high-quality water, sanitation, and hygiene services would prevent 247 800 (160 000–337 800) AMR-associated deaths and paediatric vaccines 181 500 (153 400–206 800) AMR-associated deaths, from both direct prevention of resistant infections and reductions in antibiotic consumption. These estimates translate to prevention of 7·8% (5·6–11·0) of all AMR-associated mortality in LMICs by infection prevention and control, 5·7% (3·7–8·0) by water, sanitation, and hygiene, and 4·2% (3·4–5·1) by vaccination interventions. Despite the continuing need for research and innovation to overcome limitations of existing approaches, our findings indicate that reducing global AMR burden by 10% by the year 2030 is achievable with existing interventions. Our results should guide investments in public health interventions with the greatest potential to reduce AMR burden.",
        "DOI": "10.1016/S0140-6736(24)00862-6",
        "paper_author": "Lewnard J.A.",
        "affiliation_name": "University of California, Berkeley",
        "affiliation_city": "Berkeley",
        "affiliation_country": "United States",
        "affiliation_id": "60025038",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Carbon negative footprint materials: A review",
        "publication": "Nano-Structures and Nano-Objects",
        "citied_by": "35",
        "cover_date": "2024-02-01",
        "Abstract": "The worst scenario for the humanity due to climate change and limiting global temperature seems now real and can be avoided, applying the ideas, approaches and solutions of the “carbon negative footprint” in decrease of greenhouse gas emissions and reaching their net zero. Herein, we describe main definitions and terms of the carbon neutrality and negativity, current and near-future trends in achieving their goals, and corresponding techniques and materials. Global strategies to reach carbon neutrality/negativity are discussed, including green chemistry routes, efficient materials processing, correct materials selection and substitution, use of naturally renewable and recyclable materials, among other definite or synergistic carbon-capture ideas. Carbon negative materials include biochar, several carbon negative concretes and cements, biomass, bamboo-, wood- and grass-derived construction materials, recycled polymers and biopolymers, MOFs and MOF-derived nanocarbons, as well as other nanomaterials and nanocomposites on their basis, including nano-enabled membranes and filters. Carbon capture and storing methods include the DAC (direct air capture), carbon mineralization (in particular, with use of nanomaterials), concrete process optimization, oxy-fuel combustion technology, using high-capacity industrial residues and effluents, liquid and solid sorbents or chemical-looping CO2 capture, among other alternative capture and regeneration methods. Thus captured carbon can be stored or released in the form of materials “made from air” pollution, including, in particular, carbon-negative construction materials, plastics, coatings, paints and inks. In addition to carbon footprint from construction industries, the future carbon negative technologies, life cycle assessments and circular economy principles, policies and market mechanisms, public-private collaborations, costs, scalability, and environmental impacts of carbon negative materials are discussed.",
        "DOI": "10.1016/j.nanoso.2024.101100",
        "paper_author": "Kharissova A.B.",
        "affiliation_name": "Universidad Autónoma de Nuevo León",
        "affiliation_city": "San Nicolas de los Garza",
        "affiliation_country": "Mexico",
        "affiliation_id": "60025417",
        "affiliation_state": "NLE"
    },
    {
        "paper_title": "A review of interconnected challenges in the water–energy–food nexus: Urban pollution perspective towards sustainable development",
        "publication": "Science of the Total Environment",
        "citied_by": "35",
        "cover_date": "2024-02-20",
        "Abstract": "The swift growth of cities worldwide poses significant challenges in ensuring a sufficient water, energy, and food supply. The Nexus has innovated valuable systems to address these challenges. However, a crucial issue is the potential for pollution resulting from these systems, which directly and indirectly impacts public health and the overall quality of urban living. This study comprehensively reviews the interconnected challenges of the water-energy-food (WEF) nexus and various forms of pollution in cities. The primary focus of this review article is to showcase the findings of WEF nexus studies regarding various pollutions across different geographical regions and spatial scales. It aims to examine the problems resulting from these pollutions, specifically their effects on human health and urban life. It also delves into the sources of pollution as identified in these studies. Furthermore, the article will highlight the proposed solutions from the research aimed at effectively mitigating pollution in each sector studied. This article is a systematic review which analyses research sources from the Scopus database. It extensively reviewed 2463 peer-reviewed published articles and focused explicitly on articles related to the WEF nexus that discussed pollution. Our study emphasizes, firstly, raising awareness about the crucial link between the WEF nexus, pollution, urban environments, and human health among policymakers and key stakeholders, including urban planners, industry partners and municipalities. This is to promote the development of policies that encourage sustainable practices and key stakeholders. Secondly, it evaluates WEF nexus and pollution research methods and findings, aiding in identifying research gaps technological innovation and potential, as well as enhancing decision-making. Lastly, it outlines future research challenges, providing a roadmap for researchers and policymakers to advance understanding in this domain and identify opportunities for resource efficiency and collaboration between different sectors.",
        "DOI": "10.1016/j.scitotenv.2023.169319",
        "paper_author": "Javan K.",
        "affiliation_name": "University of Technology Sydney",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60023932",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "The impact of geopolitical risk on CO<inf>2</inf> emissions inequality: Evidence from 38 developed and developing economies",
        "publication": "Journal of Environmental Management",
        "citied_by": "35",
        "cover_date": "2024-01-01",
        "Abstract": "This paper analyses the impact of geopolitical risk on carbon dioxide (CO2) emissions inequality in the panel dataset of 38 developed and developing economies from 1990 to 2019. At this juncture, the empirical models control for the effects of globalisation, capital-labour ratio, and per capita income on CO2 emissions inequality. The panel cointegration tests show a significant long-run relationship among the related variables in the empirical models. The panel data regression estimations indicate that geopolitical risk, capital-labour ratio, and per capita income increase CO2 emissions inequality. However, globalisation negatively affects CO2 emissions inequality in the panel dataset of 38 developed and developing countries. The pairwise panel heterogeneous causality test results align with these benchmark results and indicate no reverse causality issue. Potential policy implications are also discussed.",
        "DOI": "10.1016/j.jenvman.2023.119345",
        "paper_author": "Chen L.",
        "affiliation_name": "Nanjing University of Post and TeleCommunications",
        "affiliation_city": "Nanjing",
        "affiliation_country": "China",
        "affiliation_id": "60009400",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Tobacco endgame intervention impacts on health gains and Mā ori:non-Mā ori health inequity: A simulation study of the Aotearoa/New Zealand Tobacco Action Plan",
        "publication": "Tobacco Control",
        "citied_by": "35",
        "cover_date": "2024-11-10",
        "Abstract": "Background The Aotearoa/New Zealand Government is aiming to end the tobacco epidemic and markedly reduce Mā ori:non-Mā ori health inequalities by legislating: (1) denicotinisation of retail tobacco, (2) 95% reduction in retail outlets and (c) a tobacco free-generation whereby people born after 2005 are unable to legally purchase tobacco. This paper estimates future smoking prevalence, mortality inequality and health-adjusted life year (HALY) impacts of these strategies. Methods We used a Markov model to estimate future yearly smoking and vaping prevalence, linked to a proportional multistate life table model to estimate future mortality and HALYs. Results The combined package of strategies (plus media promotion) reduced adult smoking prevalence from 31.8% in 2022 to 7.3% in 2025 for Mā ori, and 11.8% to 2.7% for non-Mā ori. The 5% smoking prevalence target was forecast to be achieved in 2026 and 2027 for Mā ori males and females, respectively. The HALY gains for the combined package over the population's remaining lifespan were estimated to be 594 000 (95% uncertainty interval (UI): 443 000 to 738 000; 3% discount rate). Denicotinisation alone achieved 97% of these HALYs, the retail strategy 19% and tobacco-free generation 12%. By 2040, the combined package was forcat to reduce the gap in Mā ori:non-Mā ori all-cause mortality rates for people 45+ years old by 22.9% (95% UI: 19.9% to 26.2%) for females and 9.6% (8.4% to 11.0%) for males. Conclusion A tobacco endgame strategy, especially denicotinisation, could deliver large health benefits and dramatically reduce health inequities between Mā ori and non-Mā ori in Aotearoa/New Zealand.",
        "DOI": "10.1136/tc-2022-057655",
        "paper_author": "Ait Ouakrim D.",
        "affiliation_name": "Melbourne School of Population and Global Health",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60118547",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Trends and cross-country inequalities in the global burden of osteoarthritis, 1990–2019: A population-based study",
        "publication": "Ageing Research Reviews",
        "citied_by": "34",
        "cover_date": "2024-08-01",
        "Abstract": "Objective: To evaluate the trends and cross-country inequalities of global osteoarthritis (OA) burden over the last 30 years, and further predicted its changes to 2035. Methods: The estimates and 95 % uncertainty intervals (UIs) for incidence, prevalence, and disability-adjusted life-years (DALYs) of OA were extracted from Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) 2019. We described OA epidemiology at global, regional, and national levels, analyzed 1990–2019 trends in OA burden from overall, local, and multi-dimension scopes, decomposed OA burden according to population size, age structure, and epidemiologic changes, quantified cross-country inequalities in OA burden using standard health equity methods recommended by World Health Organization, and predicted changes of OA burden to 2035. Results: GBD 2019 estimated 527,811,871 (95 % UIs: 478,667,549 to 584,793,491) prevalent cases, 41,467,542 (95 % UIs: 36,875,471 to 46,438,409) incident cases and 18,948,965 (95 % UIs: 9,571,298 to 37,659,660) DALYs cases of OA worldwide in 2019, with the highest cases in East Asia and highest age-standardized rate (ASR) in high-income North America. The global burden of OA increased overall from 1990 to 2019 with the fastest growth observed in the first decade of the 21st century. Decomposition analysis revealed that OA knee (62.78 %), women (60.47 %), and middle sociodemographic index (SDI) quintile (32.35 %) were responsible for the most significant DALYs, whose changes were primarily driven by population growth and aging. A significant increase in SDI-related inequalities was detected, and the gap in DALYs between the highest SDI country and the lowest SDI country increased from 179.5 [95 % confidence interval (CI): 149.3–209.8] per 100,000 in 1990 to 341.9 (95 % CI: 309.5–374.4) per 100,000 in 2019. Notably, although the ASR of incidence, prevalence, and DALYs of OA was predicted to decrease annually from 2020 to 2035, the case number of these metrics was predicted to keeping increasing, with predicted values of 52,870,737 [95 % credible interval (Crl): 39,330,063 to 66,411,411], 727,532,373 (95 % Crl: 542,765,783 to 912,298,962), and 25,986,983 (95 % Crl: 19,216,928 to 32,757,038) in 2035, respectively. Conclusions: As a major public health issue, the global burden of OA showed an overall increasing trend from 1990 to 2019, which was primarily driven by population growth and aging. Countries with high SDI shouldered disproportionately high OA burden, and the SDI-related inequalities across countries exacerbated over time. This study highlighted great challenges in the control and management of OA, including both growing case number and distributive inequalities worldwide, which may be instructive for better making public health policy and reasonably allocating medical source.",
        "DOI": "10.1016/j.arr.2024.102382",
        "paper_author": "Cao F.",
        "affiliation_name": "Beijing Tongren Hospital, Capital Medical University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60073453",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Municipal solid waste management challenges in developing regions: A comprehensive review and future perspectives for Asia and Africa",
        "publication": "Science of the Total Environment",
        "citied_by": "34",
        "cover_date": "2024-06-20",
        "Abstract": "The rapid urbanization witnessed in developing countries in Asia and Africa has led to a substantial increase in municipal solid waste (MSW) generation. However, the corresponding disposal strategies, along with constraints in land resources and finances, compounded by unorganized public behaviour, have resulted in ineffective policy implementation and monitoring. This lack of systematic and targeted orientation, combined with blind mapping, has led to inefficient development in many areas. This review examines the key challenges of MSW management in developing countries in Asia and Africa from 2013 to 2023, drawing insights from 170 academic papers. Rather than solely focusing on recycling, the study proposes waste sorting at the source, optimization of landfill practices, thermal treatment measures, and strategies to capitalize on the value of waste as more pertinent solutions aligned with local realities. Barriers to optimizing management systems arise from socio-economic factors, infrastructural limitations, and cultural considerations. The review emphasizes the importance of integrating the study area into the circular economy framework, with a focus on enhancing citizen participation in solid waste reduction and promoting recycling initiatives, along with seeking economic assistance from international organizations.",
        "DOI": "10.1016/j.scitotenv.2024.172794",
        "paper_author": "Zhang Z.",
        "affiliation_name": "Xi'an Jiaotong-Liverpool University",
        "affiliation_city": "Suzhou",
        "affiliation_country": "China",
        "affiliation_id": "60102426",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Biofuels versus climate change: Exploring potentials and challenges in the energy transition",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "34",
        "cover_date": "2024-05-01",
        "Abstract": "In a scenario characterized by the constant rise of global temperatures and extreme climatic events, the need for sustainable energy alternatives is urgent. Biofuels, derived from biomass, emerge as a promising option to reduce greenhouse gas emissions and combat global warming. Biofuels are categorized into different generations, each with specific characteristics in terms of raw materials and production technology. While the first generation uses food sources such as corn and sugarcane, the second and third generations focus on non-food raw materials, like agricultural residues and algae, offering a more favorable carbon balance and lesser environmental impact. Advances in the fourth generation, involving techniques like artificial photosynthesis, represent a significant leap in energy efficiency and sustainability. The sustainability of production, responsible agricultural practices, and distribution infrastructure are crucial aspects for the effective integration of biofuels into the energy matrix. This study recommends integrated policies, investment in research and development, promotion of second and third generation biofuels, public awareness, and sustainable production practices. Investing in infrastructure and monitoring and evaluation systems is also essential. The transition to biofuels requires a holistic approach, balancing energy needs with environmental protection, and considering social and economic implications. Successful implementation of biofuels can signify a significant step towards a cleaner and more sustainable energy future.",
        "DOI": "10.1016/j.rser.2024.114369",
        "paper_author": "Rial R.C.",
        "affiliation_name": "Federal Institute of Mato Grosso do Sul",
        "affiliation_city": "MS",
        "affiliation_country": "Brazil",
        "affiliation_id": "131024348",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "How do fiscal policies, energy consumption and environmental stringency impact energy transition in the G7 economies: Policy implications for the COP28",
        "publication": "Journal of Cleaner Production",
        "citied_by": "34",
        "cover_date": "2024-01-01",
        "Abstract": "In recent decades, stringent environmental policies have gained prominence to tackle rising ecological and environmental threats and achieve energy transition. The current research extends fiscal and environmental deliberations by analyzing how fiscal, environmental and energy policies impact energy transition in advanced industrial economies. Our empirical analysis helps us identify that renewable energy, economic developments and environmental stringency ensure energy transition. On the other hand, fossil fuels, governmental expenditures and taxation revenues hinder ecological progress and energy transition. Based on our analysis, we propose that policymakers must align fiscal and environmental policies to bring structural changes and upgrade energy infrastructure to combat environmental threats from climate change.",
        "DOI": "10.1016/j.jclepro.2023.140367",
        "paper_author": "Bashir M.F.",
        "affiliation_name": "Shenzhen University",
        "affiliation_city": "Shenzhen",
        "affiliation_country": "China",
        "affiliation_id": "60000937",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Study of intention to use renewable energy technology in Malaysia using TAM and TPB",
        "publication": "Renewable Energy",
        "citied_by": "34",
        "cover_date": "2024-02-01",
        "Abstract": "Despite the increase in the usage of renewable energy in Malaysia, the proportion of renewable energy (RE) within the energy mix lags far behind satisfactory levels, at a mere 23% in 2020 compared to the 31% target by 2025 as per Malaysia's Energy Transition Roadmap. The public acceptance towards RE is one of the many obstacles that hinders the proliferation of RE in Malaysia. It is therefore imperative to determine the key factors which shape an individual's intention to utilize RE. In this study, three models are compared and assessed in terms of their efficacy in predicting such behavioural intention, namely the Technology Acceptance Model (TAM), Theory of Planned Behaviour (TPB) and an extended model that combines the characteristics of the two prior theories. Partial-least-squares structural equation modelling, finite mixture partial least squares (FIMIX-PLS), and important-performance map analysis (IPMA) were performed on the collected survey dataset with 524 responses. Analyses revealed that attitude and perceived behavioural control are important factors of intention to adopt renewable energy technology, with perceived ease of use and perceived usefulness in turn being significant antecedents of attitude, whereas subjective norm did not influence intention. Among the three models, the extended model triumphs in terms of path significance and explanatory power, followed by TPB and then TAM. Results show that costs, ease of use and accessibility of RE remain limiting factors towards RE adoption in Malaysia, hence the need of appropriate policies/programmes, such as targeted incentive campaigns, to alleviate this issue.",
        "DOI": "10.1016/j.renene.2023.119787",
        "paper_author": "Wong G.Z.",
        "affiliation_name": "University of Southampton",
        "affiliation_city": "Southampton",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60025225",
        "affiliation_state": "Hampshire"
    },
    {
        "paper_title": "Advances in identifying and managing emerging contaminants in aquatic ecosystems: Analytical approaches, toxicity assessment, transformation pathways, environmental fate, and remediation strategies",
        "publication": "Environmental Pollution",
        "citied_by": "34",
        "cover_date": "2024-01-15",
        "Abstract": "Emerging contaminants (ECs) are increasingly recognized as threats to human health and ecosystems. This review evaluates advanced analytical methods, particularly mass spectrometry, for detecting ECs and understanding their toxicity, transformation pathways, and environmental distribution. Our findings underscore the reliability of current techniques and the potential of upcoming methods. The adverse effects of ECs on aquatic life necessitate both in vitro and in vivo toxicity assessments. Evaluating the distribution and degradation of ECs reveals that they undergo physical, chemical, and biological transformations. Remediation strategies such as advanced oxidation, adsorption, and membrane bioreactors effectively treat EC-contaminated waters, with combinations of these techniques showing the highest efficacy. To minimize the impact of ECs, a proactive approach involving monitoring, regulations, and public education is vital. Future research should prioritize the refining of detection methods and formulation of robust policies for EC management.",
        "DOI": "10.1016/j.envpol.2023.122889",
        "paper_author": "Mofijur M.",
        "affiliation_name": "University of Technology Sydney",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "60023932",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Epistemic injustice and neoliberal imaginations in English as a medium of instruction (EMI) policy",
        "publication": "Applied Linguistics Review",
        "citied_by": "34",
        "cover_date": "2024-07-01",
        "Abstract": "This article examines the construction of epistemic injustice in creating and implementing an EMI policy. Drawing on \"epistemic injustice\"(Fricker, Miranda. 2007. Epistemic injustice: Power and the ethics of knowing. Oxford: Oxford University Press) and \"misframing\"(Fraser, Nancy. 2009. Scales of justice: Reimagining political space in a globalizing world. New York: Columbia University Press), we discuss how the EMI policy in Nepal's school education has reinforced the epistemic nature of social injustice. Taking an ethnographic approach, we have analyzed how EMI policies are created, interpreted, and implemented in two public schools located in historically marginalized ethnic minority/Indigenous communities. Our analyses show that the schools misframe and misrecognize Indigenous/ethnic minority parents' and children's linguistic knowledge and awareness of language education policy. While reproducing neoliberal values, EMI policies construct a deficit identity of Indigenous/ethnic minority communities by erasing and stigmatizing their knowledge of mother tongues in school. Such policies not only promote an English-only monolingual ideology but also pose multiple challenges for epistemic access of Indigenous/minority students and affect parents' \"party of participation\"(Fraser, Nancy. 2009. Scales of justice: Reimagining political space in a globalizing world. New York: Columbia University Press) in policymaking process.",
        "DOI": "10.1515/applirev-2022-0070",
        "paper_author": "Phyak P.",
        "affiliation_name": "Chinese University of Hong Kong",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60002798",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Assessing the impact of resource efficiency, renewable energy R&amp;D spending, and green technologies on environmental sustainability in Germany: Evidence from a Wavelet Quantile-on-Quantile Regression",
        "publication": "Journal of Cleaner Production",
        "citied_by": "33",
        "cover_date": "2024-04-15",
        "Abstract": "One important challenge in the world today is how to reverse the growth of carbon dioxide emissions to save the planet from environmental degradation without putting economic growth at risk. Several measures and initiatives such as resource efficiency, green energy transition, energy technologies, emission control, etc. Have been adopted by several countries worldwide in order to mitigate CO2 emissions. This study investigates the impact of resource efficiency, renewable energy Research and Development (R&D) expenditures, and green technologies towards fostering environmental sustainability in Germany. Using quarterly data spanning from 1974 to 2019, the study applies the Wavelet Quantile-on-Quantile Regression (WQQR) approach. This method embeds a wavelet kernel into quantile-on-quantile regression to capture the time-varying coefficients. The empirical findings reveal a negative impact of resource efficiency, renewable energy R&D expenditures, and green technologies on energy-based carbon intensity. The results further reveal that, with the exception of green technologies, the negative effects of resource efficiency and renewable energy R&D expenditures are stronger in the middle quantiles. The study demonstrates the robustness of these results through the wavelet quantile regression analysis. Finally, the study offers valuable policy implications that align with the United Nations’ Sustainable Development Goals (SDGs) 7 and 13, aiming to achieve a sustainable environment.",
        "DOI": "10.1016/j.jclepro.2024.141992",
        "paper_author": "Ozkan O.",
        "affiliation_name": "Tokat Gaziosmanpaşa Üniversitesi",
        "affiliation_city": "Tokat",
        "affiliation_country": "Turkey",
        "affiliation_id": "60016377",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Thirty years of experience in water pollution control in Taihu Lake: A review",
        "publication": "Science of the Total Environment",
        "citied_by": "33",
        "cover_date": "2024-03-01",
        "Abstract": "Taihu Lake has suffered from eutrophication and algal blooms for decades, primarily due to increasing anthropogenic pollutants from human activities. Extensive research and widespread implementation of water pollution control measures have significantly contributed to the improvement of water quality of Taihu Lake. However, the relevant experience of Taihu Lake pollution control has not been well summarized to provide insight for future lake restoration. This review article seeks to address this gap by first providing a comprehensive overview of Taihu Lake's water quality dynamics over the past thirty years, characterized by two distinct stages: (I) water quality deterioration (1990s–2007); and (II) water total nitrogen (TN) improvement but total phosphorus (TP) fluctuation (2007–current). Subsequently, we conducted a thorough review of the experiences and challenges associated with water pollution control during these two stages. Generally, pollution control practices emphasized point source control but overlooked non-point sources before 2007, possibly due to point sources being easier to identify and manage. Accordingly, the focus shifted from industrial point sources to a combination of industrial point and agricultural non-point sources after 2007 to control water pollution in the Taihu Lake Basin. Numerous studies have delved into non-point source pollution control, including source control, transport intercept, in-lake measures, and the integration of these technologies. Taken together, this paper provides suggestions based on the needs and opportunities of this region. Further research is needed to better understand and model the underlying pollution processes, as well as to increase public participation and improve policy and law implementation, which will assist decision-makers in formulating better water management in Taihu Lake.",
        "DOI": "10.1016/j.scitotenv.2023.169821",
        "paper_author": "Yan X.",
        "affiliation_name": "Chinese Academy of Sciences",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60019499",
        "affiliation_state": "Beijing"
    },
    {
        "paper_title": "Waste to energy: Trending key challenges and current technologies in waste plastic management",
        "publication": "Science of the Total Environment",
        "citied_by": "33",
        "cover_date": "2024-02-25",
        "Abstract": "Due to the ‘forever’ degrading nature of plastic waste, plastic waste management is often complicated. The applications of plastic are ubiquitous and inevitable in many scenarios. Current global waste plastics production is ca. 3.5 MMT per year, and with the current trend, plastic waste production will reach 25,000 MMT by 2040. However, the rapid growth in plastic manufacture and the material's inherent nature resulted in the accumulation of a vast amount of plastic garbage. The current recycling rate is <10 %, while the large volumes of discarded plastic waste cause environmental and ecological problems. Recycling rates for plastic vary widely by region and type of plastic. In some developed countries, the recycling rate for plastics is around 20–30 %, while in many developing nations, it is much lower. These statistics highlight the magnitude of the plastic waste problem and the urgent need for comprehensive strategies to manage plastic waste more effectively and reduce its impact on the environment. This review critically analyses past studies on the essential and efficient techniques for turning plastic trash into treasure. Additionally, an attempt has been made to provide a comprehensive understanding of the plastic upcycling process, the 3Rs policy, and the life-cycle assessment (LCA) of plastic conversion. The review advocates pyrolysis as one of the most promising methods of turning plastic trash into valuable chemicals. In addition, plastic waste management can be severely impacted due to uncontrollable events, such as Covid 19 pandemic. Recycling and chemical upcycling can certainly bring value to the end-of-life plastic. However, the LCA analysis indicated there is still a huge scope for innovation in chemical upcycling area compared to mechanical recycling. The formulation of policies and heightened public participation could play a pivotal role in reducing the environmental repercussions of plastic waste and facilitating a shift towards a more sustainable future.",
        "DOI": "10.1016/j.scitotenv.2023.169436",
        "paper_author": "Vuppaladadiyam S.S.V.",
        "affiliation_name": "Monash University",
        "affiliation_city": "Melbourne",
        "affiliation_country": "Australia",
        "affiliation_id": "60019578",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "The 2023 US 50-State National Seismic Hazard Model: Overview and implications",
        "publication": "Earthquake Spectra",
        "citied_by": "33",
        "cover_date": "2024-02-01",
        "Abstract": "The US National Seismic Hazard Model (NSHM) was updated in 2023 for all 50 states using new science on seismicity, fault ruptures, ground motions, and probabilistic techniques to produce a standard of practice for public policy and other engineering applications (defined for return periods greater than ∼475 or less than ∼10,000 years). Changes in 2023 time-independent seismic hazard (both increases and decreases compared to previous NSHMs) are substantial because the new model considers more data and updated earthquake rupture forecasts and ground-motion components. In developing the 2023 model, we tried to apply best available or applicable science based on advice of co-authors, more than 50 reviewers, and hundreds of hazard scientists and end-users, who attended public workshops and provided technical inputs. The hazard assessment incorporates new catalogs, declustering algorithms, gridded seismicity models, magnitude-scaling equations, fault-based structural and deformation models, multi-fault earthquake rupture forecast models, semi-empirical and simulation-based ground-motion models, and site amplification models conditioned on shear-wave velocities of the upper 30 m of soil and deeper sedimentary basin structures. Seismic hazard calculations yield hazard curves at hundreds of thousands of sites, ground-motion maps, uniform-hazard response spectra, and disaggregations developed for pseudo-spectral accelerations at 21 oscillator periods and two peak parameters, Modified Mercalli Intensity, and 8 site classes required by building codes and other public policy applications. Tests show the new model is consistent with past ShakeMap intensity observations. Sensitivity and uncertainty assessments ensure resulting ground motions are compatible with known hazard information and highlight the range and causes of variability in ground motions. We produce several impact products including building seismic design criteria, intensity maps, planning scenarios, and engineering risk assessments showing the potential physical and social impacts. These applications provide a basis for assessing, planning, and mitigating the effects of future earthquakes.",
        "DOI": "10.1177/87552930231215428",
        "paper_author": "Petersen M.D.",
        "affiliation_name": "United States Geological Survey Central Region",
        "affiliation_city": "Denver",
        "affiliation_country": "United States",
        "affiliation_id": "60013140",
        "affiliation_state": "CO"
    },
    {
        "paper_title": "A holistic approach to embracing the United Nation's Sustainable Development Goal (SDG-6) towards water security in Pakistan",
        "publication": "Journal of Water Process Engineering",
        "citied_by": "33",
        "cover_date": "2024-01-01",
        "Abstract": "Water is a fundamental natural resource for human life, socioeconomic development and environmental protection. However, population growth, climate change, and unsustainable water management practices are putting increasing pressure on water resources in many developing countries like Pakistan. The United Nations Sustainable Development Goal 6 (UNSDG-6) aims to ensure the provision of clean water and sanitation for all, and the sustainable management of these resources. The primary objective of this article is to present the Government of Pakistan's perspective on accomplishing sustainable water management through the UN SDG-6 roadmap. It provides an in-depth review of Pakistan's water reserves and the associated challenges faced in effectively managing these resources. The report emphasizes improving water governance, water conservation enhancement, and equitable water distribution promotion to attain sustainable water management. The sustainable water management practices in Pakistan could be improved by identifying potential solutions, policy recommendations, community engagement, capacity building, and public awareness campaigns. Water management policies should incorporate climate change considerations, long-term planning, and efficient water pricing mechanisms that will improve sustainable water management in Pakistan and other developing countries.",
        "DOI": "10.1016/j.jwpe.2023.104691",
        "paper_author": "Mujtaba G.",
        "affiliation_name": "University of Engineering and Technology, Peshawar",
        "affiliation_city": "Peshawar",
        "affiliation_country": "Pakistan",
        "affiliation_id": "60104814",
        "affiliation_state": "Khyber Pakhtunkhwa"
    },
    {
        "paper_title": "Examining the influence of green innovations in industrial enterprises on China's smart city development",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "33",
        "cover_date": "2024-02-01",
        "Abstract": "In this modern era, smart cities are an essential strategy for China to achieve high-quality development representing an essential issue at the stage of high-quality development to drive urban innovation and lead China to be among the innovative countries. In order to achieve this goal, this study employs a time-varying difference-in-difference (DID) model to test the above questions in a multidimensional manner based on micro-firm data from the China Tax Survey Database and the China Innovative Enterprise Database from 2010 to 2015. The estimated results explore that China's smart city pilot policies (SCPP) encourage green innovation at the firm level, a finding that still holds after a sequence of robustness tests. Furthermore, the empirical evidence indicates that the influence of green innovations on the SCPP was more important for firms in non-state-owned enterprises, heavily polluting industries and non-resource-based cities relative to state-owned firms, firms in lightly-polluting industries and firms in non-resource-based cities. In addition, this study finds that the smart city pilot policy can provide a new incentive for the green innovation behaviour of enterprises via policy and agglomeration effects. Overall, the estimated findings suggest that the government should continue to play a positive role in constructing smart cities for enterprises' green innovation and implement smart city construction programmes following local conditions to help China's high-quality economic development.",
        "DOI": "10.1016/j.techfore.2023.123031",
        "paper_author": "Yang S.",
        "affiliation_name": "Guizhou University of Finance and Economics",
        "affiliation_city": "Guiyang",
        "affiliation_country": "China",
        "affiliation_id": "60108794",
        "affiliation_state": "Guizhou"
    },
    {
        "paper_title": "A two-level charging scheduling method for public electric vehicle charging stations considering heterogeneous demand and nonlinear charging profile",
        "publication": "Applied Energy",
        "citied_by": "33",
        "cover_date": "2024-02-01",
        "Abstract": "This paper investigates the electric vehicle (EV) charging scheduling problem for public EV charging stations (EVCSs) that can accommodate heterogeneous charging demands, aiming to flatten the aggregate load on the power grid and reduce the peak demand. In contrast to existing works that mainly focus on a single scheduling strategy, a two-level hierarchical charging scheduling method is proposed, which includes an online booking system (OBS) and a pricing-based charging control system (PCCS). Specifically, the implementation of OBS can reduce the service capacity of bookable chargers, whereas PCCS can facilitate the redistribution of charging demand from peak to off-peak time periods. Moreover, the nonlinear charging profile of the battery is incorporated into the model to better reflect the real charging process. A deep reinforcement learning (DRL)-based approach with a discrete Markov decision process (MDP) formulation is designed to find the optimal scheduling solution, where deep Q-network (DQN) and deep deterministic policy gradient (DDPG) are combined to handle the hybrid action space with both discrete and continuous actions. A comprehensive set of experiments is carried out to examine the effectiveness of the developed two-level scheduling scheme. The results indicate that the proposed method improves the scheduling effectiveness compared to single-strategy methods by 6.7% to 49.44%.",
        "DOI": "10.1016/j.apenergy.2023.122278",
        "paper_author": "Zhao Z.",
        "affiliation_name": "The Hong Kong Polytechnic University",
        "affiliation_city": "Hong Kong",
        "affiliation_country": "Hong Kong",
        "affiliation_id": "60008928",
        "affiliation_state": "Hong Kong"
    },
    {
        "paper_title": "Does renewable energy proactively contribute to mitigating carbon emissions in major fossil fuels consuming countries?",
        "publication": "Journal of Cleaner Production",
        "citied_by": "32",
        "cover_date": "2024-05-01",
        "Abstract": "The success of global climate initiatives (SDG-13, COP28) heavily depends on the actions of major fossil fuels consuming countries, as their continued reliance on these energy sources greatly impedes progress towards global climate objectives. Transitioning from the dominance of fossil fuels to the expansion of renewable energy is crucial for ensuring Sustainable Development Goals (SDGs) and Conference on Parties (COP) objectives under UN climate change initiatives, as well as for achieving environmental sustainability. This study investigates the proactive role of renewable energy in enhancing environmental sustainability and evaluates the impact of fossil fuel consumption, real gross domestic product (RGDP), square of RGDP, and patents on carbon emissions in major fossil fuels consuming countries from 1990 to 2020 after considering and disregarding the EKC model. Two-way additive and interactive fixed effect models demonstrate a statistically significant negative effect of renewable energy on carbon emissions. A method of moments quantile regression endorses the asymmetric negative effects of renewable energy across different quantiles of CO2 emissions. According to the quantile regression, a low CO2 emitting country's environmental quality is largely sensitive to the consumption of renewable energy. Also, after considering heterogeneity, cross-sectional dependence and endogeneity issues, the effect of renewable energy remains unchanged. On the contrary, unlike renewable energy, fossil fuel consumption, real GDP, square of real GDP, and patents have positive effects in most cases, worsening environmental quality by increasing CO2 levels. Therefore, based on these findings, our study emphasizes pivotal policy implications aimed at fostering a better environment in major fossil fuels consuming countries.",
        "DOI": "10.1016/j.jclepro.2024.142113",
        "paper_author": "Rahman A.",
        "affiliation_name": "Lanzhou University",
        "affiliation_city": "Lanzhou",
        "affiliation_country": "China",
        "affiliation_id": "60028265",
        "affiliation_state": "Gansu"
    },
    {
        "paper_title": "Air pollution exposure and cardiometabolic risk",
        "publication": "The Lancet Diabetes and Endocrinology",
        "citied_by": "32",
        "cover_date": "2024-03-01",
        "Abstract": "The Global Burden of Disease assessment estimates that 20% of global type 2 diabetes cases are related to chronic exposure to particulate matter (PM) with a diameter of 2·5 μm or less (PM2·5). With 99% of the global population residing in areas where air pollution levels are above current WHO air quality guidelines, and increasing concern in regard to the common drivers of air pollution and climate change, there is a compelling need to understand the connection between air pollution and cardiometabolic disease, and pathways to address this preventable risk factor. This Review provides an up to date summary of the epidemiological evidence and mechanistic underpinnings linking air pollution with cardiometabolic risk. We also outline approaches to improve awareness, and discuss personal-level, community, governmental, and policy interventions to help mitigate the growing global public health risk of air pollution exposure.",
        "DOI": "10.1016/S2213-8587(23)00361-3",
        "paper_author": "Rajagopalan S.",
        "affiliation_name": "University Hospitals Case Medical Center",
        "affiliation_city": "Cleveland",
        "affiliation_country": "United States",
        "affiliation_id": "60021578",
        "affiliation_state": "OH"
    },
    {
        "paper_title": "Embracing a diverse approach to a globally inclusive green energy transition: Moving beyond decarbonisation and recognising realistic carbon reduction strategies",
        "publication": "Journal of Cleaner Production",
        "citied_by": "32",
        "cover_date": "2024-01-01",
        "Abstract": "The green energy transition is aimed at mitigating the impact of climate change. Yet, the current emphasis on ‘green’ is narrowly centred around decarbonisation, or CO2 reduction, often side-lining the roles of other gases, such as sulphur hexafluoride (SF6) and PCF-14 (CF4), which have a respective 24,300- and 7380-times higher global warming potential than CO2 on a time horizon of a century. In addition, any energy transition is a complex affair that simultaneously impacts the environmental, economic and social systems, with significant system-level interactions. For example, the material requirement for renewable energy is known to be substantial, at a factor of 15 times greater than natural gas-based energy for offshore wind generation, and almost 7 times greater for solar. The resulting increased competition for materials is reducing the appetite for global collaboration. In addition, the global capacity to deploy renewable energy technology or participate in climate change mitigation is geographically variable and no single solution is universally viable. This study examines an expanded definition of ‘green’ energy and proposes a beyond-decarbonisation approach that is more comprehensive and globally inclusive, in pursuit for a sustainable transition. The increased diversity of our approach promises advantages such as heightened global collaboration, diminished geopolitical tension, improved energy access, expanded market opportunities, and socio-environmental co-benefits. Strategies pivotal to this approach involve understanding the role of carbon-based energy systems in the transition, amplifying renewable resources, augmenting cross-sector energy efficiency, implementing effective carbon markets, and integrating nature-based as well as carbon removal technologies. Moreover, it is imperative to implement all-cost and all-benefit monitoring and evaluation systems to optimise existing decarbonisation methods systematically. This could entail the use of composite metrics that normalise the gain in climate change mitigation against economic, social or environmental metrics. Addressing societal apprehensions requires a focus on pragmatic and fair outcomes, geopolitical stability, market impacts, developmental objectives, effective public engagement, and recognition of the role of enterprises. Policymakers are important in fostering global synergy by implementing policies that encourage international collaboration, investment, enterprise engagement, institution fortification, and cross-sector policy integration.",
        "DOI": "10.1016/j.jclepro.2023.140414",
        "paper_author": "Ghorbani Y.",
        "affiliation_name": "University of Lincoln",
        "affiliation_city": "Lincoln",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60026830",
        "affiliation_state": "Lincolnshire"
    },
    {
        "paper_title": "Association between public health policies on alcohol and worldwide cancer, liver disease and cardiovascular disease outcomes",
        "publication": "Journal of Hepatology",
        "citied_by": "32",
        "cover_date": "2024-03-01",
        "Abstract": "Background & Aims: The long-term impact of alcohol-related public health policies (PHPs) on disease burden is unclear. We aimed to assess the association between alcohol-related PHPs and alcohol-related health consequences. Methods: We conducted an ecological multi-national study including 169 countries. We collected data on alcohol-related PHPs from the WHO Global Information System of Alcohol and Health 2010. Data on alcohol-related health consequences between 2010–2019 were obtained from the Global Burden of Disease database. We classified PHPs into five items, including criteria for low, moderate, and strong PHP establishment. We estimated an alcohol preparedness index (API) using multiple correspondence analysis (0 lowest and 100 highest establishment). We estimated an incidence rate ratio (IRR) for outcomes according to API using adjusted multilevel generalized linear models with a Poisson family distribution. Results: The median API in the 169 countries was 54 [IQR 34.9–76.8]. The API was inversely associated with alcohol use disorder (AUD) prevalence (IRR 0.13; 95% CI 0.03–0.60; p = 0.010), alcohol-associated liver disease (ALD) mortality (IRR 0.14; 95% CI 0.03–0.79; p = 0.025), mortality due to neoplasms (IRR 0.09; 95% CI 0.02–0.40; p = 0.002), alcohol-attributable hepatocellular carcinoma (HCC) (IRR 0.13; 95% CI 0.02–0.65; p = 0.014), and cardiovascular diseases (IRR 0.09; 95% CI 0.02–0.41; p = 0.002). The highest associations were observed in the Americas, Africa, and Europe. These associations became stronger over time, and AUD prevalence was significantly lower after 2 years, while ALD mortality and alcohol-attributable HCC incidence decreased after 4 and 8 years from baseline API assessment, respectively (p <0.05). Conclusions: The API is a valuable instrument to quantify the robustness of alcohol-related PHP establishment. Lower AUD prevalence and lower mortality related to ALD, neoplasms, alcohol-attributable HCC, and cardiovascular diseases were observed in countries with a higher API. Our results encourage the development and strengthening of alcohol-related policies worldwide. Impact and implications: We first developed an alcohol preparedness index, an instrument to assess the existence of alcohol-related public policies for each country. We then evaluated the long-term association of the country's alcohol preparedness index in 2010 with the burden of chronic liver disease, hepatocellular carcinoma, other neoplasms, and cardiovascular disease. The strengthening of alcohol-related public health policies could impact long-term mortality rates from cardiovascular disease, neoplasms, and liver disease. These conditions are the main contributors to the global burden of disease related to alcohol use. Over time, this association has not only persisted but also grown stronger. Our results expand the preliminary evidence regarding the importance of public health policies in controlling alcohol-related health consequences.",
        "DOI": "10.1016/j.jhep.2023.11.006",
        "paper_author": "Díaz L.A.",
        "affiliation_name": "Escuela de Medicina",
        "affiliation_city": "Santiago",
        "affiliation_country": "Chile",
        "affiliation_id": "60088718",
        "affiliation_state": "RM"
    },
    {
        "paper_title": "The energy saving effects of digital infrastructure construction: Empirical evidence from Chinese industry",
        "publication": "Energy",
        "citied_by": "31",
        "cover_date": "2024-05-01",
        "Abstract": "Digital infrastructure serves as a crucial foundation for development in the era of the digital economy. In light of this, this paper takes digital infrastructure construction as its focal point. Utilizing Python technology and the Meta-frontier non-radial directional distance function to calculate the level of digital infrastructure construction and industrial energy efficiency. It then employs a dynamic panel data model to analyze the impact effects and mechanisms of digital infrastructure construction on industrial energy efficiency. Additionally, threshold models and modified gravity models are employed to explore the nonlinear effects and spatial impacts of digital infrastructure construction on industrial energy efficiency. The research findings reveal that the enhancement of digital infrastructure significantly improves industrial energy efficiency. Moreover, indicate a shift in the impact of digital infrastructure construction on industrial energy efficiency from inhibitory to promotional as the level of digital infrastructure construction increases. The mechanism of this effect suggests that digital infrastructure construction can promote the improvement of industrial energy efficiency through green technological innovation and the advancement of industrial structure. Further analysis shows that the spatial network characteristics of digital infrastructure construction notably elevate the level of industrial energy utilization efficiency. This study provides practical policy implications for sustainable development.",
        "DOI": "10.1016/j.energy.2024.130778",
        "paper_author": "Wang L.",
        "affiliation_name": "Jiangsu Normal University",
        "affiliation_city": "Xuzhou",
        "affiliation_country": "China",
        "affiliation_id": "60004691",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Updated recommendations for the Cochrane rapid review methods guidance for rapid reviews of effectiveness",
        "publication": "BMJ",
        "citied_by": "30",
        "cover_date": "2024-01-01",
        "Abstract": "This article provides updated guidance on methods for conducting rapid reviews of effectiveness, targeted at Cochrane and other stakeholders interested in the methodology of rapid reviews. The guidance, developed by the Cochrane Rapid Reviews Methods Group, builds upon previous interim guidance, and incorporates changes based on an evaluation of its application, a scope of the literature on rapid review methodology, and input from a diverse group of experts in rapid review methods. The guidance consists of 24 specific recommendations supporting the conduct of rapid reviews, applicable both within and outside Cochrane. It underscores the importance of considering the appropriateness of undertaking rapid reviews and advocates for a tailored, iterative approach to each review. Key defining features of rapid reviews, such as restricted methods, how the dimension of timelines factors into rapid reviews, and the involvement of knowledge users (eg, patient and public partners, healthcare providers, policy makers), are outlined. The paper presents a definition of a Cochrane rapid review and additional considerations for rapid reviews of effectiveness to enhance the efficiency of the review process. In conclusion, the Cochrane Rapid Review Methods Group's updated guidance, complemented by examples, seeks to guide methodological decisions in the design and conduct of rapid reviews, facilitating timely decision making in healthcare.",
        "DOI": "10.1136/bmj-2023-076335",
        "paper_author": "Garritty C.",
        "affiliation_name": "Université d'Ottawa, Faculté de Médecine",
        "affiliation_city": "Ottawa",
        "affiliation_country": "Canada",
        "affiliation_id": "60013175",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "Understanding the impact of cultivated land-use changes on China's grain production potential and policy implications: A perspective of non-agriculturalization, non-grainization, and marginalization",
        "publication": "Journal of Cleaner Production",
        "citied_by": "30",
        "cover_date": "2024-01-10",
        "Abstract": "Cultivated land plays a pivotal role in ensuring national food security. The challenges of non-agriculture, non-grain production and the marginalization of cultivated land have become increasingly pronounced in the context of urbanization and industrialization in China, posing potential threats to long-term food security. This study employs a combination of remote sensing and statistical data to reveal the effects of non-agriculturalization, non-grainization, and the marginalization of cultivated land on grain production potential (GPP) at the grid scale. From 1992 to 2020, the total farmland area initially exhibited an ascending trend followed by a subsequent decline, resulting in a net decrease of approximately 0.84% in China. the northward shift in the center of gravity of cultivated land has accentuated the spatial disparity between grain production and consumption. Non-agriculturalization, non-grainization, and marginalization of cultivated land contributed 35.22%, 22.58%, and 42.20% to the GPP loss, respectively. GPP loss exhibited significant differences across the agroclimatic zones, with the combined loss in the Middle-lower Yangtze Plain and Huang-Huai-Hai Plain exceeding 60% of the national total. Cultivated land marginalization has emerged as the most impactful land-use change affecting GPP, leading to a substantial loss of approximately 11471.30 × 104 t. The affected area is predominantly concentrated in the southern region. The marginalization of cultivated land has not been effectively alleviated, and the expansion trend continues. Conservation endeavors targeting cultivated land should prioritize enhancing farmers' willingness to cultivate, curbing the extensive utilization of farmland, and mitigating the escalating trend of farmland marginalization.",
        "DOI": "10.1016/j.jclepro.2024.140647",
        "paper_author": "Lu D.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "On the Integration of Artificial Intelligence and Blockchain Technology: A Perspective About Security",
        "publication": "IEEE Access",
        "citied_by": "30",
        "cover_date": "2024-01-01",
        "Abstract": "As reliance on disruptive applications based on Artificial Intelligence (AI) and Blockchain grows, the need for secure and trustworthy solutions becomes ever more critical. Whereas much research has been conducted on AI and Blockchain, there is a shortage of comprehensive studies examining their integration from a security perspective. Hence, this survey addresses such a gap and provides insights for policymakers, researchers, and practitioners exploiting AI and Blockchain's evolving integration. Specifically, this paper analyzes the potential benefits of the integration of AI and Blockchain as well as the related security concerns, identifying possible mitigation strategies, suggesting regulatory measures, and describing the impact it has on public trust.",
        "DOI": "10.1109/ACCESS.2023.3349019",
        "paper_author": "Kuznetsov O.",
        "affiliation_name": "V. N. Karazin Kharkiv National University",
        "affiliation_city": "Kharkiv",
        "affiliation_country": "Ukraine",
        "affiliation_id": "60027251",
        "affiliation_state": "Kharkiv Oblast"
    },
    {
        "paper_title": "Strategies for upcycling food waste in the food production and supply chain",
        "publication": "Trends in Food Science and Technology",
        "citied_by": "30",
        "cover_date": "2024-01-01",
        "Abstract": "Background: Food waste (FW) occurs at every stage of the food supply chain, with each segment contributing its share to the problem. These stages include agricultural production, post-harvest handling and storage, processing and manufacturing, distribution and retail, and finally, consumer behavior. Understanding the root causes and dynamics at each stage is essential to developing effective strategies for FW reduction. One promising approach is upcycling FW, a creative and innovative process of converting FW into higher-value products, thus preventing them from becoming traditional waste. Scope and approach: This review explores various approaches for repurposing FW to create innovative products such as novel foods, animal feed, and bioenergy. The exploration of emerging and innovative technologies for upcycling functional components from FW, leading to the development of specific value-added functional products, is discussed. Additionally, this review article covers considerations related to regulatory frameworks and policies, providing a comprehensive overview of the regulatory landscape. Key findings and conclusions: Upcycling FW tackles global FW issues, creates economic value, cuts greenhouse gas emissions, and reduces food insecurity. However, the success of these strategies relies on collaboration and commitment across the entire food supply chain, from producers to retailers and consumers. Furthermore, public awareness, education, and policy support are essential to drive the widespread adoption of upcycling practices and transform the food system into a more sustainable and equitable one.",
        "DOI": "10.1016/j.tifs.2023.104314",
        "paper_author": "Punia Bangar S.",
        "affiliation_name": "Clemson University",
        "affiliation_city": "Clemson",
        "affiliation_country": "United States",
        "affiliation_id": "60026610",
        "affiliation_state": "SC"
    },
    {
        "paper_title": "The impact of digital economy on carbon total factor productivity: A spatial analysis of major urban agglomerations in China",
        "publication": "Journal of Environmental Management",
        "citied_by": "30",
        "cover_date": "2024-02-01",
        "Abstract": "Amid global climate imperatives and intensified economic competition, pivoting from China's conventional growth paradigms to innovative economic catalysts emerges as pivotal for its transformative agenda. Drawing on panel data from 141 principal urban conglomerates spanning 2011–2021, this investigation delves into the intricate nexus between the digital economy and carbon total factor productivity. Our empirical analysis unveils a U-shaped trajectory characterizing the digital economy - carbon total factor productivity interplay, accompanied by a congruent spatial spillover dynamic. While digital economy fortifies environmental governance mechanisms through amplified data and media channels, such regulatory frameworks, albeit efficacious in emission abatement, may inadvertently impede economic vitality, thus attenuating carbon total factor productivity. Progressing from digital economy's foundational phase to its comprehensive deployment, its reverberations on capital productivity manifest in a U-shaped curve, invigorating local carbon total factor productivity while potentially undermining adjacent regions. This digital economy - carbon total factor productivity interrelation is accentuated in advanced, non-resource-reliant metropolises with subdued innovation propensities. This discourse proffers nuanced policy implications for sculpting digital economy trajectories and bolstering carbon total factor productivity in a sustainable context.",
        "DOI": "10.1016/j.jenvman.2023.119765",
        "paper_author": "Chen W.",
        "affiliation_name": "Tianjin University",
        "affiliation_city": "Tianjin",
        "affiliation_country": "China",
        "affiliation_id": "60019533",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Social media influencers and adolescents’ health: A scoping review of the research field",
        "publication": "Social Science and Medicine",
        "citied_by": "30",
        "cover_date": "2024-01-01",
        "Abstract": "Social media influencers (SMIs) have become an important source of health information for adolescents. However, the lack of expertise and commercial interests of SMIs pose challenges for adolescent health. To gain a better understanding of these challenges, this scoping review aimed to synthesize existing research on the role of SMIs in adolescent health. Using the PRISMA-ScR approach, we conducted a comprehensive search of eight databases and screened articles based on predefined criteria. The final sample included 51 articles published between 2012 and 2022. Results revealed inconsistent definitions and classifications of SMIs. The most common topics included appearance, nutrition, and substance use, while mental and sexual health topics were underrepresented. The ability of SMIs to establish trustworthy relationships with their followers was highlighted in the reviewed studies, shedding light on potential benefits and challenges for adolescent health. However, most studies focused on the negative roles of SMIs, such as the promotion of unrealistic body images, unhealthy diets, substance use, and inaccurate diagnosis and treatment advice. In addition, inappropriate advertising of unhealthy products (e.g., junk food, tobacco products and alcohol) was identified as a major challenge. The reviewed studies identified stricter regulation and improved social media and health literacy as important avenues for policy action. Less attention was given to the potential positive impact of SMIs and how to effectively include them in health promotion campaigns. In addition, the majority of studies were conducted in the Global North and relied on quantitative approaches, resulting in a lack of representation of minority populations and male adolescents.",
        "DOI": "10.1016/j.socscimed.2023.116387",
        "paper_author": "Engel E.",
        "affiliation_name": "Universität Wien",
        "affiliation_city": "Vienna",
        "affiliation_country": "Austria",
        "affiliation_id": "60025988",
        "affiliation_state": "Vienna"
    },
    {
        "paper_title": "Analysis of factors and strategies for the implementation of sustainable tourism in a green economic structure in China",
        "publication": "Journal of Cleaner Production",
        "citied_by": "30",
        "cover_date": "2024-01-01",
        "Abstract": "The tourism industry significantly contributes to the economic development of numerous emerging countries by facilitating the expansion of local enterprises. However, tourism may adversely affect the environment, local communities, and cultural heritage when it is not managed effectively. In this study, the case of Guilin city of China is undertaken for the analysis. Guilin, a popular tourist destination in southern China, has experienced rapid growth in tourism, generating economic benefits but also posing challenges related to environmental sustainability and social impact. This study uses Fuzzy Analytic Hierarchy Process (AHP) and Fuzzy Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS) to identify the most important criteria, sub-criteria, and effective policy strategies for promoting sustainable tourism in developing economies. Therefore, the study identified five criteria, twenty sub-criteria, and six policy strategies for sustainable tourism development in Guilin, China. The results of Fuzzy AHP method has identified economic viability, infrastructure and services, and social and cultural impact are the most suitable criteria for sustainable tourism. The results of Fuzzy TOPSIS method has recognized community-based tourism, sustainable tourism certification, and public-private partnerships as most effective strategies. This research provides useful insights for policymakers and stakeholders, enabling them to contribute to the sustainable development of the tourism industry and support the achievement of the United Nations sustainable development goals.",
        "DOI": "10.1016/j.jclepro.2023.140011",
        "paper_author": "Li Y.",
        "affiliation_name": "Hebei Agricultural University",
        "affiliation_city": "Baoding",
        "affiliation_country": "China",
        "affiliation_id": "60015407",
        "affiliation_state": "Hebei"
    },
    {
        "paper_title": "Hydrogen energy development in China: Potential assessment and policy implications",
        "publication": "International Journal of Hydrogen Energy",
        "citied_by": "30",
        "cover_date": "2024-01-02",
        "Abstract": "Hydrogen is a promising alternative energy source for sustainable development worldwide. Despite being the world's largest hydrogen producer, China's hydrogen energy development is uneven across regions and sectors. The lack of a comprehensive and systematic analysis makes it difficult for policymakers to identify critical areas and links for targeted action. This study aims to establish a comprehensive multi-indicator framework based on a supply-demand-policy model to rank the city's hydrogen development potential. Findings are as follows. First, demand, supply, and policy environment shape the hydrogen market. Second, the development potential of hydrogen varies considerably across regions, and regional development is dependent largely on leading cities. Third, four hydrogen development patterns have been identified: advantage-demonstration, policy-guided, market-driven, and potential-enhancing. This research provides theoretical support and practical guidance for building a hydrogen-based society and may also be applied to similar energy sources.",
        "DOI": "10.1016/j.ijhydene.2023.10.176",
        "paper_author": "Huang Y.",
        "affiliation_name": "Renmin University of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014402",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Household energy consumption, energy efficiency, and household income–Evidence from China",
        "publication": "Applied Energy",
        "citied_by": "30",
        "cover_date": "2024-01-01",
        "Abstract": "In recent decades, China has experienced similar increasing household energy consumption and income trends. However, how household energy efficiency changes and relates to household income remains unclear. Based on the panel stochastic frontier analysis (SFA) model, we find: (1) China's household energy efficiency decreased from 0.917 in 2002 to 0.874 in 2021on average, resulting in growing inefficient energy use from 1779 tons of coal equivalent (tce) in 2002 to 14,773 tce in 2021; (2) household income negatively relates to household energy efficiency, and impacts the distribution of inefficient energy use; (3) household energy efficiency in low-income areas is always the highest and decreases slowly, while that in high-income areas is the lowest and decreases faster; (4) in the low-income region, household survival needs growth with rising income is the main reason for the decline in energy efficiency; in the middle-income group, household survival needs growth and consumption upgrading drives energy efficiency down before and after 2011, respectively; while household consumption upgrading is the driving force for the downward trend of energy efficiency in the high-income regions. Then, corresponding policy implications are proposed.",
        "DOI": "10.1016/j.apenergy.2023.122074",
        "paper_author": "Zheng J.",
        "affiliation_name": "Henan University",
        "affiliation_city": "Kaifeng",
        "affiliation_country": "China",
        "affiliation_id": "60003146",
        "affiliation_state": "Henan"
    },
    {
        "paper_title": "Solid waste management in the context of the waste hierarchy and circular economy frameworks: An international critical review",
        "publication": "Integrated Environmental Assessment and Management",
        "citied_by": "30",
        "cover_date": "2024-01-01",
        "Abstract": "Growing populations and consumption drive the challenges of solid waste management (SWM); globalization of transport, food production, and trade, including waste trading, distributes risks worldwide. Using waste hierarchy (WH; reduce, reuse, and recycle) and circular economy (CE) concepts, we updated a conceptual waste framework used by international organizations to evaluate SWM practices. We identified the key steps and the important factors, as well as stakeholders, which are essential features for effective SWM. Within this updated conceptual framework, we qualitatively evaluated global SWM strategies and practices, identifying opportunities, barriers, and best practices. We find that, although a few exceptional countries exhibit zero-waste compliance, most fare poorly, as exhibited by the high waste generation, incineration, and disposal (open dumping, landfilling) volumes. In the Global North, SWM strategies and practices rely heavily on technologies, economic tools, regulatory frameworks, education, and social engagement to raise stakeholder awareness and enhance inclusion and participation; in the Global South, however, many governments take sole legal responsibility for SWM, seeking to eliminate waste as a public “nuisance.” Separation and recycling in the Global South are implemented mainly by “informal” economies in which subsistence needs drive recyclable material retrieval. Imported, regionally inappropriate tools, economic constraints, weak policies and governance, waste trading, noninclusive stakeholder participation, data limitations, and limited public awareness continue to pose major waste and environmental management challenges across nations. In the context of the framework, we conclude that best practices from around the world can be used to guide decision-making, globally. Despite variations in drivers and needs across regions, nations in both the Global North and South need to improve WH and CE compliance, and enhance stakeholder partnership, awareness, and participation throughout the SWM process. Partnerships between the Global North and South could better manage traded wastes, reduce adverse impacts, and enhance global environmental sustainability and equity, supporting UN Sustainable Development Goals. Integr Environ Assess Manag 2024;20:9–35. © 2023 The Authors. Integrated Environmental Assessment and Management published by Wiley Periodicals LLC on behalf of Society of Environmental Toxicology & Chemistry (SETAC).",
        "DOI": "10.1002/ieam.4774",
        "paper_author": "Awino F.B.",
        "affiliation_name": "University of Canberra",
        "affiliation_city": "Canberra",
        "affiliation_country": "Australia",
        "affiliation_id": "60022193",
        "affiliation_state": "ACT"
    }
]