[
    {
        "paper_title": "Estimation of the global prevalence of dementia in 2019 and forecasted prevalence in 2050: an analysis for the Global Burden of Disease Study 2019",
        "publication": "The Lancet Public Health",
        "citied_by": "2306",
        "cover_date": "2022-02-01",
        "Abstract": "Background: Given the projected trends in population ageing and population growth, the number of people with dementia is expected to increase. In addition, strong evidence has emerged supporting the importance of potentially modifiable risk factors for dementia. Characterising the distribution and magnitude of anticipated growth is crucial for public health planning and resource prioritisation. This study aimed to improve on previous forecasts of dementia prevalence by producing country-level estimates and incorporating information on selected risk factors. Methods: We forecasted the prevalence of dementia attributable to the three dementia risk factors included in the Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) 2019 (high body-mass index, high fasting plasma glucose, and smoking) from 2019 to 2050, using relative risks and forecasted risk factor prevalence to predict GBD risk-attributable prevalence in 2050 globally and by world region and country. Using linear regression models with education included as an additional predictor, we then forecasted the prevalence of dementia not attributable to GBD risks. To assess the relative contribution of future trends in GBD risk factors, education, population growth, and population ageing, we did a decomposition analysis. Findings: We estimated that the number of people with dementia would increase from 57·4 (95% uncertainty interval 50·4–65·1) million cases globally in 2019 to 152·8 (130·8–175·9) million cases in 2050. Despite large increases in the projected number of people living with dementia, age-standardised both-sex prevalence remained stable between 2019 and 2050 (global percentage change of 0·1% [–7·5 to 10·8]). We estimated that there were more women with dementia than men with dementia globally in 2019 (female-to-male ratio of 1·69 [1·64–1·73]), and we expect this pattern to continue to 2050 (female-to-male ratio of 1·67 [1·52–1·85]). There was geographical heterogeneity in the projected increases across countries and regions, with the smallest percentage changes in the number of projected dementia cases in high-income Asia Pacific (53% [41–67]) and western Europe (74% [58–90]), and the largest in north Africa and the Middle East (367% [329–403]) and eastern sub-Saharan Africa (357% [323–395]). Projected increases in cases could largely be attributed to population growth and population ageing, although their relative importance varied by world region, with population growth contributing most to the increases in sub-Saharan Africa and population ageing contributing most to the increases in east Asia. Interpretation: Growth in the number of individuals living with dementia underscores the need for public health planning efforts and policy to address the needs of this group. Country-level estimates can be used to inform national planning efforts and decisions. Multifaceted approaches, including scaling up interventions to address modifiable risk factors and investing in research on biological mechanisms, will be key in addressing the expected increases in the number of individuals affected by dementia. Funding: Bill & Melinda Gates Foundation and Gates Ventures.",
        "DOI": "10.1016/S2468-2667(21)00249-8",
        "paper_author": "Nichols E.",
        "affiliation_name": "Institute for Health Metrics and Evaluation",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60091926",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Standards of Care for the Health of Transgender and Gender Diverse People, Version 8",
        "publication": "International Journal of Transgender Health",
        "citied_by": "1301",
        "cover_date": "2022-01-01",
        "Abstract": "Background: Transgender healthcare is a rapidly evolving interdisciplinary field. In the last decade, there has been an unprecedented increase in the number and visibility of transgender and gender diverse (TGD) people seeking support and gender-affirming medical treatment in parallel with a significant rise in the scientific literature in this area. The World Professional Association for Transgender Health (WPATH) is an international, multidisciplinary, professional association whose mission is to promote evidence-based care, education, research, public policy, and respect in transgender health. One of the main functions of WPATH is to promote the highest standards of health care for TGD people through the Standards of Care (SOC). The SOC was initially developed in 1979 and the last version (SOC-7) was published in 2012. In view of the increasing scientific evidence, WPATH commissioned a new version of the Standards of Care, the SOC-8. Aim: The overall goal of SOC-8 is to provide health care professionals (HCPs) with clinical guidance to assist TGD people in accessing safe and effective pathways to achieving lasting personal comfort with their gendered selves with the aim of optimizing their overall physical health, psychological well-being, and self-fulfillment. Methods: The SOC-8 is based on the best available science and expert professional consensus in transgender health. International professionals and stakeholders were selected to serve on the SOC-8 committee. Recommendation statements were developed based on data derived from independent systematic literature reviews, where available, background reviews and expert opinions. Grading of recommendations was based on the available evidence supporting interventions, a discussion of risks and harms, as well as the feasibility and acceptability within different contexts and country settings. Results: A total of 18 chapters were developed as part of the SOC-8. They contain recommendations for health care professionals who provide care and treatment for TGD people. Each of the recommendations is followed by explanatory text with relevant references. General areas related to transgender health are covered in the chapters Terminology, Global Applicability, Population Estimates, and Education. The chapters developed for the diverse population of TGD people include Assessment of Adults, Adolescents, Children, Nonbinary, Eunuchs, and Intersex Individuals, and people living in Institutional Environments. Finally, the chapters related to gender-affirming treatment are Hormone Therapy, Surgery and Postoperative Care, Voice and Communication, Primary Care, Reproductive Health, Sexual Health, and Mental Health. Conclusions: The SOC-8 guidelines are intended to be flexible to meet the diverse health care needs of TGD people globally. While adaptable, they offer standards for promoting optimal health care and guidance for the treatment of people experiencing gender incongruence. As in all previous versions of the SOC, the criteria set forth in this document for gender-affirming medical interventions are clinical guidelines; individual health care professionals and programs may modify these in consultation with the TGD person.",
        "DOI": "10.1080/26895269.2022.2100644",
        "paper_author": "Coleman E.",
        "affiliation_name": "University of Minnesota Medical School",
        "affiliation_city": "Minneapolis",
        "affiliation_country": "United States",
        "affiliation_id": "60008772",
        "affiliation_state": "MN"
    },
    {
        "paper_title": "Global prevalence of autism: A systematic review update",
        "publication": "Autism Research",
        "citied_by": "1254",
        "cover_date": "2022-05-01",
        "Abstract": "Prevalence estimates of autism are essential for informing public policy, raising awareness, and developing research priorities. Using a systematic review, we synthesized estimates of the prevalence of autism worldwide. We examined factors accounting for variability in estimates and critically reviewed evidence relevant for hypotheses about biological or social determinants (viz., biological sex, sociodemographic status, ethnicity/race, and nativity) potentially modifying prevalence estimates of autism. We performed the search in November 2021 within Medline for studies estimating autism prevalence, published since our last systematic review in 2012. Data were extracted by two independent researchers. Since 2012, 99 estimates from 71 studies were published indicating a global autism prevalence that ranges within and across regions, with a median prevalence of 100/10,000 (range: 1.09/10,000 to 436.0/10,000). The median male-to-female ratio was 4.2. The median percentage of autism cases with co-occurring intellectual disability was 33.0%. Estimates varied, likely reflecting complex and dynamic interactions between patterns of community awareness, service capacity, help seeking, and sociodemographic factors. A limitation of this review is that synthesizing methodological features precludes a quality appraisal of studies. Our findings reveal an increase in measured autism prevalence globally, reflecting the combined effects of multiple factors including the increase in community awareness and public health response globally, progress in case identification and definition, and an increase in community capacity. Hypotheses linking factors that increase the likelihood of developing autism with variations in prevalence will require research with large, representative samples and comparable autism diagnostic criteria and case-finding methods in diverse world regions over time. Lay Summary: We reviewed studies of the prevalence of autism worldwide, considering the impact of geographic, ethnic, and socioeconomic factors on prevalence estimates. Approximately 1/100 children are diagnosed with autism spectrum disorder around the world. Prevalence estimates increased over time and varied greatly within and across sociodemographic groups. These findings reflect changes in the definition of autism and differences in the methodology and contexts of prevalence studies.",
        "DOI": "10.1002/aur.2696",
        "paper_author": "Zeidan J.",
        "affiliation_name": "Institut-Hôpital Neurologique de Montréal",
        "affiliation_city": "Montreal",
        "affiliation_country": "Canada",
        "affiliation_id": "60030616",
        "affiliation_state": "QC"
    },
    {
        "paper_title": "Life's Essential 8: Updating and Enhancing the American Heart Association's Construct of Cardiovascular Health: A Presidential Advisory from the American Heart Association",
        "publication": "Circulation",
        "citied_by": "1190",
        "cover_date": "2022-08-02",
        "Abstract": "In 2010, the American Heart Association defined a novel construct of cardiovascular health to promote a paradigm shift from a focus solely on disease treatment to one inclusive of positive health promotion and preservation across the life course in populations and individuals. Extensive subsequent evidence has provided insights into strengths and limitations of the original approach to defining and quantifying cardiovascular health. In response, the American Heart Association convened a writing group to recommend enhancements and updates. The definition and quantification of each of the original metrics (Life's Simple 7) were evaluated for responsiveness to interindividual variation and intraindividual change. New metrics were considered, and the age spectrum was expanded to include the entire life course. The foundational contexts of social determinants of health and psychological health were addressed as crucial factors in optimizing and preserving cardiovascular health. This presidential advisory introduces an enhanced approach to assessing cardiovascular health: Life's Essential 8. The components of Life's Essential 8 include diet (updated), physical activity, nicotine exposure (updated), sleep health (new), body mass index, blood lipids (updated), blood glucose (updated), and blood pressure. Each metric has a new scoring algorithm ranging from 0 to 100 points, allowing generation of a new composite cardiovascular health score (the unweighted average of all components) that also varies from 0 to 100 points. Methods for implementing cardiovascular health assessment and longitudinal monitoring are discussed, as are potential data sources and tools to promote widespread adoption in policy, public health, clinical, institutional, and community settings.",
        "DOI": "10.1161/CIR.0000000000001078",
        "paper_author": "Lloyd-Jones D.M.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Pollution and health: a progress update",
        "publication": "The Lancet Planetary Health",
        "citied_by": "999",
        "cover_date": "2022-06-01",
        "Abstract": "The Lancet Commission on pollution and health reported that pollution was responsible for 9 million premature deaths in 2015, making it the world's largest environmental risk factor for disease and premature death. We have now updated this estimate using data from the Global Burden of Diseases, Injuriaes, and Risk Factors Study 2019. We find that pollution remains responsible for approximately 9 million deaths per year, corresponding to one in six deaths worldwide. Reductions have occurred in the number of deaths attributable to the types of pollution associated with extreme poverty. However, these reductions in deaths from household air pollution and water pollution are offset by increased deaths attributable to ambient air pollution and toxic chemical pollution (ie, lead). Deaths from these modern pollution risk factors, which are the unintended consequence of industrialisation and urbanisation, have risen by 7% since 2015 and by over 66% since 2000. Despite ongoing efforts by UN agencies, committed groups, committed individuals, and some national governments (mostly in high-income countries), little real progress against pollution can be identified overall, particularly in the low-income and middle-income countries, where pollution is most severe. Urgent attention is needed to control pollution and prevent pollution-related disease, with an emphasis on air pollution and lead poisoning, and a stronger focus on hazardous chemical pollution. Pollution, climate change, and biodiversity loss are closely linked. Successful control of these conjoined threats requires a globally supported, formal science–policy interface to inform intervention, influence research, and guide funding. Pollution has typically been viewed as a local issue to be addressed through subnational and national regulation or, occasionally, using regional policy in higher-income countries. Now, however, it is increasingly clear that pollution is a planetary threat, and that its drivers, its dispersion, and its effects on health transcend local boundaries and demand a global response. Global action on all major modern pollutants is needed. Global efforts can synergise with other global environmental policy programmes, especially as a large-scale, rapid transition away from all fossil fuels to clean, renewable energy is an effective strategy for preventing pollution while also slowing down climate change, and thus achieves a double benefit for planetary health.",
        "DOI": "10.1016/S2542-5196(22)00090-0",
        "paper_author": "Fuller R.",
        "affiliation_name": "Global Alliance on Health and Pollution",
        "affiliation_city": "Geneva",
        "affiliation_country": "Switzerland",
        "affiliation_id": "128222245",
        "affiliation_state": "GE"
    },
    {
        "paper_title": "The Global Burden of Cardiovascular Diseases and Risk: A Compass for Future Health",
        "publication": "Journal of the American College of Cardiology",
        "citied_by": "856",
        "cover_date": "2022-12-20",
        "Abstract": "NA",
        "DOI": "10.1016/j.jacc.2022.11.005",
        "paper_author": "Vaduganathan M.",
        "affiliation_name": "Brigham and Women's Hospital",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60016782",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "How does green finance affect green total factor productivity? Evidence from China",
        "publication": "Energy Economics",
        "citied_by": "733",
        "cover_date": "2022-03-01",
        "Abstract": "While the literature has studied various factors affecting green productivity growth, there is a relative dearth of empirical studies quantitatively analyzing the linkage between green finance development and green productivity. Based on a comprehensive index of green finance development, this research thus employs panel data of 30 China's provinces for the period 2006–2018 to explore the influence of green finance on green total factor productivity, revealing estimation results that green finance development significantly improves the level of green productivity. This beneficial effect tends to be stronger in provinces with higher levels of economic and social conditions, less public participation in environmental protection, and high pollution levels. We also find that implementing a green finance policy can further enhance the impact of green finance development. The empirical results herein offer policy implications to China's green finance planning and environmental policy.",
        "DOI": "10.1016/j.eneco.2022.105863",
        "paper_author": "Lee C.C.",
        "affiliation_name": "Southwestern University of Finance and Economics",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60018540",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Symptom prevalence, duration, and risk of hospital admission in individuals infected with SARS-CoV-2 during periods of omicron and delta variant dominance: a prospective observational study from the ZOE COVID Study",
        "publication": "The Lancet",
        "citied_by": "617",
        "cover_date": "2022-04-23",
        "Abstract": "Background: The SARS-CoV-2 variant of concern, omicron, appears to be less severe than delta. We aim to quantify the differences in symptom prevalence, risk of hospital admission, and symptom duration among the vaccinated population. Methods: In this prospective longitudinal observational study, we collected data from participants who were self-reporting test results and symptoms in the ZOE COVID app (previously known as the COVID Symptoms Study App). Eligible participants were aged 16–99 years, based in the UK, with a body-mass index between 15 and 55 kg/m2, had received at least two doses of any SARS-CoV-2 vaccine, were symptomatic, and logged a positive symptomatic PCR or lateral flow result for SARS-CoV-2 during the study period. The primary outcome was the likelihood of developing a given symptom (of the 32 monitored in the app) or hospital admission within 7 days before or after the positive test in participants infected during omicron prevalence compared with those infected during delta prevalence. Findings: Between June 1, 2021, and Jan 17, 2022, we identified 63 002 participants who tested positive for SARS-CoV-2 and reported symptoms in the ZOE app. These patients were matched 1:1 for age, sex, and vaccination dose, across two periods (June 1 to Nov 27, 2021, delta prevalent at >70%; n=4990, and Dec 20, 2021, to Jan 17, 2022, omicron prevalent at >70%; n=4990). Loss of smell was less common in participants infected during omicron prevalence than during delta prevalence (16·7% vs 52·7%, odds ratio [OR] 0·17; 95% CI 0·16–0·19, p<0·001). Sore throat was more common during omicron prevalence than during delta prevalence (70·5% vs 60·8%, 1·55; 1·43–1·69, p<0·001). There was a lower rate of hospital admission during omicron prevalence than during delta prevalence (1·9% vs 2·6%, OR 0·75; 95% CI 0·57–0·98, p=0·03). Interpretation: The prevalence of symptoms that characterise an omicron infection differs from those of the delta SARS-CoV-2 variant, apparently with less involvement of the lower respiratory tract and reduced probability of hospital admission. Our data indicate a shorter period of illness and potentially of infectiousness which should impact work–health policies and public health advice. Funding: Wellcome Trust, ZOE, National Institute for Health Research, Chronic Disease Research Foundation, National Institutes of Health, and Medical Research Council",
        "DOI": "10.1016/S0140-6736(22)00327-0",
        "paper_author": "Menni C.",
        "affiliation_name": "King's College London",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60011520",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Global, regional, and national prevalence estimates of physical or sexual, or both, intimate partner violence against women in 2018",
        "publication": "The Lancet",
        "citied_by": "551",
        "cover_date": "2022-02-26",
        "Abstract": "Background: Intimate partner violence against women is a global public health problem with many short-term and long-term effects on the physical and mental health of women and their children. The Sustainable Development Goals (SDGs) call for its elimination in target 5.2. To monitor governments' progress towards SDG target 5.2, this study aimed to provide global, regional, and country baseline estimates of physical or sexual, or both, violence against women by male intimate partners. Methods: This study developed global, regional, and country estimates, based on data from the WHO Global Database on Prevalence of Violence Against Women. These data were identified through a systematic literature review searching MEDLINE, Global Health, Embase, Social Policy, and Web of Science, and comprehensive searches of national statistics and other websites. A country consultation process identified additional studies. Included studies were conducted between 2000 and 2018, representative at the national or sub-national level, included women aged 15 years or older, and used act-based measures of physical or sexual, or both, intimate partner violence. Non-population-based data, including administrative data, studies not generalisable to the whole population, studies with outcomes that only provided the combined prevalence of physical or sexual, or both, intimate partner violence with other forms of violence, and studies with insufficient data to allow extrapolation or imputation were excluded. We developed a Bayesian multilevel model to jointly estimate lifetime and past year intimate partner violence by age, year, and country. This framework adjusted for heterogeneous age groups and differences in outcome definition, and weighted surveys depending on whether they were nationally or sub-nationally representative. This study is registered with PROSPERO (number CRD42017054100). Findings: The database comprises 366 eligible studies, capturing the responses of 2 million women. Data were obtained from 161 countries and areas, covering 90% of the global population of women and girls (15 years or older). Globally, 27% (uncertainty interval [UI] 23–31%) of ever-partnered women aged 15–49 years are estimated to have experienced physical or sexual, or both, intimate partner violence in their lifetime, with 13% (10–16%) experiencing it in the past year before they were surveyed. This violence starts early, affecting adolescent girls and young women, with 24% (UI 21–28%) of women aged 15–19 years and 26% (23–30%) of women aged 19–24 years having already experienced this violence at least once since the age of 15 years. Regional variations exist, with low-income countries reporting higher lifetime and, even more pronouncedly, higher past year prevalence compared with high-income countries. Interpretation: These findings show that intimate partner violence against women was already highly prevalent across the globe before the COVID-19 pandemic. Governments are not on track to meet the SDG targets on the elimination of violence against women and girls, despite robust evidence that intimate partner violence can be prevented. There is an urgent need to invest in effective multisectoral interventions, strengthen the public health response to intimate partner violence, and ensure it is addressed in post-COVID-19 reconstruction efforts. Funding: UK Department for International Development through the UN Women–WHO Joint Programme on Strengthening Violence against Women Data, and UNDP-UN Population Fund-UNICEF-WHO-World Bank Special Programme of Research, Development, and Research Training in Human Reproduction, a cosponsored programme executed by WHO.",
        "DOI": "10.1016/S0140-6736(21)02664-7",
        "paper_author": "Sardinha L.",
        "affiliation_name": "Organisation Mondiale de la Santé",
        "affiliation_city": "Geneva",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60027142",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Policy Statement: Breastfeeding and the Use of Human Milk",
        "publication": "Pediatrics",
        "citied_by": "519",
        "cover_date": "2022-07-01",
        "Abstract": "Breastfeeding and human milk are the normative standards for infant feeding and nutrition. The short- and long-term medical and neurodevelopmental advantages of breastfeeding make breastfeeding, or the provision of human milk, a public health imperative. The American Academy of Pediatrics (AAP) recommends exclusive breastfeeding for approximately 6 months after birth. Furthermore, the AAP supports continued breastfeeding, along with appropriate complementary foods introduced at about 6 months, as long as mutually desired by mother and child for 2 years or beyond. These recommendations are consistent with those of the World Health Organization (WHO). Medical contraindications to breastfeeding are rare. The AAP recommends that birth hospitals or centers implement maternity care practices shown to improve breastfeeding initiation, duration, and exclusivity. The Centers for Disease Control and Prevention (CDC) and The Joint Commission monitor breastfeeding practices in US hospitals. Pediatricians play a critical role in hospitals, their practices, and communities as advocates of breastfeeding and, thus, need to be trained about the benefits of breastfeeding for mothers and children and in managing breastfeeding.",
        "DOI": "10.1542/peds.2022-057988",
        "paper_author": "Meek J.Y.",
        "affiliation_name": "Florida State University College of Medicine",
        "affiliation_city": "Tallahassee",
        "affiliation_country": "United States",
        "affiliation_id": "60026141",
        "affiliation_state": "FL"
    },
    {
        "paper_title": "The linkages between natural resources, human capital, globalization, economic growth, financial development, and ecological footprint: The moderating role of technological innovations",
        "publication": "Resources Policy",
        "citied_by": "509",
        "cover_date": "2022-06-01",
        "Abstract": "Ensuring a balance between economic and ecological well-being has emerged as a key concern for governments worldwide. In the contemporary era, the global economies, especially the developing ones, emphasize the relevance of achieving eco-friendly growth whereby the ecological footprint figures are aimed to be contained alongside higher economic growth. However, in the majority of the cases, the developing countries are flourishing economically but are struggling to curb their ecological footprint levels. Against this backdrop, this study aimed to check whether or not technological innovation, natural resource consumption, globalization, economic growth, human capital development, and financial development influence the ecological footprint figures in 73 developing countries over the period from 1990 to 2016. Besides, to capture the possible heterogeneity of the outcomes, this study also conducted the analysis using sub-samples of countries belonging to the Asian, African, and Latin American and Caribbean regions. Moreover, in order to estimate the robust and reliable outcomes, this study employed the second-generation panel unit root and long-run cointegration tests. The overall results indicated that the variables have a mixed order of integration and are cointegrated. On the other hand, the long-run regression outcomes show that natural resource consumption significantly increases ecological footprint while technological innovations help to inhibit them. In addition, technological innovation was evidenced to exert a moderating effect to reduce the negative environmental consequences associated with natural resource consumption. Interestingly, these findings are homogenous for countries across all three regions. Also, globalization was witnessed to reduce the ecological footprint of African and Latin American countries only. Besides, the environmental Kuznets curve hypothesis is verified for the African and the Latin American and Caribbean nations but not for the cases of the Asian countries. Lastly, financial development was found to decrease ecological footprints overall, and for the Asian countries but not for the African and Latin American and Caribbean countries. Among the major policy recommendations, this study suggests the governments of the developing nations to adopt relevant policies regarding making efficient use of natural resources through technological innovations. In addition, the future human capital development, globalization, economic growth, and financial development policies should be aligned with the sustainable environmental development objectives.",
        "DOI": "10.1016/j.resourpol.2022.102569",
        "paper_author": "Jahanger A.",
        "affiliation_name": "Hainan University",
        "affiliation_city": "Haikou",
        "affiliation_country": "China",
        "affiliation_id": "60017716",
        "affiliation_state": "Hainan"
    },
    {
        "paper_title": "Global incidence, prevalence, and mortality of type 1 diabetes in 2021 with projection to 2040: a modelling study",
        "publication": "The Lancet Diabetes and Endocrinology",
        "citied_by": "499",
        "cover_date": "2022-10-01",
        "Abstract": "Background: Accurate data on type 1 diabetes prevalence, incidence, associated mortality and life expectancy are crucial to inform public health policy, but these data are scarce. We therefore developed a model based on available data to estimate these values for 201 countries for the year 2021 and estimate the projected prevalent cases in 2040. Methods: We fitted a discrete-time illness-death model (Markov model) to data on type 1 diabetes incidence and type 1 diabetes-associated mortality to produce type 1 diabetes prevalence, incidence, associated mortality and life expectancy in all countries. Type 1 diabetes incidence and mortality data were available from 97 and 37 countries respectively. Diagnosis rates were estimated using data from an expert survey. Mortality was modelled using random-forest regression of published type 1 diabetes mortality data, and life expectancy was calculated accordingly using life tables. Estimates were validated against observed prevalence data for 15 countries. We also estimated missing prevalence (the number of additional people who would be alive with type 1 diabetes if their mortality matched general population rates). Findings: In 2021, there were about 8·4 (95% uncertainty interval 8·1–8·8) million individuals worldwide with type 1 diabetes: of these 1·5 million (18%) were younger than 20 years, 5·4 million (64%) were aged 20–59 years, and 1·6 million (19%) were aged 60 years or older. In that year there were 0·5 million new cases diagnosed (median age of onset 39 years), about 35 000 non-diagnosed individuals died within 12 months of symptomatic onset. One fifth (1·8 million) of individuals with type 1 diabetes were in low-income and lower-middle-income countries. Remaining life expectancy of a 10-year-old diagnosed with type 1 diabetes in 2021 ranged from a mean of 13 years in low-income countries to 65 years in high-income countries. Missing prevalent cases in 2021 were estimated at 3·7 million. In 2040, we predict an increase in prevalent cases to 13·5–17·4 million (60–107% higher than in 2021) with the largest relative increase versus 2021 in low-income and lower-middle-income countries. Interpretation: The burden of type 1 diabetes in 2021 is vast and is expected to increase rapidly, especially in resource-limited countries. Most incident and prevalent cases are adults. The substantial missing prevalence highlights the premature mortality of type 1 diabetes and an opportunity to save and extend lives of people with type 1 diabetes. Our new model, which will be made publicly available as the Type 1 Diabetes Index model, will be an important tool to support health delivery, advocacy, and funding decisions for type 1 diabetes. Funding: JDRF International.",
        "DOI": "10.1016/S2213-8587(22)00218-2",
        "paper_author": "Gregory G.A.",
        "affiliation_name": "Diabetes NSW",
        "affiliation_city": "Sydney",
        "affiliation_country": "Australia",
        "affiliation_id": "126233451",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "Advancing the global public health agenda for NAFLD: a consensus statement",
        "publication": "Nature Reviews Gastroenterology and Hepatology",
        "citied_by": "471",
        "cover_date": "2022-01-01",
        "Abstract": "Non-alcoholic fatty liver disease (NAFLD) is a potentially serious liver disease that affects approximately one-quarter of the global adult population, causing a substantial burden of ill health with wide-ranging social and economic implications. It is a multisystem disease and is considered the hepatic component of metabolic syndrome. Unlike other highly prevalent conditions, NAFLD has received little attention from the global public health community. Health system and public health responses to NAFLD have been weak and fragmented, and, despite its pervasiveness, NAFLD is largely unknown outside hepatology and gastroenterology. There is only a nascent global public health movement addressing NAFLD, and the disease is absent from nearly all national and international strategies and policies for non-communicable diseases, including obesity. In this global Delphi study, a multidisciplinary group of experts developed consensus statements and recommendations, which a larger group of collaborators reviewed over three rounds until consensus was achieved. The resulting consensus statements and recommendations address a broad range of topics — from epidemiology, awareness, care and treatment to public health policies and leadership — that have general relevance for policy-makers, health-care practitioners, civil society groups, research institutions and affected populations. These recommendations should provide a strong foundation for a comprehensive public health response to NAFLD.",
        "DOI": "10.1038/s41575-021-00523-4",
        "paper_author": "Lazarus J.V.",
        "affiliation_name": "Universitat de Barcelona",
        "affiliation_city": "Barcelona",
        "affiliation_country": "Spain",
        "affiliation_id": "60001576",
        "affiliation_state": "Barcelona"
    },
    {
        "paper_title": "The Lancet Commission on lessons for the future from the COVID-19 pandemic",
        "publication": "The Lancet",
        "citied_by": "448",
        "cover_date": "2022-10-08",
        "Abstract": "NA",
        "DOI": "10.1016/S0140-6736(22)01585-9",
        "paper_author": "Sachs J.D.",
        "affiliation_name": "Columbia University",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60030162",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Can digital transformation promote enterprise performance? —From the perspective of public policy and innovation",
        "publication": "Journal of Innovation and Knowledge",
        "citied_by": "384",
        "cover_date": "2022-07-01",
        "Abstract": "As a new enterprise development model, digitization is of great significance to the development of economy and society. Using the data of relevant listed companies from 2012 to 2020, the panel measurement model is used to investigate the relationship between digital transformation and enterprise performance to further reveal the internal law of whether digital transformation helps to stimulate innovation momentum. The results show that digital transformation has greatly improved the performance of enterprises, and it can stimulate the momentum of enterprise innovation. Reducing costs, increasing revenue, improving efficiency, and encouraging innovation are the main paths for digital transformation to enable the development of enterprises, among which the policy effect of enterprise innovation is the most significant. This research is of great significance to improve the user demand orientation of enterprise innovation and research and development, as well as to realize the high-quality innovation and development of enterprises.",
        "DOI": "10.1016/j.jik.2022.100198",
        "paper_author": "Peng Y.",
        "affiliation_name": "East China Institute of Technology",
        "affiliation_city": "Fuzhou",
        "affiliation_country": "China",
        "affiliation_id": "60080101",
        "affiliation_state": "Jiangxi"
    },
    {
        "paper_title": "2019 Global NAFLD Prevalence: A Systematic Review and Meta-analysis",
        "publication": "Clinical Gastroenterology and Hepatology",
        "citied_by": "381",
        "cover_date": "2022-12-01",
        "Abstract": "Background & Aims: The increasing rates of obesity and type 2 diabetes mellitus may lead to increased prevalence of nonalcoholic fatty liver disease (NAFLD). We aimed to determine the current and recent trends on the global and regional prevalence of NAFLD. Methods: Systematic search from inception to March 26, 2020 was performed without language restrictions. Two authors independently performed screening and data extraction. We performed meta-regression to determine trends in NAFLD prevalence. Results: We identified 17,244 articles from literature search and included 245 eligible studies involving 5,399,254 individuals. The pooled global prevalence of NAFLD was 29.8% (95% confidence interval [CI], 28.6%–31.1%); of these, 82.5% of included articles used ultrasound to diagnose NAFLD, with prevalence of 30.6% (95% CI, 29.2%–32.0%). South America (3 studies, 5716 individuals) and North America (4 studies, 18,236 individuals) had the highest NAFLD prevalence at 35.7% (95% CI, 34.0%–37.5%) and 35.3% (95% CI, 25.4%–45.9%), respectively. From 1991 to 2019, trend analysis showed NAFLD increased from 21.9% to 37.3% (yearly increase of 0.7%, P < .0001), with South America showing the most rapid change of 2.7% per year, followed by Europe at 1.1%. Conclusions: Despite regional variation, the global prevalence of NAFLD is increasing overall. Policy makers must work toward reversing the current trends by increasing awareness of NAFLD and promoting healthy lifestyle environments.",
        "DOI": "10.1016/j.cgh.2021.12.002",
        "paper_author": "Le M.H.",
        "affiliation_name": "Stanford Healthcare",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60015615",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "One Health: A new definition for a sustainable and healthy future",
        "publication": "PLoS Pathogens",
        "citied_by": "376",
        "cover_date": "2022-06-01",
        "Abstract": "NA",
        "DOI": "10.1371/journal.ppat.1010537",
        "paper_author": "Adisasmito W.B.",
        "affiliation_name": "Universitas Indonesia",
        "affiliation_city": "Depok",
        "affiliation_country": "Indonesia",
        "affiliation_id": "60069377",
        "affiliation_state": "West Java"
    },
    {
        "paper_title": "Climate Endgame: Exploring catastrophic climate change scenarios",
        "publication": "Proceedings of the National Academy of Sciences of the United States of America",
        "citied_by": "367",
        "cover_date": "2022-08-23",
        "Abstract": "Prudent risk management requires consideration of bad-to-worst-case scenarios. Yet, for climate change, such potential futures are poorly understood. Could anthropogenic climate change result in worldwide societal collapse or even eventual human extinction? At present, this is a dangerously underexplored topic. Yet there are ample reasons to suspect that climate change could result in a global catastrophe. Analyzing the mechanisms for these extreme consequences could help galvanize action, improve resilience, and inform policy, including emergency responses. We outline current knowledge about the likelihood of extreme climate change, discuss why understanding bad-to-worst cases is vital, articulate reasons for concern about catastrophic outcomes, define key terms, and put forward a research agenda. The proposed agenda covers four main questions: 1) What is the potential for climate change to drive mass extinction events? 2) What are the mechanisms that could result in human mass mortality and morbidity? 3) What are human societies' vulnerabilities to climate-triggered risk cascades, such as from conflict, political instability, and systemic financial risk? 4) How can these multiple strands of evidence—together with other global dangers—be usefully synthesized into an “integrated catastrophe assessment”? It is time for the scientific community to grapple with the challenge of better understanding catastrophic climate change.",
        "DOI": "10.1073/pnas.2108146119",
        "paper_author": "Kemp L.",
        "affiliation_name": "University of Cambridge",
        "affiliation_city": "Cambridge",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60031101",
        "affiliation_state": "Cambridgeshire"
    },
    {
        "paper_title": "Environmental concern in the era of industrialization: Can financial development, renewable energy and natural resources alleviate some load?",
        "publication": "Energy Policy",
        "citied_by": "357",
        "cover_date": "2022-03-01",
        "Abstract": "Economic development accelerates the process of industrialization that has amplified the worth of extracted natural resources. Extensive exploitation of natural resources through total reserves, financial development, and renewable energy can influence the atmosphere. In view of this, this study examines the influence of industrialization, total reserves and the expansion of financial, renewable and natural resources on the ecological footprint. This research applies panel data for the period from 1990 to 2019 in newly industrialized countries. The findings of the augmented mean group (AMG) panel algorithm are robust to heterogeneity, and cross-sectional dependence points to the heterogeneous effect of industrialization, total reserves and financial development in significantly driving environmental pollution in these countries. In contrast, the abundance of natural resources and renewable energy significantly mitigates environmental pollution in the long-run. These results are also consistent with long-run and disaggregate level estimation. Moreover, the panel Dumitrescu and Hurlin causality test results revealed a unidirectional causality association from industrialization and renewable energy to ecological footprint and from ecological footprint to natural resources. A bidirectional causality relation was also found between financial development and total reserves, and the ecological footprint. Finally, several important policy implications are suggested to protect environmental quality in newly industrialized countries.",
        "DOI": "10.1016/j.enpol.2022.112780",
        "paper_author": "Usman M.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "A critical review on deployment planning and risk analysis of carbon capture, utilization, and storage (CCUS) toward carbon neutrality",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "351",
        "cover_date": "2022-10-01",
        "Abstract": "With the proposal to achieve carbon neutrality by the mid-21st century, carbon capture, utilization, and storage (CCUS) as a critical negative carbon technology is receiving extensive attention and concerns around the world. Under this context, the development of CCUS and relevant literature both have been experiencing an upsurge. However, the actual scale of CCUS is still far behind our expectations, especially, the various risks and uncertainties associated with its deployment planning have not yet been addressed clearly. Therefore, this paper provides an overview of model-based CCUS deployment pathways toward carbon neutrality, as well as the associated risks of financial, technical, environmental, health and safety (EHS) aspects. On this basis, we scrutinize the potential challenges that could lead to the pace of CCUS deployment inconsistent with the need to achieve a carbon-neutral target. The results suggest that the “Golden Age” of CCUS deployment lies from 2040 to 2060 in the world, while 2030–2050 for China. Furthermore, we found that inadequate exploration in geologic storage capacity also creates a critical conundrum for CCUS deployment and optimization, apart from typical challenges including high failure rate of projects, the lack of financial support and market stimulus, as well as incomplete regulation framework and risk-sharing mechanism. Lastly, this paper points out the further potential research direction, followed by policy implications and recommendations.",
        "DOI": "10.1016/j.rser.2022.112537",
        "paper_author": "Chen S.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The impact of digital economy on energy transition across the globe: The mediating role of government governance",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "336",
        "cover_date": "2022-09-01",
        "Abstract": "Considering the potential relationship between the digital economy and energy transition, we investigate the effect of the digital economy on the structure of renewable energy consumption and generation by employing panel data of 72 countries covering the period 2003–2019. We also investigate the mediating effect of government governance, asymmetry, and heterogeneity between the digital economy and energy transition, and draw several results. First, the digital economy positively affects energy transition; in other words, a 1% increase in the digital economy will boost the renewable energy consumption structure by 0.021% and renewable energy generation structure by 0.106%. Moreover, the digital economy stimulates the renewable energy transition by promoting governments’ governance capabilities. In addition, according to the asymmetric check, the positive effect of the digital economy on energy transition is stronger at higher quantiles. Finally, heterogeneity results indicate that the digital economy positively contributes to renewable energy transition in the high-income countries, and there are regional heterogeneities in the impact of the digital economy on energy transition. These research findings offer valuable policy implications for governments and scholars.",
        "DOI": "10.1016/j.rser.2022.112620",
        "paper_author": "Shahbaz M.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Estimation of China’s terrestrial ecosystem carbon sink: Methods, progress and prospects",
        "publication": "Science China Earth Sciences",
        "citied_by": "321",
        "cover_date": "2022-04-01",
        "Abstract": "China announced its national goal to reach the peak of carbon emission by 2030 and achieve carbon neutrality by 2060, during the General Assembly of the United Nations in September 2020. In this context, the potential of the carbon sink in China’s terrestrial ecosystems to mitigate anthropogenic carbon emissions has attracted unprecedented attention from scientific communities, policy makers and the public. Here, we reviewed the assessments on China’s terrestrial ecosystem carbon sink, with focus on the principles, frameworks and methods of terrestrial ecosystem carbon sink estimates, as well as the recent progress and existing problems. Looking forward, we identified critical issues for improving the accuracy and precision of China’s terrestrial ecosystem carbon sink, in order to serve the more realistic policy making in pathways to achieve carbon neutrality for China.",
        "DOI": "10.1007/s11430-021-9892-6",
        "paper_author": "Piao S.",
        "affiliation_name": "Peking University",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014966",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "EAACI guidelines: Anaphylaxis (2021 update)",
        "publication": "Allergy: European Journal of Allergy and Clinical Immunology",
        "citied_by": "321",
        "cover_date": "2022-02-01",
        "Abstract": "Anaphylaxis is a clinical emergency which all healthcare professionals need to be able to recognize and manage. The European Academy of Allergy and Clinical Immunology Anaphylaxis multidisciplinary Task Force has updated the 2014 guideline. The guideline was developed using the AGREE II framework and the GRADE approach. The evidence was systematically reviewed and recommendations were created by weighing up benefits and harms. The guideline was peer-reviewed by external experts and reviewed in a public consultation. The use of clinical criteria to identify anaphylaxis is suggested with blood sampling for the later measurement of tryptase. The prompt use of intramuscular adrenaline as first-line management is recommended with the availability of adrenaline autoinjectors to patients in the community. Pharmacokinetic data should be provided for adrenaline autoinjector devices. Structured, comprehensive training for people at risk of anaphylaxis is recommended. Simulation training and visual prompts for healthcare professionals are suggested to improve the management of anaphylaxis. It is suggested that school policies reflect anaphylaxis guidelines. The evidence for the management of anaphylaxis remains mostly at a very low level. There is an urgent need to prioritize clinical trials with the potential to improve the management of patients at risk of anaphylaxis.",
        "DOI": "10.1111/all.15032",
        "paper_author": "Muraro A.",
        "affiliation_name": "Azienda Ospedale Università Padova",
        "affiliation_city": "Padua",
        "affiliation_country": "Italy",
        "affiliation_id": "60027298",
        "affiliation_state": "PD"
    },
    {
        "paper_title": "Measuring Sex, Gender Identity, and Sexual Orientation",
        "publication": "Measuring Sex, Gender Identity, and Sexual Orientation",
        "citied_by": "314",
        "cover_date": "2022-01-01",
        "Abstract": "An ad hoc panel of the National Academies of Sciences, Engineering, and Medicine will review current measures and the methodological issues related to measuring sex as a non-binary construct, gender identity, and sexual orientation in surveys and research studies, in administrative settings (such as grant and job applications), and in clinical settings (such as doctors' offices or clinical trials). As part of its information-gathering activities, the panel will hold a virtual, 1.5-day public workshop to get input from researchers in sexual and gender minority health and well-being, academic and government researchers doing work on measuring these concepts, members of sexual and gender diverse populations, and policy makers and other users of these data. The panel will produce a consensus report with conclusions and recommendations on 1) guiding principles for collecting data on sex, gender identity, and sexual orientation, and 2) recommended measures for these constructs in different settings.",
        "DOI": "10.17226/26424",
        "paper_author": "Bates N.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Biologically-mediated carbon capture and utilization by microalgae towards sustainable CO<inf>2</inf> biofixation and biomass valorization – A review",
        "publication": "Chemical Engineering Journal",
        "citied_by": "300",
        "cover_date": "2022-01-01",
        "Abstract": "The continuously rising emission of carbon dioxide (CO2) is a universal hazard which urgently requires collaborative action between policymakers and scientists. International treaties such as the Paris Agreement (with 196 signatories) reflect the importance of anthropogenic climate change as a truly global public concern. Towards the aim of climate recovery, the most broadly utilized CO2 reduction strategies, including carbon capture and storage (CCS); carbon capture, utilization, and storage (CCUS); and carbon capture and utilization (CCU) are reviewed herein. Of these methods, CCU shows the greatest potential by recycling captured CO2 and harnessing it as a resource to generate emissions-neutral or -negative value-added products (VAPs). Within CCU methodologies, biologically-mediated CCU (bio-CCU) by microalgae is a promising biotechnology to drastically reduce CO2 emissions. This review therefore details the mechanisms of photosynthesis to sequester CO2 and incorporate it into valuable biomolecules. Microalgal cells utilize CO2 as precursors of macromolecules, including lipids, proteins, carbohydrates, and pigments; all of which are discussed within the frame of industrial relevance and market value. The biofixation potential of microalgae is clearly demonstrated by the carbon content of the myriad VAPs they produce. Moreover, pathways towards decreasing carbon footprint (via carbon capture prior to emission to the atmosphere) and increasing carbon handprint (reducing carbon emissions by consuming CO2-neutral or -negative products) related to bio-CCU are presented herein. Finally, existing challenges and knowledge gaps are acknowledged and described, and future research needs are recommended.",
        "DOI": "10.1016/j.cej.2021.130884",
        "paper_author": "Daneshvar E.",
        "affiliation_name": "LUT University",
        "affiliation_city": "Lappeenranta",
        "affiliation_country": "Finland",
        "affiliation_id": "60014304",
        "affiliation_state": "South Karelia"
    },
    {
        "paper_title": "Diagnostics for COVID-19: moving from pandemic response to control",
        "publication": "The Lancet",
        "citied_by": "284",
        "cover_date": "2022-02-19",
        "Abstract": "Diagnostics have proven to be crucial to the COVID-19 pandemic response. There are three major methods for the detection of SARS-CoV-2 infection and their role has evolved during the course of the pandemic. Molecular tests such as PCR are highly sensitive and specific at detecting viral RNA, and are recommended by WHO for confirming diagnosis in individuals who are symptomatic and for activating public health measures. Antigen rapid detection tests detect viral proteins and, although they are less sensitive than molecular tests, have the advantages of being easier to do, giving a faster time to result, of being lower cost, and able to detect infection in those who are most likely to be at risk of transmitting the virus to others. Antigen rapid detection tests can be used as a public health tool for screening individuals at enhanced risk of infection, to protect people who are clinically vulnerable, to ensure safe travel and the resumption of schooling and social activities, and to enable economic recovery. With vaccine roll-out, antibody tests (which detect the host's response to infection or vaccination) can be useful surveillance tools to inform public policy, but should not be used to provide proof of immunity, as the correlates of protection remain unclear. All three types of COVID-19 test continue to have a crucial role in the transition from pandemic response to pandemic control.",
        "DOI": "10.1016/S0140-6736(21)02346-1",
        "paper_author": "Peeling R.W.",
        "affiliation_name": "London School of Hygiene &amp; Tropical Medicine",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60031331",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Tobacco Product Use and Associated Factors Among Middle and High School Students - National Youth Tobacco Survey, United States, 2021",
        "publication": "Morbidity and mortality weekly report. Surveillance summaries (Washington, D.C. : 2002)",
        "citied_by": "280",
        "cover_date": "2022-03-11",
        "Abstract": "PROBLEM/CONDITION: Commercial tobacco use is the leading cause of preventable disease, disability, and death in the United States. Most tobacco product use begins during adolescence. In recent years, tobacco products have evolved to include various combusted, smokeless, and electronic products.2021. DESCRIPTION OF SYSTEM: The National Youth Tobacco Survey (NYTS) is an annual, cross-sectional, school-based, self-administered survey of U.S. middle school (grades 6-8) and high school (grades 9-12) students. A three-stage cluster sampling procedure is used to generate a nationally representative sample of U.S. students attending public and private schools. NYTS is the only nationally representative survey of U.S. middle and high school students that focuses exclusively on tobacco use patterns and associated factors. NYTS provides data to support the design, implementation, and evaluation of comprehensive youth tobacco use prevention and control programs and to guide tobacco regulatory activities. Since 2019, NYTS has been administered electronically via tablet computers. Because of emergency COVID-19 protocols that were in place across the United States during the 2021 NYTS fielding window (January 18-May 21, 2021), the 2021 survey was administered using a web URL to allow participation by eligible students learning under varying instructional models (in-person, distance/virtual, and hybrid). In total, 50.8% of student respondents reported completing the survey in a school building or classroom and 49.2% at home or some other place. CDC and the Food and Drug Administration (FDA) analyzed data from the 2021 NYTS to assess tobacco product use patterns and associated factors among U.S. middle and high school students. Overall, 20,413 students (out of 25,149 sampled students; student response rate: 81.2%) completed the questionnaire from 279 schools (out of 508 sampled schools; school response rate: 54.9%). The overall response rate, defined as the product of the student and school response rates, was 44.6%. The sample was weighted to represent approximately 11.97 million middle school students and 15.44 million high school students. Students with missing information about grade level were excluded from the school-level analyses (n = 135). RESULTS: In 2021, an estimated 34.0% of high school students (5.22 million) and 11.3% of middle school students (1.34 million) reported ever using a tobacco product (i.e., electronic cigarettes [e-cigarettes], cigarettes, cigars, smokeless tobacco, hookahs, pipe tobacco, heated tobacco products, nicotine pouches, and bidis [small brown cigarettes wrapped in a leaf]). Current (past 30-day) use of a tobacco product was 13.4% for high school students (2.06 million) and 4.0% for middle school students (470,000). E-cigarettes were the most commonly currently used tobacco product, cited by 11.3% of high school students (1.72 million) and 2.8% of middle school students (320,000), followed by cigarettes, cigars, smokeless tobacco, hookahs, nicotine pouches, heated tobacco products, and pipe tobacco. Current use of any tobacco product was reported by 14.2% of students identifying as lesbian, gay, or bisexual (LGB) (versus 7.9% of heterosexual); 18.9% of students identifying as transgender (versus 8.2% of not transgender); and 14.2% of students reporting severe psychological distress (versus 5.5% with no distress). Among students who currently used each respective tobacco product, frequent use (on ≥20 days of the past 30 days) ranged from 17.2% for nicotine pouches to 39.4% for e-cigarettes. Among current users of any tobacco product, 79.1% reported using a flavored tobacco product; by product, e-cigarettes were the most commonly used flavored tobacco product. Among current users of any tobacco product, the most commonly reported source of access was from a friend (32.8%). Among students who currently used e-cigarettes, 53.7% used a disposable device, 28.7% used a prefilled/refillable pod or cartridge device, 9.0% used a tank or mod system (a system that can be customized by the user), and 8.6% did not know the device type. Among students who had ever used e-cigarettes, the most common reason for first trying them was \"a friend used them\" (57.8%); among current e-cigarette users, the most commonly cited reason for current use was \"I am feeling anxious, stressed, or depressed\" (43.4%). Among all middle and high school students, 75.2% reported past-year recognition of any antitobacco public education campaign ads. Exposure to marketing or advertising for any tobacco product was reported by 75.7% of students who had contact with an assessed potential source of tobacco product advertisements or promotions (going to a convenience store, supermarket, or gas station; using the Internet; watching television or streaming services or going to the movies; or reading newspapers or magazines). Among students who reported using social media, 73.5% had ever seen e-cigarette-related content. Among all students, perceiving \"no\" or \"little\" harm from intermittent tobacco product use was highest for e-cigarettes (16.6%) and lowest for cigarettes (9.6%). Among students who currently used any tobacco product, 27.2% had experienced cravings during the past 30 days; 19.5% reported wanting to use a tobacco product within 30 minutes of waking. Moreover, 65.3% of students who currently used tobacco products were seriously thinking about quitting the use of all products, and 60.2% had stopped using all products for ≥1 day because they were trying to quit during the past 12 months. INTERPRETATION: In 2021, approximately one in 10 U.S. middle and high school students (9.3%) had used a tobacco product during the preceding 30 days. By school level, this represented more than one in eight high school students (13.4%) and approximately one in 25 middle school students (4.0%). E-cigarettes were the most commonly used tobacco product in 2021. Tobacco product use was higher among certain subpopulations, such as those identifying as LGB or transgender, or those reporting psychological distress. Importantly, approximately two thirds of students who currently used tobacco products were seriously thinking about quitting. However, factors that might continue to promote tobacco product use among U.S. youths, such as the availability of flavors, access to tobacco products, exposure to tobacco product marketing, and misperceptions about harm from tobacco product use, remained prevalent in 2021. PUBLIC HEALTH ACTION: The continued monitoring of all forms of youth tobacco product use and associated factors through surveillance efforts including NYTS is important to the development of public health policy and action at national, state, and local levels. The 2021 NYTS was successfully administered during the COVID-19 pandemic using a web URL to allow participation by eligible students learning under varying instructional models. As a result of these modifications to the fielding procedures, any comparison of results between 2021 NYTS findings with previous years, including the direct attribution of any potential changes in tobacco product use, is not possible. Parents, educators, youth advocates, and health care providers can help protect youths from the harms of tobacco products, including e-cigarettes. In addition, the comprehensive and sustained implementation of evidence-based tobacco control strategies, combined with FDA's regulation of tobacco products, is important for reducing all forms of tobacco product use among U.S. youths.",
        "DOI": "10.15585/mmwr.ss7105a1",
        "paper_author": "Gentzke A.S.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Spatial spillovers and threshold effects of internet development and entrepreneurship on green innovation efficiency in China",
        "publication": "Technology in Society",
        "citied_by": "276",
        "cover_date": "2022-02-01",
        "Abstract": "Green innovation is a critical component of high-quality development that is particularly integrated with the Chinese 14th five-year plan. At present, internet development and entrepreneurship are considered to be the important driving forces to improve green innovation efficiency adhered by sustainable development goals. Thus, based on the panel of 30 provincial administrative regions in China from 2006 to 2018 and 196 cities from 2012 to 2018, the spatial spillover, threshold effects, causality of Internet development on green innovation efficiency (GIE) are comprehensively investigated. The results reveal that internet development and entrepreneurship have a positive effect on the GIE. This conclusion is still valid after a series of tests of robustness including iv estimation. There are also significant spatial spillover effects among internet development, entrepreneurship, and GIE. For instance, the local internet development and entrepreneurship can significantly strengthen the green innovation efficiency of neighboring regions in China. The threshold model reveals that advancement in regional entrepreneurship lifts the positive impact of internet development on GIE. Manifestly, the development of Internet and entrepreneurship have a marginal increasing non-linear impact on the GIE, that significantly varied across different thresholds of both variables. Taking broadband China as a quasi-natural experiment, this paper tests the causality between the development of Internet and the efficiency of green innovation. The results show that the broadband China policy has significantly promoted the efficiency of green innovation. These research findings offer valuable policy recommendations for government and stakeholders.",
        "DOI": "10.1016/j.techsoc.2021.101844",
        "paper_author": "Fang Z.",
        "affiliation_name": "Ocean University of China",
        "affiliation_city": "Qingdao",
        "affiliation_country": "China",
        "affiliation_id": "60022422",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "The Vaccine-Hesitant Moment",
        "publication": "New England Journal of Medicine",
        "citied_by": "263",
        "cover_date": "2022-07-07",
        "Abstract": "Vaccine hesitancy is a state of indecision and uncertainty about vaccination before a decision is made to act (or not act). It represents a time of vulnerability and opportunity. Multiple surveys that were conducted to examine the sentiments concerning coronavirus disease 19 (Covid-19) vaccination have exposed new levels of volatility around vaccine hesitancy, particularly when the hesitancy is powered by digital media platforms. Spikes in vaccine hesitancy often coincide with new information, new policies, or newly reported vaccine risks. Some of the variability is due to factors such as a decline in the public's trust of experts, preferences for alternative health, political polarization, and belief-based extremism. In this review, we use the examples of hesitancy regarding the measles-mumps-rubella (MMR), human papillomavirus (HPV), and Covid-19 vaccines to look at the multifaceted issues that fuel vaccine hesitancy. Each of these examples is part of a larger, complex story.",
        "DOI": "10.1056/NEJMra2106441",
        "paper_author": "Larson H.J.",
        "affiliation_name": "Institute for Health Metrics and Evaluation",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60091926",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Responding to the opioid crisis in North America and beyond: recommendations of the Stanford–Lancet Commission",
        "publication": "The Lancet",
        "citied_by": "263",
        "cover_date": "2022-02-05",
        "Abstract": "NA",
        "DOI": "10.1016/S0140-6736(21)02252-2",
        "paper_author": "Humphreys K.",
        "affiliation_name": "Stanford University School of Medicine",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60032838",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Global, regional, and national burden of Alzheimer's disease and other dementias, 1990–2019",
        "publication": "Frontiers in Aging Neuroscience",
        "citied_by": "251",
        "cover_date": "2022-10-10",
        "Abstract": "Background: With the increase in the aging population worldwide, Alzheimer's disease has become a rapidly increasing public health concern. Monitoring the dementia disease burden will support health development strategies by providing scientific data. Methods: Based on the data obtained from the 2019 Global Burden of Disease (GBD) database, the numbers and age-standardized rates (ASRs) of incidence, prevalence, death, and disability-adjusted life-years (DALYs) of Alzheimer's disease and other dementias from 1990 to 2019 were analyzed. Calculated estimated annual percentage changes (EAPCs) and Joinpoint regression analyses were performed to evaluate the trends during this period. We also evaluated the correlations between the epidemiology and the sociodemographic index (SDI), an indicator to evaluate the level of social development in a country or region considering the education rate, economic situation, and total fertility rate. Results: From 1990 to 2019, the incidence and prevalence of Alzheimer's disease and other dementias increased by 147.95 and 160.84%, respectively. The ASR of incidence, prevalence, death, and DALYs in both men and women consistently increased over the study period. All the ASRs in women were consistently higher than those in men, but the increases were more pronounced in men. In addition, the ASRs of incidence, prevalence, and DALYs were positively correlated with the SDI. Moreover, the proportion of patients over 70 years old with dementia was also positively correlated with the SDI level. Smoking was a major risk factor for the disease burden of dementia in men, while obesity was the major risk factor for women. Conclusion: From 1990 to 2019, the Alzheimer's disease burden increased worldwide. This trend was more serious in high-SDI areas, especially among elderly populations in high-SDI areas, who should receive additional attention. Policy-makers should take steps to reverse this situation. Notably, women were at a higher risk for the disease, but the risk in men showed a faster increase. We should give attention to the aging population, attach importance to interventions targeting dementia risk factors, and formulate action plans to address the increasing incidence of dementia.",
        "DOI": "10.3389/fnagi.2022.937486",
        "paper_author": "Li X.",
        "affiliation_name": "Weifang Medical University",
        "affiliation_city": "Weifang",
        "affiliation_country": "China",
        "affiliation_id": "60023230",
        "affiliation_state": "Shandong"
    },
    {
        "paper_title": "An in-depth analysis of electric vehicle charging station infrastructure, policy implications, and future trends",
        "publication": "Energy Reports",
        "citied_by": "242",
        "cover_date": "2022-11-01",
        "Abstract": "A significant transformation occurs globally as transportation switches from fossil fuel-powered to zero and ultra-low tailpipe emissions vehicles. The transition to the electric vehicle requires an infrastructure of charging stations (CSs) with information technology, ingenious, distributed energy generation units, and favorable government policies. This paper discusses the key factors when planning electric vehicle charging infrastructure. This paper provides information about planning and technological developments that can be used to improve the design and implementation of charging station infrastructure. A comprehensive review of the current electric vehicle scenario, the impact of EVs on grid integration, and Electric Vehicle optimal allocation provisioning are presented. In particular, this paper analyzes research and developments related to charging station infrastructure, challenges, and efforts to standardize the infrastructure to enhance future research work. In addition, the optimal placement of rapid charging stations is based on economic benefits and grid impacts. It also describes the challenges of adoption. On the other hand, future trends in the field, such as energy procurement from renewable sources and cars’ benefits to grid technology, are also presented and discussed.",
        "DOI": "10.1016/j.egyr.2022.09.011",
        "paper_author": "Mastoi M.S.",
        "affiliation_name": "Southwest Jiaotong University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60010421",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Dynamic association between ICT, renewable energy, economic complexity and ecological footprint: Is there any difference between E-7 (developing) and G-7 (developed) countries?",
        "publication": "Technology in Society",
        "citied_by": "242",
        "cover_date": "2022-02-01",
        "Abstract": "This empirical research scrutinizes the nexus between information and communication technologies (ICT), renewable energy, economic complexity, human capital, financial development, and ecological footprint for E-7 and G-7 countries over the period from 1995 to 2018. We use four variables (Mobile cellular subscription, fixed broadband subscription, fixed telephone subscription, Internet consumers) for the ICT index prepared through principal component analysis. For empirical analysis, after testing the cross-sectional dependency, this study performs the second-generation method. From the E-7 countries' perspective, the empirical results reveal that ICT, economic complexity, and human capital increase the pollution level while renewable energy significantly reduces it. The estimated financial development coefficient is established to be statistically insignificant. In G-7 countries, all potential factors significantly improve the environmental quality except financial development. Moreover, ICT and human capital interaction significantly reduce the ecological footprint level in both panel countries. Therefore, we can observe that there is a wide discrepancy exists between these countries. The only common thing is that in these countries, bidirectional causality is discovered between ICT, human capital, and ecological footprint. Based on these empirical findings, several practice policy implications for ICT, renewable energy, economic complexity, human capital, financial development, and ecological footprint are discussed.",
        "DOI": "10.1016/j.techsoc.2021.101853",
        "paper_author": "Huang Y.",
        "affiliation_name": "Wuhan University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60029306",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Global, regional and national burden of low back pain 1990–2019: A systematic analysis of the Global Burden of Disease study 2019",
        "publication": "Journal of Orthopaedic Translation",
        "citied_by": "241",
        "cover_date": "2022-01-01",
        "Abstract": "Background: To comprehensively analyze the global level and trends of prevalence, incidence and years lived with disability (YLDs) for low back pain (LBP) from 1990 to 2019 by age, sex and sociodemographic index (SDI). Methods: Publicly available modelled data and methods were obtained from the Global Burden of Diseases (GBD) study 2019, and used to evaluate the global burden of LBP through a systematic analysis. Results: Globally, the age-standardized prevalence, incidence and YLDs rate of LBP were slightly decreased from 1990 to 2019, but the number of the prevalent cases, incident cases and YLDs had substantially increased, and LBP remains the leading cause of YLDs in 2019 worldwide. The number of prevalent cases was increased with age and peaked at the age of 45–54 years for both sexes, and the global prevalence rate was higher in females than in males and increased with age, peaking at the 80–84 age group in both sexes in 2019. Overall, a positive association between the age-standardized YLD rate and SDI was observed over the past thirty years. At the national revel, the United States, Denmark and Switzerland had the three highest levels of age-standardized prevalence, while Zambia, Zimbabwe and Canada showed the highest increase in the age-standardized prevalence during 1990–2019. Conclusions: LBP is a major public health issue globally, and its burden remains high. Increasing population awareness about its risk factors and preventive measures for LBP are needed to reduce the future burden of this condition. The translational potential of this article: Due to the high prevalence and heavy burden of LBP globally, it is important to update its epidemiological data. This systematic analysis provides researchers and healthcare policy makers with up-to-date, comprehensive and comparable information on global LBP burden, which is of clinical translational significance.",
        "DOI": "10.1016/j.jot.2021.07.005",
        "paper_author": "Chen S.",
        "affiliation_name": "Tongji Medical College of Huazhong University of Science and Technology",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60001193",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Environmental performance, green finance and green innovation: What's the long-run relationships among variables?",
        "publication": "Energy Economics",
        "citied_by": "240",
        "cover_date": "2022-06-01",
        "Abstract": "What are the relationships among environmental performance, green finance, and green innovation in developing countries? Existing literatures support the impact of green finance or green innovation on environmental performance, but rare studies query the cointegration among such three variables. We thus utilize the yearly data of 57 developing countries from 2002 to 2016 to empirically examines the relationships among environmental performance, green finance, and green innovation, via panel covariate-augmented Dickey-Fuller unit root test and the Westerlund and Edgerton (2007) cointegration test. Overall, this study confirms the existence of cointegration relationships among these variables. Moreover, the results of pooled mean group estimation suggest that environmental performance can positively affect the green innovation in the long term in the non-emerging countries and countries with better green innovation or environmental performance. Furthermore, green finance positively affects green innovation in the emerging countries and countries with lower level of green finance, while green finance negatively affects green innovation in the countries with better green innovation or environmental performance. Our empirical findings offer important policy implications for the sample of developing countries to promote green innovation and improve environmental performance.",
        "DOI": "10.1016/j.eneco.2022.106004",
        "paper_author": "Wang Q.J.",
        "affiliation_name": "Zhengzhou University",
        "affiliation_city": "Zhengzhou",
        "affiliation_country": "China",
        "affiliation_id": "60018554",
        "affiliation_state": "Henan"
    },
    {
        "paper_title": "National identity predicts public health support during a global pandemic",
        "publication": "Nature Communications",
        "citied_by": "239",
        "cover_date": "2022-12-01",
        "Abstract": "Changing collective behaviour and supporting non-pharmaceutical interventions is an important component in mitigating virus transmission during a pandemic. In a large international collaboration (Study 1, N = 49,968 across 67 countries), we investigated self-reported factors associated with public health behaviours (e.g., spatial distancing and stricter hygiene) and endorsed public policy interventions (e.g., closing bars and restaurants) during the early stage of the COVID-19 pandemic (April-May 2020). Respondents who reported identifying more strongly with their nation consistently reported greater engagement in public health behaviours and support for public health policies. Results were similar for representative and non-representative national samples. Study 2 (N = 42 countries) conceptually replicated the central finding using aggregate indices of national identity (obtained using the World Values Survey) and a measure of actual behaviour change during the pandemic (obtained from Google mobility reports). Higher levels of national identification prior to the pandemic predicted lower mobility during the early stage of the pandemic (r = −0.40). We discuss the potential implications of links between national identity, leadership, and public health for managing COVID-19 and future pandemics.",
        "DOI": "10.1038/s41467-021-27668-9",
        "paper_author": "Van Bavel J.J.",
        "affiliation_name": "New York University",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60021784",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "The nutrition transition to a stage of high obesity and noncommunicable disease prevalence dominated by ultra-processed foods is not inevitable",
        "publication": "Obesity Reviews",
        "citied_by": "232",
        "cover_date": "2022-01-01",
        "Abstract": "The Nutrition Transition model is presented with the nature and pace of change in key stages varying by location and subpopulations. At present, all high-income and many low- and middle-income countries are in a stage of the transition where nutrition-related noncommunicable diseases including obesity, type 2 diabetes, and hypertension are dominating adult morbidity and mortality and are very high or growing rapidly in prevalence. Some countries still have key subpopulations facing hunger and undernutrition defined by stunting or extreme thinness among adults. We call these double burden of malnutrition countries. All low- and middle-income countries face rapid growth in consumption of ultra-processed food and beverages, but it is not inevitable that these countries will reach the same high levels of consumption seen in high-income countries, with all the negative impacts of this diet on health. With great political and civil society commitment to adoption of policies shown in other countries to have improved dietary choices and social norms around foods, we can arrest and even reverse the rapid shift to diets dominated by a stage of high ultra-processed food intake and increasing prevalence of nutrition-related noncommunicable diseases.",
        "DOI": "10.1111/obr.13366",
        "paper_author": "Popkin B.M.",
        "affiliation_name": "Department of Nutrition",
        "affiliation_city": "Chapel Hill",
        "affiliation_country": "United States",
        "affiliation_id": "60142163",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Improving The Measurement Of Structural Racism To Achieve Antiracist Health Policy",
        "publication": "Health Affairs",
        "citied_by": "227",
        "cover_date": "2022-02-01",
        "Abstract": "Antiracist health policy research requires methodological innovation that creates equity-centered and antiracist solutions to health inequities by centering the complexities and insidiousness of structural racism. The development of effective health policy and health equity interventions requires sound empirical characterization of the nature of structural racism and its impact on public health. However, there is a disconnect between the conceptualization and measurement of structural racism in the public health literature. Given that structural racism is a system of interconnected institutions that operates with a set of racialized rules that maintain White supremacy, how can anyone accurately measure its insidiousness? This article highlights methodological approaches that will move the field forward in its ability to validly measure structural racism for the purposes of achieving health equity. We identify three key areas that require scholarly attention to advance antiracist health policy research: historical context, geographical context, and theory-based novel quantitative and qualitative methods that capture the multifaceted and systemic properties of structural racism as well as other systems of oppression.",
        "DOI": "10.1377/hlthaff.2021.01489",
        "paper_author": "Hardeman R.R.",
        "affiliation_name": "University of Minnesota Twin Cities",
        "affiliation_city": "Minneapolis",
        "affiliation_country": "United States",
        "affiliation_id": "60029445",
        "affiliation_state": "MN"
    },
    {
        "paper_title": "Race/ethnicity reporting and representation in US clinical trials: A cohort study",
        "publication": "The Lancet Regional Health - Americas",
        "citied_by": "226",
        "cover_date": "2022-07-01",
        "Abstract": "Background: Systemic progress in improving trial representation is uncertain, and previous analyses of minority trial participation have been limited to small cohorts with limited exploration of driving factors. Methods: We analyzed detailed trial records from all US clinical trials registered in ClinicalTrials.gov from March 2000 to March 2020. Minority enrollment was compared to 2010 US Census demographic estimates using Wilcoxon test. We utilized logistic regression and generalized linear regression with a logit link to assess the association of possible drivers (including trials’ funding source, size, phase, and design) with trials’ disclosure of and amount of minority enrollment, respectively. Findings: Among 20,692 US-based trials with reported results (representing ∼4·76 million enrollees), only 43% (8,871/20,692) reported any race/ethnicity data. The majority of enrollees were White (median 79·7%; interquartile range [IQR] 61·9–90·0%), followed by Black (10·0%; IQR 2·5–23·5%), Hispanic/Latino (6·0%; IQR 0·43–15·4%), Asian (1·0%; IQR 0·0–4·1%), and American Indian (0·0%; IQR 0·0–0·2%). Median combined enrollment of minority race/ethnicity groups (Black, Hispanic/Latino, Asian, American Indian, Other/Multi) was below census estimates (27·6%) (p < 0·001) however increased at an annual rate of 1·7%. Industry and Academic funding were negatively associated with race/ethnicity reporting (Industry adjusted odds ratio [aOR]: 0·42, 95% confidence interval [CI]: 0·38 to 0·46, p < 0.0001; Academic aOR: 0·45, CI: 0·41 to 0·50, p < 0.0001). Industry also had a negative association with the proportion of minority ethnicity enrollees (aOR: 0·69, CI: 0·60 to 0·79) compared to US Government-funded trials. Interpretation: Over the past two decades, the majority of US trials in ClinicalTrials.gov do not report race/ethnicity enrollment data, and minorities are underrepresented in trials with modest improvement over time. Funding: Stanford Medical Scholars Research Funding, the National Heart, Lung, and Blood Institute, NIH (1K01HL144607) and the American Heart Association/Robert Wood Johnson Medical Faculty Development Program.",
        "DOI": "10.1016/j.lana.2022.100252",
        "paper_author": "Turner B.E.",
        "affiliation_name": "Stanford University School of Medicine",
        "affiliation_city": "Stanford",
        "affiliation_country": "United States",
        "affiliation_id": "60032838",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Pandemic, War, and Global Energy Transitions",
        "publication": "Energies",
        "citied_by": "224",
        "cover_date": "2022-09-01",
        "Abstract": "The COVID-19 pandemic and Russia’s war on Ukraine have impacted the global economy, including the energy sector. The pandemic caused drastic fluctuations in energy demand, oil price shocks, disruptions in energy supply chains, and hampered energy investments, while the war left the world with energy price hikes and energy security challenges. The long-term impacts of these crises on low-carbon energy transitions and mitigation of climate change are still uncertain but are slowly emerging. This paper analyzes the impacts throughout the energy system, including upstream fuel supply, renewable energy investments, demand for energy services, and implications for energy equity, by reviewing recent studies and consulting experts in the field. We find that both crises initially appeared as opportunities for low-carbon energy transitions: the pandemic by showing the extent of lifestyle and behavioral change in a short period and the role of science-based policy advice, and the war by highlighting the need for greater energy diversification and reliance on local, renewable energy sources. However, the early evidence suggests that policymaking worldwide is focused on short-term, seemingly quicker solutions, such as supporting the incumbent energy industry in the post-pandemic era to save the economy and looking for new fossil fuel supply routes for enhancing energy security following the war. As such, the fossil fuel industry may emerge even stronger after these energy crises creating new lock-ins. This implies that the public sentiment against dependency on fossil fuels may end as a lost opportunity to translate into actions toward climate-friendly energy transitions, without ambitious plans for phasing out such fuels altogether. We propose policy recommendations to overcome these challenges toward achieving resilient and sustainable energy systems, mostly driven by energy services.",
        "DOI": "10.3390/en15176114",
        "paper_author": "Zakeri B.",
        "affiliation_name": "International Institute for Applied Systems Analysis, Laxenburg",
        "affiliation_city": "Laxenburg",
        "affiliation_country": "Austria",
        "affiliation_id": "60019497",
        "affiliation_state": "Lower Austria"
    },
    {
        "paper_title": "Environmental impact of information and communication technology: Unveiling the role of education in developing countries",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "224",
        "cover_date": "2022-05-01",
        "Abstract": "The penetration of information communication and technology (ICT) has increased in the developing world but there is still a huge gap between the need for ICT infrastructure and its availability. Alongside this, previous literature on ICT and CO2 emissions provides that ICT is a double-edged sword that can increase/decrease emissions. Against this background, this study checks the role of ICT and education with environmental quality by controlling the role of globalization, income, and financial development for developing countries over the period of 1996–2019. For empirical analysis, we use second generation econometric methods which overcome the issue of heterogeneity in the study variables. The Westerlund cointegration test results show the presence of long-run link among the variables. The long-run estimates of Cup-FM and Cup-BC indicate that ICT increases environmental quality by reducing the emissions level while education, income, financial development, and globalization decrease environmental quality by increasing emissions level. Policymakers are suggested to encourage investment building ICT infrastructure, develop and implement modern information systems, use the financial sector to devise policies regarding funding ICT projects at an affordable interest rate, and increase public pressure on political leadership to reduce unsustainable practices improving environmental quality.",
        "DOI": "10.1016/j.techfore.2022.121570",
        "paper_author": "Zhang C.",
        "affiliation_name": "Jilin University",
        "affiliation_city": "Changchun",
        "affiliation_country": "China",
        "affiliation_id": "60007711",
        "affiliation_state": "Jilin"
    },
    {
        "paper_title": "Global, regional and national burden of primary liver cancer by subtype",
        "publication": "European Journal of Cancer",
        "citied_by": "223",
        "cover_date": "2022-01-01",
        "Abstract": "Introduction: Hepatocellular carcinoma (HCC) and intrahepatic cholangiocarcinoma (iCCA) are the two main histological subtypes of primary liver cancer. Estimates of the burden of liver cancer by subtype are needed to facilitate development and evaluation of liver cancer control globally. We provide worldwide, regional and national estimates of HCC and iCCA incidence using high-quality data. Methods: We used population-based cancer registry data on liver cancer cases by histological subtype from 95 countries to compute the sex- and country-specific distributions of HCC, iCCA and other specified histology. Subtype distributions were applied to estimates of total liver cancer cases for 2018 from the Global Cancer Observatory. Age-standardised incidence rates (ASRs) were calculated. Results: There were an estimated 826,000 cases of liver cancer globally in 2018: 661,000 HCC (ASR 7.3 cases per 100,000); 123,000 iCCA (ASR 1.4) and 42,000 other specified histology (ASR 0.5). HCC contributed 80% of the world total liver cancer burden followed by iCCA (14.9%) and other specified histology (5.1%). HCC rates were highest in Eastern Asia (ASR 14.8), Northern Africa (ASR 13.2) and South-Eastern Asia (ASR 9.5). Rates of iCCA were highest in South-Eastern Asia (ASR 2.9), Eastern Asia (ASR 2.0), Northern Europe, the Caribbean and Central America and Oceania (ASR all 1.8). Conclusion: We have shown the importance of uncovering the distinct patterns of the major subtypes of liver cancer. The use of these estimates is critical to further develop public health policy to reduce the burden of liver cancer and monitor progress in controlling HCC and iCCA globally.",
        "DOI": "10.1016/j.ejca.2021.11.023",
        "paper_author": "Rumgay H.",
        "affiliation_name": "Centre international de Recherche sur le Cancer",
        "affiliation_city": "Lyon",
        "affiliation_country": "France",
        "affiliation_id": "60024610",
        "affiliation_state": "Auvergne-Rhone-Alpes"
    },
    {
        "paper_title": "Co-creation, co-design and co-production for public health: a perspective on definitions and distinctions",
        "publication": "Public Health Research and Practice",
        "citied_by": "222",
        "cover_date": "2022-06-01",
        "Abstract": "Collaboration between community members, researchers, and policy makers drives efforts to solve complex health problems such as obesity, alcohol misuse, and type 2 diabetes. Community participation is essential to ensure the optimal design, implementation and evaluation of resulting initiatives. The terms ‘co-creation’, ‘co-design’ and ‘co-production’ have been used interchangeably to describe the development of initiatives involving multiple stakeholders. While commonalities exist across these concepts, they have essential distinctions for public health, particularly related to the role of stakeholders and the extent and timing of their engagement. We summarise these similarities and differences drawing from the cross-disciplinary literature, including public administration and governance, service management, design, marketing and public health. Co-creation is an overarching guiding principle encompassing co-design and co-production. A clear definition of these terms clarifies aspects of participatory action research for community-based public health initiatives. Background Increasing the participation and involvement of key stakeholders (e.g. employers, partners, customers, citizens, policy makers, end-users) can strengthen innovation, implementation and overall success of population health initiatives.1,2 Engaging, respecting and applying these multiple perspectives provides context-specific, practical and relevant knowledge with flow-on impacts on health equity, citizenship and social justice.1,3 The engagement of stakeholders in the development and implementation of initiatives is captured under the broader term ‘Participatory Action Research’ (PAR).3 More recently, co-creation, co-design and co-production have been used to describe specific PAR-type methods.",
        "DOI": "10.17061/PHRP3222211",
        "paper_author": "Vargas C.",
        "affiliation_name": "Deakin University",
        "affiliation_city": "Geelong",
        "affiliation_country": "Australia",
        "affiliation_id": "60018805",
        "affiliation_state": "VIC"
    },
    {
        "paper_title": "Market incentives, carbon quota allocation and carbon emission reduction: Evidence from China's carbon trading pilot policy",
        "publication": "Journal of Environmental Management",
        "citied_by": "214",
        "cover_date": "2022-10-01",
        "Abstract": "As a major carbon dioxide-emitting country, China set carbon trading market to reduce enterprise carbon emissions through the rational allocation of carbon quotas among different enterprises and regions. The market has also conducted a preliminary exploration for the country to achieve carbon dioxide emissions peak in 2030 and carbon neutrality in 2060 while actively addressing the challenges of global climate change. This study analysed the emission reduction effect of China's carbon trading pilot policy, especially the role of carbon quota and carbon trading price. The analysis used county-level panel data from 1997 to 2017, regarded the implementation of the carbon trading pilot policy as a quasi-natural experiment, and used the difference-in-differences method. The results showed that, first, the policy implementation not only reduced regional carbon emissions but also inhibited carbon dioxide emissions per capita, with long-term effects. Second, the carbon emission reduction effect brought by the carbon pilot policy showed significant heterogeneous results with the different degrees of regional carbon emissions and environmental supervision. The effect was greater in areas with higher carbon emission density and stronger legal supervision. Third, the difference in carbon quota allocations resulted in different emission reduction effects, among which the historical method had the strongest effect. The carbon quota price and number of enterprises participating carbon trading market were the key factors affecting carbon emission reduction.",
        "DOI": "10.1016/j.jenvman.2022.115650",
        "paper_author": "Shi B.",
        "affiliation_name": "Northwest University",
        "affiliation_city": "Xi'an",
        "affiliation_country": "China",
        "affiliation_id": "60001298",
        "affiliation_state": "Shaanxi"
    },
    {
        "paper_title": "A study of trilemma energy balance, clean energy transitions, and economic expansion in the midst of environmental sustainability: New insights from three trilemma leadership",
        "publication": "Energy",
        "citied_by": "210",
        "cover_date": "2022-06-01",
        "Abstract": "We investigate the impact of trilemma energy balance and clean energy transitions on economic expansion and environmental sustainability while moderating the role of clean energy and natural resources rents of the three trilemma leaders from 1990 to 2016. Through this study, we have developed a comprehensive empirical analysis, applied advanced econometric methodologies. Westerlund's panel co-integration suggests long-run relationships within the variables. Our long-run random effect generalized least squares (GLS), generalized least square mixed effect models (GLMM), and robust correlated panel corrected standard errors (PCSEs) findings indicate trilemma energy balance, clean energy transition, and natural resource depletion enhance economic growth while clean energy discourages this growth. Moreover, trilemma energy balance, clean energy transitions, and clean energy improve while natural resources depletion deteriorates environmental sustainability in the trilemma energy leadership. Increasing the trilemma energy balance by 1% boosts economic growth by 0.3874223%. By increasing the trilemma energy balance by 1%, the ecological footprint is reduced by −0.5901441%. A 1% acceleration in the clean energy transitions boosts economic growth by 0.1208461%. By accelerating the transition to clean energy by 1%, the environmental footprint would decrease by 0.0273685%. Crucial policy implications and study limitations are discussed.",
        "DOI": "10.1016/j.energy.2022.123619",
        "paper_author": "Khan I.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Estimating the Prevalence of Dementia and Mild Cognitive Impairment in the US: The 2016 Health and Retirement Study Harmonized Cognitive Assessment Protocol Project",
        "publication": "JAMA Neurology",
        "citied_by": "209",
        "cover_date": "2022-12-12",
        "Abstract": "Importance: Nationally representative data are critical for understanding the causes, costs, and outcomes associated with dementia and mild cognitive impairment (MCI) in the US and can inform policies aimed at reducing the impact of these conditions on patients, families, and public programs. The nationally representative Health and Retirement Study (HRS) is an essential resource for such data, but the HRS substudy providing dementia diagnostic information was fielded more than 20 years ago and more recent data are needed. Objective: The Harmonized Cognitive Assessment Protocol (HCAP) was developed to update national estimates of the prevalence of MCI and dementia in the US and examine differences by age, race, ethnicity, and sex. Design, Setting, and Participants: HRS is an ongoing longitudinal nationally representative study of people 51 years and older with staggered entry dates from 1992 to 2022 and follow-up ranging from 4 to 30 years. HCAP is a cross-sectional random sample of individuals in HRS who were 65 years or older in 2016. Of 9972 age-eligible HRS participants, 4425 were randomly selected for HCAP, and 3496 completed a comprehensive neuropsychological test battery and informant interview, none of whom were excluded. Dementia and MCI were classified using an algorithm based on standard diagnostic criteria and comparing test performance to a robust normative sample. Exposures: Groups were stratified by age, sex, education, race, and ethnicity. Main Outcomes and Measures: National prevalence estimates using population weights. Results: The mean (SD) age of the study population sample (N = 3496) was 76.4 (7.6) years, and 2095 participants (60%) were female. There were 551 participants who self-identified as Black and not Hispanic (16%), 382 who self-identified as Hispanic regardless of race (16%), 2483 who self-identified as White and not Hispanic (71%), and 80 who self-identified as another race (2%), including American Indian or Alaska Native, Asian, Native Hawaiian or Pacific Islander, or another self-described race. A total of 393 individuals (10%; 95% CI, 9-11) were classified as having dementia and 804 (22%; 95% CI, 20-24) as having MCI. Every 5-year increase in age was associated with higher risk of dementia (weighted odds ratio [OR], 1.95 per 5-year age difference; 95%, CI, 1.77-2.14) and MCI (OR, 1.17 per 5-year age difference, 95% CI, 1.09-1.26). Each additional year of education was associated with a decrease in risk of dementia (OR, 0.93 per year of school, 95% CI, 0.89-0.97) and MCI (OR, 0.94, 95% CI, 0.91-0.97). Dementia was more common among non-Hispanic Black individuals (OR, 1.81; 95% CI, 1.20-2.75) and MCI in Hispanic individuals (OR, 1.42; 95% CI, 1.03-1.96) compared with non-Hispanic White individuals. Other group comparisons by race and ethnicity were not possible owing to small numbers. No differences in prevalence were found between female individuals and male individuals. Conclusions and Relevance: Using a comprehensive neuropsychological test battery and large sample, the national prevalence of dementia and MCI in 2016 found in this cross-sectional study was similar to that of other US-based studies, indicating a disproportionate burden of dementia and MCI among older Black and Hispanic adults and those with lower education..",
        "DOI": "10.1001/jamaneurol.2022.3543",
        "paper_author": "Manly J.J.",
        "affiliation_name": "Vagelos College of Physicians and Surgeons",
        "affiliation_city": "New York",
        "affiliation_country": "United States",
        "affiliation_id": "60011605",
        "affiliation_state": "NY"
    },
    {
        "paper_title": "Organizations' engagement with sustainable development goals: From cherry-picking to SDG-washing?",
        "publication": "Corporate Social Responsibility and Environmental Management",
        "citied_by": "209",
        "cover_date": "2022-03-01",
        "Abstract": "This article analyzes the organizational engagement with the United Nations sustainable development goals (SDGs), an initiative for corporate social responsibility also referred to as the 2030 Agenda. Engagement with the SDGs by organizations all around the world, whatever their sector and size, has attracted a lot of media interest and heightened expectations. Nevertheless, there is a lack of empirical work that sheds light on the commitment to this initiative at the organizational level. In order to fill this gap, this article examines the characteristics of engagement with the SDGs of 1370 organizations from 97 countries, taking data from their sustainability reports. The study looks at how and why organizations engage with the SDGs, as well as the priority they assign to them. The findings point to a superficial engagement with the SDGs for the vast majority of organizations, which suggests a process of “SDG-washing”. Implications for managers, public policy makers and other stakeholders are analyzed.",
        "DOI": "10.1002/csr.2202",
        "paper_author": "Heras-Saizarbitoria I.",
        "affiliation_name": "Universidad del Pais Vasco",
        "affiliation_city": "Leioa",
        "affiliation_country": "Spain",
        "affiliation_id": "60027856",
        "affiliation_state": "Biscay"
    },
    {
        "paper_title": "The role of renewable energy and urbanization towards greenhouse gas emission in top Asian countries: Evidence from advance panel estimations",
        "publication": "Renewable Energy",
        "citied_by": "205",
        "cover_date": "2022-03-01",
        "Abstract": "The increasing greenhouse gas (GHG) emission and environmental degradation (ED) is a serious concern for the various economies, and a similar issue is observed in Asia. This paper investigated the role of clean energy from renewable sources, urbanization, and economic growth in determining the level of GHG emissions from 1995 to 2018 for ten Asian States through a cross-sectional autoregressive distributed lagged (CS-ARDL) model. Meanwhile, the current research also examined the cross-sectional dependence, unit root properties, and co-integration between the study variables. The study findings confirmed that clean energy and GDP2 played their constructive role in reducing GHG emissions in the natural environment or targeted economies. In contrast, urbanization and economic growth caused more GHG emissions both in the long and short run. Furthermore, the robust check through augmented mean group (AMG) and common correlated effect means group (CCEMG) also confirmed that clean energy and GDP2 have a good sign for lowering ED compared to GDP and urbanization. The study findings could support policymakers, specifically in the field of energy economics and environmental sustainability. Therefore, it is highly recommended that some strong policy implications are needed to reduce environmental issues through controlling the negative impact of economic growth and urbanization. This study contributes in the literature of GHG emission with respect to economic growth, urbanization and clean energy and guided the regulators while formulating policies related to control the GHG emission.",
        "DOI": "10.1016/j.renene.2021.12.118",
        "paper_author": "Chien F.",
        "affiliation_name": "Fuzhou University of Foreign Studies and Trade",
        "affiliation_city": "Fuzhou",
        "affiliation_country": "China",
        "affiliation_id": "60122027",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "“Our planet, our health”: saving lives, promoting health and attaining well-being by protecting the planet – the Eastern Mediterranean perspectives",
        "publication": "Eastern Mediterranean Health Journal",
        "citied_by": "202",
        "cover_date": "2022-04-01",
        "Abstract": "NA",
        "DOI": "10.26719/2022.28.4.247",
        "paper_author": "Al-Mandhari A.",
        "affiliation_name": "Organisation Mondiale de la Santé",
        "affiliation_city": "Geneva",
        "affiliation_country": "Switzerland",
        "affiliation_id": "60027142",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The state of play in electric vehicle charging services – A review of infrastructure provision, players, and policies",
        "publication": "Renewable and Sustainable Energy Reviews",
        "citied_by": "198",
        "cover_date": "2022-02-01",
        "Abstract": "This paper reviews the market for electric vehicle (EV) charging infrastructure; it focuses on the types of existing charging, the main functions and actors in the market and the future policy actions required for widespread expansion. Electric vehicles represent a key technology in the mitigation of transportation greenhouse gas emissions and ambitious EV adoption targets have been set by many governments by 2030 and beyond. The rollout of EV charging infrastructure is vital in achieving this goal, as the uptake of EVs is linked to the level of coverage of EV chargers. To date, both the public and private sectors have been involved in the provision of charging stations and it is timely to consider the roles of the different actors in this market. We consider whether EV charging infrastructure is a public good or private asset and address the issues of the location of future chargers, the deployment models needed to develop, operate and own charging infrastructure, and finally the policy context for the development of charging infrastructure. We find that clear roles should be assigned to the individual public and private actors and funders, in order to achieve efficient development of the required infrastructure for large-scale EV deployment.",
        "DOI": "10.1016/j.rser.2021.111733",
        "paper_author": "LaMonaca S.",
        "affiliation_name": "University College Dublin",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60005141",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "Priorities for cancer research in low- and middle-income countries: a global perspective",
        "publication": "Nature Medicine",
        "citied_by": "196",
        "cover_date": "2022-04-01",
        "Abstract": "Cancer research currently is heavily skewed toward high-income countries (HICs), with little research conducted in, and relevant to, the problems of low- and middle-income countries (LMICs). This regional discordance in cancer knowledge generation and application needs to be rebalanced. Several gaps in the research enterprise of LMICs need to be addressed to promote regionally relevant research, and radical rethinking is needed to address the burning issues in cancer care in these regions. We identified five top priorities in cancer research in LMICs based on current and projected needs: reducing the burden of patients with advanced disease; improving access and affordability, and outcomes of cancer treatment; value-based care and health economics; quality improvement and implementation research; and leveraging technology to improve cancer control. LMICs have an excellent opportunity to address important questions in cancer research that could impact cancer control globally. Success will require collaboration and commitment from governments, policy makers, funding agencies, health care organizations and leaders, researchers and the public.",
        "DOI": "10.1038/s41591-022-01738-x",
        "paper_author": "Pramesh C.S.",
        "affiliation_name": "Homi Bhabha National Institute",
        "affiliation_city": "Mumbai",
        "affiliation_country": "India",
        "affiliation_id": "60079949",
        "affiliation_state": "MH"
    },
    {
        "paper_title": "The China Alzheimer Report 2022",
        "publication": "General Psychiatry",
        "citied_by": "196",
        "cover_date": "2022-03-11",
        "Abstract": "China's population has rapidly aged over the recent decades of social and economic development as neurodegenerative disorders have proliferated, especially Alzheimer's disease (AD) and related dementias (ADRD). AD's incidence rate, morbidity, and mortality have steadily increased to make it presently the fifth leading cause of death among urban and rural residents in China and magnify the resulting financial burdens on individuals, families and society. The € Healthy China Action' plan of 2019-2030 promotes the transition from disease treatment to health maintenance for this expanding population with ADRD. This report describes related epidemiological trends, evaluates the economic burden of the disease, outlines current clinical diagnosis and treatment status and delineates existing available public health resources. More specifically, it examines the public health impact of ADRD, including prevalence, mortality, costs, usage of care, and the overall effect on caregivers and society. In addition, this special report presents technical guidance and supports for the prevention and treatment of AD, provides expertise to guide relevant governmental healthcare policy development and suggests an information platform for international exchange and cooperation.",
        "DOI": "10.1136/gpsych-2022-100751",
        "paper_author": "Ren R.",
        "affiliation_name": "Ruijin Hospital",
        "affiliation_city": "Shanghai",
        "affiliation_country": "China",
        "affiliation_id": "60024452",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The dynamic linkage between remittances, export diversification, education, renewable energy consumption, economic growth, and CO<inf>2</inf> emissions in top remittance-receiving countries",
        "publication": "Sustainable Development",
        "citied_by": "192",
        "cover_date": "2022-02-01",
        "Abstract": "In recent years, the literature on financial development, public finance, and other areas has substantially increased; however, remittances are among the most neglected sources with significantly larger resource inflow that may serve the purpose of reducing environmental degradation. The literature on export diversification and education is also limited, with conflicting findings. With this in mind, the current research examined the relationship among remittances, export diversification, education, and CO2 emissions controlling for renewable energy and economic growth in a panel of 22 top remittance-receiving countries over the period 1986–2017. The study employed second-generation unit root techniques in econometric methodology, Westerlund and Edgerton cointegration approach with structural breaks, Cup-FM and CUP-BC long-run estimation techniques, and generalized quantile regression method. The findings indicate that remittances help in reducing environmental degradation as they have a negative effect on emissions. Likewise, export diversification reduces CO2 emissions, and renewable energy also contributes to decreasing CO2 emissions. In contrast, economic growth is conducive to environmental degradation. The study also finds a robust estimate of education as a stimulant of environmental degradation. Based on these novel findings, several policy suggestions are discussed.",
        "DOI": "10.1002/sd.2236",
        "paper_author": "Zafar M.W.",
        "affiliation_name": "Shenzhen University",
        "affiliation_city": "Shenzhen",
        "affiliation_country": "China",
        "affiliation_id": "60000937",
        "affiliation_state": "Guangdong"
    },
    {
        "paper_title": "Pesticide-free agriculture as a new paradigm for research",
        "publication": "Agronomy for Sustainable Development",
        "citied_by": "191",
        "cover_date": "2022-02-01",
        "Abstract": "Reducing pesticide use has become a goal shared by several European countries and a major issue in public policies due to the negative impacts of pesticides on the environment and on human health. However, since most of the agri-food sector relies on pesticides in these countries, substantially reducing pesticide use is a complex issue. To overcome this situation, we argue that agricultural research has a major role to play and must adopt a pesticide-free paradigm to expect a deep impact on pesticide use. In this article, we explain why this new paradigm is needed and outline research fronts that it will help address. These research fronts are related to five strategies: (1) redesigning cropping systems to enhance prophylaxis, (2) diversifying biocontrol strategies and associated business models, (3) broadening the scope of plant breeding to include functional biodiversity and evolutionary ecology concepts, (4) setting new goals for agricultural machinery and digital technologies, and (5) supporting development of public policies and private initiatives for the transition toward pesticide-free agri-food systems. The corresponding research activities must be managed conjointly to develop systemic and coupled innovations, which are essential for reducing pesticide use significantly. We therefore provide examples of cross-cutting objectives that combine these fronts while also highlighting the need for interdisciplinary research projects. By doing so, we provide an overall orientation for research to achieve sustainable agriculture.",
        "DOI": "10.1007/s13593-021-00742-8",
        "paper_author": "Jacquet F.",
        "affiliation_name": "Université de Montpellier",
        "affiliation_city": "Montpellier",
        "affiliation_country": "France",
        "affiliation_id": "60108488",
        "affiliation_state": "Occitanie"
    },
    {
        "paper_title": "Strengthening systematic reviews in public health: guidance in the Cochrane Handbook for Systematic Reviews of Interventions, 2nd edition",
        "publication": "Journal of Public Health (United Kingdom)",
        "citied_by": "190",
        "cover_date": "2022-12-01",
        "Abstract": "Aims Decision makers in public health practice and policy rely on access to trustworthy, relevant, synthesized evidence. The second edition of the Cochrane Handbook for Systematic Reviews of Interventions ('the Handbook') reflects a major revision in guidance for authors of systematic reviews, incorporating a decade of methodological development and a number of significant changes to previous recommendations. This paper aims to highlight new guidance that addresses a number of key methodological challenges for authors of systematic reviews in public health. Results The revised Handbook includes guidance on framing public health research questions for synthesis, considering equity, intervention complexity, risk of bias assessment and synthesis methods other than meta-analysis. Reviews of public health interventions frequently encounter the types of methodological complexity addressed in this new guidance. Conclusion We hope that readers will find that the Cochrane Handbook includes detailed and thoughtful guidance on both conceptualizing and executing systematic reviews relevant to public health questions. Considering the available methods guidance will, we hope, provide support for authors of public health reviews to tackle the challenges they encounter, strengthen their analysis and provide useful answers to the important questions asked by stakeholders and users of public health evidence.",
        "DOI": "10.1093/pubmed/fdac036",
        "paper_author": "Cumpston M.S.",
        "affiliation_name": "School of Medicine and Public Health",
        "affiliation_city": "Callaghan",
        "affiliation_country": "Australia",
        "affiliation_id": "60183191",
        "affiliation_state": "NSW"
    },
    {
        "paper_title": "How do green energy technology investments, technological innovation, and trade globalization enhance green energy supply and stimulate environmental sustainability in the G7 countries?",
        "publication": "Gondwana Research",
        "citied_by": "190",
        "cover_date": "2022-12-01",
        "Abstract": "Both developed and developing countries across the world are experiencing climate change-related adversities mainly due to failing to limit the emissions of greenhouse gases into the atmosphere. More often than not, the surge in greenhouse gas emissions is instigated through a rise in fossil fuel consumption levels. Hence, in respect of mitigating these emissions, especially carbon dioxide, it is pivotal to raise the share of green energy in the total energy supply. Accordingly, public sector investment in the renewable energy sector is hypothesized to play a vital role in specifically enhancing the technological level required for substantially increasing green energy production and supply. Moreover, the concurrent role of technological innovation, as a whole, in boosting green energy supply and ensuring environmental sustainability cannot be overlooked. Against this backdrop, this study investigates the effect of public investments in research and development related to renewable energy and technological innovation on renewable energy supply shares and carbon dioxide emissions in the G7 countries, controlling for the level of trade globalization in these countries. The results unfolded higher public investments in renewable energy development-related projects, technological innovation, and trade globalization are critical for enhancing renewable energy supply shares and curbing carbon dioxide emissions in the long run. Therefore, considering these major analytical outcomes, some relevant policies are suggested for enabling the G7 countries to achieve some of the Sustainable Development Goals set by the United Nations that are closely related to undergoing green energy transition (SDG-7) and achieving environmental sustainability (SDG-13) through the channel of innovation (SDG-9).",
        "DOI": "10.1016/j.gr.2022.09.014",
        "paper_author": "Ahmed Z.",
        "affiliation_name": "Uluslararası Kıbrıs Üniversitesi",
        "affiliation_city": "Nicosia",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60104395",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Social Connection as a Public Health Issue: The Evidence and a Systemic Framework for Prioritizing the quot Social quot in Social Determinants of Health",
        "publication": "Annual Review of Public Health",
        "citied_by": "190",
        "cover_date": "2022-04-01",
        "Abstract": "There is growing interest in and renewed support for prioritizing social factors in public health both in the USA and globally. While there are multiple widely recognized social determinants of health, indicators of social connectedness (e.g., social capital, social support, social isolation, loneliness) are often noticeably absent from the discourse. This article provides an organizing framework for conceptualizing social connection and summarizes the cumulative evidence supporting its relevance for health, including epidemiological associations, pathways, and biological mechanisms. This evidence points to several implications for prioritizing social connection within solutions across sectors, where public health work, initiatives, and research play a key role in addressing gaps. Therefore, this review proposes a systemic framework for cross-sector action to identify missed opportunities and guide future investigation, intervention, practice, and policy on promoting social connection and health for all.",
        "DOI": "10.1146/annurev-publhealth-052020-110732",
        "paper_author": "Holt-Lunstad J.",
        "affiliation_name": "Brigham Young University",
        "affiliation_city": "Provo",
        "affiliation_country": "United States",
        "affiliation_id": "60006832",
        "affiliation_state": "UT"
    },
    {
        "paper_title": "The asymmetric effects of renewable energy consumption and trade openness on carbon emissions in Sweden: new evidence from quantile-on-quantile regression approach",
        "publication": "Environmental Science and Pollution Research",
        "citied_by": "189",
        "cover_date": "2022-01-01",
        "Abstract": "With the passage of time, the continued burning of fossil fuels is proving to be one of the world’s most serious issues. In response, the current research aims to assess the critical linkage between carbon emissions and renewable energy, trade openness, and economic growth in Sweden utilizing a dataset from 1965 to 2019. The study applied the novel quantile-on-quantile regression (QQ) approach to assess this relationship. The main objectives are to address the following questions: (i) What are the effects of trade openness on CO2 emissions in each quantile? (ii) Does renewable energy consumption mitigates CO2 emissions in each quantile? What is the impact of economic growth on CO2 emissions in each quantile? The outcomes from the QQ approach revealed that at low and medium quantiles (0.1–0.6), the effect of trade openness on CO2 emissions is negative. Furthermore, at lower and higher quantiles (0.1–0.90) of combination of renewable energy consumption and CO2 emissions, the effect of renewable energy consumption on CO2 emissions is negative. Finally, at majority of the quantiles, the effect of economic growth on CO2 emissions is negative. Moreover, the present study applied the quantile regression (QR) approach as a robustness check. The findings of the QR validate the findings of the QQR approach. The study proposes that policy-makers in Sweden should place greater emphasis on raising public awareness regarding the issues of renewable energy since it mitigates environmental degradation.",
        "DOI": "10.1007/s11356-021-15706-4",
        "paper_author": "Adebayo T.S.",
        "affiliation_name": "Uluslararası Kıbrıs Üniversitesi",
        "affiliation_city": "Nicosia",
        "affiliation_country": "Cyprus",
        "affiliation_id": "60104395",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Talking AI into Being: The Narratives and Imaginaries of National AI Strategies and Their Performative Politics",
        "publication": "Science Technology and Human Values",
        "citied_by": "188",
        "cover_date": "2022-09-01",
        "Abstract": "How to integrate artificial intelligence (AI) technologies in the functioning and structures of our society has become a concern of contemporary politics and public debates. In this paper, we investigate national AI strategies as a peculiar form of co-shaping this development, a hybrid of policy and discourse that offers imaginaries, allocates resources, and sets rules. Conceptually, the paper is informed by sociotechnical imaginaries, the sociology of expectations, myths, and the sublime. Empirically we analyze AI policy documents of four key players in the field, namely China, the United States, France, and Germany. The results show that the narrative construction of AI strategies is strikingly similar: they all establish AI as an inevitable and massively disrupting technological development by building on rhetorical devices such as a grand legacy and international competition. Having established this inevitable, yet uncertain, AI future, national leaders proclaim leadership intervention and articulate opportunities and distinct national pathways. While this narrative construction is quite uniform, the respective AI imaginaries are remarkably different, reflecting the vast cultural, political, and economic differences of the countries under study. As governments endow these imaginary pathways with massive resources and investments, they contribute to coproducing the installment of these futures and, thus, yield a performative lock-in function.",
        "DOI": "10.1177/01622439211030007",
        "paper_author": "Bareis J.",
        "affiliation_name": "Karlsruher Institut für Technologie",
        "affiliation_city": "Karlsruhe",
        "affiliation_country": "Germany",
        "affiliation_id": "60102538",
        "affiliation_state": "Baden-Wurttemberg"
    },
    {
        "paper_title": "Enhancing green economic recovery through green bonds financing and energy efficiency investments",
        "publication": "Economic Analysis and Policy",
        "citied_by": "187",
        "cover_date": "2022-12-01",
        "Abstract": "This study investigates the effect of green-bond financing on energy efficiency investment for green economic recovery. The fuzzy Analytic Hierarchy Process (AHP) technique was used to achieve the research objective. The study's findings showed that green bonds are currently the primary financing source for energy efficiency projects, enhancing economic growth by 4.9% and potentially increasing green economic recovery by approximately 17% per annum. The fuzzy analysis technique and alternative models of fuzzy modeling were applied in this study. An alternative to project-based financing is energy performance contracts (EPCs). Green bonds also invest in public and private funds for energy efficiency and economic growth. Alternatively, such bonds may finance environmental initiatives or companies. Testing energy-efficiency projects with low payback rates may be expensive. Expanding the green economy through green bonds is essential for financing to successfully promote energy efficiency finance and green growth. This study also has policy implications for stakeholders.",
        "DOI": "10.1016/j.eap.2022.08.019",
        "paper_author": "Zhao L.",
        "affiliation_name": "Huaqiao University",
        "affiliation_city": "Quanzhou",
        "affiliation_country": "China",
        "affiliation_id": "60006106",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "Immunological memory to SARS-CoV-2 infection and COVID-19 vaccines",
        "publication": "Immunological Reviews",
        "citied_by": "186",
        "cover_date": "2022-09-01",
        "Abstract": "Immunological memory is the basis of protective immunity provided by vaccines and previous infections. Immunological memory can develop from multiple branches of the adaptive immune system, including CD4 T cells, CD8 T cells, B cells, and long-lasting antibody responses. Extraordinary progress has been made in understanding memory to SARS-CoV-2 infection and COVID-19 vaccines, addressing development; quantitative and qualitative features of different cellular and anatomical compartments; and durability of each cellular component and antibodies. Given the sophistication of the measurements; the size of the human studies; the use of longitudinal samples and cross-sectional studies; and head-to-head comparisons between infection and vaccines or between multiple vaccines, the understanding of immune memory for 1 year to SARS-CoV-2 infection and vaccines already supersedes that of any other acute infectious disease. This knowledge may help inform public policies regarding COVID-19 and COVID-19 vaccines, as well as the scientific development of future vaccines against SARS-CoV-2 and other diseases.",
        "DOI": "10.1111/imr.13089",
        "paper_author": "Sette A.",
        "affiliation_name": "La Jolla Institute for Immunology",
        "affiliation_city": "La Jolla",
        "affiliation_country": "United States",
        "affiliation_id": "60014683",
        "affiliation_state": "CA"
    },
    {
        "paper_title": "Global Matrix 4.0 Physical Activity Report Card Grades for Children and Adolescents: Results and Analyses From 57 Countries",
        "publication": "Journal of Physical Activity and Health",
        "citied_by": "185",
        "cover_date": "2022-11-01",
        "Abstract": "Background: The Global Matrix 4.0 on physical activity (PA) for children and adolescents was developed to achieve a comprehensive understanding of the global variation in children’s and adolescents’ (5–17 y) PA, related measures, and key sources of influence. The objectives of this article were (1) to summarize the findings from the Global Matrix 4.0 Report Cards, (2) to compare indicators across countries, and (3) to explore trends related to the Human Development Index and geo-cultural regions. Methods: A total of 57 Report Card teams followed a harmonized process to grade the 10 common PA indicators. An online survey was conducted to collect Report Card Leaders’ top 3 priorities for each PA indicator and their opinions on how the COVID-19 pandemic impacted child and adolescent PA indicators in their country. Results: Overall Physical Activity was the indicator with the lowest global average grade (D), while School and Community and Environment were the indicators with the highest global average grade (C+). An overview of the global situation in terms of surveillance and prevalence is provided for all 10 common PA indicators, followed by priorities and examples to support the development of strategies and policies internationally. Conclusions: The Global Matrix 4.0 represents the largest compilation of children’s and adolescents’ PA indicators to date. While variation in data sources informing the grades across countries was observed, this initiative highlighted low PA levels in children and adolescents globally. Measures to contain the COVID-19 pandemic, local/international conflicts, climate change, and economic change threaten to worsen this situation.",
        "DOI": "10.1123/jpah.2022-0456",
        "paper_author": "Aubert S.",
        "affiliation_name": "Active Healthy Kids Global Alliance",
        "affiliation_city": "Ottawa",
        "affiliation_country": "Canada",
        "affiliation_id": "127698282",
        "affiliation_state": "ON"
    },
    {
        "paper_title": "The role of technological progress and renewable energy deployment in green economic growth",
        "publication": "Renewable Energy",
        "citied_by": "184",
        "cover_date": "2022-05-01",
        "Abstract": "This study aims to measure the relationship between technological progress, renewable energy, and green economic growth (GEG). This study uses a data envelopment analysis (DEA) estimation method to evaluate the association between government expenditure on research and development (R&D), renewable energy deployment, and GEG in the Economic Community of West African States (ECOWAS) between 1990 and 2018. The estimates revealed an inconsistent GEG indicator in the analysis, suggesting the lesser impact disposition of public policy. In addition, the energy efficiency ratio of ECOWAS sub-region is under 0.50, implying energy poverty in the sub-region. Many people do not have sufficient energy to heat and cool their homes to enough temperature and meet their basic needs and energy security concerns. This research discovered that a percentage growth increase in renewable energy deployment results in a 3.2% increase in growth in sustainable performance. Alongside an essential effect of one percentage point growth in R&D expenditure boosts economic system sustainable performance to 4.4% combined with a supported effect of one percent. This research reveals that the ECOWAS government expenditure on human resources and R&D of sustainable energy resources would result in a low carbon growth via an advanced technological production process; nevertheless, the impacts are varied in the various countries in ECOWAS.",
        "DOI": "10.1016/j.renene.2022.03.076",
        "paper_author": "Mohsin M.",
        "affiliation_name": "Jiangsu University",
        "affiliation_city": "Zhenjiang",
        "affiliation_country": "China",
        "affiliation_id": "60017482",
        "affiliation_state": "Jiangsu"
    },
    {
        "paper_title": "Determinants of CO2 emissions in the BRICS economies: The role of partnerships investment in energy and economic complexity",
        "publication": "Sustainable Energy Technologies and Assessments",
        "citied_by": "184",
        "cover_date": "2022-06-01",
        "Abstract": "The anthropogenic implications of energy consumption, real income level, and natural resources abundance have been well documented in the environmental economics literature. However, given the uniqueness of many economies i.e., partnerships investment in energy and economic complexity around the globe, it is imperative to investigate the nexus between the outlined variables in a carbon-income framework. To this end, we leverage on second- generational panel methods for its superiority over first-generation model over annual frequency data from 1990 to 2018 for the case of BRICS countries. Empirical findings show that positive changes in trade openness and economic complexity stimulate environmental quality. On the contrary, economic growth, natural resources and public-private partnership contribute to environmental degradation. Based on these results, new insights are obtained for the policymakers, and policies are recommended to develop the environmental quality in BRICS economies.",
        "DOI": "10.1016/j.seta.2021.101907",
        "paper_author": "Caglar A.E.",
        "affiliation_name": "Akdeniz Üniversitesi",
        "affiliation_city": "Antalya",
        "affiliation_country": "Türkiye",
        "affiliation_id": "60010104",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Preparedness of countries to face COVID-19 pandemic crisis: Strategic positioning and factors supporting effective strategies of prevention of pandemic threats",
        "publication": "Environmental Research",
        "citied_by": "183",
        "cover_date": "2022-01-01",
        "Abstract": "The Coronavirus Disease 2019 (COVID-19) continues to generate a constant pandemic threat with new mutations of the viral agent (SARS-CoV-2) that create socioeconomic issues. One of the fundamental problems is the evaluation of the preparedness of countries to cope with COVID-19 pandemic crisis to detect and support factors associated with the reduction of mortality and the growth of vaccinations in society. The study here confronts this problem by developing two basic indexes, which measure the performance of countries to face pandemic threats. In particular, the Index r (as resilience) detects the countries having the best performance in the reduction of the negative impact of mortality related to COVID-19 pandemic and the Index p (as preparedness and prevention) assesses best-performer countries to support COVID-19 vaccinations in order to constrain future pandemic threats and support the recovery of socioeconomic systems. Index of resilience is a composite measure based on three indicators associated with COVID-19, given by average mortality, hospital occupancy and Intensive Care Units occupancy per 100 000 people, producing an overall score; Index of preparedness/prevention is a composite measure of two indicators related to COVID-19 vaccinations (i.e., doses of vaccines administered and total vaccinates per 100 000 people), producing also an overall score of performance. The application of these indexes on a case study of European countries, having a homogenous socioeconomic area, shows the strategic positioning of countries to cope with a major pandemic threat. Findings reveal that all countries have some weaknesses and no country has a high preparedness to cope with a major epidemic or pandemic. Moreover, results suggest that best-performer countries to cope with COVID-19 pandemic crisis have a smaller size of population and/or better public governance, associated with high expenditures in health system. These indexes can help policymakers for designing effective strategies to improve preparedness and prevention of countries to face future pandemic threats.",
        "DOI": "10.1016/j.envres.2021.111678",
        "paper_author": "Coccia M.",
        "affiliation_name": "Consiglio Nazionale delle Ricerche",
        "affiliation_city": "Rome",
        "affiliation_country": "Italy",
        "affiliation_id": "60021199",
        "affiliation_state": "RM"
    },
    {
        "paper_title": "Energy transition scenarios: What policies, societal attitudes, and technology developments will realize the EU Green Deal?",
        "publication": "Energy",
        "citied_by": "182",
        "cover_date": "2022-01-15",
        "Abstract": "The European Green Deal has been heralded as the“Europe's man on the moon moment” as it aims to achieve 100% GHG reductions by 2050. Achieving the decarbonization of the energy system will be driven by a combination of factors and synergies between technological development, policy exertion and societal attitudes. In this paper, we present an original set of future storylines until the year 2050 to inspire modelers, policy makers, industry actors, and the public to understand: Without technological developments in the next decades, to what extent can we rely on societal commitment or stronger cooperation within the EU to achieve climate targets? What technological innovations could become a cornerstone of an effective European energy transition? Through analyzing four pathways (shaped by the crossroads of policy-technology-society developments), results indicate that high electrification rates are imminent to achieve a rapid decarbonization. This implies that technology development and deployment must go hand-in-hand with strong policy enforcement in the short-term to speed-up the energy transition. Then, based on a review of European energy transition scenarios, these and other insights are compared vis-à-vis with other scenarios studies to identify similarities of pathway results and to elaborate on consolidated findings relevant to the EU Green Deal.",
        "DOI": "10.1016/j.energy.2021.122067",
        "paper_author": "Hainsch K.",
        "affiliation_name": "Technische Universität Berlin",
        "affiliation_city": "Berlin",
        "affiliation_country": "Germany",
        "affiliation_id": "60011604",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The unintended consequences of COVID-19 vaccine policy: why mandates, passports and restrictions may cause more harm than good",
        "publication": "BMJ Global Health",
        "citied_by": "181",
        "cover_date": "2022-05-26",
        "Abstract": "Vaccination policies have shifted dramatically during COVID-19 with the rapid emergence of population-wide vaccine mandates, domestic vaccine passports and differential restrictions based on vaccination status. While these policies have prompted ethical, scientific, practical, legal and political debate, there has been limited evaluation of their potential unintended consequences. Here, we outline a comprehensive set of hypotheses for why these policies may ultimately be counterproductive and harmful. Our framework considers four domains: (1) behavioural psychology, (2) politics and law, (3) socioeconomics, and (4) the integrity of science and public health. While current vaccines appear to have had a significant impact on decreasing COVID-19-related morbidity and mortality burdens, we argue that current mandatory vaccine policies are scientifically questionable and are likely to cause more societal harm than good. Restricting people's access to work, education, public transport and social life based on COVID-19 vaccination status impinges on human rights, promotes stigma and social polarisation, and adversely affects health and well-being. Current policies may lead to a widening of health and economic inequalities, detrimental long-term impacts on trust in government and scientific institutions, and reduce the uptake of future public health measures, including COVID-19 vaccines as well as routine immunisations. Mandating vaccination is one of the most powerful interventions in public health and should be used sparingly and carefully to uphold ethical norms and trust in institutions. We argue that current COVID-19 vaccine policies should be re-evaluated in light of the negative consequences that we outline. Leveraging empowering strategies based on trust and public consultation, and improving healthcare services and infrastructure, represent a more sustainable approach to optimising COVID-19 vaccination programmes and, more broadly, the health and well-being of the public.",
        "DOI": "10.1136/bmjgh-2022-008684",
        "paper_author": "Bardosh K.",
        "affiliation_name": "University of Washington",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60015481",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Human health impacts of exposure to phthalate plasticizers: An overview of reviews",
        "publication": "Environment International",
        "citied_by": "180",
        "cover_date": "2022-01-01",
        "Abstract": "In this review of reviews, we overview the current global body of available evidence from structured reviews of epidemiological studies that explore human health outcomes associated with exposure to phthalates (chemical plasticisers commonly found in plastics). We found robust evidence for an association with lower semen quality, neurodevelopment and risk of childhood asthma, and moderate to robust evidence for impact on anogenital distance in boys. We identified moderate evidence for an association between phthalates/metabolites and low birthweight, endometriosis, decreased testosterone, ADHD, Type 2 diabetes and breast/uterine cancer. There was some evidence for other outcomes including anofourchette distance, fetal sex hormones, pre-term birth, lower antral follicle count, reduced oestrodiol, autism, obesity, thyroid function and hearing disorders. We found no reviews of epidemiological human studies on the impact of phthalates from recycled plastics on human health. We recommend that future research should use urine samples as exposure measures, consider confounders in analyses and measure impacts on female reproductive systems. Our findings align with emerging research indicating that health risks can occur at exposure levels below the “safe dose” levels set out by regulators, and are of particular concern given potential additive or synergistic “cocktail effects” of chemicals. This raises important policy and regulatory issues for identifying and controlling plastics and health related impacts and highlights a need for more research into substances of concern entering plastics waste streams via recycling.",
        "DOI": "10.1016/j.envint.2021.106903",
        "paper_author": "Eales J.",
        "affiliation_name": "University of Exeter Medical School",
        "affiliation_city": "Exeter",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60111707",
        "affiliation_state": "Devon"
    },
    {
        "paper_title": "Prevalence, incidence and survival of heart failure: a systematic review",
        "publication": "Heart",
        "citied_by": "179",
        "cover_date": "2022-01-01",
        "Abstract": "Studies of the epidemiology of heart failure in the general population can inform assessments of disease burden, research, public health policy and health system care delivery. We performed a systematic review of prevalence, incidence and survival for all available population-representative studies to inform the Global Burden of Disease 2020. We examined population-based studies published between 1990 and 2020 using structured review methods and database search strings. Studies were sought in which heart failure was defined by clinical diagnosis using structured criteria such as the Framingham or European Society of Cardiology criteria, with studies using alternate case definitions identified for comparison. Study results were extracted with descriptive characteristics including age range, location and case definition. Search strings identified 42 360 studies over a 30-year period, of which 790 were selected for full-text review and 125 met criteria for inclusion. 45 sources reported estimates of prevalence, 41 of incidence and 58 of mortality. Prevalence ranged from 0.2%, in a Hong Kong study of hospitalised heart failure patients in 1997, to 17.7%, in a US study of Medicare beneficiaries aged 65+ from 2002 to 2013. Collapsed estimates of incidence ranged from 0.1%, in the EPidémiologie de l’Insuffisance Cardiaque Avancée en Lorraine (EPICAL) study of acute heart failure in France among those aged 20–80 years in 1994, to 4.3%, in a US study of Medicare beneficiaries 65+ from 1994 to 2003. One-year heart failure case fatality ranged from 4% to 45% with an average of 33% overall and 24% for studies across all adult ages. Diagnostic criteria, case ascertainment strategy and demographic breakdown varied widely between studies. Prevalence, incidence and survival for heart failure varied widely across countries and studies, reflecting a range of study design. Heart failure remains a high prevalence disease among older adults with a high risk of death at 1 year.",
        "DOI": "10.1136/heartjnl-2021-320131",
        "paper_author": "Emmons-Bell S.",
        "affiliation_name": "Institute for Health Metrics and Evaluation",
        "affiliation_city": "Seattle",
        "affiliation_country": "United States",
        "affiliation_id": "60091926",
        "affiliation_state": "WA"
    },
    {
        "paper_title": "Urgent need for a non-discriminatory and non-stigmatizing nomenclature for monkeypox virus",
        "publication": "PLoS Biology",
        "citied_by": "178",
        "cover_date": "2022-08-01",
        "Abstract": "NA",
        "DOI": "10.1371/journal.pbio.3001769",
        "paper_author": "Happi C.",
        "affiliation_name": "Redeemer‘s University",
        "affiliation_city": "Ede",
        "affiliation_country": "Nigeria",
        "affiliation_id": "60111705",
        "affiliation_state": "Ogun"
    },
    {
        "paper_title": "Wicked Problems in Public Policy: Understanding and Responding to Complex Challenges",
        "publication": "Wicked Problems in Public Policy: Understanding and Responding to Complex Challenges",
        "citied_by": "177",
        "cover_date": "2022-01-01",
        "Abstract": "This is an open access book. This book offers the first overview of the ‘wicked problems’ literature, often seen as complex, open-ended, and intractable, with both the nature of the ‘problem’ and the preferred ‘solution’ being strongly contested. It contextualises the debate using a wide range of relevant policy examples, explaining why these issues attract so much attention. There is an increasing interest in the conceptual and practical aspects of how ‘wicked problems’ are identified, understood and managed by policy practitioners. The standard public management responses to complexity and uncertainty (including traditional regulation and market-based solutions) are insufficient. Leaders often advocate and implement ideological ‘quick fixes’, but integrative and inclusive responses are increasingly being utilised to recognise the multiple interests and complex causes of these problems. This book uses examples from a wide rangeof social, economic and environmental fields in order to develop new insights about better solutions, and thus gain broad stakeholder acceptance for shared strategies for tackling ‘wicked problems’.",
        "DOI": "10.1007/978-3-030-94580-0",
        "paper_author": "Head B.W.",
        "affiliation_name": "The University of Queensland",
        "affiliation_city": "Brisbane",
        "affiliation_country": "Australia",
        "affiliation_id": "60031004",
        "affiliation_state": "QLD"
    },
    {
        "paper_title": "Decarbonizing the iron and steel industry: A systematic review of sociotechnical systems, technological innovations, and policy options",
        "publication": "Energy Research and Social Science",
        "citied_by": "176",
        "cover_date": "2022-07-01",
        "Abstract": "The iron and steel industry is the largest coal consumer and the most greenhouse gas intensive industry. It consumes about 7% of global energy supply, and conservative estimates report that it is responsible for 7–9% of global greenhouse gas emissions. Decarbonization of the iron and steel industry is thus vital to meet climate change mitigation targets and achieve a sustainable future for the industry. This paper presents a comprehensive and systematic review that considered more than 1.6 million pieces of literature and analyzes in depth a shortlist of 271 studies on the iron and steel industry's decarbonization. Applying a sociotechnical lens that investigates raw materials, iron and steel making processes, steel products making and usage, and waste and recycling, the review identifies the climate footprint of the iron and steel industry. The review also assesses current and emerging practices for decarbonization, identifying 86 potentially transformative technologies. The benefits of decarbonizing the iron and steel industry are considered through energy and carbon savings, financial savings, and other environmental and public health benefits. Barriers to decarbonization are considered across financial, organizational, and behavioral aspects. The review also discusses various financial tools and policy instruments that can help overcome the barriers. Lastly, research gaps are outlined.",
        "DOI": "10.1016/j.erss.2022.102565",
        "paper_author": "Kim J.",
        "affiliation_name": "Hanyang University",
        "affiliation_city": "Seoul",
        "affiliation_country": "South Korea",
        "affiliation_id": "60024872",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "SARS-CoV-2 reinfections: Overview of efficacy and duration of natural and hybrid immunity",
        "publication": "Environmental Research",
        "citied_by": "175",
        "cover_date": "2022-06-01",
        "Abstract": "Seroprevalence surveys suggest that more than a third and possibly more than half of the global population has been infected with SARS-CoV-2 by early 2022. As large numbers of people continue to be infected, the efficacy and duration of natural immunity in terms of protection against SARS-CoV-2 reinfections and severe disease is of crucial significance for the future. This narrative review provides an overview on epidemiological studies addressing this issue. National surveys covering 2020–2021 documented that a previous SARS-CoV-2 infection is associated with a significantly reduced risk of reinfections with efficacy lasting for at least one year and only relatively moderate waning immunity. Importantly, natural immunity showed roughly similar effect sizes regarding protection against reinfection across different SARS-CoV-2 variants, with the exception of the Omicron variant for which data are just emerging before final conclusions can be drawn. Risk of hospitalizations and deaths was also reduced in SARS-CoV-2 reinfections versus primary infections. Observational studies indicate that natural immunity may offer equal or greater protection against SARS-CoV-2 infections compared to individuals receiving two doses of an mRNA vaccine, but data are not fully consistent. The combination of a previous SARS-CoV-2 infection and a respective vaccination, termed hybrid immunity, seems to confer the greatest protection against SARS-CoV-2 infections, but several knowledge gaps remain regarding this issue. Natural immunity should be considered for public health policy regarding SARS-CoV-2.",
        "DOI": "10.1016/j.envres.2022.112911",
        "paper_author": "Pilz S.",
        "affiliation_name": "Medizinische Universität Graz",
        "affiliation_city": "Graz",
        "affiliation_country": "Austria",
        "affiliation_id": "60006224",
        "affiliation_state": "Styria"
    },
    {
        "paper_title": "The global NAFLD policy review and preparedness index: Are countries ready to address this silent public health challenge?",
        "publication": "Journal of Hepatology",
        "citied_by": "175",
        "cover_date": "2022-04-01",
        "Abstract": "Background & Aims: Non-alcoholic fatty liver disease (NAFLD) is a highly prevalent, yet largely underappreciated liver condition which is closely associated with obesity and metabolic disease. Despite affecting an estimated 1 in 4 adults globally, NAFLD is largely absent on national and global health agendas. Methods: We collected data from 102 countries, accounting for 86% of the world population, on NAFLD policies, guidelines, civil society engagement, clinical management, and epidemiologic data. A preparedness index was developed by coding questions into 6 domains (policies, guidelines, civil awareness, epidemiology and data, NAFLD detection, and NAFLD care management) and categorising the responses as high, medium, and low; a multiple correspondence analysis was then applied. Results: The highest scoring countries were India (42.7) and the United Kingdom (40.0), with 32 countries (31%) scoring zero out of 100. For 5 of the domains a minority of countries were categorised as high-level while the majority were categorised as low-level. No country had a national or sub-national strategy for NAFLD and <2% of the different strategies for related conditions included any mention of NAFLD. National NAFLD clinical guidelines were present in only 32 countries. Conclusions: Although NAFLD is a pressing public health problem, no country was found to be well prepared to address it. There is a pressing need for strategies to address NAFLD at national and global levels. Lay summary: Around a third of the countries scored a zero on the NAFLD policy preparedness index, with no country scoring over 50/100. Although NAFLD is a pressing public health problem, a comprehensive public health response is lacking in all 102 countries. Policies and strategies to address NAFLD at the national and global levels are urgently needed.",
        "DOI": "10.1016/j.jhep.2021.10.025",
        "paper_author": "Lazarus J.V.",
        "affiliation_name": "Universitat de Barcelona",
        "affiliation_city": "Barcelona",
        "affiliation_country": "Spain",
        "affiliation_id": "60001576",
        "affiliation_state": "Barcelona"
    },
    {
        "paper_title": "Analysis of emission reduction effects of carbon trading: Market mechanism or government intervention?",
        "publication": "Sustainable Production and Consumption",
        "citied_by": "174",
        "cover_date": "2022-09-01",
        "Abstract": "Carbon trading is a crucial policy to combat climate change and China's carbon market is considered one of the carbon markets to consider. Some studies have shown that China's carbon trading scheme promotes carbon reduction. However, others have shown that low carbon prices and poor liquidity characterize China's carbon market. How can China's carbon trading mechanism achieve the expected emission reduction when the market mechanism has not been fully established? To answer it, this article collected 30 Chinese provinces' panel data from 2005 to 2019 and explored the relationship between the implementation of carbon trading policies and carbon emission reduction through a multi-period difference-in-differences model. In addition, a series of robustness tests were performed. The results indicate that carbon trading does effectively curb carbon emissions. But this policy effect is not achieved through the market mechanism. In the pilot phase of China's carbon market, government intervention played a significant role in reducing carbon emissions. The results also suggest that the carbon trading mechanism promotes carbon emission reduction through energy consumption rather than industrial structure. This study enriches the empirical evidence of carbon trading and provides valuable references for policymakers and the construction of carbon markets.",
        "DOI": "10.1016/j.spc.2022.06.016",
        "paper_author": "Lin B.",
        "affiliation_name": "Xiamen University",
        "affiliation_city": "Xiamen",
        "affiliation_country": "China",
        "affiliation_id": "60018205",
        "affiliation_state": "Fujian"
    },
    {
        "paper_title": "Global Changes in Child and Adolescent Physical Activity during the COVID-19 Pandemic: A Systematic Review and Meta-analysis",
        "publication": "JAMA Pediatrics",
        "citied_by": "173",
        "cover_date": "2022-09-01",
        "Abstract": "Importance: Numerous physical distancing measures were implemented to mitigate the spread of the COVID-19 virus, which could have negatively affected child and adolescent physical activity levels. Objectives: To conduct a systematic review and meta-analysis of the literature that used validated measures to document changes in child and adolescent physical activity during the COVID-19 pandemic and to estimate whether changes in physical activity differed between participant-level, contextual, and methodological moderators. Data Sources: PubMed, PsycInfo, SPORTDiscus, Web of Science, Scopus, CINAHL, and MEDLINE were searched (from January 1, 2020, to January 1, 2022). A total of 1085 nonduplicate records were retrieved. Study Selection: Studies were included if they reported (1) changes in the duration of physical activity at any intensity for children or adolescents (age ≤18 years) comparing before and during the COVID-19 pandemic using validated physical activity measurement tools and were (2) from general population samples, (3) peer-reviewed, and (4) published in English. Data Extraction and Synthesis: A total of 126 articles underwent full-text review. Data were analyzed using a random-effects meta-analysis, which was conducted in January 2022. Main Outcomes and Measures: Change in the duration of engagement in physical activity at any intensity comparing before and during COVID-19. Results: Twenty-two studies including 46 independent samples and 79 effect sizes from 14216 participants (median age, 10.5 years; range, 3-18 years) were included. The percentage change in the duration of engagement in total daily physical activity from before to during COVID-19 was -20% (90% CI, -34% to -4%). Moderation analyses revealed that changes were larger for higher-intensity activities (-32%; 90% CI, -44% to -16%), corresponding to a 17-minute reduction in children's daily moderate-to-vigorous physical activity levels. The reduction in physical activity was also larger for samples located at higher latitudes (37%; 90% CI, -1% to 89%) and for studies with a longer duration between physical activity assessments (25%; 90% CI, -0.5% to 58%). Conclusions and Relevance: Children and adolescents have experienced measurable reductions in physical activity during the COVID-19 pandemic. Findings underscore the need to provide bolstered access to support and resources related to physical activity to ensure good health and social functioning among children and adolescents during pandemic recovery efforts.",
        "DOI": "10.1001/jamapediatrics.2022.2313",
        "paper_author": "Neville R.D.",
        "affiliation_name": "University College Dublin",
        "affiliation_city": "Dublin",
        "affiliation_country": "Ireland",
        "affiliation_id": "60005141",
        "affiliation_state": "Leinster"
    },
    {
        "paper_title": "The effects of digital finance and financial constraint on financial performance: Firm-level evidence from China's new energy enterprises",
        "publication": "Energy Economics",
        "citied_by": "171",
        "cover_date": "2022-08-01",
        "Abstract": "Sustainable development comprises two key factors: new energy and digital finance. In the case of China, given the significant investment and financing problem that confronts its new energy development plans, it remains unclear whether digital finance plays a role in the matter. In this study, panel data of 157 Chinese listed new energy companies and the digital finance index constructed by Peking University Institute of Digital Finance are analyzed via the system of generalized moment method to determine the effects of digital finance and financial constraints on a firm's financial performance. The results show that digital finance can contribute to new energy firms' financial performance, while financial constraints have a robust negative effect on the same. Further, financial constraints weaken the role of digital finance. Moreover, a heterogeneous analysis reveals the following. First, the promotion effect of digital finance is larger among small firms and non-state-owned enterprises. Second, the magnitude of the inhibition effect of financial constraints is higher among larger firms. This study elucidates the role of digital finance in promoting the development of new energy industry and bears critical policy implications.",
        "DOI": "10.1016/j.eneco.2022.106158",
        "paper_author": "Wu Y.",
        "affiliation_name": "Renmin University of China",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60014402",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Economic impacts of overweight and obesity: current and future estimates for 161 countries",
        "publication": "BMJ Global Health",
        "citied_by": "170",
        "cover_date": "2022-09-20",
        "Abstract": "Introduction The scope of the challenge of overweight and obesity (OAO) has not been fully realised globally, in part because much of what is known about the economic impacts of OAO come from high-income countries (HICs) and are not readily comparable due to methodological differences. Our objective is to estimate the current and future national economic impacts of OAO globally. Methods We estimated economic impacts of OAO for 161 countries using a cost-of-illness approach. Direct and indirect costs of OAO between 2019 and 2060 were estimated from a societal perspective. We assessed the effect of two hypothetical scenarios of OAO prevalence projections. Country-specific data were sourced from published studies and global databases. Results The economic impact of OAO in 2019 is estimated at 2.19% of global gross domestic product (GDP) ranging on average from US$20 per capita in Africa to US$872 per capita in the Americas and from US$6 in low-income countries to US$1110 in HICs. If current trends continue, by 2060, the economic impacts from OAO are projected to rise to 3.29% of GDP globally. The biggest increase will be concentrated in lower resource countries with total economic costs increasing by fourfold between 2019 and 2060 in HICs, whereas they increase 12-25 times in low and middle-income countries. Reducing projected OAO prevalence by 5% annually from current trends or keeping it at 2019 levels will translate into average annual reductions of US$429 billion or US$2201 billion in costs, respectively, between 2020 and 2060 globally. Conclusion This study provides novel evidence on the economic impact of OAO across different economic and geographic contexts. Our findings highlight the need for concerted and holistic action to address the global rise in OAO prevalence, to avert the significant risks of inaction and achieve the promise of whole-of-society gains in population well-being.",
        "DOI": "10.1136/bmjgh-2022-009773",
        "paper_author": "Okunogbe A.",
        "affiliation_name": "RTI International",
        "affiliation_city": "Research Triangle Park",
        "affiliation_country": "United States",
        "affiliation_id": "60032205",
        "affiliation_state": "NC"
    },
    {
        "paper_title": "Sustainable Electric Vehicle Batteries for a Sustainable World: Perspectives on Battery Cathodes, Environment, Supply Chain, Manufacturing, Life Cycle, and Policy",
        "publication": "Advanced Energy Materials",
        "citied_by": "169",
        "cover_date": "2022-07-01",
        "Abstract": "Li-ion batteries (LIBs) can reduce carbon emissions by powering electric vehicles (EVs) and promoting renewable energy development with grid-scale energy storage. However, LIB production and electricity generation still heavily rely on fossil fuels at present, resulting in major environmental concerns. Are LIBs as environmentally friendly and sustainable as expected at the current stage? In the past 5 years, a skyrocketing growth of the EV market has been witnessed. LIBs have garnered huge attention from academia, industry, government, non-governmental organizations, investors, and the general public. Tremendous volumes of LIBs are already implemented in EVs today, with a continuing, exponential growth expected for the years to come. When LIBs reach their end-of-life in the next decades, what technologies can be in place to enable second-life or recycling of batteries? Herein, life cycle assessment studies are examined to evaluate the environmental impact of LIBs, and EVs are compared with internal combustion engine vehicles regarding environmental sustainability. To provide a holistic view of the LIB development, this Perspective provides insights into materials development, manufacturing, recycling, legislation and policy, and beyond. Last but not least, the future development of LIBs and charging infrastructures in light of emerging technologies are envisioned.",
        "DOI": "10.1002/aenm.202200383",
        "paper_author": "Yang Z.",
        "affiliation_name": "Virginia Polytechnic Institute and State University",
        "affiliation_city": "Blacksburg",
        "affiliation_country": "United States",
        "affiliation_id": "60027090",
        "affiliation_state": "VA"
    },
    {
        "paper_title": "Nitrate and nitrite contamination in drinking water and cancer risk: A systematic review with meta-analysis",
        "publication": "Environmental Research",
        "citied_by": "169",
        "cover_date": "2022-07-01",
        "Abstract": "Background: Pollution of water sources, largely from wide-scale agricultural fertilizer use has resulted in nitrate and nitrite contamination of drinking water. The effects on human health of raised nitrate and nitrite levels in drinking water are currently unclear. Objectives: We conducted a systematic review of peer-reviewed literature on the association of nitrate and nitrite in drinking water with human health with a specific focus on cancer. Methods: We searched eight databases from 1 January 1990 until 28 February 2021. Meta-analyses were conducted when studies had the same exposure metric and outcome. Results: Of 9835 studies identified in the literature search, we found 111 studies reporting health outcomes, 60 of which reported cancer outcomes (38 case-control studies; 12 cohort studies; 10 other study designs). Most studies were set in the USA (24), Europe (20) and Taiwan (14), with only 3 studies from low and middle-income countries. Nitrate exposure in water (59 studies) was more commonly investigated than nitrite exposure (4 studies). Colorectal (15 studies) and gastric (13 studies) cancers were the most reported. In meta-analyses (4 studies) we identified a positive association of nitrate exposure with gastric cancer, OR = 1.91 (95%CI = 1.09–3.33) per 10 mg/L increment in nitrate ion. We found no association of nitrate exposure with colorectal cancer (10 studies; OR = 1.02 [95%CI = 0.96–1.08]) or cancers at any other site. Conclusions: We identified an association of nitrate in drinking water with gastric cancer but with no other cancer site. There is currently a paucity of robust studies from settings with high levels nitrate pollution in drinking water. Research into this area will be valuable to ascertain the true health burden of nitrate contamination of water and the need for public policies to protect human health.",
        "DOI": "10.1016/j.envres.2022.112988",
        "paper_author": "Picetti R.",
        "affiliation_name": "London School of Hygiene &amp; Tropical Medicine",
        "affiliation_city": "London",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60031331",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Does green finance matter for sustainable entrepreneurship and environmental corporate social responsibility during COVID-19?",
        "publication": "China Finance Review International",
        "citied_by": "169",
        "cover_date": "2022-04-07",
        "Abstract": "Purpose: The discourse aimed to investigate green finance practices under the assumptions of several notable climate advisors and speculators in Asia and particularly in Southeast Asia. The study intrigues by considering financial specialists to vent government spending on green restoration plans leading toward green bankable venture openings for the public and private sector. This section distinguishes a few of the green fund components and approaches that can be joined by national and neighborhood governments, essentially in Southeast Asia, into their post-COVID-19 techniques, but are too valuable inputs for domestic commercial banks and private corporates. Design/methodology/approach: It can be defined as a functional type for Cobb Douglas development. ARDL technology is a way of calculating complex forces at the classification level at long-term and short-term stages. This ARDL approach has many advantages and can be implemented when incorporated in level I (0) and level I first (1) with the original variable. Still, it offers robust ability to the outcomes and standardizes the lag, considering the number and sample size used. Pooled mean group (PMG) method is becoming a convenient technique for monitoring data over the period and a good approach for energy impact panels – growth ties for creating links between energy emissions and environmental sustainability and businesses in the nation. Findings: There is a positive partnership between creativity and a sustainable world. Corporations are recommended to uphold the principles of CSR in the development process by introducing environmentally friendly advanced technologies. The main objectives of corporate social responsibility (CSR) are economic growth, environmental sustainability and social justice. Several programs have been established to expand businesses' responsibilities to improve their confessions in sustainable growth. SMEs are a primary source of production of innovative products and technologies. The key concerns of stakeholders and politicians in the new competitive business climate are the protection of environmental sustainability and social responsibility, recognizing factors driving economic development for SMEs. Originality/value: During the COVID-19 era, the prime responsibility of pandemic confronting governments is to spend on help activities (that have been started in earlier phase) and recovery endeavors (yet to start in the situation). Therefore, the governments may devise policies to pool resources from commercial, private, public-private partnerships and other capital market sources. With rising hazard recognitions particularly emerging from at-threat income projections, governments ought to make the correct mechanisms and instruments that can perform this catalytic part of derisking and drawing in such capital. This too can be an opportunity for governments to enhance and execute such financial instruments that offer assistance, quicken their commitments to climate alter beneath the Paris Agreement and the sustainable development goals (SDGs), and thus “build back better” is being progressively voiced over the world.",
        "DOI": "10.1108/CFRI-02-2021-0038",
        "paper_author": "Sadiq M.",
        "affiliation_name": "Taylor's University Malaysia",
        "affiliation_city": "Subang Jaya",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60104614",
        "affiliation_state": "Selangor"
    },
    {
        "paper_title": "Global guidelines and requirements for professional competencies of natural resource extraction engineers: Implications for ESG principles and sustainable development goals",
        "publication": "Journal of Cleaner Production",
        "citied_by": "168",
        "cover_date": "2022-03-01",
        "Abstract": "The future limitation of certain types of minerals due to reduced availability and monopolization of their production requires international legal principles to forecast and respond to international environmental policy. The efficiency and complexity of mineral extraction in terms of environmental, social, governance (ESG) principles is largely determined by the level of professional competence of an extractive company. The level of professional competence of a resource extraction engineer is the equivalent of trust in the company's activities and its ability to comply with ESG principles. The paper proposes for consideration a system for determining the levels of professional competencies of the “Professional Resource Extraction Engineer” based on the “International Standards for Resource Extraction Engineers (ISREE)\". Threshold requirements for additional knowledge are expected to be introduced in areas such as ethics, safety, environment and preservation of financial viability. The developed methodology and digital indicators for evaluating the activities of public extractive companies, with consideration to ESG principles and sustainable development goals (SDG), allows increasing transparency and trust in its activities of the local population.",
        "DOI": "10.1016/j.jclepro.2022.130530",
        "paper_author": "Litvinenko V.",
        "affiliation_name": "Saint Petersburg Mining University",
        "affiliation_city": "Saint Petersburg",
        "affiliation_country": "Russian Federation",
        "affiliation_id": "60029071",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Drivers and barriers towards circular economy in the building sector: Stakeholder interviews and analysis of five european countries policies and practices",
        "publication": "Journal of Cleaner Production",
        "citied_by": "168",
        "cover_date": "2022-02-15",
        "Abstract": "Circular economy has become central in the European policy arena, and the Member States have promoted a number of initiatives and programs to shift from their traditional linear economy towards a circular economy. This is particularly relevant for the construction sector, which is the highest producer of waste and one of the main causes of resources consumption. The paper objective is to analyse the present level of application of circularity strategies, identifying the related barriers and drivers, through interviews with building stakeholders across five European countries, Belgium (Flanders), Netherlands, United Kingdom, Denmark, and Italy. The analysis focuses on the building level and assesses the level of application in current policies and practices of circular strategies in three key field: resource and waste management, design for reversible building, and business for the networking of operators in the construction value chain. The results highlight the different and fragmented circular strategies currently applied in the analysed countries analysed, highlighting the need for more effective and coordinated actions and policies promoted by European Commission. In particular, the current legislative framework promotes the waste management strategies, focusing more on recycling practices than on reuse or resource management. The design strategies for reversible building are generally in private initiatives, driven by market competitions, rather than by public incentives. The application of circular business models and the creation of circular networks among the operators of the value chain is still lacking. Furthermore, the use of life-cycle tools to assess the environmental effectiveness (sustainability) of circular strategies is rarely applied. The recommendations that emerged from the comparison of the current applications of circular economy strategies across the countries analysed and demanded by key players in the construction sector interviewed, include the need for greater international coordination in terms of policy, practices and enabling tools (digital data, platforms, traceability). Improvements in both the legislative framework and practices are needed. Future development of research regards, in particular, the fields of digital supporting tools and environmental assessment (LCA), circular relationships and business models and the definition/training of new expertise related to enabling aspects.",
        "DOI": "10.1016/j.jclepro.2022.130395",
        "paper_author": "Giorgi S.",
        "affiliation_name": "Politecnico di Milano",
        "affiliation_city": "Milan",
        "affiliation_country": "Italy",
        "affiliation_id": "60023256",
        "affiliation_state": "MI"
    },
    {
        "paper_title": "The nexus between COVID-19 fear and stock market volatility",
        "publication": "Economic Research-Ekonomska Istrazivanja",
        "citied_by": "168",
        "cover_date": "2022-01-01",
        "Abstract": "This study described an empirical link between COVID-19 fear and stock market volatility. Studying COVID-19 fear with stock market volatility is crucial for planning adequate portfolio diversification in international financial markets. The study used AR (1)–GARCH (1,1) to measure stock market volatility associated with the COVID-19 pandemic. Our findings suggest that COVID-19 fear is the ultimate cause driving public attention and stock market volatility. The results demonstrate that stock market performance and GDP growth decreased significantly through average increases during the pandemic. Further, with a 1% increase in COVID-19 cases, the stock return and GDP decreased by 0.8%, 0.56%, respectively. However, GDP growth demonstrated a slight movement with stock exchange. Moreover, public attention to the attitude of buying or selling was highly dependent on the COVID-19 pandemic reported cases index, death index, and global fear index. Consequently, investment in the gold market, rather than in the stock market, is recommended. The study also suggests policy implications for key stakeholders.",
        "DOI": "10.1080/1331677X.2021.1914125",
        "paper_author": "Li W.",
        "affiliation_name": "Zhejiang International Studies University",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60108785",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "The roles of technology and Kyoto Protocol in energy transition towards COP26 targets: Evidence from the novel GMM-PVAR approach for G-7 countries",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "167",
        "cover_date": "2022-08-01",
        "Abstract": "The investigation of the determinants of energy transition has become very attractive and popular due to the Sustainable Development Goals and COP26 targets. However, one shortcoming of the existing studies is the inability to understand the effects of technology and environmental policy to energy transition while the other criticism is the use of conventional techniques that do not handle the endogeneity issue. Thus, this study investigates the impacts of technology and Kyoto Protocol in addition to several control variables to energy transition by applying the novel econometric method of Sigmund and Ferstl (2021) on the annual data from 2000 to 2019 for G-7 countries. The empirical results confirm the positive and significant link between technology and energy transition, such that, a 1% rise in technology enhances the energy transition by 0.32%. Similarly, Kyoto Protocol has a significantly positive impact on energy transition. An explanation is that the Protocol is based on principles and policies that emphasize the advanced and industrialized economies to enhance the environmental quality by promoting the renewable energy resources and reducing the greenhouse gases. Furthermore, the G-7 authorities should start to provide subsidies to clean energy and technology-related investors and levy multiple disincentives (i.e., higher tax rates) on the industries deploying the conventional and polluting methods for energy production. Further policy implications are discussed in the study.",
        "DOI": "10.1016/j.techfore.2022.121756",
        "paper_author": "Dogan E.",
        "affiliation_name": "College of Business Administration",
        "affiliation_city": "Sharjah",
        "affiliation_country": "United Arab Emirates",
        "affiliation_id": "60227737",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The Global Burden of Osteoporosis, Low Bone Mass, and Its Related Fracture in 204 Countries and Territories, 1990-2019",
        "publication": "Frontiers in Endocrinology",
        "citied_by": "165",
        "cover_date": "2022-05-20",
        "Abstract": "Background: Low bone mineral density (LBMD), including osteoporosis and low bone mass, has becoming a serious public health concern. We aimed to estimate the disease burden of LBMD and its related fractures in 204 countries and territories over the past 30 years. Methods: We collected detailed information and performed a secondary analysis for LBMD and its related fractures from the Global Burden of Disease Study 2019. Numbers and age-standardized rates related to LBMD of disability-adjusted life-years (DALYs) and deaths in 204 countries and territories were compared by age, gender, socio-demographic index (SDI), and location. Results: Global deaths and DALYs number attributable to LBMD increased from 207 367 and 8 588 936 in 1990 to 437 884 and 16 647 466 in 2019, with a raise of 111.16% and 93.82%, respectively. DALYs and deaths number of LBMD-related fractures increased 121.07% and 148.65% from 4 436 789 and 121248 in 1990 to 9 808 464 and 301 482 in 2019. In 2019, the five countries with the highest disease burden of DALYs number in LBMD-related fractures were India (2 510 288), China (1 839 375), United States of America (819 445), Japan (323 094), and Germany (297 944), accounting for 25.59%, 18.75%, 8.35%, 3.29%, and 3.04%. There was a quadratic correlation between socio-demographic index (SDI) and burden of LBMD-related fractures: DALYs rate was 179.985-420.435SDI+417.936SDI2(R2 = 0.188, p<0.001); Deaths rate was 7.879-13.416SDI+8.839 SDI2(R2 = 0.101, p<0.001). Conclusions: The global burden of DALYs and deaths associated with LBMD and its related fractures has increased significantly since 1990. There were differences in disease burden between regions and countries. These estimations could be useful in priority setting, policy-making, and resource allocation in osteoporosis prevention and treatment.",
        "DOI": "10.3389/fendo.2022.882241",
        "paper_author": "Shen Y.",
        "affiliation_name": "The Second Affiliated Hospital Zhejiang University School of Medicine",
        "affiliation_city": "Hangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60118432",
        "affiliation_state": "Zhejiang"
    },
    {
        "paper_title": "Meta-analyses of fifteen determinants of public opinion about climate change taxes and laws",
        "publication": "Nature Climate Change",
        "citied_by": "165",
        "cover_date": "2022-03-01",
        "Abstract": "Public acceptance is a precondition for implementing taxes and laws aimed at mitigating climate change. However, it still remains challenging to understand its determinants for the climate community. Here, we use a meta-analytic approach to examine the role of public opinion about climate change taxes and laws. Fifteen variables were examined by synthesizing 89 datasets from 51 articles across 33 countries, with a total sample of 119,465 participants. Among all factors, perceived fairness and effectiveness were the most important determinants. Self-enhancement values and knowledge about climate change showed weak relationships and demographic variables showed only weak or close to zero effects. Our meta-analytic results provide useful insights and have the potential to inform climate change researchers, practitioners and policymakers to better design climate policy instruments.",
        "DOI": "10.1038/s41558-022-01297-6",
        "paper_author": "Bergquist M.",
        "affiliation_name": "Göteborgs Universitet",
        "affiliation_city": "Gothenburg",
        "affiliation_country": "Sweden",
        "affiliation_id": "60016437",
        "affiliation_state": "Vastra Gotaland"
    },
    {
        "paper_title": "Towards Secure and Privacy-Preserving Data Sharing for COVID-19 Medical Records: A Blockchain-Empowered Approach",
        "publication": "IEEE Transactions on Network Science and Engineering",
        "citied_by": "165",
        "cover_date": "2022-01-01",
        "Abstract": "COVID-19 is currently a major global public health challenge. In the battle against the outbreak of COVID-19, how to manage and share the COVID-19 Electric Medical Records (CEMRs) safely and effectively in the world, prevent malicious users from tampering with CEMRs, and protect the privacy of patients are very worthy of attention. In particular, the semi-trusted medical cloud platform has become the primary means of hospital medical data management and information services. Security and privacy issues in the medical cloud platform are more prominent and should be addressed with priority. To address these issues, on the basis of ciphertext policy attribute-based encryption, we propose a blockchain-empowered security and privacy protection scheme with traceable and direct revocation for COVID-19 medical records. In this scheme, we perform the blockchain for uniform identity authentication and all public keys, revocation lists, etc are stored on a blockchain. The system manager server is responsible for generating the system parameters and publishes the private keys for the COVID-19 medical practitioners and users. The cloud service provider (CSP) stores the CEMRs and generates the intermediate decryption parameters using policy matching. The user can calculate the decryption key if the user has private keys and intermediate decrypt parameters. Only when attributes are satisfied access policy and the user's identity is out of the revocation list, the user can get the intermediate parameters by CSP. The malicious users may track according to the tracking list and can be directly revoked. The security analysis demonstrates that the proposed scheme is indicated to be safe under the Decision Bilinear Diffie-Hellman (DBDH) assumption and can resist many attacks. The simulation experiment demonstrates that the communication and storage overhead is less than other schemes in the public-private key generation, CEMRs encryption, and decryption stages. Besides, we also verify that the proposed scheme works well in the blockchain in terms of both throughput and delay.",
        "DOI": "10.1109/TNSE.2021.3101842",
        "paper_author": "Tan L.",
        "affiliation_name": "Sichuan Normal University",
        "affiliation_city": "Chengdu",
        "affiliation_country": "China",
        "affiliation_id": "60014556",
        "affiliation_state": "Sichuan"
    },
    {
        "paper_title": "Agriculture carbon-emission reduction and changing factors behind agricultural eco-efficiency growth in China",
        "publication": "Journal of Cleaner Production",
        "citied_by": "164",
        "cover_date": "2022-02-01",
        "Abstract": "Reducing agricultural carbon emissions (ACE) plays a valuable role in China's overall carbon-emission-reduction plan. Using provincial data from 2001 to 2018, this work explores the dynamics of ACE and agricultural eco-efficiency (AEE) in China and the driving factors of AEE growth by DEA–Malmquist–Luenberger and panel data analyses. A previously unexplored aspect is investigated on the different mechanism of AEE growth among three types of agricultural areas. The findings suggest that the trend of ACE shifted from increasing to continuously decreasing after 2015 at the national level, mainly based on the contribution of major grain-producing areas. The results also imply that the AEE growth mechanism changed after 2010, mainly owing to technological progress. The improvement of agricultural infrastructure and human capital positively contributed to AEE growth, whereas public investment in agricultural R&D and agricultural industrial structure undermined it. Hence, green-oriented policies targeted at regional heterogeneity and agricultural public investments are needed for ACE reduction and AEE growth at the same time.",
        "DOI": "10.1016/j.jclepro.2021.130193",
        "paper_author": "Yang H.",
        "affiliation_name": "Huazhong Agricultural University",
        "affiliation_city": "Wuhan",
        "affiliation_country": "China",
        "affiliation_id": "60032955",
        "affiliation_state": "Hubei"
    },
    {
        "paper_title": "Is smart transportation associated with reduced carbon emissions? The case of China",
        "publication": "Energy Economics",
        "citied_by": "164",
        "cover_date": "2022-01-01",
        "Abstract": "The greenhouse effects of the transportation sector are quite significant as the sector essentially consumes a lot of fossil fuels. To reduce this sector's carbon dioxide (CO2) emissions and achieve carbon neutrality, developing smart transportation has emerged as a promising approach. Accordingly, by employing spatial econometric models, we study the impact of smart transportation on CO2 emissions in China. For this purpose, we first assess smart transportation levels in the 30 Chinese provinces for the period 2002–2017. The results indicate that the overall level of smart transportation displays a significant upward trend, and regional heterogeneity exists. Also, a significant spatial spillover effect is found between smart transportation and CO2 emissions in China, implying that a province's carbon mitigation not only depends on the development of its own smart transportation, but also on that of neighboring provinces. Smart transportation can inhibit the CO2 emissions significantly in not only the transportation but also non-transportation sectors. Furthermore, in addition to the direct mitigation effect, smart transportation can also indirectly affect CO2 emissions through transportation scale, structure, and technology effects. The findings of this paper therefore add to the existing literature and provide important policy implications for promoting smart transportation and curbing CO2 emissions in the transportation and other sectors.",
        "DOI": "10.1016/j.eneco.2021.105715",
        "paper_author": "Zhao C.",
        "affiliation_name": "University of International Business and Economics",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60013503",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Cardiovascular Disease Projections in the United States Based on the 2020 Census Estimates",
        "publication": "Journal of the American College of Cardiology",
        "citied_by": "163",
        "cover_date": "2022-08-09",
        "Abstract": "Background: Understanding trends in cardiovascular (CV) risk factors and CV disease according to age, sex, race, and ethnicity is important for policy planning and public health interventions. Objectives: The goal of this study was to project the number of people with CV risk factors and disease and further explore sex, race, and ethnical disparities. Methods: The prevalence of CV risk factors (diabetes mellitus, hypertension, dyslipidemia, and obesity) and CV disease (ischemic heart disease, heart failure, myocardial infarction, and stroke) according to age, sex, race, and ethnicity was estimated by using logistic regression models based on 2013-2018 National Health and Nutrition Examination Survey data and further combining them with 2020 U.S. Census projection counts for years 2025-2060. Results: By the year 2060, compared with the year 2025, the number of people with diabetes mellitus will increase by 39.3% (39.2 million [M] to 54.6M), hypertension by 27.2% (127.8M to 162.5M), dyslipidemia by 27.5% (98.6M to 125.7M), and obesity by 18.3% (106.3M to 125.7M). Concurrently, projected prevalence will similarly increase compared with 2025 for ischemic heart disease by 31.1% (21.9M to 28.7M), heart failure by 33.0% (9.7M to 12.9M), myocardial infarction by 30.1% (12.3M to 16.0M), and stroke by 34.3% (10.8M to 14.5M). Among White individuals, the prevalence of CV risk factors and disease is projected to decrease, whereas significant increases are projected in racial and ethnic minorities. Conclusions: Large future increases in CV risk factors and CV disease prevalence are projected, disproportionately affecting racial and ethnic minorities. Future health policies and public health efforts should take these results into account to provide quality, affordable, and accessible health care.",
        "DOI": "10.1016/j.jacc.2022.05.033",
        "paper_author": "Mohebi R.",
        "affiliation_name": "Massachusetts General Hospital",
        "affiliation_city": "Boston",
        "affiliation_country": "United States",
        "affiliation_id": "60029929",
        "affiliation_state": "MA"
    },
    {
        "paper_title": "Global, regional, and national burden of diseases and injuries for adults 70 years and older: Systematic analysis for the Global Burden of Disease 2019 Study",
        "publication": "BMJ",
        "citied_by": "162",
        "cover_date": "2022-03-10",
        "Abstract": "Objectives To use data from the Global Burden of Diseases, Injuries, and Risk Factors Study 2019 (GBD 2019) to estimate mortality and disability trends for the population aged ≥70 and evaluate patterns in causes of death, disability, and risk factors. Design Systematic analysis. Setting Participants were aged ≥70 from 204 countries and territories, 1990-2019. Main outcomes measures Years of life lost, years lived with disability, disability adjusted life years, life expectancy at age 70 (LE-70), healthy life expectancy at age 70 (HALE-70), proportion of years in ill health at age 70 (PYIH-70), risk factors, and data coverage index were estimated based on standardised GBD methods. Results Globally the population of older adults has increased since 1990 and all cause death rates have decreased for men and women. However, mortality rates due to falls increased between 1990 and 2019. The probability of death among people aged 70-90 decreased, mainly because of reductions in non-communicable diseases. Globally disability burden was largely driven by functional decline, vision and hearing loss, and symptoms of pain. LE-70 and HALE-70 showed continuous increases since 1990 globally, with certain regional disparities. Globally higher LE-70 resulted in higher HALE-70 and slightly increased PYIH-70. Sociodemographic and healthcare access and quality indices were positively correlated with HALE-70 and LE-70. For high exposure risk factors, data coverage was moderate, while limited data were available for various dietary, environmental or occupational, and metabolic risks. Conclusions Life expectancy at age 70 has continued to rise globally, mostly because of decreases in chronic diseases. Adults aged ≥70 living in high income countries and regions with better healthcare access and quality were found to experience the highest life expectancy and healthy life expectancy. Disability burden, however, remained constant, suggesting the need to enhance public health and intervention programmes to improve wellbeing among older adults.",
        "DOI": "10.1136/bmj-2021-068208",
        "paper_author": "NA",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "The burden of mental disorders, substance use disorders and self-harm among young people in Europe, 1990–2019: Findings from the Global Burden of Disease Study 2019",
        "publication": "The Lancet Regional Health - Europe",
        "citied_by": "158",
        "cover_date": "2022-05-01",
        "Abstract": "Background: Mental health is a public health issue for European young people, with great heterogeneity in resource allocation. Representative population-based studies are needed. The Global Burden of Disease (GBD) Study 2019 provides internationally comparable information on trends in the health status of populations and changes in the leading causes of disease burden over time. Methods: Prevalence, incidence, Years Lived with Disability (YLDs) and Years of Life Lost (YLLs) from mental disorders (MDs), substance use disorders (SUDs) and self-harm were estimated for young people aged 10-24 years in 31 European countries. Rates per 100,000 population, percentage changes in 1990-2019, 95% Uncertainty Intervals (UIs), and correlations with Sociodemographic Index (SDI), were estimated. Findings: In 2019, rates per 100,000 population were 16,983 (95% UI 12,823 – 21,630) for MDs, 3,891 (3,020 - 4,905) for SUDs, and 89·1 (63·8 - 123·1) for self-harm. In terms of disability, anxiety contributed to 647·3 (432–912·3) YLDs, while in terms of premature death, self-harm contributed to 319·6 (248·9–412·8) YLLs, per 100,000 population. Over the 30 years studied, YLDs increased in eating disorders (14·9%;9·4-20·1) and drug use disorders (16·9%;8·9-26·3), and decreased in idiopathic developmental intellectual disability (–29·1%;23·8-38·5). YLLs decreased in self-harm (–27·9%;38·3-18·7). Variations were found by sex, age-group and country. The burden of SUDs and self-harm was higher in countries with lower SDI, MDs were associated with SUDs. Interpretation: Mental health conditions represent an important burden among young people living in Europe. National policies should strengthen mental health, with a specific focus on young people. Funding: The Bill and Melinda Gates Foundation",
        "DOI": "10.1016/j.lanepe.2022.100341",
        "paper_author": "Castelpietra G.",
        "affiliation_name": "Health Directorate",
        "affiliation_city": "Venice",
        "affiliation_country": "Italy",
        "affiliation_id": "113498034",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Health system performance in Iran: a systematic analysis for the Global Burden of Disease Study 2019",
        "publication": "The Lancet",
        "citied_by": "157",
        "cover_date": "2022-04-23",
        "Abstract": "Background: Better evaluation of existing health programmes, appropriate policy making against emerging health threats, and reducing inequalities in Iran rely on a comprehensive national and subnational breakdown of the burden of diseases, injuries, and risk factors. Methods: In this systematic analysis, we present the national and subnational estimates of the burden of disease in Iran using the Global Burden of Disease Study 2019. We report trends in demographics, all-cause and cause-specific mortality, as well as years of life lost (YLLs), years lived with disability (YLDs), and disability-adjusted life-years (DALYs) caused by major diseases and risk factors. A multi-intervention segmented-regression model was used to explore the overall impact of health sector changes and sanctions. For this analysis, we used a variety of sources and reports, including vital registration, census, and survey data to provide estimates of mortality and morbidity at the national and subnational level in Iran. Findings: Iran, which had 84·3 million inhabitants in 2019, had a life expectancy of 79·6 years (95% uncertainty interval 79·2–79·9) in female individuals and 76·1 (75·6–76·5) in male individuals, an increase compared with 1990. The number of DALYs remained stable and reached 19·8 million (17·3–22·6) in 2019, of which 78·1% were caused by non-communicable diseases (NCDs) compared with 43·0% in 1990. During the study period, age-standardised DALY rates and YLL rates decreased considerably; however, YLDs remained nearly constant. The share of age-standardised YLDs contributing to the DALY rate steadily increased to 44·5% by 2019. With regard to the DALY rates of different provinces, inequalities were decreasing. From 1990 to 2019, although the number of DALYs attributed to all risk factors decreased by 16·8%, deaths attributable to all risk factors substantially grew by 43·8%. The regression results revealed a significant negative association between sanctions and health status. Interpretation: The Iranian health-care system is encountering NCDs as its new challenge, which necessitates a coordinated multisectoral approach. Although the Iranian health-care system has been successful to some extent in controlling mortality, it has overlooked the burden of morbidity and need for rehabilitation. We did not capture alleviation of the burden of diseases in Iran following the 2004 and 2014 health sector reforms; however, the sanctions were associated with deaths of Iranians caused by NCDs. Funding: Bill & Melinda Gates Foundation.",
        "DOI": "10.1016/S0140-6736(21)02751-3",
        "paper_author": "Farzadfar F.",
        "affiliation_name": "NA",
        "affiliation_city": "NA",
        "affiliation_country": "NA",
        "affiliation_id": "NA",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "COVID-19 pandemic and its impact on social relationships and health",
        "publication": "Journal of Epidemiology and Community Health",
        "citied_by": "156",
        "cover_date": "2022-02-01",
        "Abstract": "This essay examines key aspects of social relationships that were disrupted by the COVID-19 pandemic. It focuses explicitly on relational mechanisms of health and brings together theory and emerging evidence on the effects of the COVID-19 pandemic to make recommendations for future public health policy and recovery. We first provide an overview of the pandemic in the UK context, outlining the nature of the public health response. We then introduce four distinct domains of social relationships: social networks, social support, social interaction and intimacy, highlighting the mechanisms through which the pandemic and associated public health response drastically altered social interactions in each domain. Throughout the essay, the lens of health inequalities, and perspective of relationships as interconnecting elements in a broader system, is used to explore the varying impact of these disruptions. The essay concludes by providing recommendations for longer term recovery ensuring that the social relational cost of COVID-19 is adequately considered in efforts to rebuild.",
        "DOI": "10.1136/jech-2021-216690",
        "paper_author": "Long E.",
        "affiliation_name": "University of Glasgow",
        "affiliation_city": "Glasgow",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60001490",
        "affiliation_state": "Scotland"
    },
    {
        "paper_title": "Digital transition and green growth in Chinese agriculture",
        "publication": "Technological Forecasting and Social Change",
        "citied_by": "155",
        "cover_date": "2022-08-01",
        "Abstract": "As the primary industry in an economy, sustainable agricultural growth has attracted much attention from researchers and policy-makers worldwide. Digitalization reform and information technology greatly impact agriculture, rural areas, and farmers, improving high-quality development and green growth in the agricultural sector. Based on a measure of digitalization and a green productivity indicator, this paper investigates the impact of internet development on the economic and environmental performance of Chinese agriculture. The empirical results suggest that substantial green growth is observed in Chinese provincial agriculture, which is largely motived by technological progress. Internet popularization and digital technology indeed promote sustainable development in agriculture. Furthermore, the corresponding policy implications are provided to create a new path for steady growth in Chinese agriculture.",
        "DOI": "10.1016/j.techfore.2022.121742",
        "paper_author": "Shen Z.",
        "affiliation_name": "Beijing Institute of Technology",
        "affiliation_city": "Beijing",
        "affiliation_country": "China",
        "affiliation_id": "60016835",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Digital technologies can enhance climate resilience of critical infrastructure",
        "publication": "Climate Risk Management",
        "citied_by": "153",
        "cover_date": "2022-01-01",
        "Abstract": "Delivering infrastructure, resilient to multiple natural hazards and climate change, is fundamental to continued economic prosperity and social coherence. This is a strategic priority of the United Nations Sustainable Development Goals (SDGs), the World Bank, the Organisation for Economic Co-operation and Development (OECD), public policies and global initiatives. The operability and functionality of critical infrastructure are continuously challenged by multiple stressors, increasing demands and ageing, whilst their interconnectedness and dependencies pose additional challenges. Emerging and disruptive digital technologies have the potential to enhance climate resilience of critical infrastructure, by providing rapid and accurate assessment of asset condition and support decision-making and adaptation. In this pursuit, it is imperative to adopt multidisciplinary roadmaps and deploy computational, communication and other digital technologies, tools and monitoring systems. Nevertheless, the potential of these emerging technologies remains largely unexploited, as there is a lack of consensus, integrated approaches and legislation in support of their use. In this perspective paper, we discuss the main challenges and enablers of climate-resilient infrastructure and we identify how available roadmaps, tools and emerging digital technologies, e.g. Internet of Things, digital twins, point clouds, Artificial Intelligence, Building Information Modelling, can be placed at the service of a safer world. We show how digital technologies will lead to infrastructure of enhanced resilience, by delivering efficient and reliable decision-making, in a proactive and/or reactive manner, prior, during and after hazard occurrences. In this respect, we discuss how emerging technologies significantly reduce the uncertainties in all phases of infrastructure resilience evaluations. Thus, building climate-resilient infrastructure, aided by digital technologies, will underpin critical activities globally, contribute to Net Zero target and hence safeguard our societies and economies. To achieve this we set an agenda, which is aligned with the relevant SDGs and highlights the urgent need to deliver holistic and inclusive standards and legislation, supported by coordinated alliances, to fully utilise emerging digital technologies.",
        "DOI": "10.1016/j.crm.2021.100387",
        "paper_author": "Argyroudis S.A.",
        "affiliation_name": "Brunel University London",
        "affiliation_city": "Uxbridge",
        "affiliation_country": "United Kingdom",
        "affiliation_id": "60020623",
        "affiliation_state": "Middlesex"
    },
    {
        "paper_title": "The role of technology innovation and renewable energy in reducing environmental degradation in Malaysia: A step towards sustainable environment",
        "publication": "Renewable Energy",
        "citied_by": "153",
        "cover_date": "2022-01-01",
        "Abstract": "The current industrial era has turned into a rapidly evolved world that relies abundantly on technological advancements and robotics intelligence. However, the trends of global economic appraisals showed that the process of advancement is mostly accompanied by environmental degradation. Therefore, this research studies the connection of renewable energy and technological innovations in affecting ecological footprint and carbon dioxide emission in Malaysia. In doing so, the study employs the bootstrapped autoregressive distributed lag (BARDL) model for scrutinizing the connection between environmental degradation proxies. The findings disclose that the consumption of renewable energy helps to reduce the level of environmental degradation. In addition, technology innovation also helps to reduce both carbon emission and ecological footprint. Moreover, the environmental Kuznets curve (EKC) hypothesis is also validated for the country by showing the inverted U-shape link of economic growth with the both environmental degradation proxies. These findings give a benchmark for the policymakers to encourage local and foreign investors to invest more in renewable energy production and technology innovation in Malaysian economy whereas the results demand policy implication in the form of increased emphasis on the utilization of green energy via renewables especially in domestic businesses.",
        "DOI": "10.1016/j.renene.2021.10.007",
        "paper_author": "Suki N.M.",
        "affiliation_name": "Othman Yeop Abdullah Graduate School of Business",
        "affiliation_city": "Kuala Lumpur",
        "affiliation_country": "Malaysia",
        "affiliation_id": "60212346",
        "affiliation_state": "NA"
    },
    {
        "paper_title": "Corporate Social Responsibility and High-quality Development: Do Green Innovation, Environmental Investment and Corporate Governance Matter?",
        "publication": "Emerging Markets Finance and Trade",
        "citied_by": "149",
        "cover_date": "2022-01-01",
        "Abstract": "Under the network public opinion ecology in the Omni-media Era, corporate social responsibility (CSR) performance can provide important internal and external environmental support for improving corporate development quality. Based on the data of Chinese listed companies from 2010 to 2019, this paper evaluates the impact and mechanism of CSR on corporate high-quality development. The results show that CSR significantly promotes the improvement of corporates’ development quality. The results remain robust in altering variables, controlling more urban and corporate-level variables, and solving endogeneity. Mechanism analysis indicates that CSR can promote the high-quality development of corporates by improving green innovation, environmental investment, and corporate governance. Heterogeneity analysis shows that the incentive effect of CSR on corporate high-quality development is more obvious in non-state-owned corporates and when the market is in a “bull market.” This paper provides feasible ideas for adjusting the operating behavior of Chinese listed companies and government policy orientation.",
        "DOI": "10.1080/1540496X.2022.2034616",
        "paper_author": "Xue Y.",
        "affiliation_name": "Hunan University",
        "affiliation_city": "Changsha",
        "affiliation_country": "China",
        "affiliation_id": "60032356",
        "affiliation_state": "Hunan"
    },
    {
        "paper_title": "ESG disclosure and corporate financial irregularities – Evidence from Chinese listed firms",
        "publication": "Journal of Cleaner Production",
        "citied_by": "149",
        "cover_date": "2022-01-15",
        "Abstract": "This empirical study investigates the influence of environmental, social, and governance (ESG) disclosure on financial irregularities of Chinese listed firms and tests the moderating role of the intensity of internal and external supervision. We index the extent of ESG disclosure rather than corporate social responsibility performance from the perspective of non-financial information disclosure. Our results show that ESG disclosure decreases corporate financial irregularity risks and helps to mitigate information asymmetry. Under better internal and external supervisory conditions, the inhibiting effect of ESG disclosure on financial irregularity is significantly stronger, compared to poor supervisory conditions. We investigate the power of formal regulation systems by exploiting regional marketization and legal environment indices and incorporating the low-carbon-city pilot policy as an exogenesis regulatory impact, showing that a better formal regulation environment contributes to the inhibiting effect. We propose an “accounting channel” proxied by earnings management showing that ESG disclosure can alleviate opaqueness and improve information transparency to constrain financial irregularities. This study highlights the positive effect of ESG disclosure and the resultant improvement of internal control, public scrutiny, and government regulation in practice, suggesting that ESG disclosure complements actions to depress financial irregularities.",
        "DOI": "10.1016/j.jclepro.2021.129992",
        "paper_author": "Yuan X.",
        "affiliation_name": "Sun Yat-sen Business School",
        "affiliation_city": "Guangzhou",
        "affiliation_country": "China",
        "affiliation_id": "60122323",
        "affiliation_state": "Guangdong"
    }
]